{
  "asin": "B07ZPKN6YR",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    EXCELLENT PHONE & BEYOND AMAZING SELLER/CUSTOMER SERVICE!!!",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "I honestly can’t say enough amazing things about my experience buying a renewed iPhone 11 from this seller and dealing with their customer service! I would 1000/10 recommend anyone and everyone even considering purchasing a phone from them to absolutely do so because you won’t be disappointed!!! But read below for the full story/review, both good and bad opinions.My oldest daughter dropped her iPhone XR in the toilet and it completely died. This seller had the best priced renewed iPhone I found with next day delivery and good reviews, so I purchased the phone. It was my first time buying a phone that wasn’t brand new, so I was nervous about what condition the phone and battery would be in.The phone was sent via UPS, which I didn’t love because they left the package at the gate on the street instead of driving into our ranch and delivering it to our house in the back corner like Amazon and USPS do. Not to mention it was supposed to be here between by like 1:45 or 2:45 and they didn’t deliver it until 10pm! But that’s an issue with UPS, not the seller.When we opened the package I was pleased to see that there were very minimal dents or scuff marks on the phone and it appeared to be in really good condition. One thing I wasn’t pleased with was the fact that the phone arrived dead. I worried that meant the battery wasn’t great, but I was wrong. After charging for a bit I checked the battery health and it was 100%, so they clearly installed a brand new battery! I was really happy with my purchase, but upon setting up the phone I noticed there was this awful high pitched screech/glitching sound coming from the speaker, so I reached out to the seller to try and get a replacement sent instead of going thru the hassle and delay of returning it and having to order a new one once the refund posted.The seller responded almost immediately (they did so every single time we communicated over the course of a week, even when I reached out at almost 8pm their time!) and offered to send me the shipping label and then they’d overnight a replacement to me once they received the phone. I asked them if I could pay to overnight the phone to them so there wouldn’t be as long of a wait without a phone, and they said they would do me one better and as soon as I took the phone to the post office to send them a copy of my receipt and they’d overnight me the replacement then! This took place on a Friday and I didn’t want the shipping delay the weekend would cause, so I told them I’d reach out Monday for the shipping label and that I had out a brand new screen protector on the phone when I got it so I’d be sending it back with it on.Life got hectic and I didn’t reach out until Thursday afternoon, but they quickly sent me the shipping label. When trying to wipe the phone there was an hour delay because stolen phone protection was on, so I missed making it to the post office by like 6 mins and had to go Friday morning instead.I went to the post office and all was well until I mentioned that there was a phone in the package when I asked them for extra tape, and she said they couldn’t ship a used phone via priority mail (only new never used phones) so I needed to have them send me a hazardous shipping label instead. When I told the seller they offered to send me a new label, but I chose to try another post office first and just not mention the contents of the package because the battery WAS brand new, and I didn’t want to go thru the hassle of sending the label somewhere to be printed since I don’t have a printer, going there and paying to have it printed, and then going back to the post office. I took it to another post office nearby and had zero issues sending it.When I got back to the car I sent them a copy of the receipt, and true to their word within only like 5-10 minutes they had already send me the tracking information for the replacement shipment and let me know they put a screen protector on the new phone for me! Of course there were issues with UPS again including a delay that showed it wasn’t going to come until Monday, but thankfully it arrived on Saturday like it was supposed to, and fairly early (10-11am).When I opened the replacement package and inspected the phone I was SHOCKED! I thought the first phone was is great condition, but this one looked BRAND NEW! There wasn’t a single scratch or dent or scuff or any abnormality on the exterior of the phone! It’s also worth noting that the phone wasn't dead this time, it was midway charged. I checked the battery health again and it was also 100%! I tested out the speaker and there were no issues with the phone whatsoever. Honestly if you put it side by side with a brand new phone nobody could tell the difference, and it was a fraction of the cost of a new phone!I also reached out to the seller a few days later for a friend of mine to see if they also sold Androids and they were super helpful in getting me the info I was looking for!Between the phenomenal condition of the phone and the excellent customer service, I won't buy a renewed phone from anyone else in the future when one of my daughters inevitably break their phone! This was honestly the best experience I've ever had with a seller/replacement item on Amazon in the 15+ years I've used the site!",
      "helpfulVotes": 89
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s was good for the price",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "I recently had the iPhone 11, from games to apps. The dual-camera system took amazing photos, even in low light.The purple color was a highlight. It was a subtle, elegant shade that looked stylish without being too flashy. The glossy finish on the glass back added a premium feel.Battery life was impressive, lasting all day with heavy use. The iOS interface was user-friendly and regularly updated. Overall, the iPhone 11 in purple was a great choice for performance, camera quality, and design. Highly recommended!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition/ looks brand new!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "The phone is perfect. I ordered it in refurbished excellent condition. The battery health is at 100% and there is not a single scratch or dent on the phone. It looks as if it is brand new out of the box.  It was very easy to set up. I have already used it for texting and phone calls and no issues with speaker or keyboard. Very user friendly and I highly recommend. You can’t beat the price. I bought it in pastel purple.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, decent price",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "I needed a new unlocked iPhone for my wife, since her 6 plus cannot run on any recent IOS iterations and is getting dropped by our mobile carrier.  Sooo, a used 11 seemed a logical choice, since her needs are minimal.  I have one as well and love it (no plans to upgrade).After hunting around for about a week, I finally committed.  The phone arrived early and properly packaged.  There were some scratches on the edges, but only one of note.  It even had a (perfect) screen protector.  It was unlocked, easy to set up, and seems to run flawlessly.  The battery reserve so far is okay, although iPhone Settings claim it is an aftermarket replacement, and cannot tell me anything about battery health.  Battery issues ae commonly reported with used phones, but mine seems fine.A couple of minor issues.  While the edge scratches were not functional, they were borderline for condition rated as \"excellent.\"  Also, when ordering, play the extra $5 for FedEx or UPS delivery.  Ours came USPS and arrived unexpected early.  It was left on the top of our mailbox, but I was able to get it before heading off for a short trip.To sum up, this was a good phone at a decent price (about$225 with 128 GB memory).  When my phone needs replacement, I would go with this seller again, but would not buy anything rated less than \"excellent condition\".",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    11/10",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Soooo perfect and pretty it’s like brand new. I was scared to get it cause this is my first time ordering a phone from here but trust me it’s beyond my expectations. No scratches, speaker sounds great, not glitchy or slow (which i was scared about), the camera is perfect, and i’m so happy with this purchase, like it’s so worth the money. Trust the reviews it’s a really nice phone you won’t be disappointed!!!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Works well even after I have had it for almost 2 years. I will say when I bought it the battery health was not 100% so seems the battery was not replaced. But still holds a charge and has a pretty good battery life for an older phone. And love the color"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely worth it!",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "This phone is awesome was a little nervous at first buying this because i had never bought a unlocked phone before but i needed to since I have been needing an upgrade from the iPhone 7 i have and I haven’t put service on this new phone yet but all the other features work great and battery compacity was 80% as they said so and phone is in great condition they even shipped it here hella fast would buy from them again!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Still Going Strong!",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "I bought this iPhone 11 on Amazon in 2023 at 85% battery health, and I still have it. It works well, and I haven’t had any major issues. The performance is solid, the camera is good, and it handles daily tasks smoothly. Battery life has held up decently, though it has naturally degraded a bit over time. Overall, a reliable phone and a good purchase!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so great, thank you.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "So far so great, I’ve been using this phone from Dec  2024 to present….the battery health came at 81% wasn’t good but it was a win because I purchased a iPhone 11 Pro Max with 95% that died 12 days in and I had a bad experience with another company and it was hell to return but eventually I got my refund. This seller shipped within 24 hours and it arrived within 48 hrs. I did my research and found the iPhone 11 is one of the most affordable and reliable 11 models so I took a chance and got  it over the iPhone XR because I really needed a phone that was higher than my iPhone 6 Plus that I had for 6 years. It came brand new, no scratches. Thank you. You should definitely get it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen came cracked",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "I was very skeptical about buying this product, especially off of Amazon since I wouldn’t be able to check it in a real time before purchasing it, but I scanned through the reviews to see what everyone else was saying before purchasing it and I have to say I am pleasantly surprised the device looks almost brand new the back is free of scratches. The camera is free of scratches as well but there’s a single scratch on the screen which is kinda hard to see.The battery capacity is at 100% which I was only expecting it to be about 95% . I would definitely recommend anyone to purchase.Edit: the product is good but I noticed a crack on the screen today and decided to process a return everything else is great though"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product, worked better than expected.",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Great product, I will not give the 5 stars due to the battery length, but nothing as a consequence of the normal usage, considering that is a refurbished product.I will by again with this supplier, no doubt about it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good !",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Works great, had it for about 5/6 months, it came with 75% battery health and now it’s 72%Phone works as it should, great, feels great, I think it’s worth the money and it looked great."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10/10 Recommend",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Good phone for it to be renewed. 10/10 recommend. Comes as described. Only thing i think needs to he better, is the chargers. They aren’t original iPhone chargers. But i love everything else."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple iPhone 11 Review: A Reliable Backup That Feels Like New",
      "date": "Reviewed in the United States on February 20, 2024",
      "body": "Update:  I'm back with an update on our journey with the iPhone 11, and let me tell you, it's been quite the rollercoaster. Initially, I bought one for my daughter from a different seller, and it was, to put it mildly, a bit of a disaster. We had issues left and right – Face ID not working, the phone overheating – you name it. So, we returned it, feeling a bit skeptical about the whole refurbished scene.But here's where the plot twists: we decided to give it another go, this time purchasing from the Amazon resellers store, specifically from a shop called Hybrid IT. And oh boy, what a difference! The iPhone we received this time around was nothing short of impeccable. It arrived with all the essentials – a charger, a charging cable, and even a SIM card tool, all neatly packed. The phone itself? It could've fooled me for brand new.This experience really hammered home the lesson that when it comes to refurbished goods, the \"who\" is just as crucial as the \"what.\" The quality and condition of the product can vary wildly depending on the seller. Hybrid IT sent out an excellent product that exceeded our expectations in every way.For those of you wary about diving into the world of refurbished electronics, let this be a testament. With the right seller, you can get your hands on a device that feels brand new, without the hefty price tag. We're over the moon with our iPhone 11, and I'll be sure to keep you all posted if anything changes. But for now, it seems like we've struck gold.--------------------I recently found myself in need of a quick replacement after my daughter accidentally broke her phone. The Apple iPhone 11, 64GB in black, seemed like a promising choice, primarily because we needed something that could be set up swiftly and would perform seamlessly as a backup.Out of the box, the iPhone 11 felt like a brand-new device despite being a model released a few years back. The sleek black finish and the familiar design immediately caught my eye, reassuring me that this choice would not disappoint.Setting up the iPhone 11 was mostly straightforward, especially with the unlocked version making it easy to switch from the old device. The transfer of data and settings from the previous iPhone was seamless, thanks to Apple's ecosystem. However, we hit a slight snag with the Face ID setup - it took a bit longer than expected to get it working properly. Despite this hiccup, once configured, Face ID has been working flawlessly.The iPhone 11's performance has been impressive. The touch screen is responsive, making navigation and typing a breeze. Wi-Fi connectivity is fast, ensuring that browsing and app downloads are efficient. Although it's not the latest model, it handles everyday tasks with ease, from streaming video content to gaming, without any noticeable lag.The main issue we encountered was the initial difficulty in setting up Face ID. It required a few attempts to configure, which was a minor inconvenience in an otherwise smooth setup process. After overcoming this challenge, the phone has been working perfectly.Overall, this refurbished Apple iPhone 11 has proven to be a reliable and efficient backup phone. Its ease of setup, fast Wi-Fi, and responsive touch screen make it feel like a new device. The hiccup with Face ID setup was a small obstacle that, once overcome, didn't detract from the overall positive experience. I would recommend the iPhone 11 to anyone in need of a quick replacement or a dependable backup device",
      "helpfulVotes": 139
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple iPhone 11 – \"Smooth Performance, But Battery Life Could Be Better\"",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I’ve been using the iPhone 11 for a while now, and overall, I’m really happy with it. The performance is smooth, and the camera quality is excellent for taking photos and videos. I’ve also found the face recognition feature to be really convenient. However, I’ve noticed that the battery life isn’t as long-lasting as I hoped. I have to charge it halfway through the day if I’m using it a lot. Still, it’s a great phone for those looking for a reliable iPhone without breaking the bank.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Need a new phone for a good price",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "This phone is almost excellent it has a good battery life, good screen touch response, and everything else seems to be in good condition except the speakers the left speaker doesn’t seem to produce any sound only the right speaker does which is kinda annoying the phone itself also seems to heat up slowly but surely, it’s still a great purchase I just think everything should be tested to its fullest capability especially if a person orders “excellent” but overall I’d give this a 8.5"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I phone 11 refurbished excellent condition",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "I bought this I phone 11 through this seller. I would have givin it 5 stars because the phone is like brand new not a scratch or anything on it, it is flawless and it works. But the shipping was so late I was suppose to get it Monday before Christmas and I even paid extra to make sure it was and I’m just now recieving it today a week past the day it was suppose to be here. But other than that the phone is awesome my son loves it and like I said it’s a brand new phone. Will more and likely be buying through this seller again in the future if I need a new I phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product review",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I ordered a green 128gb but received a purple 256gb. Does not bother me, I only got it for my square app for my small business. I still use my old iphone 7 which is in excellent condition."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Goodish condition",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "I understand that good used means minor scratches but definitely DOES NOT mean cracked…"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    4 out of 5 stars",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "The phone arrived in excellent condition! However, when I turned it on there was a red dot on the dark screen. It kinda bothers me but when the phone is on it doesnt show. The phone works well. Functions just normal. I have no issue with it. Battery life is excellent. I bought this phone for work so, its pretty great! Thank you!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works like new!",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "My son loves his new (refurbished) phone…It works like it’s brand new, fresh from the Apple Store…You definitely can’t tell that it’s refurbished!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like new!",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Wow, YMMV, however, I was very pleasantly surprised at the quality of phone I received. The phone was in great shape, no scratches, looked new, battery life has been great in the month I've had it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone, but refurbished with after market display",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Great phone, works fine, but still has FireWire instead of USB C, and an after market display which is not an Apple product."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low Cost, Good Quality, High Performance and Budget-Friendly",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I was looking for a budget-friendly iPhone for my 15 year old niece and decided on the iPhone 11 because of the great reviews.I must say I was a bit skeptical at first, but boy am I happy I gave in and made this purchase. My niece was extremely happy. It was indeed a win-win situation. The product didn't break my bank and my niece is happy and extremely satisfied with the performance of the phone.The item was a gift for my niece, so unfortunately, I do not have a photo of the device."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 11",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Ordered the yellow iPhone 11 for my mom who is currently still using the 8+ with a broken screen.  The shipping was extremely fast. When I hear or read the word “refurbished” I assume “fixed up”, in this case it only seems to have been factory reset. The phone wasn’t cleaned before sent or anything. There is gunk along the sides where the previous owner would have used a case and things got trapped inside and stuck to the phone. It’s also around the charging port. The screen came with the clear plastic as if it were a new screen but there is some scratches (understandable) . The cosmetic blemishes are very minor and for the price, I think it was a great purchase for the price! For a used phone, I would consider the condition great.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished iphone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Phone gets hot after a few minutes use. Works but can’t use it long cause it gets hot"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 11",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Have it for 3 years only fix the back one timeBelieve me it’s the best"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone as described",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "EDIT: Our daughter was given the phone a few days ago and it has been working great! There is one spot on the right side of the screen that is lighter than anywhere else. The only thing I can think of that would be causing it is something underneath is pressing up against the back side of a recently replaced screen. It's there regardless of what is showing on the screen. All colors and any image and you can still see a small white area that never gets color and then fades into the normal looking screen. It's so small, it's almost unnoticeable. I only put it in the review in case it is indeed something behind the screen and eventually causes issues. Currently, I am happy with the phone. Our daughter loves it and it appears to function perfectly!Original Review: So far the phone is great! There doesn't appear to be any cosmetic issues at all. The phone turned on, loaded up and accepted my daughter's account login. Battery health is perfect, storage capacity is correct for my order. We won't actually be giving it to our daughter till her birthday in a couple weeks but preliminary inspection went well. Will update the review once we start actually using it but I am happy with the phone so farIMPORTANT INFO FOR CUSTOMERS: This review is specific to the seller that was assigned to me and DOES NOT represent the product you will be buying. The \"renew\" program compiles every review from every seller and shows it on this one page. Do not make the mistake I made. Reading all these reviews does not represent the product you will receive. The seller you get your product from may not have a single review in this ad. I got lucky, most don't. Do not use these reviews to help in your decision to purchase.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good purchase",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "It’s a great phone the battery eventually started to die but it’s a great size"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "It’s a good phone the quality is amazing. The volume works. The sound works, came with no cracks only problem was the charger it came with didn’t work so I had to use my old one"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good purchase",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "My first iPhone. Functions well, really durable, the screen size was ok and it was easy to set up. Was a good purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good service",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Everything is as it should be ! , I’m super excited about it ."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s great to use",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "It is in great condition!!! I love it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Title: Excellent Purchase - iPhone 11 in Great Condition!",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "I recently purchased an iPhone 11 from Amazon, and I couldn't be more satisfied! The phone arrived in pristine condition, exactly as described. It looked brand new, with no scratches or dents, and it has been performing flawlessly since I started using it. The shipping was prompt, and the packaging was secure, ensuring the phone arrived safely. I highly recommend buying from this seller if you're looking for a reliable and quality smartphone!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched and speakers broken",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Update: did get a partial refund to fix the speakers on the iPhone. But still doesn’t excuse that the phone should not have been listed under excellent condition.This phone was labeled under excellent condition. It wasn’t supposed to have visible damage/scratches and the phone was supposed to be fully functional. Immediately the phone was scratched and beat up, with scratches on the screen of the phone as well. Phone turned on and seemed great until trying to play music I discovered the speakers were broken and don’t work at all. Don’t recommend this at all unless your okay with a beat up phone for a higher price that may not work correctly."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To large for me",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Returned.  To large for my hand"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This seller is trustworthy",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Had my phone for 5 years now no problems"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is great! Shipping & setup frustrating",
      "date": "Reviewed in the United States on October 18, 2023",
      "body": "The renewed iPhone 11 itself is in great condition. Battery health is at 91% and came with a screen protector. It’s been 2 weeks since setup completed and so far the phone is functioning as if it is new.[Edited to add:  After 1 month, the screen protector cracked twice. It has protected the main screen, but it is not that durable itself. The screen protector on my old phone went a year without cracking.]My issues are with 1) shipping and 2) setup.1) Shipping:  Amazon said it would arrive on a specific date (3 days from time of order) and would require signature. Well, it was delivered a day early and left at the gate (that is always open), not at my house/door, and no one signed for it. The issue is that the gate is next to a public park, not secure at all and gets a fair amount of foot traffic. We had no idea they delivered it a day early and  anyone could have walked by and taken it. Normally we’d be excited about packages arriving a day early, but this was a high $ item, left in a public area. Thankfully my husband left the house to run an errand and saw it by the gate. Unknown how long it was sitting there.2) Setup took nearly 2 weeks and at least 15 times restating the setup process. It would get a little further in the process each time, then an issue would arise or would lock up and would require to start over again. Our rural town does not have high speed internet so went into town to use Starbucks WiFi & it was not enough to do what was needed. Ended up at a friend’s house but after 2 hrs I had to leave for appointments & errands. First issue, before I could do anything, the new iPhone requires an iOS update. It took 2 hrs to update the iOS on this new phone. Then it got stuck installing it, so had to install/uninstall it 4 separate times. Ended up going on a pre planned trip to see family in a big city and the internet at their house was like night and day. I was able to do the entire setup that weekend, but still had issues & had to call Apple for help. The whole set up process was soooo frustrating, infuriating, and disappointing that it took so long and was not as easy as they make it out to be. & Im good at troubleshooting electronic issues and researching resolutions. One thing I noticed is much of the troubleshooting advice online was outdated, even on the apple help website. Hope others have an easier time with setup.",
      "helpfulVotes": 56
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I am very happy with this purchase and the phone has been working well. It is a good value for the money. It is just the right size and it takes great pictures. Friends of mine thought the pictures were of postcard quality. I highly recommend this item if you are in need."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone 11 de 128 gb",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "El teléfono está en buen estado , tiene sus marcas pero está muy bien , una buena compra",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "TALKTEKVery good seller, physical and internal condition and function is excellent!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice, not scam guys i love it.",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Acceptable but the phone still working all good and looking good though likes 95% new battery is 85% but it's really nice for this price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost prefect phone",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I had a iPhone 11 once before but in purple and I loved that phone. This was my first phone I’ve ever bought off Amazon and I was a bit skeptical and nervous. I was afraid that my phone would be cracked or the battery health would be low but everything was great. No scratches or cracks, battery health came at 90%, camera quality is good too. Only thing that I don’t like are that the buttons are a bit hard to push sometimes but it’s not the worst thing. When I pulled it out of the box and unwrapped it, even my parents had told me they’re thinking about getting one too. Overall, great purchase.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price and it works great",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "Works great and still using it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hmmmmm",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I have mixed reactions. I received it yesterday. The phone looks great, no scratches. But the touch screen is sort of glitching. It will not let me press anything when the phone is laying flat on a surface. It needs to be tilted up some to be able to click on anything. Even a youtube video running with no delay, wont let me click to skip an ad. I have to always pick up the phone or it ignores me pressing. Also when texting, the letters on the right side of the screen need to be pressed 5-6 times to work. Not sure what to do since I already transf all my stuff to it.  ;/"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still working",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Refurbished, came with protective screen cover, I would say excellent condition, most definitely worth the money. Would purchase again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy it",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Very nice. Looks brand new and works perfectly"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "I was so nervous but read the reviews and I purchased. The battery health was 99% maxed out, there’s not a scratch or ding on it. Besides the fact it arrived dead, it works fantastic! Set up was easy and everything works as it should. Totally worth it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Perfecto estado",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Muy lindo el celular"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good iPhone Affordable Cost",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "We needed an iPhone for my wife since her SE old phone started having a problem with the second battery. This 11 version renewed made sense price wise since she use the phone only when she goes shopping alone so we can keep in touch. Transferring her apple account to the new phone was done quick and moving the SIM from the old phone to the 11 secured her connection with Mint Mobile provider. No glitches at all in the process. I am very happy and satisfied with the purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Nice buy, 92% battery life. Only issue I ordered a black but received a yellow"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "It was worth it, battery came at 89% health"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    FROM AOP3D: **A Stellar Companion: Apple iPhone 11 Unlocked (64GB, Black)**",
      "date": "Reviewed in the United States on April 14, 2024",
      "body": "⭐️⭐️⭐️⭐️⭐️If you're in the market for a smartphone that seamlessly marries cutting-edge technology with sleek design, look no further than the Apple iPhone 11. As a devoted Apple enthusiast, I recently upgraded to this model, and I must say, it's exceeded my already high expectations.Let's start with the design. The iPhone 11 boasts a stunning 6.1-inch Liquid Retina HD display that truly brings everything to life, from vibrant photos to immersive gaming experiences. The build quality is impeccable, with a robust aerospace-grade aluminum and glass construction that feels premium in the hand. The matte finish on the back not only looks sophisticated but also minimizes fingerprints, which is a practical touch.Performance-wise, the iPhone 11 is a powerhouse. The A13 Bionic chip ensures lightning-fast responsiveness, whether you're multitasking between apps, editing videos on the go, or playing graphics-intensive games. This phone handles it all effortlessly. Plus, with iOS, you get the smoothest, most intuitive user experience in the smartphone world. Updates are timely, and the ecosystem seamlessly integrates with other Apple devices if you're part of the ecosystem.Now, let's talk about the camera setup—a standout feature of the iPhone 11. The dual-camera system (12MP Ultra Wide and Wide cameras) captures stunning photos with impressive detail and color accuracy. Night mode is a game-changer, allowing you to take beautifully illuminated shots even in low-light conditions. The ability to shoot 4K videos at 60fps with extended dynamic range further showcases the iPhone 11's imaging prowess.Battery life has been another pleasant surprise. The iPhone 11 easily lasts me through a full day of heavy use, thanks to optimizations in hardware and software. Fast charging support means I can quickly top up when needed, which is incredibly convenient.As for connectivity, having the iPhone 11 unlocked gives me the flexibility to switch between carriers without any hassle. It supports 4G LTE and the latest Wi-Fi standards, ensuring a stable and speedy connection wherever I go.In terms of value, the iPhone 11 hits the sweet spot. It offers flagship-level performance and features without the premium price tag of the Pro models. The 64GB storage variant provides ample space for apps, photos, and videos, but you can always opt for higher capacities if needed.In conclusion, the Apple iPhone 11 is a triumph of design, performance, and value. Whether you're an Apple aficionado or simply looking for a top-tier smartphone experience, this device delivers on all fronts. It's reliable, versatile, and beautifully crafted—a true testament to Apple's commitment to innovation. I wholeheartedly recommend the iPhone 11 to anyone seeking a dependable and feature-rich mobile companion.",
      "helpfulVotes": 46
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen wasn’t original",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Phone screen wasn’t original and it s not so good in touch responsiveness. Everything else is as expected"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s really a good deal",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "So far it’s a great phone an great price"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value for money",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Ok totally worth it, had it for months and no issues so far, battery percentage was 74% so I can’t complain, would recommend"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Purple iPhone 11~",
      "date": "Reviewed in the United States on June 2, 2024",
      "body": "I ordered this phone and received it in less than 4 days. I chose the “excellent” condition out of all the renewed options. It is a lot bigger than I expected, but then again, I didn’t check the dimensions before I ordered it. The phone was packaged in a single bubble wrap sleeve. The box it came in contained a wall adapter and charging cable. The phone is almost flawless except for some scuff marks around the charging port. There are also some scuff marks around the volume up button.I like that the color of the iPhone is a muted lavender color rather than a vibrant purple. The phone came with a screen protector already installed. I didn’t realize this until hours later while I was setting up the phone. The battery health is set at 90%, and this was written on the bubble wrap sleeve.The one thing I will say about this phone is that it does lack a working left speaker on the bottom. The other reviews all seem to mention the speaker problem, and I hate to agree. It’s not a dealbreaker, but I do wish the audio was up to par with the “excellent” condition the phone is supposed to be in.By the way, this phone was sold to me by Electronic Deals. They seem to have a slightly above average reputation. I love the fact it has 128gb of storage. I upgraded from a refurbished iPhone 7, and I think I made a good decision! I like my new phone. I just need to get used to not having a home button lol.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely not in excellent condition.",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "The phone was wrapped on to a piece of cardboard on the box for shipping. The screen face has two very noticeable circles on it from where the phone had been stacked on top of each other in storage and the other phone cameras scratched the screen. It did not come with a box, instructions, or a charging cord. It does work well we so I think a very good condition is the right description.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best iPhone ever",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Great product , battery live is incredible .. best purchase I’ve made you won’t regret it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works as it should",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Nice phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "It worked very well. I’ve been using it for one month and it haven’t given me no issue."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good iPhone",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "This is my first iPhone and I love it. The battery capacity is 100%.it’s brand new.moves smoothly and overall amazing.a amazing choice for a cheaper phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    4 months later and phone is acting up",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I’ve had pretty good luck buying used phones, so far this phone was no exception. Not a scratch on the screen and battery life is 94%. No complaintsUpdate: Almost 4 months later and phone has ghost screen, meaning the phone has a mind of its own, currently I can not hit the letter “I“ when typing. O use to be able to shut phone off and turn back on and It would fix it but now it won’t. There seems to be something wrong with the screen and after researching it symptoms appear to be water damage related. Will lower product rating if customer service doesn’t make it right."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPHONE",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I bought this for my daughter because prices of iphones are too high in price and I have to say it's a great phone that came with a screen protector and battery life is at 100% amazing the only bad thing about is that my daughter complains that the phone over heats too much but overall it's an amazing phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bello teléfono.",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Nos llegó en perfecto estado, tal cual lo ofrecieron, los detalles físicos fueron muy mínimos. Lo recomiendo."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Salió muy bueno"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "My phone came with 0 problems! No scratches that I can find and it works great! Had trouble with FedEx getting it to me, but the product itself is great."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mint green",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Phone works great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the amount",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Good purchase, no faults or issues and it works just fine."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery doesn’t seem to work, right",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Good price, good Phone it looks newBut the battery doesn’t always charge"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm content with it.",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "I received this iphone yesterday and I was expecting it to be in excellent condition. What I got instead was a scratched screen and more scratches on the back and top of the phone. I also got a battery health of 73% which was disappointing. I got a replacement battery costing me $100.  Now it works like brand new and I used a case and screen protector to cover the imperfections. I'm impressed with the performance and camera. I should have picked good condition instead but it's a risk taken when buying these renewed phones.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works exactly like it should. Clear microphone.",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Love it!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It Wasn't Damaged....",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Delivered Was Great....💯💯💪🏾💪🏾👌🏾👌🏾"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    😕",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "Phone been working fine when I first got it realized that it couldn’t detect the battery and for some reason when o make a call it automatically goes to speaker phone"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s pretty good phone",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "Its a good phone it just came with a ton of scratches but overAll it’s a good phone it did come smaller than I thought but that’s ok perfect phoneSolid 4/5"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    would never know it was used!",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "I recently purchased the iPhone 11 256GB Renewed, and overall, I’m quite satisfied with my purchase. Here are my thoughts:Pros:Great Value: For a renewed phone, it offers excellent value. The price is significantly lower than a brand-new model, yet it performs almost as well.Battery Health: The battery health was at 90% when I received it, which is impressive for a renewed device.Camera Quality: The camera is fantastic, capturing clear and vibrant photos. It’s perfect for everyday photography.Storage Capacity: With 256GB of storage, I have plenty of space for apps, photos, and videos without worrying about running out of space.Cons:Minor Scratches: There were a few minor scratches on the back, but nothing too noticeable or affecting functionality.Accessories: The phone came with a generic charger and cable, which work fine but aren’t as high-quality as the original Apple accessories.Echo Issue: Occasionally, there’s a slight echo during calls, but it’s not a deal-breaker for me.Overall: If you’re looking for a budget-friendly iPhone with ample storage and great performance, the iPhone 11 256GB Renewed is a solid choice. Just be prepared for a few minor imperfections that come with a renewed product.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100% battery",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Amazing especially for the price and it being refurbished 100% battery no scratches or dents😩🫶"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I bought this for my daughter and after two weeks the volume start act up sometimes it’s not reading the SIM card sigh just a lot of problems"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    🫶🏾🫶🏾🫶🏾💯♥️",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Satisfied customer"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent quality phone",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "Mint green color as described, usually when I get a new phone there is at least some charge to it and there was no charge at all. No scratches at all. Charger is an off brand one but still works well. Screen protector was off center a little bit. Was easy to set up once it had it’s charge"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Phone functionality is great , battery life  is good even tho is refurbished. I didn’t waste any money buying this product."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 11",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I love this phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My new IPhone",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "I have always used Android devices, but this IPhone 11 is awesome!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I love it"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Power button and screen",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "The product is excellent as new, only the power button is hard and the screen is not original, it has 83 BH"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!!!",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "I was very skeptical before purchasing an iPhone through Apple… But I am so glad that I did. Received a wonderful product in the mail safely. It works perfectly! I don’t think I will ever be buying a brand new iPhone ever again… I would recommend this to anyone who’s in need of a phone but doesn’t want to spend the big bucks! I’ll be purchasing another for a family members after my first experience!Only thought I have is if you do a video call for 30 mins or longer, the back of the phone gets very hot to the touch but that’s it. It cools down immediately after the call is done. Doesn’t get hot when it charges and tbh it’s not a deal breaker for me (yet)"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone review",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "its a good phone but it does get hot fast & the phone came with several permanent scratches in the screen but i put a screen protector over it so you cant see unless theres no screen protector. everything else was fine and the battery life is good for a few days but afterwards it starts to die fast . the weight is good not heavy at all . it connects to everything fine and works good also. it just gets really hot so i have to let it sit for a while .",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is like new",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "The phone itself came in great condition, not properly protected with bubble wrap, but the phone is great not a scratch! The charger isn’t apple though and doesn’t work at all even though it says it’s a fast charger. Thank god I had some from my old iPhone still😂",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Value, battery never gets above 80%",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Looks new performs well but the battery only charges to about 80%."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Love it my daughter go crazy when I surprise her.love it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone!",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "This phone looks really good and seems to be working well!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    0",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Perfect phone .. It’s a normal iphone 11. It helped me whenI broke my old phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Instructions please",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Did not receive any instructions"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "i ordered it excellent and it came perfect with no starches or anythinggg and also had 95% battery health, this is AMAZINGGG"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPhone 11 (Renewed)",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "PERFECT CONDITION!!! FAST SHIPPING!!! WOULD DEFINITELY SHOP AGAIN !!!!! HIGHLY RECOMMENDED!!!!! :) (: :) (:",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So pretty, wonderful gift!",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "The only issues I have are very minor. There was a slight scratch across the screen, barely noticeable. The battery goes to 84%. Which isn’t bad, but I was expecting a bit more from paying for the most expensive choice.Overall, I’m happy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was a great phone",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "It was in great condition and switch over to Verizon good."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Quality is good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "It worked great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "It was very good condition and working soo great"
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched and speakers broken",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Update: did get a partial refund to fix the speakers on the iPhone. But still doesn’t excuse that the phone should not have been listed under excellent condition.This phone was labeled under excellent condition. It wasn’t supposed to have visible damage/scratches and the phone was supposed to be fully functional. Immediately the phone was scratched and beat up, with scratches on the screen of the phone as well. Phone turned on and seemed great until trying to play music I discovered the speakers were broken and don’t work at all. Don’t recommend this at all unless your okay with a beat up phone for a higher price that may not work correctly."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hmmmmm",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I have mixed reactions. I received it yesterday. The phone looks great, no scratches. But the touch screen is sort of glitching. It will not let me press anything when the phone is laying flat on a surface. It needs to be tilted up some to be able to click on anything. Even a youtube video running with no delay, wont let me click to skip an ad. I have to always pick up the phone or it ignores me pressing. Also when texting, the letters on the right side of the screen need to be pressed 5-6 times to work. Not sure what to do since I already transf all my stuff to it.  ;/"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Needs Replacing",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "I purchased this phone in June 2023. Lately the battery is not holding a charge. When I went to the Battery Health & Charging section of Settings, this is the message.  It is now February 1, 2025. I realize this was a used iPhone in really good condition looking at it. However I’ve had new iPhones that have lasted many years without a battery problem.The phone still looks great as I keep it in an Otterbox. Now I’m going to have to pay to get a new battery.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    its okay. I wish it wasnt as scratched and dinged up though.",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "the phone works and has been on for about 2 weeks now no issues.there were a lot of little dings on all the corners of the phone and on the sides. a small scratch on the screen 2 chips on the glass. a little disappointed in the condition of the phone or else I would have rated a 5 star"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    N/a",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "I feel like I’m the only one who got a defective phone it works like new and all that good stuff but somthing in the settings is wrong about the display I get there refurbished but it should still be in good condition and all parts should be there it’s working tho just be careful that’s all I’m saying"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its okay",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I ordered this and although i knew it was renewed i guess i was hoping it would be better than it was. It turns on and the screen seems to work when you touch it but i thought it was odd that there was already a screen protector on the phone. I took the screen protector off and there are scratches in the right hand corner ish of the screen. It doesnt seem to affect the function of it but it is disappointing. I bought this for my brother for his birthday and i doubt he will care as long as it works."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed with Refurbished iPhone Purchase: Mic Issues Lead to Return",
      "date": "Reviewed in the United States on June 8, 2023",
      "body": "Being someone who has never owned an iPhone and didn't want to splurge on a brand-new one, I decided to explore refurbished options. I came across one that boasted excellent condition and claimed to be thoroughly renovated. Upon arrival, it looked pristine, and everything seemed to be in good shape. However, as I tested out its various features, I quickly discovered a significant issue with the primary microphone for calls and voice messages. The volume was incredibly low and muffled and sometimes there was no sound at all, as if it were dirty or had a technical malfunction.I went to an Apple store, seeking assistance but the cost was a hefty amount, with an estimate of around $60 just for an evaluation, and potentially another $100 for repairs. Frustrated by the situation, I chose to return the device. Fortunately, the sellers accepted the return and promptly refunded my money.Nonetheless, it was disappointing to have wasted time on the selection process, especially when I was traveling and couldn't afford to wait for a replacement. As a result, I continue to rely on my trusty Android Samsung phone, which has consistently delivered exceptional performance across all the second-hand devices I've owned.Just to mention something positive; one feature that I really liked about this phone is the option where you can double or triple tap the back to perform various actions, such as turning on the flashlight or opening an app. I find this feature very useful.On the other hand, one thing I dislike about the entire iOS ecosystem is the inability to have cloned applications. In case I need to have two or three instances of WhatsApp or Telegram for work and personal use, it's quite limiting. This is just one among many other things that I don't like. While iPhones have their strengths, I believe that ecosystem is not for me. Nowadays, with many Android phones offering great cameras and other features, there are very few reasons for me to want an iPhone, as the brand or look doesn't interest me at all.Having said that, I am grateful to the seller for promptly addressing my request and issuing a refund as soon as they received the phone back. Their responsiveness and willingness to resolve the issue are commendable.",
      "helpfulVotes": 44
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I think I got a dud...",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "I’ve had this phone for 8 months now. For the last few months (after return period), whenever I watch a movie or show with a night scene in it or sometimes it’s just random when it happens, my screen will black out and then come back. And now my screen has a thin strip that goes across the top of the screen and it looks like an issue internally. Phone has been in a case with a tempered glass screen protector since day 1. The battery drains fast also but again, maybe I just got a dud."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone on good shape but battery was at 70%",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Phone looks a good shape screen and overall the phone looks good but the battery health is at 70 % and it was supposed to be at least 80%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I love it but when i try to go to google it doesn’t let do not it bad"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "brought the phone a month ago, battery health was at 90 now it’s at 86.."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life not great",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "The phone functions well other than the battery life will not go above 86%. I bought this phone about a month ago for my daughter’s first phone. So many night I just thought she wasn’t getting the charger connected correctly so I took it and charged it for her for a week. Charging all night long several times the battery will not go above 86%. Everything else is functional and works perfectly. But. I would not buy again"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished phone that doesn’t work, shuts down with battery fully charged",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "AVOID THIS SELLER. TAKE MY WORD FOR IT SAVE YOURSELF ALL A LOT OF TROUBLE. Seller sold me a defective phone that can’t be used because it powers itself off with a full battery 5 min into a telephone call or searching something on the internet- it powers down literally every 5 min or so- you have to power it back on for it to shut itself back down again the cycle just continues. The phone arrived no scratches looked brand new. Plugged phone in let it charge enough to take into AT&T to have cellular service put on the IPhone 11. The phone was first powered on inside the At&T store. I immediately noticed blacked out places at the bottom of the screen and a black line towards the bottom of the screen (see pictures) once At&T service connected with a fully charged battery the phone shuts down and cuts off 5 min after turned on-it just cuts off, you turn it back on, it may stay on for 10 min, it turns itself off or just shuts down again. This cycle of shutting off powering down continues over and over: Quality of the item in sellers description states refurbished phone fully working condition, I was thinking the phone may arrive a few scratches, but the internal hardware works properly when it was the exact opposite. I would avoid this seller just because to return the item due to the lithium batteries in cellular phones, you can’t drop it off at a UPS STORE, you must box the item up, print out the shipping label, then wait at your home all day on a scheduled pick up day for Fed Ex to pick your phone up. I scheduled a pick up day with Amazon and Fed Ex never came. Fed Ex has to pick up lithium batteries, UPS I assume doesn’t ship cellular phones, the representative with Amazon said Fed Ex- I am not sure why about that part, but I waited at my home all day and a driver never showed up to pick up the item. They schedule the day not the time. A wasted day for me on top of the hassle of everything that comes with putting service on the phone then deleting everything off the phone to return it- defective item and too much hassle to return. Not worth the trouble. I am pretty laid back, this experience has made me a bit aggravated. I feel the seller my should check the phones before selling them- if they checked this phone they clearly would have seen the blacked out splotches on the bottom corner of the screen where you can’t see any screen only black and the black line- that would probably be a good indication the phone has internal issues it needs further investigation to fix before selling or just don’t sell the iphone. Dear seller, please do not do this to others in the future- just do not ship a phone out in that condition. This seller would receive 0 stars from me if that were an option. Seriously, avoid this seller- save yourself the hassle. I was nice added no scratches and put a picture of the back of the phone to show no scratches- the iPhone just doesn’t work. - one aggravated customer.",
      "helpfulVotes": 30
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I bought an excellent iPhone that's what I received 😩",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": ""
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lacking SimID",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "Phone did not have a SimID.  I was not aware this would be the case.  Small town sent phone to does not have a Verizon (my carrier) so had to order and now wait.  Bought a renewed phone from Amazon a year or ago and it came fully functional.  Disappointed"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but..",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Put my daughters SIM in it and it locked it . Cause they think its stolen been on the phone now for 2hours trying to prove I bought it. Other then that I couldn't tell it's been a renewed phone it's so nice. No scratches , or blemish on the phone .",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very disappointed! Be warned!",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Very disappointed with the package and unsure about the phone. I expect that the phone come in a Apple box and expect to peel the protective layer and was expect it to be clean, But it looks like it’s a used phone by someone, it was dirty on the edges and as u look in the box the charger is not even from apple. BE WARN ITS A USED PHONE!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Capacity",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "I always buy these refurbished or renew items cuz I think they are good and work fine, but this time I bought this phone and noticed the battery is not at its full capacity. For an iPhone with a battery capacity of 82% it should have cost less than what I paid. Works fine, but i shouldn't have paid that much for it if the battery was not at least at 90%. I have bought other iPhones and their battery capacity has been at 100%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DEFECTIVE SPEAKER",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "I live outside of the US . in the Caribbean to be exact. I ordered the Iphone 11. It was renewd but not checked because when I got it the speaker was not working. I had to take it to a repair shop and had to pay an additional 75 dollars to get it fixed. All I wanted was to get an Iphone in good working other. I was planning to get another one for my wife but now I’m a bit scepticle. I don’t mind paying for shipping and duties as long as I get a good phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen was popping out",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "The phone worked good just the screen was coming out a little at the top they gave me option to return but I needed the phone so couldn’t return"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cosmetically pristine but Face Recognition does not work",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "When i received the iPhone I was very pleased of the condition it was: it looked like brand new.it holds charge very well and it works flawlessly... except for Face Recognition.Unfortunately, Face recognition is pretty crucial to access the phone quickly, (these phones do not have fingerprint recognition anymore), instead I am forced to type in the 6 digits pass code every time, which is a pain.I have tried to set up the face recognition many times and despite the procedure going through successfully, then it does not work when I need to unlock the phone or some apps that require credentials.It is a pity because the iPhone was in mint condition, but this undermines the value of the product since it makes it more cumbersome/time consuming to deal with.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful when ordering",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "The phone is in decent condition. It came with a screen protector already applied, but the protector has a crack. Additionally, the back microphone is broken—when I put the phone on speaker, no one can hear me.I originally ordered a yellow iPhone, and while the phone I received is indeed yellow, when I went to register it, it showed up as a Purple iPhone 11. This suggests that the phone was originally purple and has had its casing replaced.Be cautious when ordering, especially if you have a protection plan. If the phone's registered information doesn’t match its current details, repairs may not be covered. I now have to pay for a microphone repair myself. I would have returned the phone, but I had already added it to my phone plan."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone didn’t last a year INSURANCE NOT WORTH IT",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I got this phone in February 2024 and I was initially very happy the phone even came with a screen protector everything worked perfect set up perfect all that. However starting 11/8/2024 my phone has just started turning off on it’s own at first it would turn back on no problem but it kept getting worse and now won’t turn back on without a power source. Now it turns off over 30 times a day. (I really wish that was an exaggeration) I did take it to one of the stores covered by the asurion insurance policy and they told me it was an issue with the motherboard not the battery (as I had thought) and that I would need to call customer service for a replacement. I left called customer service and they told me I had to take the phone back up to the store to surrender it and wait 3 business days before they could send me an Amazon gift card to purchase a new one. As someone who uses their phone for work and has children I can’t go 3 days minimum without a phone (not even including the shipping time the new one would take). Definitely would recommend just going to a store or using backmarket.com instead because this was a whole headache I ended up having to buy another one out of pocket due to the lack of help from the insurance policy. Oh and btw in addition to purchasing the policy you have to pay $52 to actually use it sooo take that as you will."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone acted odd, but worked until it didn't!",
      "date": "Reviewed in the United States on August 26, 2023",
      "body": "I am new to buying refurbished phones and usually buy brand new from my carrier. However, I needed to get an extra phone and eventually would give it to a family member to help transition a few things. It seemed to be great out of the box, looked great and charged and worked but the camera was horrible. I had thought it was because it was an iPhone 11, but my friend's camera wasn't as blurry or pixelated as mine.The battery seemed to be in good health, but every now and then it wouldn't charge and said, \"Will continue charging after the phone stops overheating.\" I know they sent an extra chord and block, but being I only use apple chargers, I didn't even open them and they remained in the box.There were times in the last month of owning the phone that an error of: \"unknown parts,\" would SOMETIMES come up and when I looked it up it means that either the battery or the camera was replaced. I wonder if in this case, both of them were being they both gave me problems.Long story long, I am thankful I tried amazon renewed and I am glad they gave a 90 day policy because most of the problems occurred last day 60. This is an extra phone, so it didn't get used much and while it LOOKED TO BE EXCELLENT and I'm sure had new parts placed in it, they weren't as good as apple's in my opinion and this had to be returned.The return was easy and I did everything as Chubbitech said to do and returned with UPS and tracking information showing it was returned. However, when I checked today, it is still showing I haven't started the process.This company got good reviews and I hope they honor that. I have pictures to post of the errors and perhaps just got a dud. I rest assured that this company will refund me promptly and give it until next week. These types of problems with the phone would be too much for me to then give my mom who wouldn't know what to do with all of the errors.I hope this review helps somebody. I will change my review once I hear back from Chubbietech but for now this is where I am. Thanks.UPDATED REVIEW: sept 16, 2023 This phone has been returned, with all of the parts that came with it, the same box and I haven't received my refund! I can't believe they stole my money. I have been checking with the refund status and then even reached out to customer service who had said they can see that it had been returned to sender and that I should receive my refund any day. It has been about a month. Going to reach out again. This is the last time I buy refurbished with a 90 day guarantee. BOO Trusting Chubbitech will come correct.",
      "helpfulVotes": 64
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s a good cheap phone",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "The phone itself is really good no scratches or anything, but the battery life is 75% which is a little lower than I would like but it’s whatever. Overall I recommend it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Me salió bloqueado",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Me salió blocking"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT AS DISCRIBED",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "Product was shipped promptly; however this is advertised as unlocked, it is in fact locked, with a battery life of 80 percent or less meaning battery is failing"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Listed as \"excellent\" condition but it dies fast and overheats",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "It's basically just like in the title. Got a purple iphone 11 for about 270 since it was listed in excellent, like new condition. The battery states 94% which IS high to where it should be considered excellent. However the battery drains faster than another iPhone 11 we have that diagnostic runs the battery at 82%. It also overheats. Due to both of these issues which is not a good sign of longevity, I wouldn't have paid more than 100 bucks for the phone had I known its going to end up being very temporary. Will not order any thing else from this company. Its my bad because I actually meant to order from another company and mistakenly added this one to my cart. I wouldn't intentionally order from a business with less than 90% positive ratings. Use caution before spending the money.The only thing excellent about the phone is the outside appearance. 9/10 external. 4/10 internal."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst iPhone I’ve ever had!",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "I ordered this phone, knowing it was a refurbished phone. I expected some small issues with it but, right out of the box, it wouldn’t synch. I contacted Amazon and was sent a replacement. I’ve had numerous issues with this phone and have not once contacted the seller.  Issues include:Cannot back up phone because it has an “incompatible battery” as well as a “non-original screen”It shuts down randomly, by itself. Only a few times at first, but now it is doing it daily.The volume is so low, I have to use the speaker to hear a caller. Others have commented when trying to use my phone as well.The volume randomly goes away when using apps. I’ve tried to get it back and have to go into another app, turn the volume on and off, then go back to the original app."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not too bad",
      "date": "Reviewed in the United States on May 23, 2024",
      "body": "I had a Samsung Galaxy which was a nightmare full of issues!  I also have an IPad so I decided to take the plunge and get the IPhone and just got it today.  I’ve noticed others mention the charge limit, mine did charge to 1000%!  BUT I have a notice in settings saying the phone is unable to identify a part as Apple.  It seems to reference the display.  I’m guessing maybe it had a cracked screen or something.  It seems to be working fine so far.  It is smaller then what I’m used to, my Samsung was 6.6 and this it 6.1 quite a difference.  I’ll have to get used to that! I’m with tracfone so I needed to order a new sim which should come tomorrow or the day after.  So once I can finish setting it up with the carrier we’ll see how it sounds.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good phone, but the speaker sounds bad when turned up",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "The battery life on the phones is already 89%, but that’s kinda expected. The top speaker of the phone though doesnt work well if it’s turned up past halfway. The phone looks really nice and it was pretty cheap, but you probably will have some sort of problem with the phone ⭐️⭐️⭐️"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad phone, customer service makes me nervous",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "Ok, I am going to try to write a fair and honest review of my experience.  I bought the iPhone 11 a few days back and when it arrived it was not fully functional.  There was no audio for phone calls, neither from the upper speaker at ear level, nor from the speaker phone.  I reached out to the seller (Cell Surfers in Brooklyn, NY) via amazon message, expressed my frustration, and they said to send it back for refund and reorder.  I had a number of questions I sent to them--including if I could get a phone number to talk to them directly.  They answered some questions and did not answer other questions.  They did not answer the phone number question.  I got a phone number for them after talking to Apple and they found a number.  I tried to call 4 times, I believe, and goes to message after a few rings.  I looked online and saw they have an 'F' rating from Better Business Bureau.  After reading a number of reviews on amazon and seeing some claiming the refund process had not gone well, I decided to call Amazon Customer Service.  Amazon Customer Service was helpful and immediately initiated the refund process.  I do not intend to proceed to reordering with this company.  I have read other reviews of people feeling satisfied with the product and with the customer service.  That is just my experience.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone gets hot.",
      "date": "Reviewed in the United States on April 8, 2024",
      "body": "It’s a really nice phone and came really quickly. The biggest down side is that I’m noticing the phone gets hot sometimes. I’m not sure what causes it. I’ve reached out to the seller hoping to exchange the phone bc again it is a nice phone and they’ve pointed me back to Amazon. Since it is a “fulfilled by Amazon” they refuse to replace the phone. Though I believe it is apart of their warranty. Amazons only option is to return and get a refund. Which may seem like a simple solution to some but not for me. For safety reasons I do need a phone. So returning it, waiting for a refund, then purchasing a new one, the time it would take for that I’m not fully comfortable with. My old phone is not usable at all. Which is why I needed a new phone in the first place. I do wish they had a replacement option whether through Amazon or the seller. I’m not lookin for two phones. Just one that doesn’t get hot. So just something to consider when purchasing from this buyer. Or any buyer."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker was bad",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "Speaker was distorted and function poorly. Had to replace immediately at local repair facility"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "the phone works well but the battery is still done it has been changed"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good physical condition, bad battery level.",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "We purchased this phone for my daughter’s birthday so we ordered it a few weeks before to ensure we had it on time. The phone came in excellent physical condition except for a couple small scratches on the corner. We purchased the excellent option and the only gripe I have is that I feel since we did purchase the highest option for quality, the battery level should be higher. Its battery percentage is 84%, but she’s happy so I’m happy. It works and looks good so I guess that’s all we can really ask for. Next time I might try to save some money and get the good for the probably the same battery level.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    se calienta rápido ayudaaaaaaa",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "Le pongo 3 estrellas porque el teléfono se calienta demasiado rápido no puedo ni jugar 5-10 minutos porque se calienta la parte que está a lado del botón de encendidoLo demás esta perfecto a mi me llegó con un porsentague de 91% demás el cuidado de batería el único defecto como dije es que se calienta muchoSi saben como arreglar ese problema avísenme"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good performance",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "The camera quality is really good. It was easy to set up. It worked good for the most part. I’ve had it for more than a year & it still works. Battery performance is really big for me when purchasing any device. I didn’t like that the battery was already depleted. I think if it wasn’t as depleted I would get more out of this phone. I had to replace the battery to increase speed and improve functionality.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    80% battery life",
      "date": "Reviewed in the United States on June 12, 2024",
      "body": "The iPhone 11  shipped and I got it pretty quick 3 days. Looks good and it seems to work well the screen had 1 small spot on it not bad I can live with that but the battery is at the minimum 80% and that is disappointing it goes down on charge pretty quick it seems by the end of the day but it is at the very minimum stated on add so maybe other phones have better batteries I will have to see how the battery holds up over time. I would have gave it 5 stars if not for the battery.[update ]I returned this phone due to having to charge a couple times a day  and still waiting on my refund it's been over a week and it shows they received it but no refund yet. I got another 11 from a different seller and the battery is 98% so some good ones are out there. Hopefully you won't have this hassle I'm going through. good luck"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor Battery Health, Not Matching Standards",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Other than the battery, the iPhone 11 seemed to work well. However, based on refurbished standards, I was meant to have a phone with a 80% battery health life or higher. It was at 76% and notifications for degradation & needing repair were present when I went to check battery health. I am disappointed, as I was intentional about finding one with decent battery health, as I've experienced the same thing in the past. I am now going to return it and wish a simple replacement was easier to do via this seller."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish this was perfect *Updated*",
      "date": "Reviewed in the United States on August 4, 2022",
      "body": "I would like to say this is a perfect phone, and it certainly did work perfectly… until exactly 6 months after my purchase, and I mean 6 months TO THE DAY. When it suddenly stopped working, wouldn’t charge, began turning on and off repetitively about every 2-5 minutes, and it kept saying something along the lines of “battery cannot be confirmed as an apple product”. So whatever battery is in my phone well .. idk wtf it is :|. Along with that when I brought it to Best Buy’s geek squad it was so far gone that the supervisor couldn’t really do much and since for some reason they seem to have thrown random parts together and made it somehow work for half a year, it also means that (at least at best buy through their connection with apple) they couldn’t find my phone/serial number in the system at all which meant I couldn’t even get a replacement which would’ve been fricken covered but now I have to go to apple directly and am going to have to pay for a replacement battery and gods know what else. :|Update: I finally had my appt with apple and I thought it would maybe cost $150 max to replace the battery, ended up having to spend another $450 to just get an entirely new replacement phone instead. The battery still wouldn’t charge, and they said the wireless charger was so far gone and it was messed up somehow and that was what was causing the issue. I’m very suspicious though about how it all went down because I seriously mean it when I say it stopped working exactly 6 months after I bought it to the day 😭",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Has ghost touch",
      "date": "Reviewed in the United States on April 18, 2024",
      "body": "Bought it because with my old phone you could see the battery from the back and it would shut off for hours if I dropped. So naturally anything would have been an upgrade from that. This phone works pretty normal except it has this weird ghost touch problem where it press things without me even touching the screen or won’t register that I’m trying to tap on something. Ive tried reset my phone, taking off the screen protector, and wipe down the screen and it still won’t go away. It’ll do the ghost touch every now and then and I’d have to turn my screen off to clear it. Gets really annoying when it happens continuously but it’ll go away after a while but then come back. Besides that it works just fine. Battery health was projected to be 80% and it’s at 87% so that great. The screen had no cracks and it has very minimal, barely visible scratches on the back. Came with a charger which I wasn’t expecting so nice. It only has one problem but it is a really tedious and bothersome one so 3 stars."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not meet expection.",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "I have recently purchased an iPhone 11 64gb from this company. The the battery life is 79%, listing claims it should be at least 80% and up. It came without any charging cable, description said a charging cable is included in the box.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery was degraded to 67%",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Phone works well but battery severly degraded to only 67%"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as advertised",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I’ve ordered three phones from the seller, the website guarantees 80% battery capacity. One phone I received had 79 so that was good. The other phone had 65% and the last one had 71%. I’m keeping the one with 79%, but I will keep returning and rebuying the other cell phone until I get one close to 80%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Ayuda",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Necesitp ayuda, me pide un codigo y no puedo iniciar el telefono"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Iphone",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Vino algo rayado no fue como lo esperaba"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Paid PREMIUM but screen scratched  and battery went from 100% to 90% in a couple of months",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "Update: Device works well, but beware: some Amazon renewed companies are excellent and some are garbage.1st iPhone XS was Totally flawless and excellent 100% battery2nd: got a renewed phone from a different renewed reseller where the phone reported 80% battery capacity... after two weeks it started draining super fast and the actual battery capacity was below 79% and dropping fast.3rd: my third phone is ok... I paid extra for premium but the screen was scratched but hidden by a screen protector and now my battery id degrading quickly.  All of a sudden the battery is at 90%.... why was I charged extra for premium?  There's no way to see who the seller was.I'll probably not get another Amazon renewed phone again.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hardly",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "I would hardly say that “EXCELLENT” condition is a battery health of 80%. One percent less and it’s recommended that you replace the battery immediately. Wouldn’t do it again!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, thats it",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "Came in minimal packaging, nothing but a cord that apple doesn't recognize as a genuine accessory, but for the price, I am content"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    my battery capacity shows 76% , not 80% as described",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "my battery capacity shows 76% , not 80% as described. let's see, if it dies too quick, i will return this item."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cracked screen",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I got the phone and it had 2 cracks in the screen. I use it but that is a little frustrating"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low battery life",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "IPhone 11 looks good. Minimal scratches. Seems functional. The only thing I didnt like was the battery life. I feel like for a renewed phone that should have been replaced with a new battery or something with more battery life. Bought this as a gift for my dad and I can’t return it because I won’t have time to order a different phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wrong charger",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "Phone received and had warning for non -apple. Items installed. The charger is not compatible so that's more disappointing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works but has issues",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "Not at all what I expected for an \"excellent\" refurbished phone. Phone doesn't recognize screen or battery. Screen is lifted so I'm being extra careful not to break it. Can't check battery health since it isn't recognized. Besides those issues phone works great so I will unfortunately invest in a new battery andscreen for it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone had issues as soon as the first month of having it",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "This is the second phone that was purchased from this company and when I received the first phone, I was purple then the camera went out. I didn’t even have it a full year and I’ve already had cash in on the insurance thank God I got insurance so if you buy a phone from this company, be sure to buy the insurance"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s okay",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "I the phone quality is okay the brightness is great functionality is working for what I need it for the fingerprint reader works and Face ID. The only flaw is the sound it’s quiet even if I have it turned all the way up. I have a case for scratch resistance."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery in terrible condition and terrible customer service",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "Terrible service. I have bought from many third parties on Amazon, and I’ve never had an issue until now. The phone has a battery capacity of 70% and it should be at least at 80% or higher. I explained what the issue was, since i was given a defective product. Now I feel like I’ve been scammed because I have to replace the whole battery for the phone myself. I asked for a way to get the replacement first before returning the one that’s defective so I could transfer all the data, and that wasn’t even an option. So the only way to keep all my data is to keep a defective phone that I paid extra for to be in excellent condition. Hope this third part seller learns to make customers life easier instead of a living hell."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Battery Is TRASH",
      "date": "Reviewed in the United States on June 20, 2024",
      "body": "I revived the phone yesterday . It  phone arrived  in great condition , no scratches or cracks . However , the battery life was 70% . It seems as if the charger that came with the phone was draining the battery rather than charging it. I left it to charge overnight and it charged  to 100% but as soon and I take it off of the charger and start scrolling the phone the battery percentage starts to drop within minutes which is very annoying .  Im currently using the phone on low battery mode . So far this is my only complaint .Update (same day) the phone over heats 🫠",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No está en la condición ofertada",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "El teléfono no está acorde a las características que se ofertan “pues dice excelente condición ” y el estado de la batería al 79% y algunos rayones que tiene el teléfono corresponde a un teléfono de menor categoría de conservación !!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing - Face ID Disabled, Battery Issues, Non-genuine Parts",
      "date": "Reviewed in the United States on May 16, 2024",
      "body": "I’ve had this iPhone 11 just shy of 4 months. Upon arrival I noticed there was a black spot in the middle of the screen that I was unable to remove. I had difficulty looking past the mark and decided to remove the screen protector which ultimately solved the issue. I can’t imagine this being intentionally sent out this way and must’ve been overlooked. I initially had high hopes after noticing the battery life was at 100%, however after a couple weeks of using this phone I began to experience issues.Starting with FaceID, I was having trouble opening my phone on occasion, and certain apps that required FaceID were unable to open. Ultimately I had to disable FaceID and when attempting to reactivate it, I was unable to do so. After contacting Apple for a fix, it appears to be a systematic issue with the TrueDepth camera that occurs from improper repair and nongenuine Apple components. This was very disappointing as I was accustomed to using this feature and although I was within the return window I was hesitant to do so as I had been using the phone a couple weeks and the return policy appears subjective. I will add that the TrueDepth camera feature also affected  my phone’s ability to capture front facing pictures in portrait mode.I had no issues with the battery life until about 3 months. I have great battery etiquette (charge only until it’s full & no excessive charging) but recently my phone battery percentage drastically changed from 40% to dying out of the blue. Once I connected my phone to power the battery significantly jumped from 0% to around 30%. This has continued occurring where the battery percentage will jump drastically. I’ve never had to worry about an unreliable battery and will now have to consider a new phone again soon.I’m unsure if I just received a lemon of renewed phones or if this is a more common issue, but this has been terribly disappointing.Edit - 5/28/24 The battery has now swelled making the phone unusable. This is unacceptable and I will be contacting the seller and Amazon to find a solution. I was not sold a quality, professionally restored and tested phone as stated in the description. This is not right and I will escalate this if necessary.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low battery capacity",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "The phone looks relatively new. Everything seems to work as expected, except the battery capacity. It shows 73 percent capacity left. Wonder if the seller can help solve this battery issue then I will raise to 5 stars. Thanks!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "I received the phone with no charger or any paperwork at all. A supervisor did give me a 100$ discount but I am having problems being able to receive calls from an institution plus it says Jessica is calling and my name is Dorothy. They did not fully renew this phone. Otherwise the forwarding from house to cell would’ve been removed and Jessica’s name would not be showing up. I have had nothing but problems with This phone since I bought it. It no longer rings or has sound for notifications and the battery drains completely in an hour"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life not true",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Phone looked great Battery health at 70% fully charged.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very poor product -",
      "date": "Reviewed in the United States on June 11, 2024",
      "body": "Received the iphone in approximately a week after ordered.  Phone worked for about 2 months and would not accept a charge and was complete dead.  Of course this happens within 1 week of subscribing to a cellular service.  Also purchased Assurion insurance.  Got the run around to get iphone identification information to file a claim - which after all that - was told it still was under the 90 day grace period through Amazon.  Started the return process, with the option of UPS pick up at home.  We all work during the day, and missed UPS pick.  Reset my return to drop of at an Amazon return location over a week ago.  My return status still shows the item was dropped off and is in transit to the seller...for the last week.  Attempted to chat with an automated representative about the return - waste of time.  So I chose to have a representative call me directly.  The call went straight into voicemail.  At this point I am very frustrated with this whole order/return process through Amazon.  I just want to confirm the item was not stolen and why does it take 30 days for the seller to receive the item that has been returned.  I have never seen this in all the years of using Amazon.  : ("
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Damaged, not as described.",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Dont purchase! My order said the phone was in “excellent” condition, as you can see there is a chunk/chip missing from the corner. And the battery isn’t able to fully charge! I am so disappointed. The screen also doesn’t fully increase in brightness, and is very dim. NO disclosure of this either!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in \"excellent\" condition",
      "date": "Reviewed in the United States on August 13, 2024",
      "body": "I paid more for the \"excellent\" condition option, but the phone arrived with some minor scratches on the screen and dirt around the edges. It's also lopsided when you set it down on a flat surface. I consider it good, but not excellent. The battery life is 81% (just over the minimum for what Amazon says is \"excellent\" condition). So far it is working well, and I am hoping that the functionality of everything truly is in \"excellent\" condition."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone screen sometimes doesn’t work",
      "date": "Reviewed in the United States on October 30, 2023",
      "body": "Not the worst phone, but definitely won’t be buying from the seller again after the experience I’ve had with this one. The phone works SOMETIMES. I’ve had problems since I bought it with the screen not turning on when I press the power button. It takes several attempts sometimes for it to actually turn on. It’ll light up slightly like it attempted to turn on, but I can’t use it when the screen is black… I also have had 4 incidents where the phone screen won’t let me use the touch screen (funny how it’s a touch screen phone huh?). It’ll turn on, but I won’t be able to actually get it to work properly and inevitably have to restart the phone or in my case let it die because it won’t actually shut off when you hold the power button like you’re supposed to be able to do. I’ve had an iPhone 11 for 3+ years now, so I’ve grown accustomed to how they work, but needed a replacement. Never have I had so many issues with a phone. Like I said though, the phone works most of the time. It’s just an annoyance when you want it to work properly and it won’t…",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I bought this phone in 2023, and had to get rid of it by Christmas in 2024 because of how bad it kept messing up! I loved the color and i loved the phone but sometimes it would just power off, then it stopped taking my number and then its just slow in general. I prefer to keep a phone for more than a year or two to get my moneys worth, but for 600$ and a year of having it i wouldn’t recommend :("
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charger",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "Charger is not working"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished with not recognized Apple parts apparently",
      "date": "Reviewed in the United States on August 29, 2024",
      "body": "The phone seems ok but I guess I am going to have a message forever under settings that says \"Display Not Recognized\" with a little red \"1\" . The detailed message is \"This display for thisiphone is not recognized. An Apple Authorized Service Provider can repair or replace the display to restore full functionality.\" So that kind of stinks. I am not very happy about that and will have to contemplate a return.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing Refurbished iPhone Experience",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "I'm extremely disappointed with the refurbished iPhone I received from SGT Market. The phone itself looks and functions well, but the battery life is unacceptable.Upon setting up the device, I was shocked to find that the battery health is only at 86%! For a refurbished phone that's supposed to be thoroughly inspected and tested, this is unacceptable.I specifically bought a refurbished phone to save money, but I didn't expect to have to deal with a battery that's already degraded. Apple's standards for refurbished devices clearly state that batteries should have a capacity of at least 95%.I'm requesting a replacement with a new battery or a full refund. As a customer, I expect a refurbished product to meet certain standards, especially when it comes to something as essential as battery life.Until this issue is resolved, I would caution others against purchasing refurbished devices from this seller."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It worked",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "I payed for the new one and it said it came with a fast charger but it came with some cheap usb charger and a box so don’t get this one but it worked and I didn’t have any issues and the battery was at 90 the camera worked fine and it had no",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap screen replacement.",
      "date": "Reviewed in the United States on March 12, 2024",
      "body": "I received this phone and I was a little upset because it said that it was going to be an excellent condition, but there were scratches along the back of the phone on the camera and also on the bottom of the phone since I bought the phone use. I wasn't too upset, but when I turn the phone on, you could see an outcast.  Of the screen, like the replacement screen wasn't placed on the right way.In a few days later there were lines at the top of my screen as if there was damage to the screen but it was not cracked at all. Luckily I contacted Amazon and they were able to give me the option to return the device for a refund. If the screen wouldn't have started malfunctioning, I would have kept the phone. It was working perfectly fine.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was okay, just be aware.",
      "date": "Reviewed in the United States on February 18, 2024",
      "body": "The phone itself looked fine, there were hardly any scratches and no dent marks or obvious cracks, and was a bit dirty but that was easily resolved with alcohol wipes.The issue I had was the phone top speaker was very low to non-existent, I use speaker on my phone a lot and with the phone I received it just wasn't possible I could barely hear youtube videos or anything played on my phone for that matter, the sound while not on speaker was fine I could hear if I had it directly up to my ear.But setup with easy enough and everything else worked as described, I am probably going to refund it and maybe try my luck and order another one to see if I could get one that the speaker actually works.I tried to issue a replacement but it was impossible for me to get to a ups to return it, i wish they did in home pick up.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on August 3, 2022",
      "body": "I bought this product about 3 weeks ago. I have loved it and I thought it was the best purchase. However, yesterday my phone randomly crashed and it was at 50%. I turned it on and it was completely dead, but it was on. It said 0% remaining when I plugged it in and it was not seeming to charge. I went on settings and it told me that the battery in the phone is likely not compatible with this phone or it is not an actual apple battery. Now it can't go 2 minutes without crashing. I cannot even write this review on my phone because it will crash so I am using a computer. I would return the phone, but I cannot keep it on long enough to transfer my information to a new phone or to reset it. I am very disappointed and I do not know what to do. I would recommend buying straight from apple to ensure the phones reliability. Edit: I took it into best buy and I was told that the battery is not the issue, it failed all the tests and they did not replace it. I am not sure what the problem is. Maybe I just got a defective phone with my luck. I'm sure the other phones from this seller are reliable, I just had a bad experience. The customer service was great and they seemed very willing to help me out and assist in returns.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product but delivered 2 weeks later than promised",
      "date": "Reviewed in the United States on September 17, 2024",
      "body": "The delivery date was not close to what it said when I bought it.  It said 2 days, it took over 2 weeks.  I would have selected another vendor had the delivery date been accurate. I can only give it a 3 because of this."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone but Volume is broken — returned",
      "date": "Reviewed in the United States on February 1, 2023",
      "body": "Phone came promptly and as advertised: slight chipping on the corners (don't care — I use a case), and a disappointing 83% battery health. But all within what was promised. The screen was replaced with genuine Apple screen. It was charged over 500 times — essentially just about every day of its life.However, as I started using it, the Volume would automatically go down when I was just walking. Tried to deal with it in software:- Restarted after every change- Turn off Change with Buttons on iPhone- in and out of case cover- wired and bluetooth headphones- turn off \"Lift to Wake\"- turn off \"Tap to Wake\"- Disable Attention Aware Features- backtap off- in a pocket and held by handNothing helped. Something must have been damaged as the phone was dropped by the original owner.Had no choice but return it. Can't really blame the reseller. That bug would be hard to spot without extended use. Hope they'll fix it and not just pass it on to someone else as is.Will try again after the return is done.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hidden damage - don’t recommend this seller",
      "date": "Reviewed in the United States on November 6, 2024",
      "body": "This phone was NOT excellent quality as per Amazon description but I found out too late I was initially pleased with this purchase and it came with a screen protector which I thought was a bonus. However I recently had to replace it because my son dropped the phone (of course this is why we use screen protectors) and when I removed the protector it came with I discovered the screen was covered in small scratches. I purchased an “excellent” level renewed phone and one of the criterion for that is no scratches on the screen.Be warned - if your renewed phone comes with a screen protector already installed I suggest removing it to make sure the seller isn’t trying to cheat you and sell a lower level phone for the higher price."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery won't stay charged",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I bought this phone for my son's birthday it worked great for a few weeks then it's slowly just stopped charging and when I do get it to charge the battery drains within 30 minutes."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera Quality is Horrible",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "(Took a picture of the charger box that came with the phone) The phone works as it should but the camera quality sucks. It’s blurry and it can barley make out text as shown in the picture. Disappointing but I didn’t get the phone for taking pictures so it is what it is.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible Conditions",
      "date": "Reviewed in the United States on September 2, 2023",
      "body": "Do not buy. I have purchased multiple phones through Amazon Renew and love the service. Unfortunately, this one has been the worst, and by a mile. Their \"acceptable condition\" has the description of minor surface-level scratches, I do not understand what type of definition they mean by this as it's not what I got. I guess they derived this definition from their own dictionary or made a new meaning for it. I bought this and even paid for the express shipping to only receive a phone with about three deep scratches in the middle of the screen and scratches throughout. An excessive amount almost like someone just had their keys in their pocket and decided to put their phone in and purposely rub both items together. This by far has been a colossal disappointment, I prefer them to be honest and straightforward with the condition rather than having me pay extra for shipping and getting a horrible product. DO NOT use this seller, I would hope Amazon would review this seller as well as I believe this is not a great representation of what this program is meant for. I do apologize for the long review but as stated I've used this program multiple times and compared it to the rest one of the worst sellers on here. Even the packaging it came in was just bubble rap with all the continents of the phone loosely placed in an oversized box. I'm surprised the phone didn't get more damage in transit, as other sellers at least do the courtesy of placing a box with a tighter fit so the phone won't get damaged. Avoid this seller at all costs, I hope Amazon can see this and refund my shipping cost as I am now out $25 for what I think has been my worst experience on this site by a mile. I will definitely be returning this and at least recoup some of my money to use another seller on here. DO NOT BUY FROM THIS SELLER YOU HAVE BEEN WARNED.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Heat",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "I bought the acceptable refurbish $197 (214.97) well it heats up really fast when it charges up but if I have screen off and not using the phone it stays cool."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ordered purple received yellow",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "Ordered purple even shipment paper from them says purple but they shipped a yellow iPhone 11. There are visible scratches on it. Seems to be working fine so far still early though."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as Described",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "The iPhone I purchased was listed as \"Excellent\" condition and described that as having no screen scratches or signs of cosmetic damage. However, the iPhone I received is very visibly scratched up. Battery life was 89% which is decent but the when I tried to set the phone up, it was freezing a lot which had me worried it would not function properly. I am returning this phone and hoping the seller will replace with an iphone free of scratches and cosmetic damage."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Touch screen inferior",
      "date": "Reviewed in the United States on May 16, 2023",
      "body": "When I first set up the phone I got a message saying the touch screen was not Apple.  I didn't think much about it because everything seemed to be working.  I was getting ready to go out of the country for 3 months and needed a phone.  The first time i tried to turn the phone off was when I was on the plane. it took about 6 pushes on the side button for the phone to go off.  Again, I didn't sweat it.  However, over the last two months I can barely turn the phone off with the button.  i have to go to settings.  The biggest problem is the touch screen.  occasionally it could be slow to respond.  I got back to the USA about a week ago and noticed the slowness was more often.  Today i saw a missed call from a contact in Africa.  Those calls are usually important.  I couldn't unlock the phone.  The screen was completely unresponsive no matter how much I tried to swipe.  I couldn't do anything.  I couldn't use settings to turn the phone off.  I thought maybe if I turn off and restart it will be ok.  After pressing the side but about 16 times I got the turn off screen.  That worked.  After waiting about 30 minutes I tried turning the phone on. Again pushing the button numerous times.  Nothing changed the screen was and is still unresponsive.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "Phone looked new, disappointed how hot it got and retained the heat level. Burning my hand. Also battery life seems to drain fairly quickly.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Microphone.",
      "date": "Reviewed in the United States on April 10, 2024",
      "body": "I ordered this not that long ago. Overall great for the price. had a little trouble setting it up but that was all my doings. Though when i finally got it set up, a few days after i realized that there was a microphone issue. I can’t record videos nor can people hear me on call. The only thing that picks up audio is my video from the camera app itself. snap, insta, other socials and again calls are the issue. I thought about sending it back in but changed my mind and am just going to take it to a repair store for a quicker fix. Overall, the phone itself is great, no other issues battery life is great."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Let the buyer beware!!!!!",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "Let the buyer beware! This is the first negative review that I have ever written, but the story needs to be told. Two weeks after purchasing this phone the screen started glitching and not responding to my touch. I spoke to an Amazon customer service representative and they put me through to an apple support technician. At this point, I spent two hours attempting to fix this issue with the Apple Support tech. One of the things that they tried was a reset on the phone. This caused an additional couple of hours having to go back through my phone and reestablish passwords and usernames for most of the apps. Rather than send the phone back to Amazon and be without a phone until they could send another, I made the decision to take it to a cell phone repair business. Within 20 minutes and $159 later, the phone was fixed. The problem was, when the phone was refurbished, the screen/digitizer was installed incorrectly. The technician also indicated that most of the parts inside the phone were not Apple original. In his words, “ it looks like a real iPhone, but is far from it, this is Frankenstein‘s monster”. The lesson that I have learned is that if you spend $250 on an iPhone, either don’t expect much from it, or expect to have costly repairs.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best for a refurbished phone…",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "Obviously I liked the price, but I definitely didn’t get too lucky with the phone I got. The battery percentage was 77% which means it should be serviced. There’s a slight fuzzy dot whenever I take pictures and the volume is crackly and low on the ear speaker, so I always have to make calls with the speaker phone on.It was too much of a hassle to try and return, as I had already factory reset my old phone and needed a working phone right away. However, everything else seems to work fine. It links well with my iPad which I love and a case easily covers up the scratches it had on the back.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not use authentic/genuine replacement parts",
      "date": "Reviewed in the United States on February 5, 2023",
      "body": "As someone who has used a Samsung for years and wanted to try an Apple iphone out for the first time, I was disappointed that when setting up my phone I was met with the same System Message regarding the phone being unable to determine whether the display is a genuine apple part as \"it's a non-genuine part, its not functioning as inspected or installation is incomplete.\" It didn't matter how often I closed the message it would frequently pop up with any use of the phone. When I contacted Avant/seller, I was initially met with a message that made no sense to what I was asking (to help troubleshoot the system message). Eventually I received a response to ask for screenshots of the message and after sending they apologized  as they have a strict quality control system in place and on rare occasions a few devices get overlooked - and offered a credit or a return for a refund. Here is where I experienced a few frustrations:1. Although the seller admits it was an oversight on their part, if I wanted to return the device I would have to fully pay the shipping back, which in my opinion I shouldn't have to pay anything for receiving a product that was not properly cleared during their \"strict quality control inspections.\"2. The other option is, if otherwise I'm happy with the product they offered a $10 credit and 30 day extended warranty. I considered this, but I wasn't happy with the device and opted to return in which I learned I'd have to pay the full shipping cost.I ended up keeping the phone as it's past the refund stage and still continue to deal with the system message. I use it mostly as a secondary phone and have learned that if you have the funds, just go to an apple store to buy a phone. It's not worth the hassle. Although refurbished doesn't always mean they are refurbished with genuine parts, the fact that myself and others lately have experienced the same issue is concerning. I see these phones posted all the time as part of FatKidDeals and it is the first product I bought thru their referral that has let me down.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issue with battery health and a bit glitchy!",
      "date": "Reviewed in the United States on November 20, 2023",
      "body": "The battery health on my phone is 82 and it stops peak performance at 80, and starts slowing down after that! I'm a little bummed out Im going to have to buy a battery for it so soon! Other than that it works good. Update: it glitches out and will kick me out of apps, I’ve had the phone for 4 months and the entire time my system data has eaten up any storage available on my phone, I even bought iCloud storage and it ate that up, and because of this it will not do a system update so my phone is just gradually getting slower! And it’s cheaper to trade my phone in than to get it fixed through the insurance plan, it’s 80$+ 🫤 on top of all of this my phone will just glitch out and kick me off of my apps, it has rang and disappeared and rang and disappeared when it comes to phone calls, it will load the app kick u out and load the app and kick you out (all of this without touching the screen) I paid extra to get the best refurbished phone so it’s actually quite disappointing that I have this many issues with it and I could of saved money and just bought the fair and probably would of had the same issues!🫠🫠🫠"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Face ID",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "I just bought this phone yesterday it came how I ordered it but one problem is that my Face ID dosent work"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t buy, waste of money",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I bought this last year in December and it’s been nothing but trouble. I’ve had to replace the battery TWICE now and it’s acting up for a third time. At this point I’m just going to buy a new phone from an Apple Store or a store that carries authentic apple products. Renewed phones usually have poor quality Apple batteries and you’re just going to have to keep replacing the battery."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unknown battery",
      "date": "Reviewed in the United States on June 8, 2023",
      "body": "I had just received the phone yesterday and everything was great on it. I noticed some access glue on the phone where the back is put on but I dismissed it and thought nothing of it. I was using the iPhone when it had suddenly turned off and when I got it back up and running i received a notification that there was an unknown part in my phone located in my battery.  If it wasn’t for that, this phone is super affordable (even if I have to buy a new battery for the phone they are inexpensive) and came in really good condition and so far had worked very well.Update: I’ve been using this phone for about 6 months now and have yet to switch the battery to an apple battery. It does reset itself a lot and it does get quite annoying especially when I’m in the middle of a text, but it hasn’t been resetting almost at all within the past two weeks so that’s a plus! The phones definitely worth it for the price!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice iPhone",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I loved the color and the price. I could never fully get it transferred over but what I needed it for was fine. Calling and text messages was really all I need I notice after about a week of having the phone my speaker went out . I had to answer my phone with headsets or on speaker"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To be updated",
      "date": "Reviewed in the United States on September 22, 2023",
      "body": "Jesus.... the amazon deliverer had a bad day I think and I might have to return this because he just tossed the box and it landed sideways!Amazon really needs to hire new people who WILL do their job right.It seems I lucked out even IF the Amazon driver was a a hole... the battery life seems to be great for a refurbished device and the touchscreen functions like a brand new phone. Setting up took less than 2 mins now one thing to note, I bought this phone primarily to use for my starsense telescope and to utilize the starsense explorer app but thats a whole different topic. This Iphone is in excellent condition though the packaging I really have to rate 2 and a half stars as there was barely any cushioning to protect the phone from any harsh movement AND of course angry \"amazon\" drivas*ers but currently am convinced I do have a working phone. 👌 However, im still wanting to punch that amazon driver.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tiny scratch even on excellent quality, return allowed however",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Upon unboxing the product I unfortunately found a small scratch/Nick on the screen portion of the phone. There, of course, we’re others on the casing, but those are of no import. I was hoping that purchasing at excellent quality would afford only case damage. However I was allowed to return it and given a plentiful amount of time to do so, so this is not a 1 star review."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Could’ve been nice but",
      "date": "Reviewed in the United States on January 15, 2023",
      "body": "Ok so I will say I was satisfied with the shipping, return went through fine and communication from the  seller was good also my phone came to me in like new condition BUT i could not update it no matter what I did and I did everything you can think of down to Apple support! Multiple local phone stores, Best Buy, tons of YouTube videos, logging into tons of different Wi-Fi’s, tons of googling, watching others around me update their phone with in minutes and still mines would say “cant update because I’m no longer connected to the internet” it was becoming a headache as I would try over and over daily! I gave up after 3 weeks, yes 3 weeks of trying. Wasted time and wasted money on a case, screen protector ect. But I couldn’t imagine keeping a phone that can’t update that’s not good at all. I believe as in others, that it had an internal issue. So while I had no issue returning and getting my refund, thank goodness, I did write this review to help others in case they come across this same update issue with their refurbished phone. Just send it right back. It’s a hassle, and you’ll need to buy another phone to keep your number but don’t waste your time and brain cells like I did. Just transfer your number to new phone, log into Apple ID, wipe it out and sent it back! Again seller was cool, but unfortunately the ordeal and all that I went thru because of it was the reason for a low rating. Oh and my new phone from somewhere else updated immediately!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life, Not Reliable and can’t hold charge",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I have had my phone now for a month and was trying to be patient and thought it was my own fault that I bought it used. I had an android for the last 15-20 years, and do buy expensive ones due to it being a small device not a life! I am not rich and use a non-contract carrier for freedom choices. So after much thought I decided to make the BIG switch. That transfer alone was a challenge but worked. I was thrilled this the size, its picture quality and the huge selection of accessories! Then it would just turn off out of nowhere. Battery fully charged. Ok I thought maybe I did something. Then it would go from 90% battery to under 10% in an hr of no use. So as this has been going on for a month now, I purchased August 1st (gift to myself for 1 year sobriety and doing it on my own 1st time and for myself!) I made a complaint. Called the # I read to call. No help but direction on sending seller order number and complaint. I was hoping for an exchange for a new one. I keep getting same automated message about 2 business days. It’s been over a week. I can send this one back if they send one so I can easily make transfer of information. Sitting here unsure, unhappy, disappointed and mad at myself for making the BIG switch. I just want a cell phone that’s reliable.",
      "helpfulVotes": 5
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone 11, 64GB, Black - Unlocked (Renewed)",
    "asin": "B07ZPKN6YR",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).",
      "Tested for battery health and guaranteed to have a minimum battery capacity of 80%.",
      "Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information."
    ],
    "boughtCount": "3K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "1",
      "2"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$175.86",
    "url": "/gp/offer-listing/B07ZPKN6YR/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B07ZPKN6YR",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone, USB Data Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$186.00",
    "listPrice": "$222.60$222.60",
    "savingsPercentage": "-16%",
    "standardDeliveryDate": "Friday, March 28",
    "primeDeliveryDate": "Monday, March 24",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}