{
  "asin": "B084KS5WYC",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exelente Producto",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I was pleased, this phone is very good, it comes free from the factory you can use it anywhere, good price, I recommend it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Kudos to TheGadgetDeals.  The phone appears to be excellent.  It was unlocked as advertised and easily setup with a Mint mobile sim card.  It is smaller than most new phones, which is why I wanted it, and it has a very easy user interface compared to a Motorola phone.  I would buy this again.  If any unpleasant surprises come up i will update this review.  It is older tech, but it works fine for me and the price was great at $72.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a bad phone",
      "date": "Reviewed in the United States on November 19, 2023",
      "body": "The Phone was in a factory package but upon opening it would not charge after many attempts it finally began to charge.  So I began setting up the phone . Initially I was on WiFi so setup proceeded as expected,  then I switched off WiFi and discovered that the phone was locked from att Sim use. I noticed that the phone was a tracphone so I contacted tfunlock and after 24 Hrs was able to unlock. But the phone would not work on data plan so I researched how to setup the APN settings to look like my other phone but they were greyed out.  There were four options before a factory reset and on the forth I was able to force APN settings that worked with att but it was still using the VMNO setting that are forced on tracfone which delivers way weaker signal than my other phones about 20 dbm's which is significant signal loss.  So  thought ID contact the manufacturer.  I connected the charger and attempted to continue setting up the next day but the phone has not recharged since and I have tried two different chargers and 3 different cords all of which work on my other phones.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very durable",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Ease to use, value for money, works perfectly , charge 100% and phone condition is brand new."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Que funciona muy bien",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Teléfono súper bueno, especial para Cuba, muy buena calidad, anda súper bien"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent refurbished.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Looks good and works bit the usb-c charging port is not working most the time!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Muy bueno",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Excelente 👌 producto"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "This is a replacement for the same phone. I don't have to relearn how to use it since I already had one. Plus I'm not paying over a thousand dollars for a phone, which I think is crazy!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    ya explique el equipo funciona pero no el mandarles el teléfono roto",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "nunca se me remborso por retornar el teléfono roto( la pantalla) y se los mande"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, screen too dim",
      "date": "Reviewed in the United States on February 24, 2024",
      "body": "This is my third Galaxy A10e, the other two were bought new from Tracfone a few years ago and are still working fine. I needed an extra one for a trip, so I could use another SIM card for roaming. All is well with the phone, except that the screen is dimmer than my older original one. The screen on this renewed one looks dimmer and off-white in color, when the brightness it at the same level as my other phone. I normally have my brightness down low around 10% on the scroll bar, but have to turn brightness up to around 50% on the scroll bar in order to get it even close to the brightness on the original, but that will use more battery power to run it with the brightness up so high, and it's still not as bright as the old one. I sent a message to the seller about this issue.When I took the phone out of the box, before turning it on, I noticed that it looks brand new, the screen and the entire phone. Amazing in that respect. It had a 68% charge, so I charged it up to 100%, then set up the phone and it's already down to 68% again.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thanks Amazon",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Great"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Set up process",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "I can't get past this screen during set up,can anyone help???"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy A10e 32GB",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Failed 2 weeks after using !"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Has a few issues but all managable",
      "date": "Reviewed in the United States on January 28, 2024",
      "body": "So the phone isn't too bad, it does have some issues for like new condition. If the screen doesn't light fully up on the lock screen you can't unlock the phone. Usually I have to use the power button a few times to get the screen to light up properly and then it works. Not ideal but manageable. The phone also will randomly disconnect from the service network and I have restart the phone to make a call. Also nothing major it doesn't happen all the time. Overall for what I spent and having the protection on it I can make it work until I can buy a newer phone on my phone plan. It was definitely the cheapest option and I appreciate that even with a few issues. Otherwise the phone was well maintained and in great physical condition. No cracks or dings and it does what I need it to.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Our wireless service couldn't program it to receive phone calls. Had to return it even though it wasn't that old."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easily broken when dropped even with a case",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Bought this for my kid Sept 2024.I put a case on the thing and a screen protector.He dropped the phone on its back, so not on the screen. It's completely broken. It's cheaper to buy a new phone rather than pay for someone to fix it! Avoid this cheap piece of crap."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Galaxy phone",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "This phone was a great deal. It was in very good shape and had many features. It was purchased for a family member."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor \"Renew\" repair",
      "date": "Reviewed in the United States on April 15, 2024",
      "body": "Purchased the phone that had the \"best\" quality and and listed as fully renewed, however the screen is aftermarket and isn't flush with the phone itself so there is a gap and debris all down in it. It concerns me that putting too much pressure on that end with mess up the LCD which then would be a cost to me to repair. There are also scratched and a small crack in the plastic where the screen was replaced. Yes it was a cheaper phone but for $20 more I would have had a brand new phone so if it weren't in good condition it should have listed as such. Will only be using until I find another from another seller.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's all righ",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "It doesn't work very very well doesn't keep you're work and you can't use it in most stores."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I like mortola better",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "Broke after a month if using"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone.",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "Love the Galaxy A10e. This phone was like brand new. Unfortunately I got into a swimming pool with my beloved A10e, and it died. I will be replacing it immediately from the same seller. My experience with this phone has been great, no complaints. If you add a memory card.. this is the best phone: small and practical specially for traveling. Thank you.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "Quality"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "I like it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Llegada en tiempo",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Me llegó a tiempo y el celular útil la verdad"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    had a Galaxy A 10 e GB , nothing like the original one I own.",
      "date": "Reviewed in the United States on November 6, 2023",
      "body": "does not have the options that was on my phone. Can not retrive delete messages, don't need call balances, call reboost, care services, nor do I have QR code option. the phone is slow and it hesitates, whe n I'm in the middle of somthing. So many other options. too many to mention. I sent a messages a few weeks ago,to see if the seller could help with this matter..Would like another phone that would be replace with a another,like a phone similar to one  that I had. Don't know where or how the seller received or got this phone. went to Verizon their is nothing they can do to chance or fix my issues.  Please is there any thing that you can do to help with this matter. Hope that you can help me. Haven't heard the seller on this matter. I would like if the could  responded to this text. Been to Verizon they can not fix the problems that I'm having. is their anyone that can help with this matter.  Sincerely Mary Tsipouras  5-10-2024  How many times must I write you about the phone sold me,It's the worst of the worst. There are so many issue with thist phone,too many to mention. Never received a responds from you. Try dealing with all  the problmes just want to throw the phone again  the wall.  May I ask how are your going to solve this matter. If you can not replace or send me the same or a better phone. I will rate you unfavorably  Again Mary Tsipouras (so so so so disayifity and unhappy.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Good product"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works great",
      "date": "Reviewed in the United States on May 19, 2024",
      "body": "It's cheap and unlocked which is awesomeAnd came earlier than was supposed to so that was awesome"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected.",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I returned it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on June 26, 2024",
      "body": "It’s works really well"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy bien cuidado",
      "date": "Reviewed in the United States on July 2, 2024",
      "body": "Buen producto"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poorly engineered, UN-reliable.",
      "date": "Reviewed in the United States on March 1, 2023",
      "body": "I have owned 3 of these cell phones now.  Bought the first in October 2019.  Lasted about one year, then the screen went black.  It was not dropped or abused.  Most of the time it was tethered  to my computer for internet service, so I could run my Amazon seller business.  When the screen went black it was a disaster.  With Amazon's two-step verification, I could not access my Amazon account to buy a replacement cell phone, confirm my Marketplace sales, or ever turn off my store.  Tried Walmart for a replacement, but they had nothing that would work with my 4G T-Mobile account.  I had no choice but to drive over 100 miles to a uBreakiFix same day repair shop.  The screen was replaced for about $100.  More than a year later, same thing happened again.  Paid another $100.  6 months later, same thing, $100.  Next time the it happened within the 3 month  uBreakiFix warranty (now owned by Asurion), so they fixed it for free.  So I decided it would be cheaper to buy a back-up Samsung Galaxy A10e.  I purchased an unlocked one here and made sure I got the 2 year Asurion warranty.  That phone was DOA.  Returned it and received refunds for both the phone and the warranty.  Bought another.  Less the a month later the screen just went black again, but I was still connected to Amazon, so I quickly purchased a Google Pixel 3 64GB Unlocked GSM & CDMA 4G LTE, with an Asurion warranty.  Then I returned the third phone for both refunds.  I hope the Pixel 3 works better.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Confusing transaction",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "The initial phone would not pair up with the provider I had chosen, Mint Mobile. I returned the phone and I am 99% sure I did not order a replacement. When I received the e-mail that a replacement was on the way I immediately contacted the seller to stop the shipment. The phone arrived anyway which added a little more stress to an already stressful situation. I remain a little confused about the entire process, but all is well in the end. Phone returned; refund given.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The battery is very terrible",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "I brought this to send to a brother and his response after using it for a month is not good the battery basically got big like so big that we had to take it to a repair shop to replace it. Don’t purchase it not good",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SD card tray don't work",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "I bought this product. And the SD card tray does not work. I placed multiple SD card in the phone and it doesn't work. Not a good buy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent service of incompatible with my network.",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "Excellent delivery service of a nice smartphone which, unfortunately, is not compatible with my network.  Will be returning."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good shape refurbished phone - wasnt correct color",
      "date": "Reviewed in the United States on October 21, 2020",
      "body": "My boyfriend goes through phones like they are going oiut of style because he is just so clumsy and such that I wanted to get him something that would work well for his needs but also something that wasn't super expensive so that if it was broken like all the rest it wouldn't break the bank. I love Samsung phones so I was happy to come across this one. It was pre-used but there aren't any scratches or anything major with it. They also included a charging cable because it takes a Type C as well as a USB adapter wall plug. They also put in a paper that tells you about the unlocked phone and how to get it to use other carriers chip (I forget what they are called). The only thing I wasn't really happy was that I am pretty sure that it advertised the phone as black and so I bought a black and clear case to go with it however when I got the phone it was actually blue. My boyfriend doesn't care though so we kept it. Other than that pretty happy with it.",
      "helpfulVotes": 39
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I Hope it last for long",
      "date": "Reviewed in the United States on January 1, 2024",
      "body": "I wanted a cheap phone just to tide me over for a while. I was interested and I ordered it. At first I was wary because of some reviews. finally it arrived with its charger and I put it directly to charge. as I hoped it was at 0% so I waited for 100% before turning it on and it worked normally until then. Im giving 3 stars cause I’m just using it since 2days. hope it lasts long time.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pensé que era nuevo",
      "date": "Reviewed in the United States on June 25, 2024",
      "body": "Llego en una caja marrón no en la original no se si leí mal pero yo pensé q era nuevo"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone ever - one MINOR problem",
      "date": "Reviewed in the United States on November 3, 2023",
      "body": "Great phone and perfect size. Tried to transfer my Straight Talk to it from one just like it - not compatible. Unlocked?? I thought so. But it doesn't work. I wish there was a way to contact the seller. I'll try to unlock it over the internet and see if it works for me. In any event, the A10E is the best IMHO. The more modern phones are like little suitcases and you can hardly take them anywhere. The A10E fits into any pocket and basically disappears there. UPDATE - I'm not paying to unlock the phone. Already bought a SIM card that won't activate.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be prepared to google how to change the language",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Phone showed up in Chinese and had to google how to change the language. A bit frustrating but I guess what can I expect with a used phone that I only need to do some testing for work."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just as described!",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "Just as described!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Newbie Phone",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "Got the phone as gift for Hubby for father's day. He's new to cell phones, and this works great for him. Nice picture quality, expandable space, nice screen. Easy to set up, battery lasts all day. Nice video quality, Supports Android 11. All and all it's a great phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Just a replacement for myself. Phone was not unlocked as addvertised. could not use with my network. Return was simple and easy. 2 stars for that."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of refurb budget phones. Oem parts cost more than than the phone!",
      "date": "Reviewed in the United States on January 8, 2021",
      "body": "The phone is probably a decent budget phone when it's new. I bought this as a replacement for a much better but also much older phone for a teenager.2 stars because, even for a budget phone, it felt super cheap. Now, I suspect this was most likely due to it being a renewed product. Most often I think refurb phones are OK. In this case though I think whoever fixed up this phone used cheap replacements and did a bad job of it because oem parts would cost almost as much as the phone!. From day one  the phone was nearly unusable due to constant phantom touches all over the screen that would hang up calls, switch between or close apps, and cause the screen to get stuck alternating between the two home screens, like someone frantically swiping left and right on the home screen. Anyway, as I mentioned the phone screen also felt super cheap and it even started to separate along the top edge. Within a couple days the screen also started to crack and what little glue was holding on the screen must have given up because the whole screen (glass, digitizer and lcd) just fell right off. I'm sure this was the exception to the rule but just be aware you stand a better chance of getting a lemon on a refurb/renewed phone.  Better to buy refurb flagship phones. You can get a decent new budget phone for slightly more than this renewed budget phone.Moto G anyone?",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Never thought I would,but here i am.",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "My husband had to have a new phone when his went crazy,I bought one of this style and it works great,so when the phone company sent letters to our locals that still land lines that thier was not enough people to justify the need for any phone service.I ordered another one of the same phone and it works great.I am finding that it is not as bad as I thought.Thanks for the great phones.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works",
      "date": "Reviewed in the United States on February 5, 2024",
      "body": "No issues with the item as of now. Seems a little flimsy, however no issues so far.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone saver",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "As much as I drop my phone, this protector is a life saver. Love the color and works perfectly.Love it"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It fits the price",
      "date": "Reviewed in the United States on February 20, 2023",
      "body": "The phone is pretty good. When you buy it, it says it was supposed to be black/gray but it appears to be blue. It's cpu and storage aren't the greatest, but it works. I'd recommend getting this phone if you aren't looking for super high performance. Otherwise, I like it.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything is locked",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "I need access. to Things that this world has to have a phone for. I HATE the damn thing, but I have to live in this world. It locks-I don't want it to lock, HERE!!!! HAVE ALL THESE APPS!!!! Don't want a single one. I have to log onto an e-mail account that locks randomly WITH A \"CELL\" Nope! well get fired. Aaaaaand of course every singe place of business MUST demand a \"cell\" phone??  Ok you got it. Nothing else, at all."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Movil",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "Muy buena calidad"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Questionable Condition",
      "date": "Reviewed in the United States on December 11, 2021",
      "body": "I cant really give a review of the actual phone since i didnt see this purchase in person myself, but I can comment on the condition since it was renewed. The person i bought this for said that the phone was in poor condition and didnt come with the charger as was specified as included at the time of purchase. Trust me, this isnt someone that would expect a new S21 Ultra for $100, they are very reasonable and didnt expect to be blown out of the water, so the depth of their disappointment was very telling. Luckily there was some sort of trade in promo that their local ATT was running and so they ended up trading this in the next day without even wasting time trying to live with it and got a new phone for a couple bucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do NOT buy renewed Excellent it’s a lie",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Died and won’t charge after a week this was a horrible experience and it was described as excellent renewedWell…nope.A major waste of money and time and lost wages since I work off my phone - do NOT trust renewed listings"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pésimo",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Este telf no lo recomiendo lo compre para llevarlo para cuba y el telf no servia la batería no le dura la carga y cuando se le conectaba el cargador decía que estaba mojado por dentro,si viene desbloqueado pero no funciona bien"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    OEM bootloader locked",
      "date": "Reviewed in the United States on June 20, 2024",
      "body": "There is nothing wrong with this phone, but the clowns at Samsung have locked the bootloader and refuse to unlock it. It's a scummy company alongside the trash of crApple.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks and works great",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "Girlfriend needed to update her phone and this was a great price on a refurbished phone that looks good and works great. She is very 😊",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    A tiempo",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "Llegó en buenas condiciones y súper rápido a tiempo"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast delivery",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "Love my phone work great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 14, 2023",
      "body": "Great device and customer service was excellent they were able to revise and come fix my issue 💯"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used phone",
      "date": "Reviewed in the United States on March 27, 2023",
      "body": "It was used, so there were some scratches on the screen when it came in. The charger it came with didn't work. That said, the phone worked as intended. Battery life is solid and I only had to charge it once for a few days' of use. It's slower than a flagship phone, but useable.Just be sure to have an extra charger on hand, just in case.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Excellent\" condition has not been so excellent",
      "date": "Reviewed in the United States on June 24, 2024",
      "body": "While I am aware that I purchased a refurbished phone in what the seller listed as \"Excellent\" condition, I would expect it would charge correctly. We have tried but with no luck to set notifications to let us know when we've received a text. Texting also proves difficult. I feel the money spent is not worth the difficulties we have faced with this phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Garbage",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "This was a terrible choice.  Do not buy a cell phone from Amazon.  Too little information.  In fact, do not buy any electronics from Amazon.  Too little info to make a good choice of what to buy.  Also, I returned this almost two weeks ago on instruction from Amazon.  Have not received a confirmation of the return.  I am probabilly out the money.  I have used Amazon over the years and have been very satisfied.  But this changes my opinion.  I purchased the phone and other electronics, was credited for the return of the other electronics by Amazon, but not on the phone.  I followed Amazon's instructions on the phone return, but still have not heard back from them on the phone.  I do not know if I will ever use Amazon again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will not work with an AT&T SIM card",
      "date": "Reviewed in the United States on January 27, 2022",
      "body": "My son ordered this phone to be used with an AT&T SIM card and was told he needed to have a \"broken\" or unlocked phone.  When he got out to Arizona and was given his SIM card the phone only came up with the Verizon logo and wouldn't accept the ATT SIM Card.  I called the seller who told me ATT changed their policy a few months ago and that is why. They also said they would take the phone back.  I called Amazon and it is easier to pay the $25 restocking fee from them and just stick with Amazon.  Still feel like it was good customer service from both parties.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A fine, very basic phone",
      "date": "Reviewed in the United States on March 12, 2021",
      "body": "This phone is ok...This phone lacks some basic features on most modern phones, no finger print reader, wich I miss more then I expected. The face reader sucks in low light, and is a bummer in the era of masks in public.It has fewer personalization options, and some not so intuitive settings controls.That being said... the battery is good, the smaller size is convenient, the micro USB is great for tons of extra memory, and it is a functional telephone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad charging port straight out of the box.",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I bought this item as a gift for a friend however the phone came with a defective charging port straight out of the box. The device was not tested properly before shipping it serms. When purchasing, make sure to test before giving these items as gifts."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice entry level phone for kids",
      "date": "Reviewed in the United States on July 15, 2021",
      "body": "It is a great device for kids, and as spare. Does everything you expect from an entry level phone, it is not super fast but if you pay so little for a phone, you already know you won't be getting a flagship.Screen is clear, battery last quite a long time, and overall it is responsive. Do one thing at time with it and it will comply with your requests",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Calidad no Muy buena",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "Se daño rápido no me gustó"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone. Bought many",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "Lasts long, charges fast, efficient phone, and a great price",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks fine now",
      "date": "Reviewed in the United States on December 8, 2022",
      "body": "This is a gift for Christmas for my daughter so I haven't tried it thoroughly yet I will update later, but the initial inspection it was better than the note 10 I ordered with it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    POS",
      "date": "Reviewed in the United States on June 28, 2024",
      "body": "Decent camera, connects easily to Wi-Fi and Bluetooth. However. It’s incredibly slow, battery only lasts 25 minutes, can’t unlock without having to try at least three times, screen goes black, lags so badly I can’t answer phone calls, by the time the crappy screen lets me answer the call has gone to voicemail."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on December 22, 2022",
      "body": "This is a very decent phone for the price. It is much slower than what I am used to and the picture isn't as great but it is worth what you are paying for it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does exactly what I need it for!",
      "date": "Reviewed in the United States on August 14, 2022",
      "body": "I have a work phone, so I don't need it to make calls.  I wanted a device to use for personal things, like listening to audiobooks and music, monitoring my heart rate while I jog, recording my food, medicine dosages, private messages to friends and family, photos, etc.  It does all of these things perfectly.  The battery life is excellent and it has not crashed or given me any kind of problems since I received it.  Glad I have it.  It fits the exact hole in my life I bought it to fill.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works reasonably well",
      "date": "Reviewed in the United States on July 7, 2023",
      "body": "The phone was refurbished so I did not expect to get 2 years out of it, but it stil works well. Twice it \"crashed\" and had to berebooted, but I was able to retrieve almost everything so that worked out",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't connect to network.",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Description states phone is unlocked and compatible with AT&T network but isn't.  Been buying phones from Amazon for years and never had these issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scam",
      "date": "Reviewed in the United States on July 3, 2024",
      "body": "This phone is listed  as unlocked but it’s not Scam",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm not recommending",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I'm not recommending because I buying and went I call to activate the company said that cell phone it's locked 🤨"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great for the money",
      "date": "Reviewed in the United States on June 17, 2024",
      "body": "works better than phones that cost  10 times as much",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy bueno",
      "date": "Reviewed in the United States on September 30, 2022",
      "body": "Muy buen teléfono cumple perfectamente con todas sus funciones lo único que puedo decir en que si quieres guardar fotos y videos debes poner una tarjeta de memoria para tener más almacenamiento...pero lo demás perfecto 👌",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is not unlocked!",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "Update: verizon will not unlock it, after spending all morning calling around and going to the store!I looked up the IMEI and it said it had a carrier lock with Verizon, so I called to see if I could have them unlock it and they said it would take 60 days and that I should go into a store to see if they can unlock it early. I am leaving for an overseas trip soon and need to be able to use local sim cards of the places i am traveling."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crap",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "Would not hold a charge"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Samsung A10e",
      "date": "Reviewed in the United States on March 4, 2024",
      "body": "El teléfono llegó en tiempo, buena empaquetadura.Es como comprar un tel nuevo, funciona perfectamente y ya lo uso como respaldo a mi S23, veré  como se comporta fuera del país cuando viaje al exterior, espero que bien.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very slow",
      "date": "Reviewed in the United States on February 29, 2024",
      "body": "Does everything, but very slowly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product Perfect!!!",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "Great product Perfect!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To get my refund for the phone",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "I bought this phone and was charging it and it caught and I requested a refund and still haven't received it. The phone was burnt to dust"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on June 7, 2023",
      "body": "Nice little phone to have as a spare."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery dies very quickly",
      "date": "Reviewed in the United States on May 7, 2023",
      "body": "Phone is good, except for the battery has to be charged constantly. This is my backup phone so it’s not used as often, yet the battery doesn’t hold a charge for long."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn’t last long",
      "date": "Reviewed in the United States on July 8, 2023",
      "body": "Screen cracked after 2 or 3 months of me having it but maybe it was because of the 110 degree weather where I live"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    low battery life",
      "date": "Reviewed in the United States on June 4, 2022",
      "body": "i know this was refurbished, but the battery has a low battery life, can't last 10 hours. And the outer screen has three smudge lines top to bottom that cant clean up, this was way over priced for the model,( i didnt do my research), you can get this from certain companies for less than $40 bucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lovely",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "My daughter love it I would buy again"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El teléfono queda congelado",
      "date": "Reviewed in the United States on September 14, 2023",
      "body": "El teléfono se traba muchoLo táctil.no funciona bien"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy phone to use",
      "date": "Reviewed in the United States on March 4, 2023",
      "body": "I love this phone. Samsung is the only type of phone that i use",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone at  great price.",
      "date": "Reviewed in the United States on June 20, 2020",
      "body": "Item arrived earlier than expected. Others have noted scratches or other damage. This reconditioned phone was impossible to tell from brand new. Activating through MetroPCS took a simple phone call. Porting everything over from my old phone took all of ten minutes. It is a little smaller than my wife's A20 but that doesn't bother me as it fits in my pocket better. The only complaint is that without a case this phone is very slippery. Also, I would like a longer charging cord. I would definitely recommend buying an aftermarket case along with the phone. Nice phone at a reasonable price. Would definitely recommend.",
      "helpfulVotes": 71
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Telephone",
      "date": "Reviewed in the United States on July 12, 2024",
      "body": "Muy buenos"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone failed at 127th day. 90 day warranty",
      "date": "Reviewed in the United States on May 10, 2022",
      "body": "This is a renewed phone  purchased 12/3/22.  I needed it to do one thing..  Run the the cardiac app. It did not have a Sim card until around May. 1.Once it was put into service,. it was slow and had poor tactile response... The phone quality was garbled.I wrote the seller. He stood behind his 90 day warranty and that was that.. I have never purchased a rebuilt product until now.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty phones",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "The media could not be loaded.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works",
      "date": "Reviewed in the United States on August 2, 2023",
      "body": "Yup",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    sufficient",
      "date": "Reviewed in the United States on November 15, 2022",
      "body": "the phone covers my needs however the camera is pretty basic .",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on February 22, 2024",
      "body": "The phone is a great phone works really good but now that I have a new phone I use it as a backup and it still works great"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phones",
      "date": "Reviewed in the United States on January 26, 2023",
      "body": "It will make a good gift, good deal, value for my money.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought 2, both faulty.",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "I've bought two of these phones. The first wouldn't allow apps to be uploaded. The 2nd has terrible scratching during calls. And I cannot figure out how to return the 2nd one!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Genial",
      "date": "Reviewed in the United States on February 13, 2024",
      "body": "Hasta el momento trabaja muy bien , vino sin ningún rasguño . Como nuevo de paquete muy buen producto"
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a bad phone",
      "date": "Reviewed in the United States on November 19, 2023",
      "body": "The Phone was in a factory package but upon opening it would not charge after many attempts it finally began to charge.  So I began setting up the phone . Initially I was on WiFi so setup proceeded as expected,  then I switched off WiFi and discovered that the phone was locked from att Sim use. I noticed that the phone was a tracphone so I contacted tfunlock and after 24 Hrs was able to unlock. But the phone would not work on data plan so I researched how to setup the APN settings to look like my other phone but they were greyed out.  There were four options before a factory reset and on the forth I was able to force APN settings that worked with att but it was still using the VMNO setting that are forced on tracfone which delivers way weaker signal than my other phones about 20 dbm's which is significant signal loss.  So  thought ID contact the manufacturer.  I connected the charger and attempted to continue setting up the next day but the phone has not recharged since and I have tried two different chargers and 3 different cords all of which work on my other phones.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent refurbished.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Looks good and works bit the usb-c charging port is not working most the time!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    ya explique el equipo funciona pero no el mandarles el teléfono roto",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "nunca se me remborso por retornar el teléfono roto( la pantalla) y se los mande"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thanks Amazon",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Great"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Set up process",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "I can't get past this screen during set up,can anyone help???"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Our wireless service couldn't program it to receive phone calls. Had to return it even though it wasn't that old."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easily broken when dropped even with a case",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Bought this for my kid Sept 2024.I put a case on the thing and a screen protector.He dropped the phone on its back, so not on the screen. It's completely broken. It's cheaper to buy a new phone rather than pay for someone to fix it! Avoid this cheap piece of crap."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor \"Renew\" repair",
      "date": "Reviewed in the United States on April 15, 2024",
      "body": "Purchased the phone that had the \"best\" quality and and listed as fully renewed, however the screen is aftermarket and isn't flush with the phone itself so there is a gap and debris all down in it. It concerns me that putting too much pressure on that end with mess up the LCD which then would be a cost to me to repair. There are also scratched and a small crack in the plastic where the screen was replaced. Yes it was a cheaper phone but for $20 more I would have had a brand new phone so if it weren't in good condition it should have listed as such. Will only be using until I find another from another seller.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's all righ",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "It doesn't work very very well doesn't keep you're work and you can't use it in most stores."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I like mortola better",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "Broke after a month if using"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    had a Galaxy A 10 e GB , nothing like the original one I own.",
      "date": "Reviewed in the United States on November 6, 2023",
      "body": "does not have the options that was on my phone. Can not retrive delete messages, don't need call balances, call reboost, care services, nor do I have QR code option. the phone is slow and it hesitates, whe n I'm in the middle of somthing. So many other options. too many to mention. I sent a messages a few weeks ago,to see if the seller could help with this matter..Would like another phone that would be replace with a another,like a phone similar to one  that I had. Don't know where or how the seller received or got this phone. went to Verizon their is nothing they can do to chance or fix my issues.  Please is there any thing that you can do to help with this matter. Hope that you can help me. Haven't heard the seller on this matter. I would like if the could  responded to this text. Been to Verizon they can not fix the problems that I'm having. is their anyone that can help with this matter.  Sincerely Mary Tsipouras  5-10-2024  How many times must I write you about the phone sold me,It's the worst of the worst. There are so many issue with thist phone,too many to mention. Never received a responds from you. Try dealing with all  the problmes just want to throw the phone again  the wall.  May I ask how are your going to solve this matter. If you can not replace or send me the same or a better phone. I will rate you unfavorably  Again Mary Tsipouras (so so so so disayifity and unhappy.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Good product"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected.",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I returned it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poorly engineered, UN-reliable.",
      "date": "Reviewed in the United States on March 1, 2023",
      "body": "I have owned 3 of these cell phones now.  Bought the first in October 2019.  Lasted about one year, then the screen went black.  It was not dropped or abused.  Most of the time it was tethered  to my computer for internet service, so I could run my Amazon seller business.  When the screen went black it was a disaster.  With Amazon's two-step verification, I could not access my Amazon account to buy a replacement cell phone, confirm my Marketplace sales, or ever turn off my store.  Tried Walmart for a replacement, but they had nothing that would work with my 4G T-Mobile account.  I had no choice but to drive over 100 miles to a uBreakiFix same day repair shop.  The screen was replaced for about $100.  More than a year later, same thing happened again.  Paid another $100.  6 months later, same thing, $100.  Next time the it happened within the 3 month  uBreakiFix warranty (now owned by Asurion), so they fixed it for free.  So I decided it would be cheaper to buy a back-up Samsung Galaxy A10e.  I purchased an unlocked one here and made sure I got the 2 year Asurion warranty.  That phone was DOA.  Returned it and received refunds for both the phone and the warranty.  Bought another.  Less the a month later the screen just went black again, but I was still connected to Amazon, so I quickly purchased a Google Pixel 3 64GB Unlocked GSM & CDMA 4G LTE, with an Asurion warranty.  Then I returned the third phone for both refunds.  I hope the Pixel 3 works better.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SD card tray don't work",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "I bought this product. And the SD card tray does not work. I placed multiple SD card in the phone and it doesn't work. Not a good buy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent service of incompatible with my network.",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "Excellent delivery service of a nice smartphone which, unfortunately, is not compatible with my network.  Will be returning."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I Hope it last for long",
      "date": "Reviewed in the United States on January 1, 2024",
      "body": "I wanted a cheap phone just to tide me over for a while. I was interested and I ordered it. At first I was wary because of some reviews. finally it arrived with its charger and I put it directly to charge. as I hoped it was at 0% so I waited for 100% before turning it on and it worked normally until then. Im giving 3 stars cause I’m just using it since 2days. hope it lasts long time.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pensé que era nuevo",
      "date": "Reviewed in the United States on June 25, 2024",
      "body": "Llego en una caja marrón no en la original no se si leí mal pero yo pensé q era nuevo"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be prepared to google how to change the language",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Phone showed up in Chinese and had to google how to change the language. A bit frustrating but I guess what can I expect with a used phone that I only need to do some testing for work."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Just a replacement for myself. Phone was not unlocked as addvertised. could not use with my network. Return was simple and easy. 2 stars for that."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of refurb budget phones. Oem parts cost more than than the phone!",
      "date": "Reviewed in the United States on January 8, 2021",
      "body": "The phone is probably a decent budget phone when it's new. I bought this as a replacement for a much better but also much older phone for a teenager.2 stars because, even for a budget phone, it felt super cheap. Now, I suspect this was most likely due to it being a renewed product. Most often I think refurb phones are OK. In this case though I think whoever fixed up this phone used cheap replacements and did a bad job of it because oem parts would cost almost as much as the phone!. From day one  the phone was nearly unusable due to constant phantom touches all over the screen that would hang up calls, switch between or close apps, and cause the screen to get stuck alternating between the two home screens, like someone frantically swiping left and right on the home screen. Anyway, as I mentioned the phone screen also felt super cheap and it even started to separate along the top edge. Within a couple days the screen also started to crack and what little glue was holding on the screen must have given up because the whole screen (glass, digitizer and lcd) just fell right off. I'm sure this was the exception to the rule but just be aware you stand a better chance of getting a lemon on a refurb/renewed phone.  Better to buy refurb flagship phones. You can get a decent new budget phone for slightly more than this renewed budget phone.Moto G anyone?",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything is locked",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "I need access. to Things that this world has to have a phone for. I HATE the damn thing, but I have to live in this world. It locks-I don't want it to lock, HERE!!!! HAVE ALL THESE APPS!!!! Don't want a single one. I have to log onto an e-mail account that locks randomly WITH A \"CELL\" Nope! well get fired. Aaaaaand of course every singe place of business MUST demand a \"cell\" phone??  Ok you got it. Nothing else, at all."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Questionable Condition",
      "date": "Reviewed in the United States on December 11, 2021",
      "body": "I cant really give a review of the actual phone since i didnt see this purchase in person myself, but I can comment on the condition since it was renewed. The person i bought this for said that the phone was in poor condition and didnt come with the charger as was specified as included at the time of purchase. Trust me, this isnt someone that would expect a new S21 Ultra for $100, they are very reasonable and didnt expect to be blown out of the water, so the depth of their disappointment was very telling. Luckily there was some sort of trade in promo that their local ATT was running and so they ended up trading this in the next day without even wasting time trying to live with it and got a new phone for a couple bucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do NOT buy renewed Excellent it’s a lie",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Died and won’t charge after a week this was a horrible experience and it was described as excellent renewedWell…nope.A major waste of money and time and lost wages since I work off my phone - do NOT trust renewed listings"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pésimo",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Este telf no lo recomiendo lo compre para llevarlo para cuba y el telf no servia la batería no le dura la carga y cuando se le conectaba el cargador decía que estaba mojado por dentro,si viene desbloqueado pero no funciona bien"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used phone",
      "date": "Reviewed in the United States on March 27, 2023",
      "body": "It was used, so there were some scratches on the screen when it came in. The charger it came with didn't work. That said, the phone worked as intended. Battery life is solid and I only had to charge it once for a few days' of use. It's slower than a flagship phone, but useable.Just be sure to have an extra charger on hand, just in case.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Excellent\" condition has not been so excellent",
      "date": "Reviewed in the United States on June 24, 2024",
      "body": "While I am aware that I purchased a refurbished phone in what the seller listed as \"Excellent\" condition, I would expect it would charge correctly. We have tried but with no luck to set notifications to let us know when we've received a text. Texting also proves difficult. I feel the money spent is not worth the difficulties we have faced with this phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Garbage",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "This was a terrible choice.  Do not buy a cell phone from Amazon.  Too little information.  In fact, do not buy any electronics from Amazon.  Too little info to make a good choice of what to buy.  Also, I returned this almost two weeks ago on instruction from Amazon.  Have not received a confirmation of the return.  I am probabilly out the money.  I have used Amazon over the years and have been very satisfied.  But this changes my opinion.  I purchased the phone and other electronics, was credited for the return of the other electronics by Amazon, but not on the phone.  I followed Amazon's instructions on the phone return, but still have not heard back from them on the phone.  I do not know if I will ever use Amazon again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will not work with an AT&T SIM card",
      "date": "Reviewed in the United States on January 27, 2022",
      "body": "My son ordered this phone to be used with an AT&T SIM card and was told he needed to have a \"broken\" or unlocked phone.  When he got out to Arizona and was given his SIM card the phone only came up with the Verizon logo and wouldn't accept the ATT SIM Card.  I called the seller who told me ATT changed their policy a few months ago and that is why. They also said they would take the phone back.  I called Amazon and it is easier to pay the $25 restocking fee from them and just stick with Amazon.  Still feel like it was good customer service from both parties.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad charging port straight out of the box.",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I bought this item as a gift for a friend however the phone came with a defective charging port straight out of the box. The device was not tested properly before shipping it serms. When purchasing, make sure to test before giving these items as gifts."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    POS",
      "date": "Reviewed in the United States on June 28, 2024",
      "body": "Decent camera, connects easily to Wi-Fi and Bluetooth. However. It’s incredibly slow, battery only lasts 25 minutes, can’t unlock without having to try at least three times, screen goes black, lags so badly I can’t answer phone calls, by the time the crappy screen lets me answer the call has gone to voicemail."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works reasonably well",
      "date": "Reviewed in the United States on July 7, 2023",
      "body": "The phone was refurbished so I did not expect to get 2 years out of it, but it stil works well. Twice it \"crashed\" and had to berebooted, but I was able to retrieve almost everything so that worked out",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't connect to network.",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Description states phone is unlocked and compatible with AT&T network but isn't.  Been buying phones from Amazon for years and never had these issues."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm not recommending",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I'm not recommending because I buying and went I call to activate the company said that cell phone it's locked 🤨"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is not unlocked!",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "Update: verizon will not unlock it, after spending all morning calling around and going to the store!I looked up the IMEI and it said it had a carrier lock with Verizon, so I called to see if I could have them unlock it and they said it would take 60 days and that I should go into a store to see if they can unlock it early. I am leaving for an overseas trip soon and need to be able to use local sim cards of the places i am traveling."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crap",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "Would not hold a charge"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very slow",
      "date": "Reviewed in the United States on February 29, 2024",
      "body": "Does everything, but very slowly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To get my refund for the phone",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "I bought this phone and was charging it and it caught and I requested a refund and still haven't received it. The phone was burnt to dust"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery dies very quickly",
      "date": "Reviewed in the United States on May 7, 2023",
      "body": "Phone is good, except for the battery has to be charged constantly. This is my backup phone so it’s not used as often, yet the battery doesn’t hold a charge for long."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn’t last long",
      "date": "Reviewed in the United States on July 8, 2023",
      "body": "Screen cracked after 2 or 3 months of me having it but maybe it was because of the 110 degree weather where I live"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    low battery life",
      "date": "Reviewed in the United States on June 4, 2022",
      "body": "i know this was refurbished, but the battery has a low battery life, can't last 10 hours. And the outer screen has three smudge lines top to bottom that cant clean up, this was way over priced for the model,( i didnt do my research), you can get this from certain companies for less than $40 bucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El teléfono queda congelado",
      "date": "Reviewed in the United States on September 14, 2023",
      "body": "El teléfono se traba muchoLo táctil.no funciona bien"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought 2, both faulty.",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "I've bought two of these phones. The first wouldn't allow apps to be uploaded. The 2nd has terrible scratching during calls. And I cannot figure out how to return the 2nd one!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This product is the worst thing I ever buy",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "I both 2 Samsung galaxy A10e phone and the screen blank out and not coming on i  am so disappointed.  I not recommend this product at all"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy A10e 32GB A102U GSM",
      "date": "Reviewed in the United States on June 24, 2023",
      "body": "Still requires the password of the previous owner. The phone was not restored to its a state before selling it to me",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    😓",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "Me duró una semana y nada más se apagó y no quiso encender nunca más, horrible"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "Waste of time, I ordered 2 phones. One of them didn't turn on, nor did it charge.The other one seems to work BUT is not unlocked for all carriers, only for Verizon, AT&T and T-Mobile, so if you plan to use it with any other company like me it won't work, you will need to get the Network Unlock code and the seller won't even attempt to help, they tell you straight to return it and get a refund."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Need headphones or wireless buds",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "I have to use headphones to have a phone conversation."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wrong description of the item",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Its completely waste of time. The phone is locked by Verizon and not unlocked, as claimed."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No está buena la batería",
      "date": "Reviewed in the United States on May 8, 2024",
      "body": "La batería  del teléfono se descarga muy rápido y no lo pude devolver porque era un regalo a una persona de otro país"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    waste of my money",
      "date": "Reviewed in the United States on March 9, 2024",
      "body": "it’s like i’m holding a play phone for a child that’s torture. i open any app on this phone and after 10 seconds the app crashes and the phone freezes. i’ve tried this with 20+ apps and games and it does the same thing every time. don’t waste your money on this"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, but....",
      "date": "Reviewed in the United States on May 7, 2024",
      "body": "Thus would be a great phone *IF* it was unlocked as advertised.  Unfortunately, it was locked to another carrier and is useless to me.  I am returning it."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unreliable and slow",
      "date": "Reviewed in the United States on December 21, 2023",
      "body": "This phone is awful. It’s slow, it has trouble receiving and sending multimedia text messages, and the sound quality is very poor, especially when connected to Bluetooth devices. The antenna causes service to be spotty, and calls to be dropped often, when other phones on the same network have no trouble. Another case of “you get what you pay for.”"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer beware",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Phone was advertised as unlocked and I received locked phone. Buyer beware! It was a nice phone. Renewed but looked brand new. No scratches or anything.  Just disappointed it was still locked"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No guarantee of compatibility with your carrier",
      "date": "Reviewed in the United States on May 7, 2021",
      "body": "The listing indicated that this was an unlocked phone,  with no other identifying information,  leading me to believe that this phone could be used with any carrier.  I did not do further research,  which I should have done. I would have learned that tracofones phones are notorious for not being compatible with other carriers. Just putting my SIM card into this phone suspended my account with my carrier. For those who don't know,  you need to check a phone's IMEI number with your carrier to confirm compatibility.  This listing did not include that information, which makes the purchase risky.  The only reason I'm doing 2 stars is because I should have done more research before buying and the fact that so far the return process has been easy enough.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too slow",
      "date": "Reviewed in the United States on July 24, 2023",
      "body": "It's very slow. And they don't take some apps."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Needed a case",
      "date": "Reviewed in the United States on December 31, 2022",
      "body": "Got it for a gift and it was dropped two weeks in and broke before I could get any case or insurance. Would love a replacement!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great item to give for a gift if you despise that person...",
      "date": "Reviewed in the United States on February 25, 2023",
      "body": "I purchased this as a beginner phone for my kid as one of his birthday presents. Not expensive by any means, but I thought it would get the job done. The listing was great - good price, new with only missing packaging, and unlocked so it can be used with any carrier! Or so it said...Jump to today at his birthday party. He's super excited as he's opening it and then it all falls apart. He opens it and it's very much not new as advertised. The back is scratched to hell, smudges on the screen. But the winner - the Verizon brand on the back. Most unlocked devices aren't branded, so you can guess where this goes.Three hours later, we're off to purchase a device locally and I'm angrily starting the return process. Glad I can get my money back. Too bad my kid can't get a better birthday back.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    bad quality",
      "date": "Reviewed in the United States on March 26, 2024",
      "body": "not sure why but the screen wasn't even attached to the phone…wasnt a option for me to get a refund it says replacement available option unavailable"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It wasn't unlocked",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "It wasn't unlocked when it came I need password and didn't come with one so I would like a replacement one"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "Scratches on the body of the phone cracked charging port and after market screen, the phone is so slow and not functioning well, I will return it.Save your money and time."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    esta nuy viejo se puede conseguir algo que funcione mejor para esta epoca",
      "date": "Reviewed in the United States on March 5, 2023",
      "body": "se frisa mucho mal redimiento el dispositivo funciona bien si no que el telefono y sus requisito ya pasaron tanto la bateria y el gps funciona muy mal le recomiendo que siempre compre telefono de gama alta como si el nuevo samsung galaxy22 pues puedes conseguir el galaxy 10 y funcionara bien y sin errores,a lo que me refiero compra siempre la gama alta de samsung pero no la actual y todo funcina bien ahora mismo esta el s23 yo tengo el s10 y el rendimiento va bien y lo pueden conseguir a buen precio y funciona con todas las lineas es mejor informase bien antes de gastar algo que no vale la pena en nada y que de hecho hace tu dia mas mal en estos dias es muy necesario tener un telefono que tenga algo de potencia para correr bien al dia dia",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Never received the cel charger.",
      "date": "Reviewed in the United States on May 27, 2022",
      "body": "It was never specified that the cell phone did not come with a charger, so on top of the price, I had to order a charger for an extra $20.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This doesn't work on 4G service",
      "date": "Reviewed in the United States on September 3, 2021",
      "body": "This phone works on a CDC (2G network) it is not compatible with Verizon, Sprint, or any service over 2G. Was a nice phone. However it's not TRULY UNLOCKED TO ANY SERVICE. Retuned the next day."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a great phone",
      "date": "Reviewed in the United States on June 2, 2024",
      "body": "Quit working after a few months."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Piece of junk",
      "date": "Reviewed in the United States on May 14, 2024",
      "body": "Package had a different charger that does not fit in the port. Phone has an opaque screen cover that cannot be removed, so there is no way you can use the phone even if it charges. Tried charging with a compatable samsung charger and it beeped that there is water damage and to remove from charging. Very disappointed. Don't waste your money on this worthless piece of junk."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone was very slow and now is almost impossible to use",
      "date": "Reviewed in the United States on November 6, 2024",
      "body": "I got this phone from this place and was very slow freezing all the time and now 6 months later it’s useless. So don’t waste your money"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awful phone",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "This phone started really overheating, the screen didn't work right and then it shut off and never turned back on within 24 hours of getting it."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Has Android 11, not Android 9. Bought it because it said Android 9. False advertising.",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "I need a replacement phone that has Android 9.  The listing says this has Android 9.  This phone is not even supposed to be able to support Android 11, yet here we are.I have purchased TWO of these, both have Android 11.  I am returning both.Please keep listings honest and up to date."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    REPORTED LOST OR STOLEN!",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "This phone cannot be activated on AT&T netork or any other large network because it has been reported lost or stolen. DO NOT BUY FROM THIS PERSON! I will be reporting this to AMAZON."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn’t work well",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Don’t buy keeps getting worse and worse."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gb too small.",
      "date": "Reviewed in the United States on February 22, 2023",
      "body": "Looks very ordinary memory need  more space.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works for short time",
      "date": "Reviewed in the United States on February 19, 2022",
      "body": "Great product but did not last for more than 1 and 1/2 years, battery issues speaker issues and more. Its like the phone does not last for 1yr.now"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Small phone",
      "date": "Reviewed in the United States on February 7, 2024",
      "body": "Good phone except the one I got renewed the sound quality drops when on a call"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Creepy AF",
      "date": "Reviewed in the United States on May 25, 2024",
      "body": "Hacked ??? Trying to call my kids phone and it rings twice and a recording of a man answers \"hellooo?\" Then nothing and hangs up after 7 minutes . Childs phone does not ring . After reseting the Phone .... starts working again??? So creepy did this for hours with the recording"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not completely unlocked as advertised.",
      "date": "Reviewed in the United States on June 5, 2021",
      "body": "The phone is not completely unlocked it is usable on other carriers so not useless however it still says the former carriers name at startup.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on September 25, 2021",
      "body": "I bought 3 phones as gifts and they all got spoilt within a month I was so embarrassed by this"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ordered for compatability on current carrier stated was but was not.",
      "date": "Reviewed in the United States on November 8, 2022",
      "body": "wasn't compatable with my service",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT METRO Compatible",
      "date": "Reviewed in the United States on May 2, 2021",
      "body": "This is not compatible with metro. They had to call corporate just to hook up texting. I then used it for less than 24hrs only to find out that I am unable to send pictures through text. Metro told me it is a tracfone and because of that it is not compatible and will continue to have issues.on other note I did love the phone and would have kept it if it was fully compatible with metro",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked and a complete waste of time and money",
      "date": "Reviewed in the United States on September 29, 2021",
      "body": "Very deceiving. This is not an unlocked wipes phone. The phone I received was from T-Mobile and shows T-Mobile start up screen and apps. I needed an unlocked phone that I wanted to use with a new AT&T Prepaid SIM card and service. I followed all of the instructions to activate and received error messages stating this phone would not work with AT&T. I had bought this \"unlocked\" phone, screen protectors, a case and an AT&T Prepaid SIM card kit and now I have to return all of it because the phone is locked to T-Mobile. I wasted about a week of time and $150.00 which Amazon will have to refund.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very disappointed",
      "date": "Reviewed in the United States on February 17, 2023",
      "body": "It stays like this charging until it tells you that it no longer charges that there is an error and it does not pick up a signal it does not read the SIMIt was a gift for my mother since it is her favorite phone😡😔"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trash camera/Bown speaker but for $100??",
      "date": "Reviewed in the United States on April 27, 2021",
      "body": "For $100 bucks it works! Only problems are the rear camera.the picture shows the quality...awful. the speaker sounds like it's cracked/blown. Other than that functions ok",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phones not unlocked",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "They promise unlocked phones but that’s no real is a waste of money and time and for returning is too much papers"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would Not Work Effectively",
      "date": "Reviewed in the United States on November 5, 2020",
      "body": "This would be a great phone, except my service provider is ATT and the phone I received was intended for users of a different service.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I know cheap phone",
      "date": "Reviewed in the United States on October 19, 2023",
      "body": "With in 2 months of having this phone it completely broke so I upgraded to the new Samsung"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will never buy refurbished again!  Extremely disappointing!",
      "date": "Reviewed in the United States on June 16, 2021",
      "body": "This is an edit on my original review when I got my phone a few months ago. After five months of this purchase my phone screen was acting up and then all of a sudden stopped responding at all. I had never dropped it or had any damage done to it. I brought it to a repair center and they replaced with a new screen and still there was no response from my phone. They said it was beyond repair due to the inner mechanics of the phone. I can't tell you how frustrated I was to feel like I just wasted my money just a few short months ago.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Verizon phone in retail mode",
      "date": "Reviewed in the United States on July 29, 2022",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    This seller is falsely advertising the products they sell.First, I thought I would get an unlocked phone, and when I turned it on, it showed the Verizon logo.Second, it was in Retail Mode, which means I cannot customize it. It even prevents you from factory-resetting your phone.Third, to get out of Retail Mode, you need a password, which I tried to find on the web, but none of the passwords I found works.Fourth, they only sent me the phone, and it came with no accessories like the charger.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They do not back their products!",
      "date": "Reviewed in the United States on January 21, 2024",
      "body": "I had the phone long enough to go outside of their return window. Just activated the phone a couple days ago and major problems with the microphone and people not being able to understand me or even hear me. I inquired and they were very short with me and only care about the money and not their customers. Not happy whatsoever!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Lo peor que puedan comprar",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "Este teléfono lo compre para enviar de regalo fuera de EEUU y ahora me dicen que se calienta mucho mucho y se apaga no tengo como recuperar mi dinero 💰 el vendedor vende teléfonos usados de muy mala calidad"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work on all networks.",
      "date": "Reviewed in the United States on May 4, 2022",
      "body": "The phone was good but the compatibility was not. I had no problems getting started, the data side with the wifi was ok but the phone app would not work with my network. I had to get a better phone to work with my 4g network phone app. Sim cards didn't work well with it either."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Decepción",
      "date": "Reviewed in the United States on November 22, 2023",
      "body": "Compré este móvil para enviarlo para Cuba y nos encontramos con la sorpresa de que no tiene la bandeja de la línea,ahí se muestra en la foto todo lo que le falta al móvil. Es bastante decepcionante para mi recibir un producto que pagué, en estas condiciones. No lo recomiendo para nada."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen went blank could use it",
      "date": "Reviewed in the United States on January 25, 2021",
      "body": "My phone was glitching I thought maybe it was just temporary so I put my sim card in and the screen went blank it was lit up but was still blank so I couldn't turn it off or restart it I had to basically wait for it to come on for a few minutes so I could switch my sim card back to my old phone then it went blank before I could factory reset it but I'm sending it back anyway I'll stick with the phone I have until I'm sure I found a phone that won't glitch like this one did",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor condition",
      "date": "Reviewed in the United States on January 13, 2024",
      "body": "From the first day of using the phone I got a notification saying that moisture or foreign material was in the port . I checked it and to my surprise it was very dirty. I attempted to clean it but I’m still getting the notification. I will have to take it to a professional.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t match with the descriptions",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "I regret buying it. Had problems connecting to wifi, memory issues etc."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t buy",
      "date": "Reviewed in the United States on September 10, 2024",
      "body": "Just horrible the phone will not charge and when I finally got it open it was in Chinese in making noise. 0 star."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The sound notification for text will not work!",
      "date": "Reviewed in the United States on November 6, 2021",
      "body": "The sound notification for text will not work!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked !!!😠",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "Was not unlocked like advertised !!!! 😠 Had to call boost mobile myself, still not sure if I can use this phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is not unlocked!",
      "date": "Reviewed in the United States on November 23, 2021",
      "body": "It wasn't unlocked had to pay a phone technician good money to unlock it!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy this",
      "date": "Reviewed in the United States on July 13, 2024",
      "body": "Thisvphone is the cheapest POS. The camera is gray, the screen cracked when something touched it, it over heats when used, and the battery dies in about 4 hours"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Decepcion",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "No trabaja Nada bien en la descriccion dice ser desbloquedo para cualquier compania y no esta desbloquedo 🙄no es una buena invercion"
    }
  ],
  "productDetails": {
    "productTitle": "Samsung Galaxy A10e 32GB A102U GSM Unlocked Phone - Black (Renewed)",
    "asin": "B084KS5WYC",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Display: 5.83 inches PLS TFT capacitive touchscreen, Resolution: 720 x 1560 pixels",
      "Memory: 32GB 2GB RAM - microSD, up to 512 GB",
      "Main Camera: 8 MP, f/1.9, AF w/ LED flash, panorama, HDR - Selfie Camera: 5 MP, f/2.0",
      "OS: Android 9.0 (Pie) - Chipset: Exynos 7884 - CPU: Octa-core (2x1.6 GHz Cortex-A73 & 6x1.35 GHz Cortex-A53) - GPU: Mali-G71 MP2",
      "Dimensions: 5.80 x 2.74 x 0.33 in, Weight: 4.97 oz"
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": null,
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$63.35",
    "url": "/gp/offer-listing/B084KS5WYC/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": "Product information",
      "item_details": {
        "section_1_row_1_brand": "Samsung",
        "section_1_row_2_model_number": "A10e 32GB A102U",
        "section_1_row_3_model_name": "Galaxy A10e",
        "section_1_row_4_builtin_media": "USB Cable",
        "section_1_row_5_manufacturer": "Samsung",
        "section_1_row_6_specific_uses_for_product": "Entertainment,Photography,Gaming,Business",
        "section_1_row_7_upc": "887276339887",
        "section_1_row_10_asin": "B084KS5WYC"
      },
      "battery": {
        "section_2_row_1_battery_type": "Lithium-Ion",
        "section_2_row_2_battery_power": "3600"
      },
      "measurements": {
        "section_3_row_1_item_weight": "0.2 Kilograms",
        "section_3_row_2_item_dimensions": "6 x 4 x 8 inches"
      },
      "battery_life": {
        "section_4_row_1_battery_average_life": "15 Hours",
        "section_4_row_2_phone_talk_time": "23 Hours",
        "section_4_row_3_average_battery_life_talk_time": "23 Hours"
      },
      "additional_details": {
        "section_5_row_1_operating_system": "Android 9.0",
        "section_5_row_2_processor_series": "Snapdragon",
        "section_5_row_3_processor_speed": "1.35, 1.6 GHz",
        "section_5_row_4_memory_storage_capacity": "32 GB",
        "section_5_row_5_color": "black",
        "section_5_row_6_sim_card_slot_count": "Single SIM",
        "section_5_row_7_connector_type_used_on_cable": "usb type c",
        "section_5_row_8_form_factor": "bar",
        "section_5_row_9_biometric_security_feature": "Fingerprint Recognition",
        "section_5_row_10_humaninterface_input": "Touchscreen",
        "section_5_row_11_sim_card_size": "Nano",
        "section_5_row_12_water_resistance_level": "Not Water Resistant",
        "section_5_row_13_headphone_jack": "3.5 mm"
      },
      "display": {
        "section_6_row_1_screen_size": "5.83 Inches",
        "section_6_row_2_resolution": "720 x 1560",
        "section_6_row_3_display_type": "LCD",
        "section_6_row_4_display_resolution_maximum": "720x1560 Pixels",
        "section_6_row_5_display_pixel_density": "295 Pixels Per Inch (PPI)"
      },
      "connectivity": {
        "section_7_row_1_wireless_provider": "Unlocked",
        "section_7_row_2_cellular_technology": "2G, 3G, 4G, LTE, GSM, CDMA",
        "section_7_row_3_connectivity_technology": "Wi-Fi",
        "section_7_row_4_wireless_network_technology": "GSM, UMTS, CDMA"
      },
      "camera": {
        "section_8_row_1_front_photo_sensor_resolution": "5 MP",
        "section_8_row_2_rear_facing_camera_photo_sensor_resolution": "8 MP",
        "section_8_row_3_camera_description": "Rear",
        "section_8_row_4_shooting_modes": "Panorama, High Dynamic Range",
        "section_8_row_5_optical_sensor_resolution": "8.0, 5.0 MP",
        "section_8_row_6_number_of_front_cameras": "1"
      },
      "video": {
        "section_9_row_1_video_capture_resolution": "1920 x 1080 pixels"
      },
      "navigation": {
        "section_10_row_1_gps_geotagging_functionality": "True"
      }
    },
    "overviewAsin": "B084KS5WYC",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "USB Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$63.35",
    "listPrice": "$71.99$71.99",
    "savingsPercentage": "-12%",
    "standardDeliveryDate": "Friday, March 21",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}