{
  "asin": "B0C1Q3MVBP",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So Far, Very Good, Looks Like New",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Bought this for my wife, I already have one I bought new couple years ago.  Can't find new ones but found this one on Amazon that is supposed to be like new and renewed, unlocked phone.  It does look like new and took to Amazon store to have data from old phone transferred to this phone.  Only negative I have was that I tried contacting seller about phone with question I had after I received it and didn't get a reply.  Ended up I didn't need to hear from him anyway.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    hardware as well is operating system overdone",
      "date": "Reviewed in the United States on April 9, 2024",
      "body": "The Germans have a wonderful word concoction: \"Verschlimmbessern\"Meaning to improve something continuously and by that making gradually worse and eventually useless.In our \"update mania\" world this here is a classic case.The phone has a way to sensitive touchscreen and no matter what you try from the gazillion settings there is only one to increase the sensitivity but not to decrease it! You can search online that issue.Tests I did show that the touchscreen responds when the finger is actually is not touching the screen but is 0.5- 1mm ( 1/52\" - 2/52\") away from it!This leads of course to an absurd overreaction when you handle the phone, even with the palm protection on, it reacts unintentionally. Often even it responses before you have actually touched anything simply because you moved your finger without touching the screen!Then there is the OS, by now Android 14. Another effort to overload an overdo many functions and poorly organize them. all of course in the eternal other obsession \"security\". The [settings] interface is not intuitive and straightforward anymore like it used to be in older android OSs.Whereas like in earlier versions you could customize and prioritize which icon functions you wanted where, that no longer seems to be possible.And then of course the confirmation pop-up window mania.Say you want to turn something off or delete a message/email. You have to go on a regular basis through three confirmations! DUH? Say you select an email or SMS and click on delete, then it asks you first if you want to delete it, and then and then again were you wanted deleted to and finally you need to confirm that! Really? Seriously?notwithstanding that the new and improved absolutely outlandish privacy terms and all other terms all of them with their 10,000 links to other terms about terms and privacy etc. blah blah... I really feel being raped on a daily basis.Furthermore for some reason despite larger screen all the fonts are smaller but layout spacing is larger with more wasted space. (yes I tried the font sizing). Total useless another feature is, that you can choose from an endless variety of different fonts...Any app you start needs a gazillion confirmations requesting permission to give access to this and that, here and there etc. etc. Overall straightforward sensible layout of the interface and functionality is gone.Here's a personal comparison and experience.Before I upgraded to this phone I had a Samsung S5 with OS Android 6.01. Everything worked fine I never had an issue SMS and MMS sent out instantaneously and everything else worked. Of course with new apps the phone became, aside from artificial incompatibilities, slower and slower. P part of a marketing ploy probably.Now I have a Samsung A14 5G with Android 14. MMS take much longer and needs two or three confirmations...And when executing a functioning in an app, next time I open the app I have to navigate back as it doesn't go back like previously by default.There's more but that would take up too much space to writeup here.Remember the peaceful relaxed time when we had a Bell telephone and a typewriter?We were able to communicate and even managed to fly two men to the moon and bring them safely back...",
      "helpfulVotes": 44
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for my Dad",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "My father is in a nursing home and his phone access was through a nurse's station and was hit and miss. We purchased this phone to allow him to call and text us and we have better continuity. We purchased this refurbished phone and it works perfectly. We utilize the Mint Mobile phone service and spend only $15 a month. It has all of the features and we downloaded enough apps to keep him busy. The phone was not too complicated and we did not pay retail for a brand new phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    the right tool for the job",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Ok, so my mother-in-law (the technophobe) baby sits my 1 year old and has an old half broken prepaid flip phone that won't pick up a signal at our home. Truth be told all cell phone coverage is a blackhole at my house. It is in a rural location surrounded by hills. But I do have fiber internet and cell booster with AT&T that works great but you must have an AT&T phone to use it. So off to the AT&T Store we go. Long story short, I told them I needed a cheap phone for a technophobe and they tried to sell me an $800 phone (locked of course). Not no, but Hell No! So I ordered this, got it the next day. Yeah it's got a couple blemishes but once the protective case arrives tomorrow, they'll never be seen again. Took it to AT&T today and got it a sim card on my existing account for a mere 5 bucks and connected to the cell booster effortlessly, full bars (in blackhole). Even got her a 256 gb sandisk sd card for more storage than she'll probably ever need for $20 here on the 'zon. That math adds up to a mere $125, a damn sight better than $800 any day of the week.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    everything works great and phone was as advertised",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "everything works great and phone was as advertised.note: for those that don't know... if the phone starts up with the ATT screen, it will still work with Tmobile - so long as the phone is \"unlocked\".  I did not initially realize this but the seller provided prompt customer service, literally within minutes of me sending a rather unnecessary and curt email because of the aforementioned. 10/10 would recommend."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new. Great value",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Like new, no scratches, scrapes or wear. Very easy to set up. Great functionality for the price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer Beware",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "The three stars is for the phone condition only!!  It was is in mint condition and operated effectively and efficiently. However, I was not able to use the phone because it was not truly unlocked and in fact had been blacklisted by T-Mobile because it had been reported lost or stolen! Customer service was a little slow in responding back about the issue but is offering a refund or replacement. I chose refund because I need the phone asap for work and did not want to chance getting another blacklisted phone.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fifth phone in my life, first to go defective after 2.5 foot drop",
      "date": "Reviewed in the United States on January 22, 2024",
      "body": "I've previously had an LG and three Motorola phones. I'm not picky, so they've always been on the budget side. Always had to replace because of internal storage limitations and/or battery issues from long-term use. This time around, I decided to plunge for a budget-level Samsung, as I've enjoyed my experience with one of their GalaxyBooks over the last year. Loved the A14 5G at first, it's a major step-up for me in all of the specs. Or so I thought. After having it for six weeks, I just dropped it about 2.5 feet from counter to linoleum floor. Landed face down in a case, but I didn't think much of it as I've dropped old phones from much higher distances onto concrete and simply picked them up and kept going. Not so with this phone, whose screen went black and left me unable to interact with it. Force restart caused it to vibrate, so the internals are still working, but the screen is just dead. Never dropped it before, and never in my life have I had a phone screen quit on me, let alone after such a minor incident. After growing frustrated with lack of response and research that yielded there's probably nothing to do but replace the screen (which would cost more than I paid for this phone), I smacked the screen in frustration and wow - screen cracked. That's never happened to any phones I've owned, either, no matter the abuse I've handed them. Conclusion: back to Motorola I go!",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worse in virtually every way compared to my 2017 Moto x4. Keeping it due to longer software support",
      "date": "Reviewed in the United States on October 15, 2023",
      "body": "I bought a Moto x4 many years ago and have been perfectly content with it. After it updated to Android 9 I didn't like the fact that you could no longer see all open apps in the new window-switching view, and it forced a google search toolbar, and a number of other things I thought were worse, so I used directions on xda to revert back to 8.1.I was perfectly happy with this for many years.Then a security-related app I was using notified me that Android 8.1 was not secure and has not received security updates for years. So I have to get the latest version of Android.Then I find out that Motorola doesn't publish security or Android version updates to the phone past Android 9, so my only option is to buy a new phone or flash a 3rd party ROM. I looked for instructions and ROMs, and LineageOS seemed to be the primary other option, but I ran into many problems.So I looked up what phones were similar to the Moto x4 and provided the longest term of security and software updates. Samsung Galaxy A14 5G seemed to be the winner so I bought it. It's 6 years newer than my Moto x4 so it should be an enjoyable upgrade at least right? Wrong.* It's much thicker and taller. Too tall for my liking; difficult to use with one hand - yes I've tested the \"one-handed features\".* The fingerprint reader is worse. The Moto x4's works 90%+ of the time, the A14's works about 40% of the time.* The battery takes many hours more (can be more than twice as long) to recharge (via USB 3.0 to my PC) and drains as fast or faster.* No call recording.* No view all open apps ability.* Various other annoyances related to how the software functions on this phone/android version.The only noticeable improvements are more customization of notifications & layout.New Android versions & phones are barely different and many of the changes are often downgrades. Hyping them up and making us buy new phones to get security updates is such a scam. My Moto x4 could have lasted me another decade at least.I hate the smartphone industry. Thankfully, California's new Right to Repair law might mostly solve this issue for the future.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A better phone",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Great replacement phone. It's better then my old one that was damaged. It seems to be an upgrade from my old phone. Easy to use. I like it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great cheap phone",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "I'd highly recommend this phone if you're looking for a decent cheap phone however its Works decent though  the chargers and cords that come with it are crap no fast charging capabilities at all the phones are great but the charger and cord that come with them are junk I would suggest if you're buying one of these phones to either use the Chargers you already have or purchased another one from another retailer that you know is going to be a good high quality fast charging and good quality type c chords that are designed for fast charging otherwise I have not had any issues with the phone other than the finger sensor does not work on either phone we have purchased and every time you type something the phone vibrates like the vibration on types is enabled but there's no way to disable it it does work great with apps like tik tok",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    What was expected",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Well I bought for a friend birthday , he love it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked perfectly",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "It came in when it was supposed to was packaged great nothing wrong with the phone at all set it up easy everything worked great my grand daughter loves it thanks",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is it worth it? You decide.",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "I recently bought a phone from a different store from Amazon, and it really truly does look brand new. I decided I wanted to get another one for my fiance's birthday in August (I'm a horrible gifter and normally gift early or at the least plans months in advance). Well I was not so happy when I couldn't order from the original store the exact same device, so since this store did have a few in stock I took a chance and did this store instead. This store sold me the exact phone I wanted and there was only a $2 difference in price comparison to my original purchase, I also got the EXACT same quality I had ordered prior at the other store. I am not happy with the obvious picking marks from where they pride the previous screen off I assume, it is very noticable in a few areas of the phone along with a few indentions and a little bit of separation at the top. The indentions don't matter as much to me, but the obviously worked on glass has me questioning the quality on if it will hold up. Cheap phone? Yes. Doesn't work? Yes. Is it the most cosmetically pretty? No, But hey it's an upgrade that won't break bank. Id recommend they quality check better or decide on a new scale because the previous store with the exact same phone and wear for practically the same price, gave me a great nearly new device along with the original box and it had waaay better packaging and the phone still even had the film to protect the glass instead of a single piece of paper that this company has for \"protection\". We shall see how it does long term however. Luckily I bought a case and am gifting it ready to use so it does somewhat hide those damages, but if love chooses to put a different case on it may not be able to.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked/carrier specific",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "This phone was purchased as a previously used, now renewed, unlocked phone. When I received it I was impressed by the condition it was in but returned it due to the fact I was unable to activate service on it through Visible. I was told it was carrier specific or not unlocked."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Able to upgrade it using another smartphone.",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "I was able to upgrade it using another smartphone Samsung Galaxy A01 using an odin apk tool. I just needed it plugged and with all the files included after accepting ADB permission and booting to the light blue odin mode screen (all buttons held down.) Even this phone A01 seems smooth after upgrading the other! Thanks!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Brand not disclosed.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Specifications did not disclose that it was an AT&T branded phone. AT&T firmware updates do not work on AT&T branded phones unless you have an active AT&T sim chip in the phone, even if the phone is unlocked. If I would have known that it was an AT&T branded phone, I would not have purchased it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would not charge (had to return)",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "I have an existing (purchased new unlocked) A14 and it works great.  I wanted a second one as a safe duplicate that would serve as my phone using a prepaid sims card for some travel.  The \"renewed\" phone looked great and everything worked fine after I copied over my existing phones data.  I could not test the actual calling feature, however, since I was going to buy the travel sims card while on vacation.  However turns out the phone would not charge at all.  (I did try all all the solutions on the internet and various cables and adaptors).  I am guessing they never really tested that in the \"renewal\" process. Ugh!  I am disappointed and just returned it (which is easy with Amazon).  I am going to try buying a used version of this phone again for my backup, and fingers crossed that it will work.  When it does work, the A14 is a nice capable phone.  Update - Amazon did made the return easy and prompt, and the second A14 phone works like brand new.  So one bad and one good phone in this process.  I guess a three star review.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was nice",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Nice product"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    light weight",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Easy to set up and transfer from the old phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    happy",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "so far so good i am grateful problem solved"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fine, not the highest highs or lowest lows",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "The phone has worked great for what it is. I've had no issues with it. 20 years ago it would have been mind blowing. Now it falls behind most any other phone.Sound is fineDisplay is fineBattery life last all dayExpandable storage is great because without it the phone would suckResponsiveness is snappy, but not the fastestI use mine without a screen protector or case so when it goes, it goes, but it can do everything I want it to do until then."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Good"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's really big to put in your pocket",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "So far it works ok. It turned out to be longer than I thought it would be. Doesn't fit in your pocket well. Other than that, time will tell."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Working in the 242",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "Refurbished but look like new. Unlocked and working in the 242 with BTC. Recharge block given was not charging the phone so I had to get a Samsung block hence the 4 rather than 5 stars."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As expected",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Great condition, satisfactory battery life"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "The first one of this one was factory locked it was online as unlocked customer service contacted the vender and amazon shiped a relacement!0",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    you need a physical sim",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "you need a physical sim, it kind of implies esim, not a big deal if you're upgradingjust take out of the old one. Took me a bit to figure out."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wasn't what I expected",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I was expecting a phone that was completely empty. I do not want to use samsung products instead I would just like to use google. phon, messages, phots, gallery, email etc. I was able to download them and use them however I have the Samsung apps and products on the phone that I can not delete. those apps are taking up storage, which is unfortunate. The phone does work fine though."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy A14 5G",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Wasn't scratched received it like it was brand new"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broken at the edge",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "It seems the main issue with the phone is that it arrived a bit battered at the lower left corner, which I somewhat anticipated. If that's the case, I'd prefer the price to be lower to reflect that condition.In terms of performance, the phone feels a bit sluggish compared to my Xiaomi, but given its price point, I suppose that's acceptable.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful",
      "date": "Reviewed in the United States on February 27, 2024",
      "body": "After doing much research and comparing other smartphones, I decided to purchase this based on very high scores, more features than I needed, and an affordable price. Within 2 weeks, I woke up around 1am and noticed the screen on the phone was on and thought it was doing an automatic update. After a good 10 to 20 minutes, the screen was still on and I'm thinking this shouldn't be on this long and when I checked it again is said error and the word SUPER which I had know idea what it meant. To make a long story short, it was frozen and I couldn't cancel or turn the thing off. I then took it to a local ATT&T just to check what was wrong and they referred me to call Samsung. After over an hour with tech support and going no where, I decided to return and get another one hoping I just got a lemon. So far, this new one is working and I changed the auto updates. It still downloaded UI 6 anyway since the first phone would not finish this update so I'm keeping my fingers crossed that any future updates aren't going to get locked again. For a phone that's only a little more than a year old better last for many years ore I'm going to morse code!!! Be aware what you get!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    8/10",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Claro en promedio $145 y nuevo cuesta $175, llegó súper rápido pero como ven en el vídeo está sucio, rayado y un poco lento.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Your standard of",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Excellent is clearly not mine",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As New Condition",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "Very satisfied with this vendor would buy from this vendor again. I was disappointed in setting up the Samsung a14. Samsung has decided that you have to open an account with them before you can access your cell phone. I would look for a phone other than Samsung for that reason in the future.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This does capture in 4k",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Just received this and will be returning it on Monday. I bought this because in the specifications say that it captures in 4kThe 4k option is not availableLooks like a nice phone otherwise"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price, but freezes too much!",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I needed to have a newer Andriod phone to have some apps work. I read the reviews and thought it was a steal at $99 refurbished. The screen freezes up 50% of the time. I have to close the screen and reopen it often.I will have to upgrade again soon."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice budget phone",
      "date": "Reviewed in the United States on November 5, 2023",
      "body": "This is a great budget phone. Sure higher end phones have better cameras, faster charging, and wireless charging. This phone's camera is plenty good for me and plugging in for a 15W charge is good enough for me. This phone has a large screen and large battery (some of Samsung's higher-end phones have smaller batteries). Samsung also promises longer upgrade support for higher end phones, but I didn't figure that spending twice as much for a phone with twice the ssoftware support period made for a better value.I did have trouble getting an actual Factory Unlocked phone (the first seller sent Carrier Unlocked versions of this phone instead of Factory Unlocked which could not be activated on my preferred carrier due to the carrier using a IMEI whitelist to check for compatibility). Factory Unlocked also means that I am not reliant on a carrier's software update channel (the AT&T carrier unlocked model's Android security patch level was still more than 6 months old after checking for updates - perhaps updates are only availably for that phone when on AT&T's network). In the future, I will check the seller's ratings and reviews before purchasing a refurbished Factory Unlocked phone (note that if the item is shipped by Amazon, the unit you get is not guaranteed to be the unit provided by the seller so checking the seller reviews is only useful for sellers who ship directly).",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Second one that's in advertised consideration",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "This is the replacement for a phone that was advertised to be in excellent condition but was missing Sim card tray and was scratched up.  This one had all pieces and loop scratches. However, it takes 10 hours to charge from 15% to 60% and doesn't hold the charge well. Not what I call excellent condition."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost too good to be true!  Believe!!!",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "This company did an outstanding job of refurbishing the phone I received (Stalion ReQuip).  The phone itself was excellent.  It functions perfectly.  It has all the features a \"normal\" user could ask for and MORE!  It had no issues connecting to various carriers, was totally unlocked.  Transferring my data from my previous phone was extremely simple.  No kidding, I am not technically gifted and transferred everything with a few simple keyboard strokes!  Even WiFi calling is easy to set up so you can use the phone to make calls from a cruise ship's WiFi!BTW, Stay away from the Chinese knock offs.  They sound good but you are asking for problems.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "I did extensive research on the best phone to fit my needs and this was it. (Disclosure: this phone is for an almost two year old.) I was extremely skeptical about the unlocked reviews, more than too many said the phone wasn’t truly unlocked. Luckily for me, it absolutely was. I put the SIM card in and it worked immediately. I didn’t need to configure APN’s or anything. It did warm up during info transfer from an older galaxy but it didn’t overheat. So far during charging and usage I don’t have that issue either. As stated, the phone is a backup for me but I let me son have full autonomy over it. So far his apps work with no issue. It does lag a bit for higher storage games but overall I can’t complain. The phone came basically brand new. If it had a Samsung box I’d believe it was. I think the experience varies and won’t negate anyone else’s, but mine has been so far so good. I would take the chance and worst case scenario just send it back.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "Ok"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okish. The GPS is terrible.",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "The GPS takes 10 minutes to figure out where you are. Super fun when you're in a new city and trying to figure out where you are.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    it is exactly what I was expecting",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "So far I am very pleased with it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Desanimada",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "E tenido muy buenas compra aquí y es la primera vez k tengo este problema. Esta mañana me di cuenta k ordene 2 veces este dispositivo por error.pero estoy contenta por k al parecer el otro si funciona.espero no tener problemas despues"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "Its fine"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for the price",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "My old phone was so slow that I was ready to throw it against the wall. This phone is much better. I did have to spend $20 to get a new charger block because my cords were causing it to take 10 hours to charge, but it was worth it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasantly Surprised",
      "date": "Reviewed in the United States on January 28, 2024",
      "body": "This renewed Galaxy A14 G5 arrived unlocked as described.  It's renewed by Amazon and to be honest, I think it could possibly be brand new or as close as you can get.  There is literally not a mark or scuff on this phone.  It replaces an A02S Galaxy that I've had for a couple of years.  I'm a Tech guy so, it was pretty easy to set up.  I was able to install my Verizon SIM card and an additional 128Gb SDHC  memory card in about three minutes.  Downloaded the Samsung Smart Switch app from the Google Play store to both phones and within a few minutes, it transferred all my data and setup all the apps.  This was probably the longest part of the process consuming no more than 30 minutes.  Pretty much just had to set a few permissions and it was done.  It's fingerprint and facial recognition equipped. and the cameras seem pretty good.  As mentioned earlier, it IS Verizon compatible.  All in all, a pretty good phone at, what I think, is a fantastic price. UPDATE.....I moved this phone from Verizon to T-mobile without a single problem. Runs great using T-mobile's 5g. 👌",
      "helpfulVotes": 33
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No mobile data with T-Mobile mvno",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "Wouldn't connect using a simm from a T-Mobile mvno. Got great support from a competing seller who explained the subtleties. I needed an unlocked phone built for T-Mobile mvnos. $50 more but it worked instantly and was in mint condition. Hopefully FCC settles this locking crap.🫤"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in excellent condition",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "2 stars because the phone works. It was supposed to be in excellent condition but was the complete opposite. The screen is completely covered in micro scratches (thankfully they can't be seen when the screen is on) and the mic and speakers were clogged with dust. Luckily I was able to clean it out myself."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "The phone is amazing for my grandmother"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone in good condition very pleased. Great job Amazon!",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "I like this phone and it was just as described. everything was in package it all worked and was like new.Very pleased with this order! Thank you Amazon PS: will buy more of this type of product.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Good👍💯"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like new",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "The phone is quite a bit more advanced than my old Galaxy J7.  I wish it had come with an owners manual so that all of the features would be easier to learn how to use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "The phone was in great condition. It works well. As long as you have the appropriate expectations of the kind of phone you will be getting for the price, you will be happy. This phone is several years old based on the model, so it won't perform like the newest models. I am happy with the purchase and it was a good value for the money.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone itself was in great condition, but...",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "...it was not a factory unlocked phone. It was a T-Mobile phone, that had been unlocked later. So, I could not use it on the Verizon network. Only the T-Mobile network. If it was an actual factory unlocked phone, this would not have been an issue. So for that reason I dropped it to three stars. (I tried the IMEI at Visible and Verizon too. It showed that I could not use it there either, since they are both the Verizon network too)I had planned on using it on the Verizon network, with US Mobile(they call it Warp 5G). Like my Galaxy S24 Ultra is. But I had to use it on the T-Mobile GSM/5G network, with USMobile, instead. I am using it as a home phone replacement. And it is working very well for that use.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cust service?",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "Good phone for the price. No cust service number..."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked !!!",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "The phone is in great shape, but when i tried to swap amount to this phone i got an error in metrcPcs app. I checked imei sites and it shows as clean, but tmobile shows it locked. I even went to the store and they tried, but it's lockedUseless brick is getting sent back."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exelente",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Exelente"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera quality",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "Like the model"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    At first phone wouldn't charge.",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Then replaced C cable & it works now.Looking at wireless chargers. Works like an A14 is supposed to."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They are dented, scratched, and won't power on",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "We received these and the phones were scratched and beat up. They aren't turning on, even after charging.Shipping was fast which was nice since we needed these ASAP. That's why I gave 2 stars."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "Arrived quickly, nicely packed and works just fine. This is a refurbished phone, and does have some very minor screen scratches, but with a protector and turned on I never notice them. Everything functions great, as if new.I've always had some version of these Samsung android phones, and I'm just as pleased with this one. After installing a transfer app, I was able to migrate my old phone's content easily with no issues. I'd recommend this phone and seller for sure!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As good as the brand new thing for just half the price",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Did it came in the original packaging? No. Did it include the manuals? No. Did it arrive in immaculate conditions? Also no, but do I care? Abso-freakin-lutely no, this is basically a brand-new phone for only half the price, if you have complaints you might as well bite the bullet and get a brand-new phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Deal",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "This is a good phone, the price is great. It does everything a more expensive phone does. I am very satisfied with my purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good  phone",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "Best phone I have and works well with my service. All applications  and functions  work good  as well."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bit of a brick",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "I bought this cell phone as a replacement to my Iphone as I didn't feel like paying hundreds of dollars for a new model and it was breaking down. The fact that it had a phone jack in there was a big plus as I dislike air pods and how disconnected they are. The phone is serviceable, not a fan of the UI or the placement of the side buttons. I really can't stand how enormous this thing is. You really can't tell from the image here. Add in a phone case and this thing becomes a veritable brick. It feels like I'm lugging around a terminal instead of a smart cell phone. It works, but it's just too big, very conspicuous."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Recieved on time. Product looked great, no obvious damage. Phone would no charge or turn on."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone, camera isn't great",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "The phone is good for the price but the camera doesn't work very well, QR code scanning is pretty difficult. I also had an issue where it kept switching time zones on me."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked how its suppose to be.",
      "date": "Reviewed in the United States on August 6, 2023",
      "body": "I bought this phone after my previous provider has a sim lock on my phone and wanted $150 to unlock it. I said ill buy a new phone. My previous phone was an A10e which held up well. I bought this phone as I saw it was refurbished but in excellent condition. When I received it the packing was looking good on it. Upon opening it I saw this brand new phone in the box. I mean there wasn't a scratch or anything wrong with it. There was no manuals/information pamphlet however I didn't expect it to have one. I also usually throw them out anyway. It included the sim card tool as well as charging cable which is always a plus. Honestly if you are looking for a phone that can run games decently as long as they aren't heavy games (cod) as well as work good and stays fast. I would recommend this one! Phone was fully unlocked. It accepted my Mint mobile sim card right away only thing it needed was to do a restart.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great backup phone",
      "date": "Reviewed in the United States on March 24, 2024",
      "body": "I purchased this phone to keep as an alternate network and OS.  This is perfect for the pay as you go network we chose.  Can never be to careful or prepared.  Make sure to buy a protective case, as the phone has a plastic case.  We chose bright blue to enable us to easily find it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung cell phone",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "New condition, everything works as it should. Was bought as a gift, they are pleased with the phone. Came with charging cord and block."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stolen reused phone",
      "date": "Reviewed in the United States on July 16, 2024",
      "body": "This phone was tured in and redone and now im stuck with a stolen phone i cant usr",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Mejorar o revisar bien los artículos",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "La bocina de re ir estaba defectuosa"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the newest phone out there...",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "but perfect for me! So much faster than my old phone and it supports the only app that I care to use. Light and not a big ol' brick in my pocket! The price is right, too and it was fully unlocked as advertised.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "This phone takes a beating I probably drop mine a hundred times on gravel on concrete on asphalt course in the grass I have cracked to protective glass coverings that I put on it but with the case and the coverings I've had no problems with any kind of shock to the phone or malfunctioning",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Little slower than phone of same make",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "But fair deal for 80 bucks. It's worth paying 10 more for the one in better condition."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No lee mi Sim card",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "No funciona con mi linea de Metro, creo que tendre que devolverlo"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad",
      "date": "Reviewed in the United States on June 14, 2024",
      "body": "For what the phone is worth it gets the job done, good speed, ram, not laggy unless over loaded but decent phone over all."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Celular bloqueado.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "He comprado dos teléfonos en Amazon reparación en estados excelente A14 Samsung, sus condiciones físicas son excelentes, pero uno de los dos está totalmente bloqueado, me pide una contraseña, se supone que deben de venderlos totalmente libres."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "I bought this is for my pre teen and it works great! thanks for a cost effective phone that you can put a SIM card in it and it is clear and not so slow. thanks",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "Probably would have been a good phone, however, the low review is because it was not as described.  It should have been an unlocked phone, but it was not.  Could have been an error in the listing, so double check with the seller before buying if you need an unlocked unit.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Despite being unlocked, it did not work with my SIM, plus durability issue",
      "date": "Reviewed in the United States on May 5, 2024",
      "body": "This all applies to the REFURBISHED A14, a new one from the factory probably won't have these issues.I won't fault the Amazon employee(s) who probably had to refurbish this, they actually seem to have done a really good job of doing that. The phone had little to no visible damage, the only exception being some slight scratches on the power switch.And the carrier settings *did* say the phone was unlocked to be used with any carrier.The catch is that when I put my SIM in (T-mobile), it only seemed to work with data transfer for web surfing - calling and SMS were non-functional.What really ended up being a disappointment is that the power switch eventually fell out of place after a couple weeks of barely using it. I think that might just be bad luck with the very specific phone I received, but after this experience I think I'll just get a new phone entirely.Yes that will cost hundreds more, but hopefully I'll get piece of mind that the thing actually works."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Para Regular uso",
      "date": "Reviewed in the United States on June 26, 2024",
      "body": "No tan bueno pero trabaja a lo basico. Cuando no ocupas usarlo para juegos esta bien."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works better than I thought",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "I ordered this as a back up phone and I really like it. It works great and it runs better than I thought because reviews that I read said it was slow, but I have not experience that at all."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lasted less than 6.months",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Worked good till it didn't.  Black screen .. had less than 6mths .. business would not do anything to replace bc past 90day guarantee."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "Received and accepted as advertised! Absolutely love it !"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not charging",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "I bought 3 phone and one not working cause it isn't charging."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Phone Deal—Galaxy A14 5G is a Game Changer",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "Let me tell you, folks, the Samsung Galaxy A14 5G—factory unlocked, 64GB, black, renewed—is an absolute steal. This phone is fantastic. Super fast with 5G, tons of storage, and factory unlocked? You can’t go wrong. It’s like getting a brand-new phone at a fraction of the price. Works perfectly, and the quality? Top-notch. Why pay more? This is the phone deal of the year. Believe me",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "My husband needed a new phone and this was perfect. Came the same day it was supposed to be here."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's faster than my old phone",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "I like some of the features but it adds messages or text to different people. It adds words or does not complete texts or finish the message or text."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Pleased & Excited",
      "date": "Reviewed in the United States on June 3, 2024",
      "body": "I am very pleased & excited, its a fresh site to see someone to sell an item/device that is locked to a network & it was a very reasonable & affordable price, I see sellers sell items that is unlocked & charge a arm & leg.. I am pleased that the seller made a very gr8 price & not charge 2 much, I appreciate it so much & if I could, I would give it a higher star rating. I hope this seller offers more like that in the future ! A++++",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is OK",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "For a kid or maybe for someone that just need a new cheap phone. Screen is nice tough.Struggle to work with 2 or 3 apps in same time ,like maps Bluetooth connection and a delivery app.For me was not good enough.For the part of the seller : was quick,like new,looked like never was used ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mediocre phone - only buy if you need a back-up phone",
      "date": "Reviewed in the United States on May 28, 2024",
      "body": "I bought this phone as a back-up phone for some of the apps I am using. It is not quick to respond. The touch screen has a slight delay in response and the battery dies faster than with other phones."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great and easy to set up",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "The phone was perfect for what I needed and a great price!  I didn't have any issues connecting or setting it up."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Power No Charge",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "I bought 5 of these and two have died. They will no longer take a charge or power on. I have initiated returns for replacement. Hopefully the replacements will not have the same problem."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Tried 4 different mobile carriers and none worked. Definitely not unlocked."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for the Money",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "This has been a great starter phone for my son and would work perfectly for most adults that don't want to break off the money for an S series."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Found out I did not need it",
      "date": "Reviewed in the United States on March 31, 2024",
      "body": "I could not transfer the info to the new phone without a new screen,with a new screen I don't  need a new phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review says excellent condition but in real that’s full of scratches all over the phone",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    In first view is like disheartening to me coz the body is like badly scratched all over including the corners of camera and side lines."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    hardware as well is operating system overdone",
      "date": "Reviewed in the United States on April 9, 2024",
      "body": "The Germans have a wonderful word concoction: \"Verschlimmbessern\"Meaning to improve something continuously and by that making gradually worse and eventually useless.In our \"update mania\" world this here is a classic case.The phone has a way to sensitive touchscreen and no matter what you try from the gazillion settings there is only one to increase the sensitivity but not to decrease it! You can search online that issue.Tests I did show that the touchscreen responds when the finger is actually is not touching the screen but is 0.5- 1mm ( 1/52\" - 2/52\") away from it!This leads of course to an absurd overreaction when you handle the phone, even with the palm protection on, it reacts unintentionally. Often even it responses before you have actually touched anything simply because you moved your finger without touching the screen!Then there is the OS, by now Android 14. Another effort to overload an overdo many functions and poorly organize them. all of course in the eternal other obsession \"security\". The [settings] interface is not intuitive and straightforward anymore like it used to be in older android OSs.Whereas like in earlier versions you could customize and prioritize which icon functions you wanted where, that no longer seems to be possible.And then of course the confirmation pop-up window mania.Say you want to turn something off or delete a message/email. You have to go on a regular basis through three confirmations! DUH? Say you select an email or SMS and click on delete, then it asks you first if you want to delete it, and then and then again were you wanted deleted to and finally you need to confirm that! Really? Seriously?notwithstanding that the new and improved absolutely outlandish privacy terms and all other terms all of them with their 10,000 links to other terms about terms and privacy etc. blah blah... I really feel being raped on a daily basis.Furthermore for some reason despite larger screen all the fonts are smaller but layout spacing is larger with more wasted space. (yes I tried the font sizing). Total useless another feature is, that you can choose from an endless variety of different fonts...Any app you start needs a gazillion confirmations requesting permission to give access to this and that, here and there etc. etc. Overall straightforward sensible layout of the interface and functionality is gone.Here's a personal comparison and experience.Before I upgraded to this phone I had a Samsung S5 with OS Android 6.01. Everything worked fine I never had an issue SMS and MMS sent out instantaneously and everything else worked. Of course with new apps the phone became, aside from artificial incompatibilities, slower and slower. P part of a marketing ploy probably.Now I have a Samsung A14 5G with Android 14. MMS take much longer and needs two or three confirmations...And when executing a functioning in an app, next time I open the app I have to navigate back as it doesn't go back like previously by default.There's more but that would take up too much space to writeup here.Remember the peaceful relaxed time when we had a Bell telephone and a typewriter?We were able to communicate and even managed to fly two men to the moon and bring them safely back...",
      "helpfulVotes": 44
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer Beware",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "The three stars is for the phone condition only!!  It was is in mint condition and operated effectively and efficiently. However, I was not able to use the phone because it was not truly unlocked and in fact had been blacklisted by T-Mobile because it had been reported lost or stolen! Customer service was a little slow in responding back about the issue but is offering a refund or replacement. I chose refund because I need the phone asap for work and did not want to chance getting another blacklisted phone.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fifth phone in my life, first to go defective after 2.5 foot drop",
      "date": "Reviewed in the United States on January 22, 2024",
      "body": "I've previously had an LG and three Motorola phones. I'm not picky, so they've always been on the budget side. Always had to replace because of internal storage limitations and/or battery issues from long-term use. This time around, I decided to plunge for a budget-level Samsung, as I've enjoyed my experience with one of their GalaxyBooks over the last year. Loved the A14 5G at first, it's a major step-up for me in all of the specs. Or so I thought. After having it for six weeks, I just dropped it about 2.5 feet from counter to linoleum floor. Landed face down in a case, but I didn't think much of it as I've dropped old phones from much higher distances onto concrete and simply picked them up and kept going. Not so with this phone, whose screen went black and left me unable to interact with it. Force restart caused it to vibrate, so the internals are still working, but the screen is just dead. Never dropped it before, and never in my life have I had a phone screen quit on me, let alone after such a minor incident. After growing frustrated with lack of response and research that yielded there's probably nothing to do but replace the screen (which would cost more than I paid for this phone), I smacked the screen in frustration and wow - screen cracked. That's never happened to any phones I've owned, either, no matter the abuse I've handed them. Conclusion: back to Motorola I go!",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is it worth it? You decide.",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "I recently bought a phone from a different store from Amazon, and it really truly does look brand new. I decided I wanted to get another one for my fiance's birthday in August (I'm a horrible gifter and normally gift early or at the least plans months in advance). Well I was not so happy when I couldn't order from the original store the exact same device, so since this store did have a few in stock I took a chance and did this store instead. This store sold me the exact phone I wanted and there was only a $2 difference in price comparison to my original purchase, I also got the EXACT same quality I had ordered prior at the other store. I am not happy with the obvious picking marks from where they pride the previous screen off I assume, it is very noticable in a few areas of the phone along with a few indentions and a little bit of separation at the top. The indentions don't matter as much to me, but the obviously worked on glass has me questioning the quality on if it will hold up. Cheap phone? Yes. Doesn't work? Yes. Is it the most cosmetically pretty? No, But hey it's an upgrade that won't break bank. Id recommend they quality check better or decide on a new scale because the previous store with the exact same phone and wear for practically the same price, gave me a great nearly new device along with the original box and it had waaay better packaging and the phone still even had the film to protect the glass instead of a single piece of paper that this company has for \"protection\". We shall see how it does long term however. Luckily I bought a case and am gifting it ready to use so it does somewhat hide those damages, but if love chooses to put a different case on it may not be able to.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked/carrier specific",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "This phone was purchased as a previously used, now renewed, unlocked phone. When I received it I was impressed by the condition it was in but returned it due to the fact I was unable to activate service on it through Visible. I was told it was carrier specific or not unlocked."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Brand not disclosed.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Specifications did not disclose that it was an AT&T branded phone. AT&T firmware updates do not work on AT&T branded phones unless you have an active AT&T sim chip in the phone, even if the phone is unlocked. If I would have known that it was an AT&T branded phone, I would not have purchased it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would not charge (had to return)",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "I have an existing (purchased new unlocked) A14 and it works great.  I wanted a second one as a safe duplicate that would serve as my phone using a prepaid sims card for some travel.  The \"renewed\" phone looked great and everything worked fine after I copied over my existing phones data.  I could not test the actual calling feature, however, since I was going to buy the travel sims card while on vacation.  However turns out the phone would not charge at all.  (I did try all all the solutions on the internet and various cables and adaptors).  I am guessing they never really tested that in the \"renewal\" process. Ugh!  I am disappointed and just returned it (which is easy with Amazon).  I am going to try buying a used version of this phone again for my backup, and fingers crossed that it will work.  When it does work, the A14 is a nice capable phone.  Update - Amazon did made the return easy and prompt, and the second A14 phone works like brand new.  So one bad and one good phone in this process.  I guess a three star review.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fine, not the highest highs or lowest lows",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "The phone has worked great for what it is. I've had no issues with it. 20 years ago it would have been mind blowing. Now it falls behind most any other phone.Sound is fineDisplay is fineBattery life last all dayExpandable storage is great because without it the phone would suckResponsiveness is snappy, but not the fastestI use mine without a screen protector or case so when it goes, it goes, but it can do everything I want it to do until then."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's really big to put in your pocket",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "So far it works ok. It turned out to be longer than I thought it would be. Doesn't fit in your pocket well. Other than that, time will tell."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wasn't what I expected",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I was expecting a phone that was completely empty. I do not want to use samsung products instead I would just like to use google. phon, messages, phots, gallery, email etc. I was able to download them and use them however I have the Samsung apps and products on the phone that I can not delete. those apps are taking up storage, which is unfortunate. The phone does work fine though."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful",
      "date": "Reviewed in the United States on February 27, 2024",
      "body": "After doing much research and comparing other smartphones, I decided to purchase this based on very high scores, more features than I needed, and an affordable price. Within 2 weeks, I woke up around 1am and noticed the screen on the phone was on and thought it was doing an automatic update. After a good 10 to 20 minutes, the screen was still on and I'm thinking this shouldn't be on this long and when I checked it again is said error and the word SUPER which I had know idea what it meant. To make a long story short, it was frozen and I couldn't cancel or turn the thing off. I then took it to a local ATT&T just to check what was wrong and they referred me to call Samsung. After over an hour with tech support and going no where, I decided to return and get another one hoping I just got a lemon. So far, this new one is working and I changed the auto updates. It still downloaded UI 6 anyway since the first phone would not finish this update so I'm keeping my fingers crossed that any future updates aren't going to get locked again. For a phone that's only a little more than a year old better last for many years ore I'm going to morse code!!! Be aware what you get!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    8/10",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Claro en promedio $145 y nuevo cuesta $175, llegó súper rápido pero como ven en el vídeo está sucio, rayado y un poco lento.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Your standard of",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Excellent is clearly not mine",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This does capture in 4k",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Just received this and will be returning it on Monday. I bought this because in the specifications say that it captures in 4kThe 4k option is not availableLooks like a nice phone otherwise"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price, but freezes too much!",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I needed to have a newer Andriod phone to have some apps work. I read the reviews and thought it was a steal at $99 refurbished. The screen freezes up 50% of the time. I have to close the screen and reopen it often.I will have to upgrade again soon."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Second one that's in advertised consideration",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "This is the replacement for a phone that was advertised to be in excellent condition but was missing Sim card tray and was scratched up.  This one had all pieces and loop scratches. However, it takes 10 hours to charge from 15% to 60% and doesn't hold the charge well. Not what I call excellent condition."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okish. The GPS is terrible.",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "The GPS takes 10 minutes to figure out where you are. Super fun when you're in a new city and trying to figure out where you are.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Desanimada",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "E tenido muy buenas compra aquí y es la primera vez k tengo este problema. Esta mañana me di cuenta k ordene 2 veces este dispositivo por error.pero estoy contenta por k al parecer el otro si funciona.espero no tener problemas despues"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No mobile data with T-Mobile mvno",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "Wouldn't connect using a simm from a T-Mobile mvno. Got great support from a competing seller who explained the subtleties. I needed an unlocked phone built for T-Mobile mvnos. $50 more but it worked instantly and was in mint condition. Hopefully FCC settles this locking crap.🫤"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in excellent condition",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "2 stars because the phone works. It was supposed to be in excellent condition but was the complete opposite. The screen is completely covered in micro scratches (thankfully they can't be seen when the screen is on) and the mic and speakers were clogged with dust. Luckily I was able to clean it out myself."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone itself was in great condition, but...",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "...it was not a factory unlocked phone. It was a T-Mobile phone, that had been unlocked later. So, I could not use it on the Verizon network. Only the T-Mobile network. If it was an actual factory unlocked phone, this would not have been an issue. So for that reason I dropped it to three stars. (I tried the IMEI at Visible and Verizon too. It showed that I could not use it there either, since they are both the Verizon network too)I had planned on using it on the Verizon network, with US Mobile(they call it Warp 5G). Like my Galaxy S24 Ultra is. But I had to use it on the T-Mobile GSM/5G network, with USMobile, instead. I am using it as a home phone replacement. And it is working very well for that use.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked !!!",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "The phone is in great shape, but when i tried to swap amount to this phone i got an error in metrcPcs app. I checked imei sites and it shows as clean, but tmobile shows it locked. I even went to the store and they tried, but it's lockedUseless brick is getting sent back."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera quality",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "Like the model"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They are dented, scratched, and won't power on",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "We received these and the phones were scratched and beat up. They aren't turning on, even after charging.Shipping was fast which was nice since we needed these ASAP. That's why I gave 2 stars."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bit of a brick",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "I bought this cell phone as a replacement to my Iphone as I didn't feel like paying hundreds of dollars for a new model and it was breaking down. The fact that it had a phone jack in there was a big plus as I dislike air pods and how disconnected they are. The phone is serviceable, not a fan of the UI or the placement of the side buttons. I really can't stand how enormous this thing is. You really can't tell from the image here. Add in a phone case and this thing becomes a veritable brick. It feels like I'm lugging around a terminal instead of a smart cell phone. It works, but it's just too big, very conspicuous."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Recieved on time. Product looked great, no obvious damage. Phone would no charge or turn on."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone, camera isn't great",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "The phone is good for the price but the camera doesn't work very well, QR code scanning is pretty difficult. I also had an issue where it kept switching time zones on me."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Mejorar o revisar bien los artículos",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "La bocina de re ir estaba defectuosa"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Little slower than phone of same make",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "But fair deal for 80 bucks. It's worth paying 10 more for the one in better condition."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No lee mi Sim card",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "No funciona con mi linea de Metro, creo que tendre que devolverlo"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Celular bloqueado.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "He comprado dos teléfonos en Amazon reparación en estados excelente A14 Samsung, sus condiciones físicas son excelentes, pero uno de los dos está totalmente bloqueado, me pide una contraseña, se supone que deben de venderlos totalmente libres."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "Probably would have been a good phone, however, the low review is because it was not as described.  It should have been an unlocked phone, but it was not.  Could have been an error in the listing, so double check with the seller before buying if you need an unlocked unit.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Despite being unlocked, it did not work with my SIM, plus durability issue",
      "date": "Reviewed in the United States on May 5, 2024",
      "body": "This all applies to the REFURBISHED A14, a new one from the factory probably won't have these issues.I won't fault the Amazon employee(s) who probably had to refurbish this, they actually seem to have done a really good job of doing that. The phone had little to no visible damage, the only exception being some slight scratches on the power switch.And the carrier settings *did* say the phone was unlocked to be used with any carrier.The catch is that when I put my SIM in (T-mobile), it only seemed to work with data transfer for web surfing - calling and SMS were non-functional.What really ended up being a disappointment is that the power switch eventually fell out of place after a couple weeks of barely using it. I think that might just be bad luck with the very specific phone I received, but after this experience I think I'll just get a new phone entirely.Yes that will cost hundreds more, but hopefully I'll get piece of mind that the thing actually works."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lasted less than 6.months",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Worked good till it didn't.  Black screen .. had less than 6mths .. business would not do anything to replace bc past 90day guarantee."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not charging",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "I bought 3 phone and one not working cause it isn't charging."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's faster than my old phone",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "I like some of the features but it adds messages or text to different people. It adds words or does not complete texts or finish the message or text."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is OK",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "For a kid or maybe for someone that just need a new cheap phone. Screen is nice tough.Struggle to work with 2 or 3 apps in same time ,like maps Bluetooth connection and a delivery app.For me was not good enough.For the part of the seller : was quick,like new,looked like never was used ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mediocre phone - only buy if you need a back-up phone",
      "date": "Reviewed in the United States on May 28, 2024",
      "body": "I bought this phone as a back-up phone for some of the apps I am using. It is not quick to respond. The touch screen has a slight delay in response and the battery dies faster than with other phones."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Power No Charge",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "I bought 5 of these and two have died. They will no longer take a charge or power on. I have initiated returns for replacement. Hopefully the replacements will not have the same problem."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Tried 4 different mobile carriers and none worked. Definitely not unlocked."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review says excellent condition but in real that’s full of scratches all over the phone",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    In first view is like disheartening to me coz the body is like badly scratched all over including the corners of camera and side lines."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not compatible with Verizon",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "Beautiful cell phone , perfect condition , but is not compatible with Visible by Verizon",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "Got the phone and was very disappointed it was supposed to be used but Excellent can do excellent condition b ut it was more like used but and in OK condition hat a lot of scratches on the back and lots of little scratches on the screen"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't come with sim card.",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "Didn't come with sim card."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not recommend",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "I don't recommend this phone because out of 4 phones that I bought 1 in dead in less than 3 months,  one stopped taking charge twice."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratches in screen",
      "date": "Reviewed in the United States on March 19, 2024",
      "body": "Was supposed to be like new but it had scratches in the screen for completely refurbished I wasn't expecting that. The phone itself is a good phone bit my kid overloaded it with apps and now the sound works intermentently. The phone was cleared and worked for Tmobile."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not working, Not recommended",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "The phone is not working properly, it can't be charged since I tried different chargers, it can't be turned off or restarted and it has scratches. I'm trying to get a replacement by talking to the seller and he doesn't want to, he suggested I return the product and buy another one, that doesn't make sense since it would be a long time between me receiving my money and making the new purchase again and until the phone arrives again. I would also lose money from my insurance which can't take care of repairing the equipment since I'm in the first 30 days of purchase. Definitely the seller didn't solve the problem nor did Amazon, I just wanted a replacement, I don't think it's that difficult."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Presentación del oriducto",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "Los teléfonos están con la pantalla rallada, golpeados por detrás y por delante he inclusive uno de ellos tiene el marco partido, demasiado golpeados"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great device",
      "date": "Reviewed in the United States on May 11, 2024",
      "body": "Nice phone,  works great, only thing is that I switched to spectrum mobile it doesn't on that network,  might send it back"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awful performance, nearly unusable for anything",
      "date": "Reviewed in the United States on February 27, 2024",
      "body": "Very, very slow. The touchscreen will frequently just not work. Frequently freezes for up to 15 seconds when opening the settings. No software installed outside of what came with it. Unclear if this was just a defective device being sold as refurbished to excuse the very laggy and broken behavior or if it had damaged components which weren't changed. Based on the other bad reviews, I cannot say for certain that these phones were obtained completely legally. Either way, you're being sold a bad product and it's being hidden from you by bought, obviously fake reviews.If, like me, you read reviews about it being scratched and a little busted but decide you might get the phone regardless because you just need a reasonably new device for development work and the price was the main point, I would still recommend avoiding it and not only from the ethics around the dubious sourcing. For my device (and it seems like many experience different problems), the performance was so bad that I could not effectively test on my device. It was always unclear where the fault lay.Spend a little bit more on a refurb somewhere else.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not fullly working",
      "date": "Reviewed in the United States on February 21, 2024",
      "body": "Took me a day or to to figure out that the nfc reader was not functioning at all. Switched from a TCL with a completely different system interface, so I thought it was something I was doing wrong. After troubleshooting with amazon I found it was the phone. Not at all happy about this because I've been waiting to get away from my old cracked curved edge screen for a LONG time and now I have to find another seller within the same price range, because I also purchase a case and screen protector for this model. Needless to say I'm missed, not to mention my kids locked me out of my old phone. Oh joy.But the phone does seem to be flawless otherwise.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone looks really used even though you paid for new",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "my product was all scratched up i believe i paid for a new one , not used it looks like there is some chips on the surroundings of the phone as well, now i am not sure for the performance of the phone i am pretty skeptical about this."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not factory unlocked",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "Bought two of these, neither was factory unlocked. One was from cricket and the other from Verizon, not what the listing states. Factory unlocked shouldn't have all the bloatware.And they came with generic crappy chargers that heat up to a scary temperature, I need to order actual Samsung chargers."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Literally a crap shoot.",
      "date": "Reviewed in the United States on January 3, 2024",
      "body": "What do you expect from a 'RENEWED', not RECERTIFIED, phone from Amazon.  I will be sending back my 2nd Samsung A14 from Amazon Renewed Store.  I ordered an AT&T compatible phone.  The first was able to connect just fine with the AT&T network but the microphone didn't work at all.  I guess they don't actually test anything with the hardware before selling them again.  The second phone, which was supposed to be a replacement for the first and was ordered by Muthu, and Amazon Customer Service member, was a Tracphone and that is not compatible with AT&T networks.  Why is it so hard for a multi-billion dollar company to get the little things right?",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apps",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "There are some apps on it I don't need or use and can't get rid of them"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheating with customer",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "You know it's a defective phone, but you sold it to a customer. This is serious cheating with customers. The phone you sold to me can not be used for talking and listening because the speaker is defective. Please don't waste customers' valuable time and effort by buying your useless product. I will also report this to the authority for consumer rights protection.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Estoy desepsionado de los envíos",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "No vino completo el paquete,le faltó el cargador."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BEWARE! They don't deliver on what their page promises!",
      "date": "Reviewed in the United States on October 15, 2023",
      "body": "The product page cleary says:- Product will come with a SIM removal tool, a charger and a charging cable.- Accessories may not be original, but will be compatible and fully functional.- Whats in the box - A14 5G Smart Phone, Quick Reference Guide/Terms and Conditions, SIM Ejection Pin, USB-C to USB-C CableThey will NOT provide you with the advertised 1) Charger, 2) Quick Reference Guide/Terms and Conditions, 3) SIM Ejection PinAnd if you complain to them, they will tell you not to expect everything advertised!BEWARE! They don't deliver on what their page promises!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I don't recommend",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Wouldn't charge and microphone was  bad and they don't do replacement, They do refund and I found the amount of time I spent messing around was definitely not worth it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished",
      "date": "Reviewed in the United States on February 26, 2024",
      "body": "Phone was described as \"Excellent\", yet it had 2 dents on the rear case,otherwise,it worked perfectly fine.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not good",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Charge this phoneBattery 100 percentTurn onThen it went blank until god knows whenNot saying it was a wasteMaybe I got the wrongDUMMY",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Useful",
      "date": "Reviewed in the United States on March 6, 2024",
      "body": "It is ok, my grand father is using it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone but battery goes down fast",
      "date": "Reviewed in the United States on January 10, 2024",
      "body": "Maybe because it was a renewed item but the battery does not keep a charge for long",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This company sucks",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "The screen just popped off and then they Don't want to send me a new phone first so can transfer my apps to the new one and then I'll send this piece of junk back .DON'T BUY PHONES FROM HERE",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not recommended",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "I wouldn't give any stars of it allowed me not to do so. Please do not purchase this phone. The phone says unlocked but no phone provider could unlock the phone for me. I was informed to them reach out to the seller which may be after the holidays when I get a response so please don't waste your money or time"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    How do I know?",
      "date": "Reviewed in the United States on October 2, 2023",
      "body": "The phone came still factory locked. If it wasn't unlocked, how do I know it truly was refurbished? Glad I got the extended warranty.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It didn't work even geek squad can't fix it",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Didn't work it said it was run by other then Knox mobile security and needed a factory reset but after factory reseting it 20 time it still wouldn't work super disappointing ruined my daughter 13th b day",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Old and scratched up",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "I just ordered a galaxy 14 5g and it was all scratched up. Won't be ordering again. 100.00 for a old scratched up phone!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped working",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "Camera is not good. Phone when working OK. Used for a month before the phone stopped charging and turning on. Not worth the money."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    tap and pay",
      "date": "Reviewed in the United States on December 18, 2023",
      "body": "phone would not work for tap and pay but other wise a nice phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Me salio un poco malo",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "El teléfono está fallando mucho la imagen se queda congelada no funciona el táctil no lo devolví porque no tengo dinero para comprar otro no me puedo quedar sin teléfono por mi travajo"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone doesn’t work. Won’t charge.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Sent a phone that won’t charge, instead of a replacement phone sent a charging cable. Still doesn’t work, poor communication."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "This phone says it's unlocked to tmobile but Its not it's locked to verizon .. waste of money and time."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen Fell Off",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "After replacing the first attempt within the return window due to issues, just a few months later the screen started falling off the replacement phone.  Seems that whatever method is used to put the screen back on after repairs does not work so well."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone isn't factory reset.",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "Phone still has provider on it. I figured I might get lucky after reading reviews. But gambled and lost. I don't understand why you would advertise something and then allow so much of said product to go out wrong. Either your business model is crap, employees are undisciplined or you as owner don't care enough to correct said issue within your company. Anyway it reflects badly on your company and this one's going back. Good luck people.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Black listed phone",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "This phone is black listed by T-MobileAll Amazon did was sell me a STOLEN phone they are out of control snd I will NEVET NEVER EVER by another Amazon product"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not fully unlocked, still reg'd to cricket",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "Was getting this to connect on an assurance line for a family member because assurance sells the same model on their site for 50% more. Unfortunately I booted it up and got the Cricket wireless welcome screen. Assurance would not allow connection. I was going to try to connect it to my metro account, they confirmed it was not unlocked and stated they cannot or would not unlock it as it had been connected on Crickets network within the last 6 months... unfortunately this us now the 3rd \"unlocked\" cell from Amazon that is being returned in a matter of a few weeks for the same reason",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone started rebooting constantly",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "I had this same phone and loved it, so I proceeded to order one for my husband. He used it strictly in our home office, never takes it out of office.  After couple days he heard the phone vibrating and it was trying to reboot over and over again, by itself. Tried charging it. Wouldn't take a charge. By night time, phone was totally dead.Phone came in plain white box with no model, serial # etc. There was no sim key, owners manual and very flimsy screen protector on it.  Returned it today. Will reorder, but from different supplier. Have feeling we were sold damaged phone. Company needs better quality control. Hopefully we will get full refund."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2/3 phones arrived locked to Spectrum (so far)",
      "date": "Reviewed in the United States on February 15, 2024",
      "body": "Can't say I'm impressed. I and someone I know ordered a phone from this listing. Theirs arrived unlocked, mine was locked to Spectrum. Amazon sent a replacement, which was _also_ locked to Spectrum. Still hoping to receive an unlocked phone. I know it is a small sample size, but when the majority of the phones shipped don't match the listing that isn't promising.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Unlocked",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I purchased this phone as a Christmas gift.It was supposed to be unlocked as it clearly says in the description and when I called my phone carrier to connect the line it was not Unlocked.Very disappointing on Christmas morning."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    shop elsewhere.",
      "date": "Reviewed in the United States on May 10, 2024",
      "body": "It looks realy nice. To bad it didnt come with a cord and charger to charge it up. The  last phone i bought two months ago cost 175,00 and it came with a charger. Looks like I need to find a new place to shop."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "I purchased this phone because it said it was unlocked. It is not unlocked, and is now basically useless unless I can get the previous carrier to unlock it for me. Don't waste your time or money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not unlocked",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "Phone doesn't come unlocked period. False advertising."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "When I went to activate new service it was not unlocked."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    More obnoxious than it's worth.",
      "date": "Reviewed in the United States on September 19, 2023",
      "body": "For reasons absolutely no tech support person anywhere could explain, there are inexplicable issues: carry-over, specifically relating to apps connecting and working between linked devices, which has frankly put a massive hitch in many of my everyday routines. I shopped for ages for a good deal, but this phone, maybe because it was used, is highly problematic for the few functions on it on which I rely. Autocorrect does not work. It does not remember frequently used words unless you misspell them. The screenshot function is useless and highly problematic. Certain apps just don't run. If you edit a photo, it immediately becomes \"corrupted\". Both the seller of this item and the manufacturer really botched their jobs with this one. I'm sure I'll find mpre problems as I use it. The moral is: don't truat Amazon to refurbish tech. Buy directly from a provider.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    black spot",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I bought this for my mom and it came with a black spot on the bottom and couldn’t connect to her old phone"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    What a pain in the ass",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "This phone has so many problems already. I can't get the Bluetooth to even work or the headphone Jack, Can't get any sound to come out of the headphone Jack Or get it to pair on bluetooth to anything.Somehow I can't figure out how to even move storage from internal memory to the s d card so I can free up space.It says it's an unlocked phone, but I'm still showing AT&T on it instead of t mobile.Only took 4 hours to do the Smart Switch! !I'm about ready to return it."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    issue with charging",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "The device does not charge well after charging overnight."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    false advertisement",
      "date": "Reviewed in the United States on August 3, 2023",
      "body": "Before purchasing this device I confirmed the device isUnlocked for All Carriers per the description under wireless carriers. However this device is only unlocked for AT&T and does not work for T-Mobile SIM cards. Therefore  this is false advertisement and a waste of time and Money. I requested a replacement that is as advertised or for the unlock code to be provided but customer service was less than helpful. I was told that I would receive a call back regarding the unlock code but instead I received an email in the middle of the night stating that a refund would be issued on a gift card once the device is returned  in 3-5 business days. Time effectiveness is extremely important given that I use this device as a source of income. This is unacceptable and I am Truly disappointed!",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Punto de vista",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "Lo único mal es que no vienen con su cajita"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Reported Stolen.",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "Bought this phone to replace my current Galaxy A14 5g phone as I had cracked the screen. Tried to activate and switch phone number from the cracked phone to the Amazon phone and the site said there was a technical problem and to try again later. Went to my phone carriers store and  tried to activate phone at carrier store, phone couldn't be activated as it was marked as reported stolen when the person went to activate it and couldn't activate it/switch numbers. Just be aware when ordering online that the phone may be stolen.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    control button broke",
      "date": "Reviewed in the United States on May 3, 2024",
      "body": "Control button, upper left of phone broke after only 2 1/2 months of use, passed return timeline, so I'll have to get phone repaired or replaced."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone has multiple scratches",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "The phone arrived on time which was great however,  the phone had multiple scratches and was very old and dusty.  I will be returning  it"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOCKED PHONE",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Bought this for our son for Christmas and the phone was locked when we received it. Totally useless and now our son won't have a phone for Christmas."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Unlocked!!! And damaged",
      "date": "Reviewed in the United States on August 24, 2024",
      "body": "DO NOT TRUST THAT IT COMES UNLOCKED. The phone arrived damaged on the top corner as it shows in the image and did not come with the SIM card tray pin. It also was not unlocked at all! It was locked to AT&T and when I tried to unlock it I was told it was still under a payment plan under an AT&T. I called AT&T and was assured that it was still under an existing account and could not be unlocked until it was paid off by the account holder. The phone therefore became a paperweight for me.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They Sent a Locked Phone",
      "date": "Reviewed in the United States on May 18, 2024",
      "body": "I received the A14 but it is locked.I contacted customer support via their WhatsApp— but they are not working for the next 24 hours.Meanwhile my number has already been ported and I am left holding a useless Samsung as my new carrier can’t activate it until it is unlocked!—-Update. —-The only support is via email and WhatsApp. I provided them with the IEM 24 hours ago on WhatsApp and still no reply, acknowledgement or resolution.I recommend avoiding this merchant!I’ll update this if they respond, otherwise it’s going back as DEFECTIVE.Update:Six days of playing the chat support game on WhatApp has yielded nothing.  No solutions.  It's going back.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not charge/ hold a charge",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "The phone would not hold a charge, its the same as mine that broke and after 3 hours without using this one it went from 85% to 42% and when I tried to charge it, the battery would not go up I tried 3 differnt chargers with completely different wall boxes and nothing. The charging symbol was on but wouldn't go up after 30 minutes."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dirty phone",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Phone came very dirty",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Ready for Prime Time",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "I should have returned it immediately, when I saw 'Tracfone' as my supposedly unlocked phone powered up.  Instead, I tried to charge it and found that it wouldn't accept more than a 60% charge.  I also wanted to contact my cell carrier to confirm that it wasn't compatible with their network.It wasn't.So far, the return system seems to be working OK."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dont buy",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Terrible dont buy the speaker was messed up waste of money"
    }
  ],
  "productDetails": {
    "productTitle": "Samsung Galaxy A14 5G A Series, Factory Unlocked, 64GB, US Version, Black (Renewed)",
    "asin": "B0C1Q3MVBP",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Android 13.0 Operating System: Runs on the latest Android OS for smooth performance and up-to-date features.",
      "Bluetooth 5.0 and Wi-Fi 802.11ac: Stay connected with others wirelessly and stream content at high speeds.",
      "6.6\" AMOLED Display: View vivid content on a large, high-resolution screen.",
      "Quad Camera Array: Capture stunning photos and 4K video with the advanced camera system.",
      "Long Battery Life: Power through the day on a large 5000mAh battery."
    ],
    "boughtCount": "2K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$87.06",
    "url": "/gp/offer-listing/B0C1Q3MVBP/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0C1Q3MVBP",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "A14 5G Smart Phone, Quick Reference Guide/Terms and Conditions, SIM Ejection Pin, USB-C to USB-C Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$97.90",
    "listPrice": "N/A",
    "savingsPercentage": "N/A",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "Friday, March 21",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}