{
  "asin": "B08PPDJWC8",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Maybe serviced by Apple? if it was serviced? I think it was an open box return. It’s too nice!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Wow !!!! This iPhone 12 mini is BRAND NEW BASICALLY 🤯🥰😲 how ? I don’t understand yes I know I payed extra for “renewed premium” but still it’s like too nice it’s got a 94 % battery and it’s got like zero scratches I’d say one spot in the back maybe two ! This is gorgeous here’s a couple pictures I’m so happy the company is joygoods out of New York City I’m so happy with this phone I could shout from the rooftops !!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s good no problems with the phone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "It has a little bit of scratches the camera quirky is good I haven’t had any problems with the phone yet but so far I like it it’s smaller then the se and it doesn’t have many cases for this phone"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DON’T BUY IT",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I rarely write reviews, but in this case, I think people should be warned. I’ve been through four of these phones in a couple months, and they have all had major issues from Camera not working to audio issues, and the worst of all one COMPLETELY DIED after four months.Unfortunately, the Amazon warranty is only three months. (I thought it was one year because other competitors offer that. But it does clearly say on their page that it’s only three months.) During these three months, they to completely refund you no problem or fix the issue that you report. But unfortunately the phone I kept died on month four, while I was on vacation to make matters worse.Seems like the sellers are always different stores, but all amazon approved and they follow some sort of Amazon standards for these phones. But it seems to me that these phones have really severe issues so these Amazon sellers fix the phones to a certain standard, but they are not in good condition.All the sellers are polite and responsive, but the issue is the actual phones and their conditions. Even though these phones are used, they are not cheap, they should function properly.I’ve been an Amazon customer for years and I really haven’t had any issue with them. That was the reason why I decided to buy the used phone on Amazon instead of a competitor. But this is truly disappointing to the point that I think I’m going to report them to the Better Business Bureau. They should not be selling phones in this condition.FULL STORYPhone 1: iPhone 12 mini (Ordered good condition )Received Mid OctoberSeller: Kojak salesWhen I receive the phone physically it seems fine. But as soon as I put a case on it, a lot of little pieces of paint started coming off of it and then you could tell it had a lot of scratches on the case so somebody was trying to cover the scratches, then I put a screen protector on it, and after trying to I could not get rid of a humongous huge bubble, took a third of the screen. So some thing was hinting to me that the screen was not straight. In my opinion, the phone shouldn’t have been sold as good condition with so many scratches but since I don’t care about the look as much as functionality, I move forward. But then, after a few weeks of using the phone, I realized things were not working properly. The camera was very slow at taking pictures if it was dark or if you were using inside the message or WhatsApp. Also, if I received a text while listening to videos or video calls, the speaker would suddenly gets super low, and I could barely hear the video for about two minutes . (usually this lowering of audio feature happens only for five or 10 seconds).This was worrying me so I contacted the seller and told him I wanted to change the phone and he said no problem. Since I was still thinking that this was bad luck, but in general, I liked the iPhone 12 I decided to buy another phone as a replacement, and one more phone as a Christmas gift. I’ll explain below the problems with those phones, but since the problems were actually worse than the current first phone I had in my possession, I never gave back this phone. I kept thinking that maybe the issues would get better with update and also, in my mind, I thought I had a year warranty. Unfortunately, in February while away on vacation the phone one morning, simply never turned on again. My dad is an engineer and he tried helping me connect it to computer and nothing it’s like the battery is no longer connected. I’m sure you can imagine the horrendous time I had the following week without my phone., traveling.. Things got worse when I got home and was able to contact the seller. I then discovered the warranty was only 90 days and that date had passed. After some back-and-forth the seller Kojak sales said they can fix it for $39 and I pay for shipping. I have still not done this since I’m skeptical and don’t understand how they can give me a price if they don’t even know the actual problem or if they need parts. But I really have no other option, or I lose $241 or I pay $60 more. (also, I have to figure out how to erase the phone from a PC if the phone doesn’t even turn on. I’m sad I’m gonna lose all my pictures from the last four months)After I send them the phone, I will update this review.-Phone 2 and 3- iPhone 12 mini (Ordered good condition )Received Mid  begging of decemberSeller: WilzeeSo one of these phones was supposed to be replacement for my phone and the second phone was gonna be a Christmas gift. But the first one was so scratch that I didn’t even set it up and I gave it back, no problem and the other phone after giving it as a gift, a little embarrassed with all the scratches, we set it up and realized the camera did not focus at all so I also gave this phone back and received a refund no issue.-4th Phone-  iPhone 12 mini (Ordered EXCELLENT condition )Received mid JanuarySeller: PDI MobileThis phone did actually look really good in the outside barely any scratches. I was very happy with the look. But after setting it up again, the camera could not focus so we contacted the seller and sent it back and they fix the camera then after a few weeks of using also, it has audio issues. We’re looking at social media videos suddenly that audio lowers  a lot. Since at this my 1st phone died suddenly we decided to give this 4th phone back. I don’t wanna take any chances since the quality of the phones is clearly not good. I don’t expect an issue with the refund. But I will update this review if I do.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nice iPhone 12 mini in good condition.",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I like the phone.pros: the iPhone is in very good condition, basically no visible scratch.cons: the battery is 80%. I cannot shut the iPhone down by keeping pressing the right side button, I had to use general-shut down.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone - Battery Health Lower than expected",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "The phone works well and is a major upgrade from my previous iPhone. My one issue is that the minimum battery capacity was 74% when I received it. Amazon Renewed guaranteed at least 80%.The internet and download speeds are great. It was easy to transfer over my iCloud information and set up the phone within a few minutes. I plan to keep the phone and figure out options for battery replacement.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love refurbished products!",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Cliff notes:-GREAT price-No/minimal cosmetic damage-77% battery health (not ideal)-Efficient customer service resolved issuesI'm upgrading from an iPhone SE so this feels like a massive jump! I believe I purchased a phone in \"Good Condition\" for $195. The phone, cosmetically, was perfect! No noticeable scratches on the screen or the cameras. There is a tiny little chip on the border/metal but once a case is on, you don't even notice it. Amazon guarantees all phones will have battery health of at least 80%, but mine came at 77%. I contacted the seller who recommended I return the phone and they will send a replacement. I really didn't want to have to wait another 2 weeks or so to have a new phone (my SE is glitching like crazy) so this was less than ideal. I proposed a partial refund and was able to get a refund for 20% of the price. (I'm upgrading from an SE with 82% battery health and have no issues with battery life. I've gotten used to carrying a charger around with me everywhere. Even at 77%, this 12 mini has a longer battery life haha). Overall, I think I spent 15 minutes chatting with customer service so it wasn't a huge burden or hassle. I really do appreciate that.  So was the item as described? No, but I feel like it was made right. The phone came with a non-authentic charging cord but no wall plug. Not really an issue since I already own a charger for my current phone, but it's worth noting.  Overall, $150 doesn't seem like a bad price for a phone!",
      "helpfulVotes": 34
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its okay",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I got this phone one year ago. Its my first iPhone.Pros- Came in essentially perfect condition appearance wise, no scratches or damage.I personally like the size, not too small not too big.Cons- Battery life is terrible, I have to charge it a few times a day. When I got it the maximum capacity was at either 84-86%, now it’s at 80%. Camera isn’t that great, photos look dull like there’s no color saturation. Laggy at times with loading, whether I switch between WiFi or phone service it’s the same. Storage isn’t great either at only 64GB.All in all it’s probably a good starter iPhone for a child but as an adult it’s lacking in some areas.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Snazzy ‘new’ phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Wow! Super great purchase - easy transfer and up and running - phones are perfect - no scratches and charger cord works great. Thank you Amazon for this ‘new’ phone!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice, compact phone, renewed in very nice condition.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Being annoyed by iPhone size creep, I decided on a 12 mini to get back to a pocket-able device.  Always missed my 4S that you could stick in a shirt pocket.  If I want to screen big enough to read a book I'll grab an iPad.  This is small and light enough to take everywhere and hardly notice it.  Having said that it replaced an iPhone 8 and the screen actually measures slightly larger than the 8 does since it doesn't have a border at the top and bottom.Am pleased with the quality of the renewed device; it came with barely a scratch, maybe a little rubbing on one edge but not noticeable with the Otter case on it.  No scratches or flaws on the face glass.  The battery shows 85% capacity which I was disappointed about at first but seems to be better than what many other reviewers are reporting.  The phone arrived 3 days earlier than the estimate which was nice.  Came with a charge cable as advertised.Rated down a star not for any quality issue but because the price dropped by $10 during the time I ordered it and the day it arrived.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would buy again",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Phone arrived in timely manner. Just had one minor scratch on bottom right corner nothing tempered glass can cover up otherwise frame and phone in immaculate condition. But was a toss up on the battery was a gamble but I already around and replacement is 59.99 for battery. Battery health is 82% still usable but will need new one soon. But overall I am happy with the device and would purchase again. A++++"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall it’s good for the price ig",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I purchased excellent condition it do have dents and scratches but nothing major my number one problem is that when I received the phone it was already on the Home Screen like they didn’t even factor reset the phone I had to do it and it had 3 pictures in the photo album and then the phone says finish repair like whattttt"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition!",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I’ve usually don’t write reviews, but I needed a small phone for my EDC kit I was using the iPhone 5s until update software was no longer supported so I’ve decided to go with the iPhone 12 mini was worried the condition of refurbished phone wasn’t going to meet my expectation, but I am very satisfied with this purchase!  definitely get your hands on these EDC phone from DirectCertified!!  I’ve purchased this order as a “GOOD” refurbished turns out it was an “excellent” refurbished! Haven’t seen suff that is noticeable on the phone looks brand new!! Plus battery health level was 100%!! Recommend seller 5 start. Adding phone to my pocket, knife, lighters, and conceal carry etc., every day carry.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Diseño elegante",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Es un celular con las mismas prestaciones que el 12 normal, acá hay algo que debemos tener en cuenta, al ser pequeño la batería es super limitada también, por eso le doy 4 estrellas, porque la batería no dura ni 8 horas, por lo demás en un excelente equipo y diseño"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I got this in very good condition, like a brand new phone. The battery life was a little lower than what a new phone would have, otherwise it is beautiful."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Love the mini. I had to call Xfinity because it was saying locked but turned out not to be"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    got the job done",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "works perfectly fine. perfect for a kids starter phone. couple dings and dents but why pay full retail?"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera won’t focus",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Great phone, but the camera won’t focus, so I can’t take good photos."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mint green color",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "The color is more white than green, so color doesn’t really match the photo. Can hardly tell it’s supposed to be green. But the battery health came at 90%, so not bad for the price I suppose. I also ordered a purple one, color matched photo but battery health at 80%."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for the price!",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "I had problems with SIM card and adding service down the line."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product!!",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Amazing product, bought it on Friday said it was coming Tuesday but came Monday morning. Came in great condition with 1 tiny scratch. The mini size is perfect for me and isn’t too much smaller than the one I had before. Battery came at 52% and lasted at fully charged for about 9 hours. Was able to transfer all my data very easily and only took about an hour and a half."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Curiosity with privacy",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I’m not tech-worthy enough to give a viable review, but it has survived all of my ignorance. We’ve been through a lot together for the last 2 years but we always get back to where we need to be. I’ve come to the conclusion it’s much more capable of taking care of itself if I leave it alone. It fulfilled the service I needed which was, to be curious but safe. I have enjoyed my phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone, though no replacement for my Iphone SE (1st Generation)",
      "date": "Reviewed in the United States on May 14, 2024",
      "body": "This is a brilliant phone. Yes, it is a few generations down from the newest, and yes these are specifically refurbished as well. Even so! My phone arrived in basically new condition a year ago, and has worked well since.Battery life is...not amazing, but Iphones honestly don't have great battery life. They'll last you through the day depending on your use, but not much past that. That's fine, I charge mine often.64GB's is plenty for a phone unless you are recording often and keeping a large gallery or a ton of apps.I like the smaller size of the phone, I think phones are getting too big, and this has all the features of a big phone in the smaller package. I like the facial recognition (although it feels dystopian) as it makes unlocking the phone a breeze. I think the camera is very passable, and I like the screen. If not for being worried about dropping it, the outer case is beautiful. Apple outdid themselves.What I don't like. The size...is actually still a bit too big for me. The Iphone SE (1st Generation) used the Iphone 5 frame. I thought that frame was truly amazing, as it wasn't very big at all. Easy to one hand, almost as if designed to be. It in fact *WAS* designed to be. When I first got it, I realized this. It is too big to one hand comfortably, it's not quite so big that 2 hands feels truly right. It's fine, but I feel the mini should have been actually a touch smaller. Also, I honestly kinda dislike having almost all the phone's front be the screen. There's nowhere good to rest your hand to support it without touching the screen. I used to wrap my hand around the phone and support it with my thumb across the front, near where the button was. It's a nitpick, but I just don't dig it as much.For $200~275 though, is it worth it? Ab-so-lutely. It's a great phone, I bought mine I think for near double that, and I only somewhat regretted the price tag. It's held up very nice the past year, and I don't expect to have to replace it for a good number. If not for the busted screen on my old phone, I'd still be rocking it despite a truly not good battery. This one makes for a fine replacement, and if you want a new Iphone, this is the one to get.",
      "helpfulVotes": 45
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, minus battery",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "The phone I received was in good shape apart from a few very small scratches on the edge of the phone (normal for refurbished). I purchased a renewed (premium) phone to guarantee battery life over 90%, however, this phone had an aftermarket battery put in that didn’t hold a charge.I messaged the seller who responded relatively quickly and offered a full refund or a refund for the price of a new battery from the Apple Store. I got a new battery and it works great now. Although I wish it would’ve just come with a functioning battery as the “premium” option stated.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone12 mini",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Product arrived on time in good working order."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good phone, No Scratches and Operates Fine",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "I’m not used to the apple ecosystem, so I decided to try this as a test run to see how they work. I really love the phone, was very much what I expected, including the sleekness of the design.I think the only problem I have with it is the battery - I mean, even the phone as new has a battery capacity of about 2200mAh - so this one with 86% battery life wasn’t expected to do much. A full charge lasts for about 6 hours if you only browse the internet (on WiFi), play music and watch videos. But once you are on a video call, a full charge will only last for about 1.5 hours.Overall, I would say it is a good buy, I didn’t purchase it to be my main cellular, so it works just fine as a backup device.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality and price!",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I bought this phone in excellent condition, hoping that it would come basically brand new. One of the first things I noticed was that the screen was in great condition and came with a screen protector. The back was also in good condition. There were some light wear and tear around a lot of the corners and sides as shown in the photos. However, with a case on you literally couldn’t tell. My battery came with 100% which was way above the 80% promised. So for $230 I think this is a steal ✨",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Condition",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    As described in the images, minor scratch but functional. Once in a case all the imperfections will be hidden.Very light in hand and well packaged.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Overall in good condition, but the battery is at 76% when it supposed to be guaranteed to have a minimum battery capacity of 80%. Also,Very nice phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still a Pocket Rocket in 2024",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "The iPhone 12 mini is a fantastic phone for those who prioritize size and one-handed usability. It's still a capable performer with a great camera and display. However, the battery life is a significant consideration. If you're a heavy user or need the latest and greatest features, you might want to look at newer models. But if you're on a budget and want a truly pocketable phone, the 12 mini is still worth considering, especially on the used market.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charge Cable isn't good quality, refurb seems pretty good",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Phone seemed in pretty good condition, box said AT&T CDMA but it was infact gsm.Charge Cable broke after 3 uses unfortunately"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Iphone 12 mini",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "el paquete llego a tiempo , revise el mismo venia con su cable y cargador genérico , probé los mismos todo estaba funcionando bien , el modelo que compre ya había mostrado en fotos el porcentaje de batería (84%) ese fue el único defecto , pero por su precio y su espacio de almacenamiento , mi hija tiene celular para rato.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed: you get what you pay for..",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "There is absolutely nothing wrong with the phone. The camera, speakers, mic, calling, etc works as it should Now the battery capacity is 78% which I can’t be mad at that. I paid $240 for it. There are NO blemishes on the camera nor the phone itself. It did need a lil wipe down though. The phone works great performance wise as well. -Shipped by Kanga Supply"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Honestly it looks brand new to me. Battery life is 90%. Works great. Camera looks great. Super easy to transfer data."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 12 Mini, 128 GB",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "Scratch resistant: The phone by itself can easily get scratched on the sides and just one drop itself can leave a noticeable scratch/mark if you drop it somewhere like the street or crossroad by accident.Screen: The screen feels very smooth if you are upgrading from something less newer. Easy to play games on if you have small hands as well as type. I recommend a screen protector cause every iPhone to ever exist is easy to get scratches without you even noticing.Battery: My phone came with 87% battery health and I was fine with it until within just a week or so it went down to 85%. That’s my only real problem with this phone.Camera: The quality is amazing so if you take pictures this will satisfy most of your needs. It’s definitely more than worth it if you’re looking to upgrade to something better or newer.Appearance: I personally got the red color and it looks amazing and brand new. The phone comes in a box with a SIM card opener pin, charger without cube, paper with information about the phone and seller, and the phone is inside a little bag.**Although it might not be important but if you for example get the 128 GB and you have the latest IOS update that means you’ll have 10GB less due to the software. So you’ll be left with 108GB or at least somewhere around that area**",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Volume is an issue.",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "No issues with shipping or the packaging. Phone works fine but the volume is extremely low even when turned all the way to the max."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s so good",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "Ever since I welcomed the iPhone 12 Mini into my life, it has become more than just a device; it’s an extension of myself, a companion that enriches my daily experiences. From its sleek design to its powerful capabilities, the iPhone 12 Mini has captured my heart and enhanced my life in countless ways.At first glance, the iPhone 12 Mini’s compact size immediately drew me in. It fits perfectly in the palm of my hand, effortlessly slipping into my pocket or purse without adding any bulk. Its lightweight yet durable design makes it a joy to hold, allowing me to navigate through my day with ease.Beyond its physical attributes, the iPhone 12 Mini’s performance is truly impressive. Powered by the A14 Bionic chip, it delivers lightning-fast speeds and seamless multitasking, allowing me to stay productive no matter where I am. Whether I’m streaming videos, browsing the web, or playing games, the iPhone 12 Mini never fails to impress with its smooth and responsive performance.But perhaps what I love most about the iPhone 12 Mini is its stunning display. The Super Retina XDR OLED display brings my content to life with vibrant colors and deep blacks, making every photo, video, and app look absolutely stunning. Whether I’m watching my favorite movies or editing photos, the iPhone 12 Mini’s display never fails to captivate me with its clarity and detail.Of course, the iPhone 12 Mini’s camera is another standout feature that I can’t get enough of. With its advanced dual-camera system, I can capture breathtaking photos and videos with ease. Whether I’m snapping selfies with friends or documenting my travels, the iPhone 12 Mini’s camera consistently delivers stunning results that exceed my expectations.But it’s not just about the hardware – the iPhone 12 Mini’s software is equally impressive. iOS provides a seamless and intuitive user experience that keeps me connected and organized throughout the day. From the convenience of Face ID to the efficiency of Siri, every feature is designed to enhance my productivity and streamline my life.Beyond its practical utility, the iPhone 12 Mini has also become a source of entertainment and inspiration for me. Whether I’m exploring new apps, discovering new music, or diving into the world of augmented reality, the iPhone 12 Mini constantly surprises and delights me with its endless possibilities.In conclusion, my love for the iPhone 12 Mini runs deep. Its sleek design, powerful performance, stunning display, and versatile camera have transformed it from a mere device into a beloved companion that enhances every aspect of my life. With the iPhone 12 Mini by my side, I know that I’ll always have a reliable and enjoyable tool to help me navigate through life’s adventures.",
      "helpfulVotes": 41
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As described!",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "The description was correct in excellent condition and unlocked. It did have 2 light little scratches on the screen but you can barely see it. It doesn’t bother me cause I put a screen protector and case on it. Battery capacity is at 81% I can’t complain it’s a great phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente! Producto cumple con la descripción del vendedor",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Producto cumple 100% con lo ofrecido en la descripción. Funciona perfectamente cero fallas. Recibí el celular antes de tiempo lo que fue un plus 👍🏽 vendedor recomendado"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone in good condition",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Upgraded an even older phone to the iPhone 12 mini. Packaging was minimal but adequate. It included just a USB charging cable, but that's all I needed. My main problem is getting used to the different locations of some of the controls and the lack of a Home button. I'm pretty happy with the purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Compact, Fast, and Reliable – Perfect for Everyday Use!",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "I’ve used a variety of iPhones over the years, including the iPhone XR, iPhone 12 Pro, and now the iPhone 15 Pro. With all that experience, I can confidently say the iPhone 12 Mini is an excellent choice for anyone looking for a compact, high-performance phone. It packs all the essential features of the iPhone 12 into a smaller, pocket-sized form that’s easy to carry around.The 5.4-inch Super Retina XDR display is sharp and vibrant—perfect for watching videos, browsing, and using apps. The screen might be small, but it’s still incredibly clear and bright. Powered by the A14 Bionic chip, the phone runs smoothly whether I’m multitasking, opening apps, or just browsing. It’s fast, responsive, and performs seamlessly.The camera system, with Night Mode and Dolby Vision HDR video, takes excellent photos and videos for everyday use. While it’s not quite as powerful as the higher-end iPhones for photography, it still does a great job capturing everyday moments.I use the iPhone 12 Mini for all my on-the-go tasks, and it’s been a perfect fit. It’s compact, easy to carry, and handles everything I need—social media, maps, watching videos—with ease. The battery life is solid, and with 128GB of storage, there’s more than enough space for all my apps and media.For around $250-$300, the iPhone 12 Mini offers incredible value. It’s fast, reliable, and provides a premium iPhone experience without the high price. If you’re looking for a high-quality, compact phone that delivers excellent performance, I would highly recommend the iPhone 12 Mini!",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished All The Way!",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "In no way was this purchase a disappointment. It’s refurbished but really it’s like a brand new phone. I will never buy a new phone again."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came with the screen lifting.",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Purchased for my son phone came in screen was lifting in one corner and camera was blurry contacted seller. They said box it up and as soon as they get it, they’ll ship us a new one we had new phone within 2 to 3 days after they received  bad phone very happy with the replacement phone. Happy with the fast service."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Get a refurbished battery!",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "This thing keeps dying on me, I bought two extra MagSafe batteries that I carry around with me. I also have issues with phone calls. If you heavily rely on phone calls maybe look at another place to buy."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy with these phones.",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Got 2 for my kids. They are both happy they work well"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality phone for a good price",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I was nervous making a purchase like this on Amazon but I’m glad I trusted the reviews. My phone is in great shape and I’m pleased with processing speed, size and quality. I like the mini, and prefer a small phone. I got a second one for my son and am pleased with both. I would Recommend"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn’t get what I thought I was getting",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Bought the iPhone 12 mini and was shipped and received the next day. Awesome speed on the shipping. How ever the add said it was for Verizon and I received a random unlocked iPhone. Ok no big deal. I called Verizon to have my line switched over to the new to me iPhone  and they said they can’t hook it up cause the phone came from Europe and it would take a few days to change it over to the US specs. Not the happiest customer."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buena compra",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Todo ha funcionado muy bien desde que lo compré"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good purchase",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Good purchase only thing I hate is that the battery it came with is at like 85% health",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent seller",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "We had a slight problem with shipping, but the seller fixed it with lightning speed. Super satisfied with the phone and more impressed with the customer service. Thank you."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exceeded My Expectations!",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I have so far purchased 2 phones from the seller MOBILESUPPLY. While you are looking at the iPhone product on Amazon under the “Add to cart” and “buy now” tab it will tell you under those tabs who the SELLER IS. I made sure both were from the seller MOBILESUPPLY as they had the best and most reviews.The black one I got in 3 days time from New York and the second one came in the next day after purchase !I purchased 2 of 3 for Christmas gifts for my children who will use these as WiFi phones.Our home has WiFi, schools and most stores we go to have WiFi as well as our car.I have also taken MY SIM card out of my phone and put them in the purchased phones and it works just fine to make calls etc.The condition of both of the iPhone 12 mini I purchased is immaculate condition and the battery health is above 80%. I selected the “EXCELLENT Condition”.Any particles seen in the photo/video are dust.This comes with a generic cube & charger so be sure to get a screen protector and case.Unfortunately, it will be about a month before my kids can actually start using the phone to see if there are any issues etc.The phones I purchased updated and are compatible with the newest iOS 18 update and working just fine when I set them up .I purchased black , green and soon I will be purchasing purple as soon as MOBILESUPPLY has it in stock.I am definitely a review person and I WILL be certain to come back and update ANY issues.If you do not see an update then that means my review remains at 5 stars!I will add the green and purple photos soon but I wanted to get this review posted for others before Christmas . Shalom",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mini and cute",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "At first i was so skeptical if i should buy r not cz it was used and refurbished but i took risk and I'm satisfied now it's really good According to price, phone condition is good, sound quality is high, but there is something which i didn't like which is sometimes when i try to unlock screen n swipe it feels like hangup sometimes n it took me some time for setting up my cloud ID as well but overall it's good picture quality is good but not too excellent",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Iphone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Muy buen celular"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    If you’re looking for a cheap iPhone 12 mini; buy this!! (read below)",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "I got this phone with high expectations, and in the end, it exceeded them!Notice how I said in the end though..BUYER BEWARE!not sure if this has happened before, but the original phone that came was a iPhone 12 Pro with 75% battery life, which is less than excellent condition which I had ordered.I had to return it to get my mini.When I got my phone mini; packaging was different but I have got to say, I am so surprised since the phone is flawless and the battery life is amazing!! Screen color is good, sound quality sounds brand new too, little to no scratches on screen, overall gets an A from me, especially for the price :)I rated 4 stars since I got a pro originally.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone had it for over a year",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "I have had this phone for over a year and it’s wonderful, but i received the color black when i ordered purple, but it wasnt a big deal. Battery is great and i still havent cracked the phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Phone",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Phone looks brand new came with 100% battery life"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works great but has a few scratches",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "the phone screen is absolutely perfect and it functions great! There only \"con\" is that the back around the camera edges the paint has chipped off some and around the edges of the phone. it is very minimal damage and doesn't effect the phone in any way. you wouldn't even be able to tell with a phone case on. it also came with a phone charger. the packaging was also pretty secure and arrived on time. highly recommend. :)"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like a new iPhone, exceptional value",
      "date": "Reviewed in the United States on March 15, 2024",
      "body": "Ordered based off of other reviews.  Was time to get our 12 year old his first phone.  A new iPhone with my carrier was $1,000 with no existing phone to trade in.  Took a chance on Amazon Renewed iPhone 12 Mini.  At this price, if we lost it, broke it, or whatever- it was a good business case.  Phone was sent FedEx shipping and had it in one day.  You couldn't tell the phone was ever used.  Came with pre-installed screen protector with no \"bubbles\"- better than I could have installed one honestly.  Packaging was supurb, and came with a used charging brick in great condition, and what appeared to be a new charging cable to match.  Phone stated it was unlocked.  Tried to add new line with phone to my carrier plan and ran into issue.  Called carrier, and they did a few resets to the carrier profile of the phone, and verified it was unlocked.  Within 30 minutes had the phone up and running.  Box stated the battery to be 85%, and that was verified in the phone's settings to be correct.  No issues at all, phone holds a full charge alomst as well as any new iPhone I have ever purchased for 4x the cost.  Did not have high hopes for Renewed, but turns out this was like getting a pretty much new device, so my expectations were far exceeded.  Told my wife I would not hesitate to go this route on another Renewed iPhone when my existing iPhone is paid off with my carrier, and save a monthly equipment payment going forward.  Sure it is not the latest iPhone, but honestly- most of the improvements that the end-user really sees every year is in the camera- not so much a fancy new chip with marginal speed improvements on the same phone form factor.  Is that worth $1,000 a year- that is a personal decision.  Great purchase experience and value.  For purchasing a phone for a teenager where you are worried about losing or breaking, this is a great option that one should explore before plunking down money on a risky purchase with a new carrier phone financed over 2-years.  Also saves paying up to $20 a month for an insurance plan on said phone.",
      "helpfulVotes": 48
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good looking and many new features",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "I upgraded from an iPhone 7 to this 12 Mini.  I like that it handles 5G networks and runs on the latest operating system (17).  This \"reconditioned\" or \"refurbished\" (EXCELLENT) phone truly looked brand-new.I've been using it for 3 days now, and it takes some getting used to, to navigate around the screens, finding your websites, tools, apps, etc. And CLOSING THEM is different, too. There's no more \"home\" button on the bottom center like my old phone.As for battery life, it seems to charge more quickly than my iPhone 7 did, but it still uses up the battery just as fast.  Today I started with 100% power at 7 am and didn't make a single call, but did a few texts (with a couple of attached photos) and did browse a few websites.  By 10 a.m. my battery was down to 80 percent.  Of course the phone came with one 120V wall charger and a cord, and all my other iPhone and iPad charging cables work with this one too.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Love it so small but does everything a pro max does"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of BATTERY!",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "The iPhone 12 mini, refurbished was visually in great condition. Purchased in September 2024. The touchscreen didn’t seem sensitive enough. I tried changing settings, but still bothersome, especially around the edges. After warranty was out, several issues began with the battery. The first month or so, it required charging twice a day, with or without excessive use. I liked the size so much and the fact text messaging was a breeze, I tolerated it. December 2024- Then the battery began getting really hot. The touchscreen stopped responding. I removed the cover and even took the screen protector off (I was panicking)! I forced it to power down. After powering up again, I ran it in low power mode, which seemed to help and kept the phone functional. January 2025 - The phone would say it wasn’t charged, plug in and it indicated 70 - 89% charged; unplug, 2 -3%. Phone gave a message: Battery not recognized. Look in explanation, the battery is not Apple and may be incompatible. Next day, thankfully, it upgrades. Since then, screen sensitivity is much better and the battery seems ok. It doesn’t need charging as often. I just really enjoy that text messages are sent and received so easily and I don’t feel like I’m carrying around a mammoth of a phone.  It also seems faster on the internet. Those are the reasons that I gave 2 stars. Also, it’s in a case and the screen has several cracks, from low level drops. This might be an Apple issue. The only other electronic device that I own that has cracked, is an iPad. No cracks on any of my android refurbished phones. In fact, I still have two around the house to use for shopping, internet searches, etc. This may just be the “luck of the draw” and I just happened to get a lemon. I’m going to try to limp along until at least a year, just to not feel too bad about spending the money. But when I buy, it will DEFINITELY be Android!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery health, missing charger, dirty device",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "While the phone was priced decently, the actual device was dirty (gunky sides and around the camera and silence button), and the battery health is only 82%. Also, the charger was missing. I needed the phone, so I didn't want to have to wait and go through a return. Phone functions ok."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As expected",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "As expected 👏"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks great, runs great, but only 82% battery life upon receipt, yours might be different",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "Cosmetically excellent. Functionally perfect. However arrived with only 82% battery health. The advertisement guaranteed 80% or more so it did met its minimum as stated, but of course hoped for better (especially since this model isn't known for the longest battery life even when new). Would I do it again? = Probably. Should you do it? = not sure as every used iPhone is used and has a unique history of use and abuse and every refurbishment is done just enough to get unit up to minimum specifications so one used phone may not be fully indicative of what another is. If you get a dud you'd probably realize it soon and be able to erase and return. Since i was comfortable with the tech of knowing I was buying the right unit for my network, changing SIM cards and updating software, for me it seems like a better value than $1000 for a new phone. Overall mildly positive rating.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mine came with a screen protector already on it so you won't have to put one on",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Love it came just as advertised looks brand new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "After looking for the best prices,This is it. With the condition and price.. and shipping.. you can’t beat it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lack of a SIM card",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "The camera is lovely, except it doesn't have a SIM card. Please send me a SIM card."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery!",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I received this phone, I ordered excellent  condition, I received the phone it was fine on the outside minimal to no scratches and has a screen protector. But the battery health is at 76% and it heats up so fast. Do not buy from this company. Amazon renewed is promised to have 80% and above!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality of phone is ⭐️⭐️⭐️⭐️⭐️",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Love my new phone , delivered promptly and perfectly"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "Unfortunately I gave it to my girlfriend as she was in desperate need for a phone. The same day we set up the service she broke up with me. At least it was a good deal so my pockets have less of a hole in them than my heart. :(",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    in love",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "LOVE LOVE LOVE IT. it’s perfect honestly and in great condition"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 12 mini-Content with my purchase!",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "I have had this phone for 7 days now. When it arrived, I was worried that it would be damaged due to the way the product was packaged. It was placed inside a box loosely then put into an envelope that was lined with bubble wrap. However, upon inspection, the outer appearance was flawless! There was not a single scratch anywhere, not even the screen.Once I got the phone powered on and switched on with my carrier, I noticed the battery health was at 85%. This is lower than I was expecting, but it wasn’t a dealbreaker. I have used the phone vigorously and to my surprise, it has held up quite well. I do have to leave the Power Saver on for the battery life to last me throughout the day.  I know this isn’t normal for an iPhone, but for being an old-ish model and since I am used to using a cheap android that has terrible battery life, I don’t mind having to charge it throughout the day. Especially since it is a wireless charger. I can throw it on a portable power supply and call it good.Overall, I am content with my purchase.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleased",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "The phone is in good condition and works well. Switched to eSIM carrier easily and got rid of (major carrier) without issues.Packaging wasn't great- one piece of bubble wrap, and only a cable was included. Overall, good deal with no issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 12 mini was delivered successfully",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "It was great!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone good, hiccup during setup",
      "date": "Reviewed in the United States on May 26, 2024",
      "body": "I bought the phone for my wife. It’s been a week and she’s very happy with it. I worked on transferring settings and such from her old phone to the new phone, and that took a lot longer (3 hours) instead of 15 min (like it should have) because the phone didn’t come reset to factory settings. I didn’t realize that at the beginning. I kept waiting for the Quick Start screen to pop up. Eventually, I realized that I needed to erase this brand new phone to get it back to factory settings. Once I did that, the Quick Start screen popped up and things worked as they were supposed to. (Actually, I had to erase it three times. The transfer didn’t work the first time because I guess I wasn’t properly connected to appleID on the old phone [that doesn’t complete make sense to me now but that was my conclusion at the time]. The second time I’m not sure what happened. But it finally worked the third time, and like I said, my wife is very happy with it.)",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life not as stated",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "I ordered this iPhone 12 mini Renewed. It said it would have a minimum battery percentage of 80% but it was only 79. Not a huge deal but it's not what it stated when I ordered it. My daughter does love the phone though but I don't know if I'd buy another Renewed phone. Buyer beware.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The features",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "This phone is small and neat and the features are amazing camera quality is good I would recommend it to anyone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone mini 12 64GB",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "El telefono esta en perfecto estado, la batería llego en 84%, en general se recomienda el vendedor"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Only thing wrong was the battery life was only 10 hrs but everything else looked brand new great condition."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cute small phone!",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "It Was in good condition! No scratches or any thing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    come in Very Excellent Condition almost like new! Did have to return it came 76% battery health.",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Came in Fantastic Condition, with a screen protector already on it. Ordered Excellent. Got this for my sister and I hope she likes it. I’ll keep updated! Tysm! Amazon renewed will be ordering from here again!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just as described",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "Just as described it great condition exact color screen had no scratches on it and it was unlocked. Only problem was it took longer than expected. Would order again from this company."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "So I got this phone for about a week for my son, so far so good, I like the phone, small little imperfections here and there but other than that great, not glitchy, battery percentage is okay for him at a 78% not too bad. Thank you!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Basically Out of Box New",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "This arrived in excellent condition, battery 95%. I really think it wasn’t a refurb, but overstock of an item Apple does not produce anymore.  I bought this specifically for its size. I don’t like large phones. I don’t like paying insurance, to get a remanufactured replacement phone . I upgraded from an iPhone 8 to this, and am extremely pleased with the faster chip.  I recommend this phone, the only downside is its inherently smaller battery than the larger editions. It’s good for an entire day with moderate use. That’s not an issue really, my car, my monitor all have fast, wireless charging.  I think of it like this. It’s a price/phone for a “ throw down “ phone. I mean, it gets the job done, and at 250$, if I lose it, no worries, If I break it , no worries.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health life",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Phone is good condition , one thing we all need to consider is…. Battery health life will not be 100%.I am concerned with this phone being small already holding up with phone usage one 83% battery health."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone Mini",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "The iPhone Mini worked as advertised. It arrived in excellent condition. I’d recommend seller in the future.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not What it Seems",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "I received this phone in good working order and cosmetically it's in great shape.  Here is my complaint and it's a big one.  After activating the phone on my network, i checked the battery life and it was at 73%,  Renewed Premium phones are supposed to have a battery life of at least 90%.  I ended up spending an additional $89.99 at Apple to replace the battery.  It's obvious that Amazon is not checking the battery life on renewed phones or renewed Premium phones and the sellers know it.  Very hard to return phone after you've activated it and switched all your iCloud data to new phone already.  Buyer beware!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Tardo un poco en llegar pero todo bien",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "El equipo estaba bien para el precio quizá un poco raspado pero solo eso"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I phone 12 mini",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Nice phone they said at least an 80% battery but it had 93% it was also easy to setup"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good condition, on the outside.",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "I decided to pay a bit more for the renewed IPhone 12 Mini in “excellent condition“  the phone is in overall great condition n the outside, no scratches or scruffs on the phone, but the problem is when a product is advertised as “In Excellent Condition” and marked up for that condition I’d expect the hardware to also be in great condition and that’s not the case when the phones battery is at 77% capacity and has a message saying “Your phones battery needs replacement” the phone can be perfect on the outside but it’s not worth much when you can only use it for 2 hours before it dies. If you pay extra for the “excellent renewed condition” check the battery and make sure it’s actually in excellent condition, gonna have to pay another $100 to have it replaced now because they decided not to actually renew the phone.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s not bad of a condition but acceptable",
      "date": "Reviewed in the United States on June 19, 2024",
      "body": "It arrived quickly! But was expecting the product to be in excellent condition as it says on the description below “Refurbished- Excellent” I received a few scuffs around the corners of phone and a small dent on the left corner. I would list this phone as a good condition phone rather excellent. But the battery health is still good of 86%. Still lasts great. Saw the history of the parts, it is a Genuine Apple Part which is great. In conclusion the scuffs and the dent does not affect the performance of the phone as I can easily cover it up with a case, so it’s not noticeable. But probably next time when I buy a phone from Amazon it would be “Renewed Premium”",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Muy buenos"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Iphone 12 mini 128Gbi",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Compre calidad buena, todo esta super perfecto, le funciona absolutamente todo, me llego sin piezas cambiadas, unicos detalles fueron estéticos, unos rayones en el modulo de camara y en los alrededores pero no afectan su funcionamiento, y me llego con 100% de batería",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okay",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "The phone arrived with little protection. The sides of the phone are all scratched. And the phone freezes every now and then but it is used so I wasn’t expecting much."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery lofe",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "Everything was in pristine condition. There was even a screen protector already in place I’m very satisfied with everything. The only thing that I had an issue with is I have 84% battery health for a phone considered an excellent condition. I would’ve hoped to have a little bit higher battery life it should’ve been closer to 90% in my opinion I saw people who paid for good or acceptable condition and had higher battery or same battery as I do. I would’ve been cool with a couple nicks and scratches to have received a better battery, other than that, everything is great putting my Sim card in my generic phone service. It worked properly with no hassle or haggle good purchase overall.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can’t beat it for the price",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "There was basically about as much damage as I would cause in a single day without a case on the phone other than that it functions perfectly beautiful condition. Solid battery over overall couldn’t be happier."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    i absolutely adore!!",
      "date": "Reviewed in the United States on August 24, 2024",
      "body": "i've never ever written a review on amazon everr before, but i had to leave one for this. my 11 broke on me a few days ago, and i needed a new phone for cheap ASAP. there were a few bad reviews on this that made me a little bit skeptical.. but once i got the phone i fell in love!i ordered the 12 mini in green and it came in perfect condition, literally sparkling when i opened the box. the screen was clean and perfect, and i saw no physical issue at all. the box came in with a lighting cable (along with the phone) which was sweet.i was also worried about battery life/health and prayed that it would be above 80% at least. so when i checked and it was at 82% i was relieved. not the absolute best, but i'm not complaining because of the awesome price.if you're thinking of buying, i say go for it!! the 12 mini is so cute and pretty stable/sturdy in my opinion (i played roblox on it already). i'll be buying phones (if necessary) on amazon renewed from now on as well :))",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched, many parts have been replaced with aftermarket",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "I bought an Iphone 12 mini in \"excellent\" condition first. All scratched up and if look very decently used. Did not care much, since I just want to use it as dashcam. Battery was at 100%- meaning it was replaced. Good and bad... since I got a message that the camera was not genuine also. So phone was damaged. Camera and battery were replaced. Problem is they got replaced with non-genuine parts. While I have nothing against aftermarket parts when I have to replace them, I have an issue when someone sells something and not disclosing that. I would rather have an old non genuine battery than a new aftermarket. Also the way Apple has been working lately what's from stopping them disabling my non genuine camera. They try doing it before I believe people were outraged and they stopped and even a law- The right to repair was also introduced because of that. Either way bought another refurb phone after returning this one. That one I got it with the lowest possible condition- \"acceptable\" or something. Also, the cheapest. Honestly as far as scratches they look identical. This one battery was at 88%- so it hasn't been replaced and no messages about non genuine parts. So I guess my advice would be to go in with a lot of expectations about these and my opinion just get the cheapest possible. Chances are you will still get the same condition unit.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Absolutely Awesome!!",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Absolutely Amazed Recived Phone Very Quick The Description Advertised The Battery At 80 Percent But Nope I Get Max Charge IPhone To Me Looks Brand Spankin New. Highly Recommend Ordering From Here."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good quality for the condition",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "When it said acceptable I was expecting worse, but it was in very good condition. Similar to what other websites would mark as very good at least."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You can trust is!",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "Okay let’s be real I was so skeptical about buying off of Amazon for a new refurbished phone. But I was pleasantly surprised. The battery capacity was 100% came with a screen protector fully charged when I received it and in great condition. Cell surfers has a great return policy if nessciary but so far so good. I am a very skeptical person and buying a refurbished phone online was always a little nerve racking for me but this phone has exceeded all my expectations so far. I trust cell surfers and you should to it was fast free shipping and they provided me with a return shipping label if I needed to send it back for any reason. Ships from the USA so I received it in 2 days. I have recommended this phone and company to everyone recently and am very happy with my purchase thus far. Will update if anything changes. If you are skeptical like me take the leap its worth it and if I doesn’t turn out like you expected they have the same return policy as Amazon so you can trust them. Great purchase!",
      "helpfulVotes": 2
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DON’T BUY IT",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I rarely write reviews, but in this case, I think people should be warned. I’ve been through four of these phones in a couple months, and they have all had major issues from Camera not working to audio issues, and the worst of all one COMPLETELY DIED after four months.Unfortunately, the Amazon warranty is only three months. (I thought it was one year because other competitors offer that. But it does clearly say on their page that it’s only three months.) During these three months, they to completely refund you no problem or fix the issue that you report. But unfortunately the phone I kept died on month four, while I was on vacation to make matters worse.Seems like the sellers are always different stores, but all amazon approved and they follow some sort of Amazon standards for these phones. But it seems to me that these phones have really severe issues so these Amazon sellers fix the phones to a certain standard, but they are not in good condition.All the sellers are polite and responsive, but the issue is the actual phones and their conditions. Even though these phones are used, they are not cheap, they should function properly.I’ve been an Amazon customer for years and I really haven’t had any issue with them. That was the reason why I decided to buy the used phone on Amazon instead of a competitor. But this is truly disappointing to the point that I think I’m going to report them to the Better Business Bureau. They should not be selling phones in this condition.FULL STORYPhone 1: iPhone 12 mini (Ordered good condition )Received Mid OctoberSeller: Kojak salesWhen I receive the phone physically it seems fine. But as soon as I put a case on it, a lot of little pieces of paint started coming off of it and then you could tell it had a lot of scratches on the case so somebody was trying to cover the scratches, then I put a screen protector on it, and after trying to I could not get rid of a humongous huge bubble, took a third of the screen. So some thing was hinting to me that the screen was not straight. In my opinion, the phone shouldn’t have been sold as good condition with so many scratches but since I don’t care about the look as much as functionality, I move forward. But then, after a few weeks of using the phone, I realized things were not working properly. The camera was very slow at taking pictures if it was dark or if you were using inside the message or WhatsApp. Also, if I received a text while listening to videos or video calls, the speaker would suddenly gets super low, and I could barely hear the video for about two minutes . (usually this lowering of audio feature happens only for five or 10 seconds).This was worrying me so I contacted the seller and told him I wanted to change the phone and he said no problem. Since I was still thinking that this was bad luck, but in general, I liked the iPhone 12 I decided to buy another phone as a replacement, and one more phone as a Christmas gift. I’ll explain below the problems with those phones, but since the problems were actually worse than the current first phone I had in my possession, I never gave back this phone. I kept thinking that maybe the issues would get better with update and also, in my mind, I thought I had a year warranty. Unfortunately, in February while away on vacation the phone one morning, simply never turned on again. My dad is an engineer and he tried helping me connect it to computer and nothing it’s like the battery is no longer connected. I’m sure you can imagine the horrendous time I had the following week without my phone., traveling.. Things got worse when I got home and was able to contact the seller. I then discovered the warranty was only 90 days and that date had passed. After some back-and-forth the seller Kojak sales said they can fix it for $39 and I pay for shipping. I have still not done this since I’m skeptical and don’t understand how they can give me a price if they don’t even know the actual problem or if they need parts. But I really have no other option, or I lose $241 or I pay $60 more. (also, I have to figure out how to erase the phone from a PC if the phone doesn’t even turn on. I’m sad I’m gonna lose all my pictures from the last four months)After I send them the phone, I will update this review.-Phone 2 and 3- iPhone 12 mini (Ordered good condition )Received Mid  begging of decemberSeller: WilzeeSo one of these phones was supposed to be replacement for my phone and the second phone was gonna be a Christmas gift. But the first one was so scratch that I didn’t even set it up and I gave it back, no problem and the other phone after giving it as a gift, a little embarrassed with all the scratches, we set it up and realized the camera did not focus at all so I also gave this phone back and received a refund no issue.-4th Phone-  iPhone 12 mini (Ordered EXCELLENT condition )Received mid JanuarySeller: PDI MobileThis phone did actually look really good in the outside barely any scratches. I was very happy with the look. But after setting it up again, the camera could not focus so we contacted the seller and sent it back and they fix the camera then after a few weeks of using also, it has audio issues. We’re looking at social media videos suddenly that audio lowers  a lot. Since at this my 1st phone died suddenly we decided to give this 4th phone back. I don’t wanna take any chances since the quality of the phones is clearly not good. I don’t expect an issue with the refund. But I will update this review if I do.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its okay",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I got this phone one year ago. Its my first iPhone.Pros- Came in essentially perfect condition appearance wise, no scratches or damage.I personally like the size, not too small not too big.Cons- Battery life is terrible, I have to charge it a few times a day. When I got it the maximum capacity was at either 84-86%, now it’s at 80%. Camera isn’t that great, photos look dull like there’s no color saturation. Laggy at times with loading, whether I switch between WiFi or phone service it’s the same. Storage isn’t great either at only 64GB.All in all it’s probably a good starter iPhone for a child but as an adult it’s lacking in some areas.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn’t get what I thought I was getting",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Bought the iPhone 12 mini and was shipped and received the next day. Awesome speed on the shipping. How ever the add said it was for Verizon and I received a random unlocked iPhone. Ok no big deal. I called Verizon to have my line switched over to the new to me iPhone  and they said they can’t hook it up cause the phone came from Europe and it would take a few days to change it over to the US specs. Not the happiest customer."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of BATTERY!",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "The iPhone 12 mini, refurbished was visually in great condition. Purchased in September 2024. The touchscreen didn’t seem sensitive enough. I tried changing settings, but still bothersome, especially around the edges. After warranty was out, several issues began with the battery. The first month or so, it required charging twice a day, with or without excessive use. I liked the size so much and the fact text messaging was a breeze, I tolerated it. December 2024- Then the battery began getting really hot. The touchscreen stopped responding. I removed the cover and even took the screen protector off (I was panicking)! I forced it to power down. After powering up again, I ran it in low power mode, which seemed to help and kept the phone functional. January 2025 - The phone would say it wasn’t charged, plug in and it indicated 70 - 89% charged; unplug, 2 -3%. Phone gave a message: Battery not recognized. Look in explanation, the battery is not Apple and may be incompatible. Next day, thankfully, it upgrades. Since then, screen sensitivity is much better and the battery seems ok. It doesn’t need charging as often. I just really enjoy that text messages are sent and received so easily and I don’t feel like I’m carrying around a mammoth of a phone.  It also seems faster on the internet. Those are the reasons that I gave 2 stars. Also, it’s in a case and the screen has several cracks, from low level drops. This might be an Apple issue. The only other electronic device that I own that has cracked, is an iPad. No cracks on any of my android refurbished phones. In fact, I still have two around the house to use for shopping, internet searches, etc. This may just be the “luck of the draw” and I just happened to get a lemon. I’m going to try to limp along until at least a year, just to not feel too bad about spending the money. But when I buy, it will DEFINITELY be Android!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery health, missing charger, dirty device",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "While the phone was priced decently, the actual device was dirty (gunky sides and around the camera and silence button), and the battery health is only 82%. Also, the charger was missing. I needed the phone, so I didn't want to have to wait and go through a return. Phone functions ok."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery!",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I received this phone, I ordered excellent  condition, I received the phone it was fine on the outside minimal to no scratches and has a screen protector. But the battery health is at 76% and it heats up so fast. Do not buy from this company. Amazon renewed is promised to have 80% and above!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    come in Very Excellent Condition almost like new! Did have to return it came 76% battery health.",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Came in Fantastic Condition, with a screen protector already on it. Ordered Excellent. Got this for my sister and I hope she likes it. I’ll keep updated! Tysm! Amazon renewed will be ordering from here again!!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not What it Seems",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "I received this phone in good working order and cosmetically it's in great shape.  Here is my complaint and it's a big one.  After activating the phone on my network, i checked the battery life and it was at 73%,  Renewed Premium phones are supposed to have a battery life of at least 90%.  I ended up spending an additional $89.99 at Apple to replace the battery.  It's obvious that Amazon is not checking the battery life on renewed phones or renewed Premium phones and the sellers know it.  Very hard to return phone after you've activated it and switched all your iCloud data to new phone already.  Buyer beware!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good condition, on the outside.",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "I decided to pay a bit more for the renewed IPhone 12 Mini in “excellent condition“  the phone is in overall great condition n the outside, no scratches or scruffs on the phone, but the problem is when a product is advertised as “In Excellent Condition” and marked up for that condition I’d expect the hardware to also be in great condition and that’s not the case when the phones battery is at 77% capacity and has a message saying “Your phones battery needs replacement” the phone can be perfect on the outside but it’s not worth much when you can only use it for 2 hours before it dies. If you pay extra for the “excellent renewed condition” check the battery and make sure it’s actually in excellent condition, gonna have to pay another $100 to have it replaced now because they decided not to actually renew the phone.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okay",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "The phone arrived with little protection. The sides of the phone are all scratched. And the phone freezes every now and then but it is used so I wasn’t expecting much."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched, many parts have been replaced with aftermarket",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "I bought an Iphone 12 mini in \"excellent\" condition first. All scratched up and if look very decently used. Did not care much, since I just want to use it as dashcam. Battery was at 100%- meaning it was replaced. Good and bad... since I got a message that the camera was not genuine also. So phone was damaged. Camera and battery were replaced. Problem is they got replaced with non-genuine parts. While I have nothing against aftermarket parts when I have to replace them, I have an issue when someone sells something and not disclosing that. I would rather have an old non genuine battery than a new aftermarket. Also the way Apple has been working lately what's from stopping them disabling my non genuine camera. They try doing it before I believe people were outraged and they stopped and even a law- The right to repair was also introduced because of that. Either way bought another refurb phone after returning this one. That one I got it with the lowest possible condition- \"acceptable\" or something. Also, the cheapest. Honestly as far as scratches they look identical. This one battery was at 88%- so it hasn't been replaced and no messages about non genuine parts. So I guess my advice would be to go in with a lot of expectations about these and my opinion just get the cheapest possible. Chances are you will still get the same condition unit.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Received it late do to it being Christmas time but overall a very good product!!",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I didn’t like that my package came late, but it was around Christmas time. But overall love the product and would definitely order again."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Damaged and used not new or like new",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Phone works but damaged screen goes in and out won’t last long but will do for now…"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    79% capacity",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "why the battery is so bad…I orderes excellent condition"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery falls off",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Honestly its an easy fix but inconvenient, phone work just fine its just that the battery sometimes will fall off and you have to squeeze the phone really hard to set it back in place. Also the phone does overheat and dies really fast but for the price of it i guess its not to big of a deal."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I ordered this phone June 10th 2024 and have loved it. But it is now Oct 6th 2024 & phone is dead.",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "It worked flawlessly for just short of 4 months. Never had a better phone. But my takeaway from this experience is to order \"renewed premium\" for electronics from amazon rather than \"renewed,\" for one reason (buried in the fine print of course.)\"Renewed premium\" gives you the buyer 12 months of satisfaction guaranteed coverage, whereas \"renewed\" gives you a mere 3 months of the same. My phone had not been abused or subjected to moisture in any way shape or form, so 4 months of cellphone service for $240 feels suboptimal, when paying slightly more for a whole year of coverage would be much less so.I'm now tasked with \"repairing\" a phone i've owned for less than 4 months and now need to repair or replace at my expense. I did nothing negligent (water damage, dropping it, etc) to get to this point.It is a great phone, but I hope to spare other buyers what I have just gone through.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My only issue was the lack of communication",
      "date": "Reviewed in the United States on March 9, 2023",
      "body": "While I am completely satisfied with what I got, I was made anxious by the fact that there was little to no communication between me and the product stages. I was never told when it was processed, never received updates on location for the product and I paid two day shipping. While Amazon maintained the idea that it would be delivered on the 6th at 10pm, I was never told when it was even out for delivery! I was at college in the middle of class at 6:45pm when it was dropped off. I know and realize that they did complete the agreement of 2 day shipping but I ordered the phone at the end of February and they couldn’t process or ship it until the Friday BEFORE the deadline? Kinda ridiculous that I even paid two day at that point. I would ask for a refund but they fulfilled their contract with little time to spare, but it’s complete none the less.As for the phone: All in all, for a refurbished mini, I expected the battery life to be equal if not a little less than my current SE (2nd gen). I was right as it arrived with 86%. Not awful, what I’m used to. The phone works well and runs as smooth as I could have hoped. Set up between two iPhones is a breeze now and I highly recommend the direct transfer over the iCloud if you’re someone like me who has had Apple devices since 2011 (I don’t need to text my peers from high school or my ex boss…). The color purple was stunning and everything I wanted! No dings or dents in the body or on the screen. I have loved this phone since it came out as I have tiny hands and gripping this phone makes it feel like I have normal sized hands!To summarize: The phone is great, the processing and order fulfillment barely passed requirements with a lack of communication. For an expensive purchase, I expect to get updates as regularly as I do my weights I ordered.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone works fine, screen replacement left something to be desired.",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Works fine, annoyed the screen has these air bubbles in it. This is a photo WITHOUT a screen protector."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked - can't use data service through a sim card",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Front Camera takes nice photos, but it stalls for more than a few seconds sometimes when taking pictures.Selfie camera is horrible (lol - it's the camera!!!)Assuming it's my wifi, and not the cell phone, often times search engine web pages take extremely long to open.Otherwise, works well."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery condition",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "The phone works great in general. But the battery condition is poor. I bought this phone in October and I received it with %78 of battery condition. So I have to buy a new battery.You have to improve and check it."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing Durability – Not Worth It",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I purchased the iPhone 12 Mini last year, and while I loved its compact size and overall performance, I have to say that the screen has been a major disappointment. Despite using a screen protector, the display broke easily, and I ended up having to replace it twice within just a few months.To add to the frustration, the fragility of the screen caused me to lose the Face ID feature. Ultimately, I decided to upgrade to either the iPhone 13 or 14 because I couldn't rely on the 12 Mini anymore.While the phone has some good qualities, the screen issues really overshadow them. I wouldn't recommend the iPhone 12 Mini to anyone looking for durability. There are definitely better options out there!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It comes at 88 percent 90 percent",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "The battery at 88 I bought this phone for my job not wanting to use my personal phone and a stage phone  I use it all the time and the battery 84% life im going to replace battery which is 89 dollars because I use this phone for everything",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone Review",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "The Product Says Exellent Refurbished even tho it came with scratches on the front and some on the back And the Battery Says It's Not Genuine For what I paid the condition could of been better.👎🏻"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is not what was expected.  My old iphone had much better battery",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "The phone was immaculate, although the charger was just a cheap chinese model.  I use my old one.  Not happy with battery life, it only lasts 24hr even when not in constant use."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condition",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Condition is marked as excellent but ever other time I’ve bought renewed excellent meant minor scratches on body but perfect screen with above 90% percent battery health. This screen has some pretty deep scratches so after trying 3 different types of screen protectors hoping the higher dollar ones would stick better, none still truly stick all the way due to the scratches on the screen. Like there’s more scratches on the screen than on the body of the phone. The battery health is only 85%. Overall is it bad? No. But I wished I would’ve just gotten the one through Verizon instead.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful with your purchase",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Let me preface this by saying that some of this is on me for not verifying my purchase. I purchased a phone from amazon (amazon renewed) in May of 2024 to use for developing a new app. I did not (at that time) need to connect it to a cellular network, so I did not. On that front the phone is great: fully functional, great physical shape, and the settings showed that it was carrier unlocked, as expected.January of 2024, I'm at a point where it does need service, and after several days and efforts, I find that while it's unlocked, it only works on T-mobile's network. So not what I wanted, not what I was expecting, and not what I paid for.However, I should have checked half a year ago during the return window. It's a learning experience. When you get a renewed phone, make sure what you bought matches what you were sold."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too tiny, keyboard too small.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "This particular Iphone 12 mini, that I received, seems to me that it's been returned before. It had too many scratches  around  the edges. The power bottoms , and the bottoms in general, are hard to operate. There is no way to know, where this phone came from, means the previous owner, or owners. When I turn on the Iphone, seems like they did not erase to factory settings. It was very difficult to do it. The price was too high for that mini phone. I do not recommend to buy it. Specially renewed, you have no idea the conditions of the phone. And the keyboard is too tiny. Sorry, did not feel happy about it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The battery percent",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Didn't receive the cable just the phone came in the box"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    apple iphone 12 mini",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "didnt have long before it started wrking slow"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is normal to heat up a",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "It heats up when I charge it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No sound when not on speaker",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "That I can’t hear people."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not so much \"good\" condition",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "I paid the higher amount because i wanted a phone that looked fairly new. The cameras are scratched, and there is a scratch on the screen. Was buying this phone as a gift for my teen but now I feel kind of bad because of the condition the phone is in. Still yet to get it fully activated so I may be updating my review.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Busted",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Received a faulty iphone. The screen was flickering and the edged of the phone would not register my touch. The phone would read random taps at times that I did not perform. 10 minutes with the phone on and the screen went black. Could still hear the sound notifications of the phone charging or calls. They are able to get me a refund after a return but I would stay away from this seller. Not worth the hassle of having to gamble and see if your phone works or not and then send it back.Updated to 2 stars because customer service was helpful."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Eh",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "For the price, the phone was OK. If I had turned in a phone, I never would’ve turned it in with the amount of dings and scratches that this one had. It won’t take my face as an ID because there is something wrong with the camera and I am not going to spend the money to find out what it is"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm very disappointed.",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "I ordered this phone because my old iPhone 8 finally decided to kick the bucket. It didn't die exactly but the battery started swelling. And then I found out it was at risk of blowing up in my face. Literally. Naturally I needed a new phone ASAP so I could transfer all the data from my old phone before it went off like a bomb. I didn't want to pay a ton of money for a new phone, I don't mind pre-owned stuff, and I like giving things a new life. So I got this.After the order being delayed several times my new (to me) iPhone finally arrived. I opened the package and was surprised to see that the phone was black; not red as it said it was. I was slightly taken aback but I was fine with a different color especially since I didn't want the hassle of returning it and ordering a new one. Not what was advertised but not a huge deal. I then began to transfer the data from old phone to new. When it was all set up and ready for use I opened the camera to see how much better it was then my iPhone 8's, only to see that it was as bad if not WORSE and it made a terrifying buzzing noise while trying to focus, which it couldn't. I was now certain I needed to return it, but just for funsies I decided to check the battery health. It was at 75% (below the guaranteed level) and said it needed servicing. I just returned the phone.This is more a review for the seller (Wireless Source) than it is for the general refurbished iPhone 12 mini as I know there are many different sellers selling the same product and quality varies quite a lot. I'd really like to give them the benefit of the doubt because it totally could have been just a fluke, but I won't ever feel confidant enough to order from that seller again.A word of advice. If you are buying a refurbished phone check the seller's rating over the past 12 months by clicking on 'Sold By: Whoever'. It could save you from a bad experience. I just ordered another refurbished iPhone 12 mini. I clicked on the seller before I hit proceed to check out and they had a 78% positive rating. Because of that I ended up getting one from a seller that had a 99% positive rating instead.TLDR: The phone was not how it was advertised, it was crappy, I returned it, I got another one from a better seller.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Right side of the phone did not work",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "The phone turned on the whole right side of the phone did not work and the left side did work, and the  screen of the phone was green, then whenever i powered off the phone it would show a green spiral in the background not to mention the fact that the phone stopped working and just started leaving a message on there every time i turned off and on the phone. this phone was terrible, i don’t see how someone could sell this, its not worth the price thats all i have to say. $200 wasted"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the greatest…",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "I purchased 3 of these. 1 set up with no issues, everything works as it should but the battery does not have a good life-it has to be charged multiple times throughout the day. The second one set up ok but you have to use  a passcode as the facial recognition feature won’t work (it says to take it to an Apple Store to be fixed); it also doesn’t have a good battery life. The third one…it frequently won’t make or receive calls, has static, poor battery life, & also won’t set up facial recognition (though it doesn’t say to take it to Apple Store). We are greatly disappointed & will be looking for new phones soon.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera focus defect with newest software also limited return locations",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Beware!  Current software 18.2.1 makes your forward facing main camera unusable.  The focus simply won’t work.  This is a known issue if you do a search. But isn’t being talked about.  I suppose I can’t complain about the renewal, as it looks ok, sold as an excellent with numerous scratches and dings in the aluminum bezel and around the lenses.  The screen is great. But selling something that flat doesn’t work seems wrong.  Will be returning it for a se gen 3 which is a great little phone.  Also be aware that returning this is a hassle.  The convenient ups and kohl’s drop off is not an option, Whole Foods 13miles in traffic, and specialty locker 18 miles are the only options.  Not happy!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Annoying",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "For this mini iphone, Apple replaced the home button with a swipe up from bottom feature to exit a webpage or app to return home. On many pages it takes multiple swipes to find the sweet spot to exit the page, especially on pages that load extra content at the bottom, such as chat boxes, advertisements, etc. The email app is especially difficult to exit.The extra screen space gained by eliminating the lower bar for the home button is negated by the annoyance level of an unresponsive new feature.Also, cannot add a frequently used app, such as Safari to the main Settings screen. Now you have to take a second step to access all the app listings in order to clear web browsing history and data."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    display scrached, battery come hot",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "the cellphone come with big scrach on screen, also become really hot on extensive use, not recomended"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone in great condition, battery is not",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Phone looks like new, but the battery is at the end of its life."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ft and call volume is muted and battery capacity is bad",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I thought this phone would be newish. But it isn’t. my old iphone 11s battery capacity was at a 84, which makes it die faster, but this iphone 12 minis capacity is at a 78 and it was supposed to be brand new.. The iPhone dies super fast and it dies when you’re not even on it. The phone was supposed to be brand new. When I call or FaceTime someone on Messages the sound doesn't work and it’s all the way up. I have to use my iPhone 11 from now on and use snapchat to call my boyfriend. I really gave this phone a chance but it’s awful I mean I can’t even hear people talking when they call me??"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Is Degraded",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "Phone overall works well and I love the size of the mini, but the product came with a degraded battery. I would’ve thought a new battery would’ve already been installed in a refurbished device. I find myself charging multiple times per day."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect trap phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Came in decent quality. Way smaller than I thought. Battery completely drains if not constantly on low power mode. It had some typing defects, a bug or a glitch that made it extremely hard to type normally. I could only use the phone for background music on Spotify while I play games or study. I plan on reselling the phone. I intended on buying a phone to replace my main phone. Not a trap phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery health, not in “excellent” condition",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Purchased a red iPhone 12 mini in “excellent” condition which promises battery health no lower than 80%. I received the phone at 78% and it showed. I’d charge the phone all night and after unplugging it, it would go down to 20% within 2 hours with moderate use. Then from 20% to 5% within minutes. It would over heat every time I’d charge it, too. This phone should definitely not be labeled as “excellent” condition. Returned & requested a refund.The phone also came with an AT&T chip already inside. It wasn’t removed from the previous owner, so I had access to their number."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 12 mini phone",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "I gave two stars because my phone was misplaced after it was delivered on the 3rd if march, finally I got my phone and it's okay,however has a lot of scratches the battery life is at 80% which is not bad.Overall it's okay for now my only issue is sis is so small not like my regular size iphone. If anything arises will update my review"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used iPhone 12 Mini",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "I recently purchased an iPhone 12 Mini, and I have a few thoughts to share based on my experience. First and foremost, it's important to note that my unit had a replacement screen. While the screen works fine, I can’t help but wonder if it impacts the phone's overall performance and longevity.One of the most common complaints I read in other reviews was about the battery life, and I have to agree. The battery doesn't last as long as I hoped. Even with moderate use, I find myself needing to charge it more frequently than my previous phones. For a device that promises portability and convenience, having to carry a charger around somewhat defeats the purpose.Additionally, I noticed that the phone had a few scratches on the body when I received it. While these are mostly cosmetic issues, they were disappointing to see on a relatively new device. It's something to keep in mind if you're considering purchasing a refurbished or pre-owned model.In summary, while the iPhone 12 Mini is compact and offers the usual Apple quality in terms of user experience, the battery life and the condition of the phone I received were letdowns. If battery longevity and pristine condition are important to you, you might want to consider other options or ensure you buy from a reputable source that guarantees the condition of the device. I ended up returning the phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A decent phone",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "I found that Amazon sells renewed phones and bought two of them.But the situation cannot be said to be particularly good.There are many scratches on the case, which are very obvious.One of them has a screen that slides up and gets stuck.The only good thing is that the current functions are normal!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "The phone is great. It says minimum battery percentage is 80% but mine came at 79%. The battery dies pretty quickly but overall a good phone and came in clutch bc I needed something cheap to replace my other phone that got stolen. It’s in great condition, just wish the battery health would have been better"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I am surprised this is considered a premium refurbished",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "I am surprised this was considered a premium refurbished iPhone 12 mini. I bought several phones off of Amazon and never had one dinged up. The battery is at 81% but only lasts 4 to 5 hours. I know the mini was notorious for not having a very big battery, but it’d be nice to make it through a work day.  However,  it was cheep."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Make sure to Buy Unlocked",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "We bought this just having our carrier in mind but it came locked. When we went to unlock the phone had an outstanding balance and was not paid off. The phone could not be unlocked. Therefore adding an eSim for international travel will never work. I know that Amazon reviews all the purchases but someone who skips out on their payment and then hacks it to Amazon puts the next buyer at risk of this situation. No one had ever told me this so I'm warning other people. Always buy unlocked! This was our mistake.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Less then “ excellent” condition",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Phone works as expected however came with less then the 80% battery health that was promised."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Battery life sucked. Camera glitched a lot. It was just to get by"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    FIND A DIFFERENT SELLER - MODEL OF PHONE IS GREAT",
      "date": "Reviewed in the United States on January 11, 2024",
      "body": "My best review advice is find another seller, because sometimes spending some extra money from a different seller might be worth it, because I will be spending $178 more.So I have two children and wanted to upgrade their phones.  Being that they are kids I got them renewed phones.  I got the phones in.  They are supposed to have 80% of the original battery health life.  They used it to stream audio for 4 hours and they were then down to 20%.  No video, no other applications going.  Even if you doubled the 4 hours you would still be only barely making the lowest estimate. I messaged the sellers.  They offered to refund, replace, or give me a $15 credit so -I- could go get the batteries replaced.  Both phones had the problem so replacement didn't seem wise.  Refunding would leave me with my kids not having a phone until I got them replacements because I had already recycled their old ones.  Oh, and the battery replacement is $89 - EACH... to use the warranty it would cost me $39 (each) - on a week old phone... So I thought ask for the $39 and pay the difference out of pocket since insurance would laugh at me doing a claim with a WEEK OLD EXCELLENT CONDITION PHONE. They might even cancel my plan for fraud.  The seller said no, and reminded me I could simply return or replace them.  I could, but then my kids wouldn't have communications for an unknown amount of time and for their safety I found that unacceptable.  MAYBE the phone you get will be better - I got two with the same problem.  MAYBE you won't need to use the warranty - I wouldn't think you would have to even consider it the first week.... the phones LOOK pretty, no scratches or screen cracks or whatever - and when I called them on the whole battery thing they DID fulfill their requirements for Amazon A to Z - but sometimes doing only what is requirred isn't kosher / right given the situation... and I was stupid enough to recycle their old phones so quickly... just know that sometimes spending some extra money from a different seller might be worth it, because I will be spending $178 more.Oh, and I didn't take their $30 ($15 for each) - sometimes it isn't about the money, but the principle.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is at 81% that’s supposed to be premium refurbished?",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "This means this phone will need to be charged more often and I wouldn’t cal that a premium refurbished phone which is too bad because I love the phone. I’ll have to replace it sooner then expected"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery was dying",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Phone works perfectly, battery life is horrible, dies waaay too fast!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I'm not sure if mine was just faulty, or what.I'm a vtuber on Twitch, and I purchased this iPhone to use an app to utilize the facial tracking Apple has implemented.I decided to purchase this refurbished iPhone in the hopes I could save some money and get the device I need.However, since I purchased this on Feb 20th, I have had nothing but problems.I believe whoever did the refurbishment process swapped out the screen with a replacement that is not approved by Apple.There are problems with the touch screen, and the phone seems to just freeze up when I go to unlock it and restarts. This happens every single time I go to use the phone. No device should freeze and restart every time you try to use it.I won't even be running any programs on the phone, I'll just go to unlock it to do something and it happens.I'm going to probably submit a return and get a refund while I'm within the 30 days, since this product does not function despite being \"Excellent\" quality. Sorely disappointed this one passed any sort of quality inspection.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok... I guess",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "It was supposed  to be in  excellent condition but got a good condition so that kinda killed my vibe and battery needs servicing so not really happy with this buy ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It just didn’t work.",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "There were deep gouges in the frame. Whatever. What really annoyed me is it would not leave SOS mode even when my wireless provider tried to help. Returned. Annoyed."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for intensive app users or gamers",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "It's a little too small that I'm always afraid of dropping it, great for general usage, but horrible if you are a gamer or use intense resource apps."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good condition and return service, defective phone though",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "Phone came in good condition, but upon use i realized the screen was defective as i would have to turn the phone off and on again to open it, as well as a green motion blur from the screen itself when i scrolled. I returned the phone and was reimbursed in a timely manner, going to try another color because i already bought a case and screen protector, will edit this review based on my next experience.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished Amazon Phones",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "Overall the phone is good, just the charge is really crappy. It doesn’t even last. A whole day. I do like the camera tho. I needed an upgrade so I’m Satisfied"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst scam ever!",
      "date": "Reviewed in the United States on June 26, 2023",
      "body": "I recently purchased a phone and to say that I am utterly disappointed would be an understatement. The moment the return date expired, the battery of this phone mysteriously stopped working, rendering it completely useless. It's truly disheartening to experience such a malfunction after only a week of usage after return date has passed.The final blow came when the battery completely died and refused to charge, no matter what I tried. I attempted different charging cables, wall adapters, and even tried charging it from my laptop, but the phone remained lifeless.As a consumer, I expect reliability and quality from the products I purchase, especially when they come with positive reviews and reputable branding. However, this particular phone failed to meet even the most basic expectations. It not only failed in terms of performance but also fell short in terms of durability and longevity.Moreover, the timing of this battery failure seems highly suspicious. It is incredibly frustrating that the issue manifested itself just after the return date had passed. It raises questions about the quality control and the integrity of the product itself. I am left wondering if this was a deliberate ploy to ensure customers are left with defective products beyond the return window.I must emphasize my profound disappointment and advise potential buyers to exercise caution before purchasing this particular phone. While it may initially appear appealing and have decent features, the lack of reliability and the unpleasant customer experience I encountered cannot be ignored. I sincerely hope that others will be spared the frustration and inconvenience that I have endured.I have reached out to Amazon's customer service regarding this matter, hoping for a resolution. However, based on this experience, my trust in the brand has been significantly diminished. I will be considering alternative options in the future to avoid a repeat of this ordeal.In conclusion, my recent phone purchase has left me feeling disgusted and thoroughly dissatisfied. The untimely failure of the battery, just after the return date had expired, raises serious concerns about the product's quality and the overall experience provided. It is regrettable that what seemed like a promising investment turned into a waste of both time and money.",
      "helpfulVotes": 43
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good physical condition / Diminished battery health",
      "date": "Reviewed in the United States on October 26, 2023",
      "body": "I ordered: Apple iPhone 12 Mini, 256GB, (Product)Red - Fully Unlocked (Renewed)I expected the phone to be in a used condition, that's the nature of renewed as is stated in the descriptions. However, the Battery Health max capacity was at 85%. Normally this should be fine, but with average use, I need to charge it 2 times a day. I've cleared out apps that were possibly running/draining in the background, but that only made a minimal impact. I've had the phone less than a week and now the Battery Health maximum capacity dropped to 84%, so I have no idea if this will survive without the need for a new battery. That's pretty disappointing considering I am switching from an iPhone Xs that should have a worse battery capacity and health yet stays charged with the same use all day.Everything else appears to be working just fine. Shipping was slow, but was stated in the order estimate. It arrived 1 day later than the 2-week delivery timeframe.I know this is the nature of ordering used, but was a disappointing experience.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker problem.",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "The price and phone overall is good BUT the speaker barely works. The speaker buzzes and is very quiet. Clearly messed up. This would be that much of a problem to me if my job didn’t have everything to do with sound (Music)."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not loud enough",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "First, I thought I ordered a black one, but got a blue one. Second, battery life is not great. It’s ok for personal use but would not be acceptable for a work phone. My biggest complaint is that there is no way to make the ringtone louder. I have even purchased “loud “ ringtone from Apple Store but I still miss a lot of calls which is very frustrating. From what I read online, this is a common complaint with the iPhone mini."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Alright phone for the price",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "When I got the phone the back was covered with finger prints and wasn't cleaned at all. The camera however was perfect! The battery maximum capacity was at 84% which is not good for long term use. The screen is horrible and is probably after market. It lags sometimes. Overall it's an alright phone for the price."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Manage your expectations with this purchase",
      "date": "Reviewed in the United States on July 9, 2023",
      "body": "I was hesitant to purchase a renewed iPhone, but I was not interested in purchasing a new iPhone with so many affordable devices available for reuse. I understood that with the purchase of a used device that there would be typical wear and tear associated with use and I was not expecting a pristine condition phone by any means.I purchased the “Excellent condition” option available for the product. This option provided several assurances: 1) The screen would be free of scratches. 2) the body would have no signs of cosmetic damage visible within 12 inches and 3) the battery would be fully functional and above 80% battery life.I did not receive that product. The screen had a substantial and tangible scratch across the lower half of the screen. I thought it was strange the iPhone came with a screen protector already installed, but I suspect this was placed to cover the deep scratch below. The camera plate around the rear camera lens was covered in visible scratches and dents around the bezel of lenses.Functionally, the phone was in good condition. The battery life is at 84%. There does not seem to be anything electronically or mechanically wrong with the device. The camera works great and there does not appear to be any internal problems with the iOS or processor.If I had received this product with purchase under “Acceptable condition”, then I imagine be happier with the purchase. I wanted to try to refund/replace the item, but I really could not afford to be without a phone through the refund process, so I decided to keep the device. However, I advise caution for those with high expectations looking to purchase this product in the future.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Error Message - Unknown Part",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "The iPhone 12 mini looked great cosmetically. There was no scratches or dents, except on little spot where the SIM card goes in, but overall great! My issue was once I turned it on I immediately received an error message that stated “Battery Part Unknown.” For a phone that was listed as “Excellent” condition I was not happy. I totally understand that a new battery may have been put into the phone and that is fine with me, however, I should have never seen this error message.The seller was great with offering several resolutions and getting this made right. I am getting a refund and sending the phone back.After checking with my carrier as well, Boost Mobile, for whatever reason they wouldn’t allow this phone to be added to their network."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seller tries to pull one over on me with a lesser quality phone",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "I spent extra to receive a phone in excellent condition, only for it to arrive with scratches and paint worn all around the edges. I guess they thought I’d just accept the cosmetic flaws and they’d get to keep the extra money.I’m also having constant daily issues with apps and the phone itself lagging and freezing. It’s not exclusive to any app. I often have to close an app and restart it when it freezes.The phone is usable and at first I believed maybe there was an issue with the apps I’m using, but then it happened with every single app. I desperately needed to stay connected, and therefore can’t just send the phone in and demand a replacement. I haven’t had funds to purchase another phone from someone else (won’t trust this seller again) to be able to send this in and stay connected. I’ve been forced just to tolerate this phone when I paid for one in top condition.Very frustrating experience.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Silent mode button was scrapped",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "Phone was in good shape except for the silent mode button had a marking on it that shouldn’t have been there for how much I paid for the phone. That’s my only complaint should be looked at a little more in-depth if your charging close to $300 for a phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "The phone is in good condition but the battery health is showing 100 but I go to 3u tools and it shows the health is 78 with 1500 cycles and the battery is horrible"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    On the fence about “premium refurbished”",
      "date": "Reviewed in the United States on March 10, 2024",
      "body": "After almost 2 weeks of use I am unsatisfied with the Amazon premium refurbished for 2 reasons. First, Upon set up I was greeted to the alert that the screen is not properly set up. Second the screen or phone is glitching while using certain apps or websites. I can honestly say that when I got the phone I was impressed because it truly looks new, but I am disappointed it doesn’t function as well as it looks. I have not yet returned my old iPhone and may exchange or return this one. I haven’t decided yet. I am hoping that an update will fix the glitch. Maybe im delusional. Phone is very usable but not user friendly at times like you would expect. -Edit- Returned phone, ordered same phone but the “real deal” from apple."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing battery life and screen quality",
      "date": "Reviewed in the United States on November 3, 2024",
      "body": "This was my first experience buying a renewed phone through Amazon. It wasn't a total disaster, but overall I would not do it again. The iPhone 12 mini we ordered was in pretty good cosmetic condition. However, there were two main drawbacks. The batter capacity was less than 80% of the original for that model. So battery life wasn't great. The other issue was that the original glass on the screen seems to have been replaced at some point in the past. The surface of the screen wasn't flush with the body, sticking up above the sides of the phone. And the glass was low quality. It cracked within a few months of pretty light usage without any serious drops."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratches",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "It is kinda scratched up a bit but other then that seems to be fine so far I think it should of been lower priced due to the scratching but that’s just my opinion"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was fine till 90 day warranty expiree",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Phone came as advertised, but on day 135 the battery failed. If it held 80% when they sold it, it should have gotten more than 4 months."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery is horrible",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Bought for my husband who wanted a smaller phone that would fit in his pocket. The phone itself works, and he really likes the size, but the battery is completely dead by the end of the day with minimal use. We should have returned but the return window was already closed."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Teléfono en mal estado.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Teléfono comprado como en excelentes condiciones. Pero en realidad llego con muchos detalles estéticos y también con la batería por debajo del 74%"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not “Excellent” Condition",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "Purchased the iPhone 12 mini in “Excellent” condition, which by definition says the body of the phone should have NO visible scratches from 12 inches away… this phone has scratches ALL OVER the body. Maybe if you held it 5 ft away you wouldn’t notice. VERY disappointing to have my spouse open this phone on Christmas Day and immediately notice all of the damage to the body. The screen and backside glass are the only parts in excellent condition."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seller responded quickly at first",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    The iPhone screen arrived scratched we understood it is used.  But then the phone is stuck in a constant loop starting up. Hard reset did not correct.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "Phone is not unlocked like it says"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone was reported lost",
      "date": "Reviewed in the United States on September 17, 2024",
      "body": "The phone arrived in perfect condition there was so scratches or anything turned on fine, bright screen, the only thing was that my sim card that worked fine on my previous phone was not working on this one. I thought it was an issue with the card itself so i switched providers and got a new phone. That one still didn't work but I still didn't suspect it was the phone thought maybe i needed extra activation so i went in store to the provider just for them to tell me no physical or e sim card would work because the phone had been reported as lost or stolen. very very disappointed seemed almost perfect but that really killed my mood today. i dropped off the phone today for the return and now i have to wait over a month to even get my money back. very very upsetting.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100% battery last 30minutes this is an absolute scam",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "There appears to be something fundamentally wrong with the battery for it to tick down 1% per minute.I'll give it a full charge and see how it peforms for another day.It was immediately dead after 30 minutes, pulled it out of my pocket done.The return process is obnoxiously difficult, you're forced to take a day off to cater to when ever UPS can come by and pick it up.Wait I can't take it to the ups store across the street?absolutely not because of the battery label we tell you to print out and place on the box.\"Is a special label that only the UPS driver has\"\"You don't place any label\"Alright Sherlock your instructions state differently, to print this label and place it on the box.Calls the number on the instructions to setup the pickup\"Enters in tracking number\"\"Please drop off at UPS store location nearest you\"Ducking really...This impeccable logic means I'll never trust Amazon renewed, because duck they suck at it renewing things and this thing belongs in the trash.First I've ever experienced bad Amazon support.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    many glitches not sure why",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "I purchased this phone a month ago to replace a stolen iphone 13 and I have a lot of problems and glitches with it.  The side buttons go out, it over heats very fast, freezes up.I do not know if this is the phone or my carrier but this is one of the most glitchy phones I have ever had.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    cascading sets of issues",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "I wish we had returned this phone within the time window. Within a month of getting it, the phone was powering off every 5 minutes. Our local repair shop found that the battery wasn't attached so they did that for us free of charge. Yay! 6 months later, it was doing the same thing. So we paid $70 to replace the battery. About 6 months later, the phone was not working again. $220 later, we had a new lightning connector assembly and another new battery. So this $320 phone has turned into a $610 phone. Plus a lot of time invested in dropping it off for various repairs."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPhone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Speakers didn't work, so it's being returned. The return process hasn't been a nightmare though, but it is inconvenient."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Third Party Parts",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "The price is solid but they use third party off brand parts that are prone to breaking or wearing out much faster than apple products."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Batería",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "La verdad está impecable, pero 75 de batería, durará muy poco tiempo sin tener que cambiarla! Pff"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thought it would in better shape",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "The phone came with a lot of scratches on the frame. Battery is at 86% which seems low for a good condition."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer beware",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "I should have read the reviews.  The mini's battery life is short.  But the biggest issue is that a few weeks after I bought it, the camera function freezes up, which I assume was the original issue.  Well, it's not fixed.  I did buy insurance but the problem is intermittent and I just don't have the time to deal with it!  It's always a gamble I suppose with refurbs but it's annoying."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lost Bluetooth ability quickly",
      "date": "Reviewed in the United States on June 21, 2024",
      "body": "This iPhone 12 mini lost its ability to connect to my car within just a couple of weeks. A trip to the AT&T store and it was restored by resetting the network. The battery doesn't even last one day. I do like the phone, but will probably get a different one in a year or so. The company did send me a different color than I ordered, but since color doesn't make the phone, I kept it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Made a descent gift",
      "date": "Reviewed in the United States on August 24, 2024",
      "body": "My mom needed a replacement for her phone so I purchased this for her. She has encountered some technical issues with sounds when originally received but she was able to solve it. Not so expensive and it made a great gift. Looked great. Camera does work great. Not so heavy as it is a light phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bit of a risk, took 3 phones to get one that worked properly",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "Have ordered this item 3 times to get one that works properly. First one from Techrific Deals, both earpiece and main speaker did not work. Second phone was from Hybrid IT, listing states the renewed phone should have 80% or better battery, this one was at 77% and also stated it needed service because it wasn't working properly. The Third one was from Synergy, works perfect, the battery is at 85%. Finally got a working phone after a week and a half of trial and error. Amazon as usual has been great with returns."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great as a phone, bad as a camera.  Ordered two and both had broken cameras",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "Great as a phone, bad as a camera.  Ordered two and both had broken cameras.  Apparently the lenses are very delicate and the focus lens gets broken on first impact.  First order had broken camera so ordered another which also had broken camera."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t recommend",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "The phone came in great physical condition but the battery life is absolutely garbage!!!!! If I could return it, I would. I woke up with my phone at 100% at 720am. Started texting my mom at 730. I checked a few emails, scrolled on Facebook,by 930, the battery life is at 30%. Granted, I wasn’t on my phone that entire timeframe. I have my cellular data, Bluetooth, turned off so it’s not searching. I continually exit out of all my apps so I don’t have apps running in the back ground and it’s going dead. The picture and sound is great but I can’t get pass the battery life.I purchased the phone in may but I was saving it to use once my husband and I moved overseas. I’ve only been officially using this phone for a week.  And it hasn’t been consistent bc I was still using my stateside phone until I got this new iPhone connected to my new phone service.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not original display",
      "date": "Reviewed in the United States on September 1, 2024",
      "body": "I received green color but ordered white 😁 some scratches behind is not a problem for me, I can use case. But display appears like not original, so it’s possible to see white spots on the screen. Maybe for this money it’s ok  🤷🏻‍♀️ battery 88%",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Aftermarket screen",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "This product is refurbished however the screen is very unresponsive to touch, only works half the time. I anticipate it is not a OEM replacement screen on it. To much of a pain to return at this point."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was expecting better",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "Can't expect too much with a refurbished phone. Have to meet it was in great condition, however the battery quality is 79% and also I have to be double tapping and when  I'm scrolling its a bit difficult, which is a bit annoying to me."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Repaired with non-Apple parts",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "I now have a phone that will forever display a 3rd party parts warning as there does not seem to be any way to clear the error. This is not what I had expected, but buyer beware I guess.It also included a defective charging cable.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone mini 12",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "The next day after receiving the phone we got it all setup and my information transferred and it worked perfectly. That night the screen got red lines and a few days later I had to get a new screen that cost 140 dollars. I know it was under warranty but I didn’t want to go through the hassle of having to set it up again.If it had happened before I spent a day sitting it up I would have sent it back.",
      "helpfulVotes": 3
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone 12 Mini, 64GB, Black - Unlocked (Renewed)",
    "asin": "B08PPDJWC8",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).",
      "Please check with your carrier to verify compatibility.",
      "When you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on screen prompts to activate service.",
      "The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable.",
      "Tested for battery health and guaranteed to have a minimum battery capacity of 80%."
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$173.00",
    "url": "/gp/offer-listing/B08PPDJWC8/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B08PPDJWC8",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone, USB Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$181.05",
    "listPrice": "$216.00$216.00",
    "savingsPercentage": "-16%",
    "standardDeliveryDate": "March 25 - 26",
    "primeDeliveryDate": "Monday, March 24",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}