{
  "asin": "B0D7HWG255",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "Bought this Pixel 9 256GB new, direct from Amazon during the early Black Friday sale. The discount was even better than Google's. Phone arrived undamaged and in working, new condition. Have had the phone for a couple of weeks. No issues so far. Upgraded from a 7 year old Moto G 5. My review is skewed by my experience that is limited to budget phones.The squared edges does get some getting used to. Screen looks good, glass doesn't smear too quickly. Audio, connection, web browsing speed are satisfactory. Camera is good. Wish there was a 3.5mm audio jack and a microSD card slot like my previous phones. Phone surface is slippery to hold without a rubbery case. Haven't had a chance to try all the AI features. Haven't experienced overheating or slow charging that other people have mentioned. But I do not play mobile games, and I use an Anker 25W charger.As a preferer of smaller phones, the 6\" height of this Pixel 9 is the maximum I'd like. It is also heaver than I'm used to. I couldn't find any budget phones I liked that were 6\" or smaller, and the price is out of my normal target range. But the big Black Friday discount, and the 7 years of promised software support from Google, were some of the reasons for my purchase.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect android phone with best camera",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "The Pixel 9 is the best phone for anyone looking for a compact device, as most phones these days feel too large in hand. The camera is excellent for everyday photography, with Google's software making casual shots effortless and consistently impressive.Battery life easily lasts a full day, providing around 5-6 hours of screen time, primarily for checking emails, social media, and taking a few photos.I got it during a sale, which made it a great value for money. The design looks premium and stands out from other Android devices. The haptic feedback is top-notch, enhancing the overall user experience.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The perfect phone for most people",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "I had a Pixel 6 for several years until it died.  The Pixel 9 does everything I liked about the 6 and fixes the few annoyances I experienced with the 6...mainly the issue of failed fingerprint recognition.  On Pixel 9, face recognition and fingerprint recognition make for a seamless experience...the phone unlocks when I pick it up.Otherwise bright clear screen, fast response times and long battery life plus wireless charging have made this the perfect phone for me.  It also is much better than the 6 in maintaining Bluetooth connections.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm mainly glad",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Reviewing after switching from pixel 6a.I like 9's front design more. I thought the round camera deisgn would look vulgar and too much, but appears it's so only in the pictures and it looks even better than older pixels'. However, I didn't like the back glass, it's slippery, I'm afraid to touch the phone without a case.Battery life is good, the same as pixel 6a's to me. Functionality is perfect so far. Phone unlockability could be improved, it doesn't recognise my finger sometimes and my face during certain lights, but it's not a major issue to me.The camera quality is no doubt excellent, however the back camera's colors could be more \"alive\" and have better contrast.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera blows my mind and water proofing already save the day",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I don't know if the picture will come across on here but I live in Houston the brightest city in Texas at night. I can see stars I usually only see out at big bend. The second week I owned the phone it fell from the top of my dash into a 40oz ocean water from sonic it was completely submerged didn't even drop the call. Gemini is great I find myself using it everyday. Phone is super responsive and fast at every task. I want to play with desktop mode and do a review on that as well. I have a magsafe m.2 SSD holder with USB c connection so I have an extra 2 TB to play with. I work in very harsh environments lots of dust that ruins glasses in no time but this phone is holding up with just a few scratches even after dropping it from 15ft onto gravel screen first! I am really hard on phones my pixel 6a and 4a were great and after a short foray back into Motorola I came back to the 9 and will never look back. It's like these are the smartest phones everything else feels like an old Nokia. Seriously I don't know why anyone wasted their time on apple or Samsung y'all are living in 2006 I'm in 2060.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing phone, slippery as hell",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "You can check out youtube for the pixel 9 if you want an in depth review. The ones I watched were pretty accurate. Great phone, great camera. Works amazing. The one thing they don't metion is that holding this phone without a case is like trying to hold onto a very thin wet bar of soap. It slips right out of your hand, vibrates right off the table, and glides right out of every pocket. Get a case when you order the phone. You won't regret it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9 review",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "One of the best phone from Google pixel . Design and build quality impressive.Software feature next level...",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I had the Pixel 7 before and felt great change,Battery is better and there is a great upgrade related to face unlock and fingerprint reader."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    a powerful pixel 9 phone loaded with Google apps",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "I bought the Pixel 9. It's a small, powerful phone with a weird bulging Camra/Flashlight area. It only comes with a USB C cable and a pin to remove/add your physical sim card.  It does not come with a charger so be prepared to spend an additional amount on Google's 45w wall adaptor.  I love that Google used minimal paper packaging. I highly recommend buying a case and screen protector to protect this investment.At the time of this writing this review, I have only played with my phone for about a week runtime.  I was disappointed this phone cannot take smooth photos of the night sky stars or even the moon (an enlarged white light source)!  However, for all other daytime casual photo taking abilities, this phone impressed me with the speed in which it takes clear, vibrant photos.  Taking screenshots of web pages is amazing since it gives me the option to take a long vertical screenshot. The fingerprint unlocking feature isn't reliable, so I don't recommend using it.  I am slightly disappointed the AI translation feature only works with videos played on the phone and the words fade out too quickly after it was spoken.  Browsing web pages on this phone is superbly faster than my 4-year-old Samsung phone. I am still learning about this phone, or more precisely google apps LOL, but I'm loving it so far.  Google Lens' ability to identify items I photograph is 95% accurate. I would recommend this phone to anyone who lives, eats, breathes and enjoys using Google apps.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9 Phone - nice phone & comes in several colors",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I was a little skeptical ordering a cell phone but this worked out excellently.  Learning to use a Google based phone was a bit of a challenge for me but it just takes getting used to.  The phone was a little smaller than my old phone but still a nice size.  For some reason the camera section sticks out farther than the back of the phone which seems odd, however the cases adapt for the extension.  It takes very nice pictures and has several cool editing features."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice upgrade",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "My Google pixel smashed and I needed a replacement fast. Ordered this Google pixel 9 at midnight and it showed up around 11am. Works beautifully and didn't think I'd upgrade any time soon as I loved my pixel 7 but I am really glad I did. Haven't had a chance to test out the camera on this one just yet but will update when I do"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good for someone who doesn't use alot of apps at once",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "All the AI features you would want. I sent it back. It was slow and laggy and overheated constantly. I love this color and sad they didn't offer it in the pro line."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it!",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I'm moving from Pixel 6A to Pixel 9 and I'm loving it thus far. The phone came a day early then said it would. It was easy to transfer service using E-Sim card. It feels like I'm in my old phone but way better."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good phone",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "This is my second Google Pixel phone. I have had other brands which I liked also. When I need a new phone was advised to try the google pixel. The first one I had was the pixel 7 which I had for a little over a year then something happened with the screen. It was cheaper to buy a new phone than replace the screen. And I need it in a hurry. I received this phone in two days. I am very pleased with it . Like the fact that it is small because it is the prefect fit for my hand"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Peony is more than pink !",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Big step forward from Pixel 6/7/8 comfortable carry/pocket size good cameras close enough to pro purist's google software plenty os/security updates makes it long term purchase, was running cool till Jan update then started getting hot ? Reset/uninstall/reinstall not much changed not many reports of it getting hot yet mine did, had heat issues with previous pixels so decided to return it, looking forward to P 11/12 as soon as google kills the Tensor i'll buy another Pixel. Overall Pixel 9 is a great phone Peony's an incredible color but.. Next time google !"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good idea",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Very good idea and I recommend this to anyone who has been looking to buy a new phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing battery life",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Amazing battery life"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "The product arrived earlier than expected and everything went well. I had a Google Pixel 6 before and I've always been happy with it. After a few weeks of using this new one I still don't have any complaints. I would definitely buy it again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to set up",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Fast shipping. Very nice phone. I was not sure about buying this off Amazon at first but everything worked out very smoothly and it was very easy to set up. I definitely recommend this phone 🤳📱👍😜",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone overall",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Great phone but the battery doesn't quite live up to the hype. I got a great deal for $550 and love the payment plan"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect, highly recommended.",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "If you're looking at buying your next Android phone, definitely choose this one. Google definitely outdid themselves on this phone. The battery life is very good. Considering this phone is made by Google, who also makes the Android OS, they were able to flawlessly pack a ton of useful features on this phone that I have never seen on any other phones. It's an A+ from me."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Size matters 🤔",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "the phone in General is Great, I just feel they should've made the 9 & 9 pro size at least 6.5 the 6.3 just feels a bit small, I'm also coming from a 6.7 Motorola edge plus lol got so use to the bigger phones. but as for performance Google pixel 9 is great, they should just bump the sizes up on the pixel 10 & 10 pro 🤔 if the price at the time I bout these 2 pixel 9's for the pixel 9 pro XL was lower I would have bought them 🤔 lol",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "A phone that exceeded my expectations, very reliable, the battery lasts all day and the camera is exceptional."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wintergreen pixel 9!",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Very nice phone. Very good camera as expected. Got in in wintergreen color and it is very beautiful. The screen size isn't very big and easy to use with one hand.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to transfer data from my old phone",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "I was worried I would have to go to a Verizon store to get help with data transfer but the phone did it seemlessly. All I had to do was connect a chord between the phones and select the prompts. The fingerprint reader works a lot better on this phone than my last. Photo quality is great and I still am experimenting with the editing and picture taking options."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Lo mejor!",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Teléfono de gama muy superior y que cuesta la mitad de lo que te cobran por un iPhone. La cámara, la velocidad de carga,  la durabilidad de la batería y la muy fácil formar de trasladar todo desde tu antiguo teléfono hacen de este equipo lo mejor que hay en el mercado."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    just buy it dont think to much its a great phone",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "amazing phone for the quality 10/10"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google Pixel 9",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "This may be the best phone I've ever bought.  I often buy a new phone every 2 years, so I've had many phones of various brands, but lately a number of Samsung models.  This time I went for a Pixel and I really do like it, literally everything about it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great replacement for my Pixel 6",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Needed to upgrade in January, and this is exactly what I wanted.  Great phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Well designed, long battery life.",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "It's a Pexel!  Not a big surprise but the battery life caught me off guard. Last night after using it for mostly phone, messages and occasional news, it was at 72%. Over night left on face down, 71%. I was able to get through the next day without charging.I do no games or movies.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First Pixel",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Camera quality is insane! I wish it had a bit more battery life but for it's size, decent."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good looking phone with good camera and satellite connectivity.",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I don't need a super duper phone. I just needed a phone with emergency satellite connectivity to replace my SPOT4 satellite messenger and take a good video, so that I can replace a couple of electronics on my trips. This phone checks both boxes. It's a handsome phone to boot. Oh, and the speaker sounds terrific too. I'm so used cheap Chinese phone with tinny sound that this phone was a treat. All at half the price of iPhone.I could've had it practically for free if I waited a few days. Mint Mobile cut their price on black Pixel 9 to $249 when packaged with 1 yr subscription of their unlimited plan for $180. I could return mine and get that one instead, but I like this white phone enough that I'm keeping it.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent Phone, Fuzzy Sound in Headphones at First",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Overall, I think this is a pretty good phone. The camera quality in the rearview is good, especially in good lighting. The front camera is excellent; it enhances the details of your face and has a crisp, clear quality. I also like the AI features of the phone. It is nice to be able to erase things that are not needed in the background of pictures. I also like adding things to the background for fun. It is fun to mess around with, but it could be better. It won't always generate what you ask for. Additionally, the fingerprint and face recognition on the phone are excellent; the phone always opens upon recognition of my face or fingerprint. In terms of the battery life, it is just okay. It lasts all day with heavy use, but I have to charge it after that. Sometimes I have to charge it sooner than the day's end if the brightness is high. I've had phones before that last for a couple of days before I need to charge them. Another issue is that if I'm running Google Maps and Spotify at the same time, the phone starts to heat up. It has never overheated from doing this, but it is something that I've noticed. Also, my phone calls sounded fuzzy in my headphones from the beginning. I know that the headphones weren't the problem because they work fine on any other device. However, I tried resetting the Bluetooth, and that seemed to fix the issue. If there the issue doesn't come up again, then I'll bump up the score to a four. However, if I have more issues with this, then I'm going to be irritated.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    One of the best cameras in a mobile phone",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Great phone at a great price. The camera is excellent. AI features are a little meh."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El mejor android",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Amo este celular, es excelente"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Love the phone.  Data transfer was smooth and easy."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is amazing, Gemini isn't.",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "Alright so the pixel 9 is an incredible flagship. However the 8 pro was as well and it costs less. I love this phone but the only reason it costs so much more than the previous generation is Gemini. Problem is, Gemini sucks bad. Just get the 8 pro.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy transfer of Service",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Works great. Easy to transfer service using AT&T. Love the updated features compared to my older Google Pixel."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s perfect",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "The display and quality does not disappoint. When I took pictures, they turn out just the same colors as in real life and love the details shown. Also, it’s efficient. You can find all types of sound volume when decreasing or increasing it by pressing the three dots. The charging speed is super quick. It would be charged in less than 2 hours if you’re not using it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Luv this Pixel 9",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Just upgraded from a pixel 7 . The pixel 9 is way superior in every way . Transfer was simple, took less than 5 minutes , everything transfered to my new phone appeared exactly how it was on my old phone even the my custom ring tone ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Pixel 3 was better.",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "This phone is evidence of the tech worlds deep overselling of AI. Out of the box, the gestures to swap between open apps on your phone and close them is virtually unusable. The gesture to circle something and Google search it, that's what's easy. Screen capture on a button on the side? Nope, launch the AI assistant, which is just the old assistant with a new name. Fortunately you can bring back the virtual buttons in the settings, rendering the phone almost functional.Just not for voice mail or MMS messages which I keep receiving errors on. Custom support chat can't even be bothered to read what you tell them so you have to type it three times, and their solutions just don't work. Up next on my list? Spending hours on the phone with their customer support.The phone feels great, but it's so slick, it slid from the center of a hardcover book (library book with the protective cover) off my side table with no force applied. Case is a must for grip. Even for flat surfaces apparently.This phone was a big jump for me from a Pixel 3 to a Pixel 9 and so far, nothing about the 9 is impressive outside of the fact that it made it through the day with battery to spare. When I got my 3 I was blown away. What I got a few days ago is unimpressive for six full years of development time.For the cost and the time jump. I wanted to be wowed. I was not wowed. The phone still takes good photos, you get good volume out of the speakers, although I think I liked the tone of my 3 better. Oh well, maybe in another 6-7 years Google will make a phone that functions better in its fundamentals instead of chasing unnecessary features in response to fragile tech trends.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "The phone works great Arrived early ,good price"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid Phone",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Sleek, fast and with no bloatware. Great phone. No complaints!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Medium quality phone, could have been better",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "After a month of use, I guess I was not very impressed with this. It works terribly during calls as the microphone turns off and you have to reset it multiple times, restart the phone or have other person call you. Camera quality is also okay, not too great for the price. I haven't experienced much heat from the phone. Screen quality is okay. Overall it gives a feel of medium low range phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "Was as advertised, clean phone, right color, very pleased with the product"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Not Great",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "Side by side comparison between my Pixel 7 and my Pixel 9 I had to wonder where is the upgrade? Surprisingly photos in both low and high lighting are near identical. The Pixel 9 photos have a warmer tint and reduced sharpness but otherwise the camera in real world use hasn't been noticeably upgraded. The UI is the same as they both run the same version of Android and they are both equally responsive. The fingerprint reader on the 9 is noticeably improved and there are a few AI gimmicks thrown in. If your phone is 5+ years old this is probably a good choice for an upgrade, otherwise you should wait for more noticeable hardware improvements.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to set up",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "It was very easy to transfer all my data and settings from pixel 7.  Time to complete less than an hour.  Only took that long because I was watching college football. Screen is superior to the Pixel 7."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for a reasonable price",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "I love this phone. I got it in pink. The color is great, and so is the shape and size. I love the camera for it too, especially the selfie cam. For the price, this is a really great phone. I can't afford a 2k phone, and this phone is already well priced at around 700-800, but it helped that I got it during a black Friday sale, so I got it for about 550. If you like android phones and like using google apps, this is a great option.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fan boy",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Google makes it, I buy it. I don't care if they have my info they make my life easier and that's worth more than browsing history. Upgraded from Pixel 7 Pro, this is smaller. I do miss the size of the 7, but trade off is more power, new exclusives and that green😍"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Todo ok",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Por ahora anda perfecto el celular, pase de un Xioami mi9 a esto, es un avión."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "Works great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't complain",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "Found a great deal and phone arrived quickly.  Not big on tech but the phone does a lot more than my last one.  The pixel screenshots and weather apps are cool.  I thought I would miss the fingerprint access on the backside of the phone on the older pixels but with the face recognition and the pretty good frojt fingerprinting I don't. The phone is a little on the heavy side.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Preordered this phone at a great price. Came brand new in box. Works great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than any other Android that I know of",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Its nice to get a phone thats not loaded with Bloatware and apps that you can't remove. No more trying to force me to use \"their\" version of assistant or Messager or voice mail and more. I'm done with that other company.  Great phone and nice price on Black Friday. Better phone for sure!! Get yourself one and let that other company know they can't force us to do anything.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phone - IDs/Helps minimize the scam calls",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "Needed a newer phone with more memory to be able use so many of today’s apps. The Pixel 9 was a good choice especially with Google supporting it with 7 years of updates. Not sure I’ll still be using this phone in 2031 but nice to have these features and security updates. This phone is great in identifying scam calls too.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente celular",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Excelente celular lo que más destaca es su sistema de cámaras muy pulido por Google.Vengo de Samsung y el cambio a android plano se nota y bastante.La pantalla de modelos como Samsung S23 es superior solo en eso bote que es peor.Lo demás todo perfecto buena cámara y en todos lo demás cumple a la perfección, contento con el cambio.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Factory Unlocked",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "This phone is carrier unlocked, but the bootloader has been encrypted and the 1 year warranty has expired.A factory unlocked phone should not have the developer options encrypted.It’s no doubt a nice phone, but not if you would like to make use of the various developer options.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I got this on sale for 33% discount.",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "I mean if the standard price was 550(that's how much i paid before tax), this would 100% be a 5 star product.  If i could give it 3.5 stars i would.  I only bought this cause cause my pixel 4a is showing some age and seems like a great phone for the next 5-7 years.My only thing is that you can't really rate a phone after a week, a month, or even a year.  I bought it cause it seemed like a pretty good deal at the time but early adopters of new technology often have that \"what if i waited\" mindset when a more polished version arrives a year later.Solid phone so far, would never pay full price for it, but if I had a crystal ball I could give a better review"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "The is good. Everything works great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "This was my first Flagship phone. Upgraded from a Samsung A53 5g. Night and day difference. Battery life is insane. Camera quality is in a league of its own. Scored it black Friday for $649. Unbelievable value. It feels like a $1k phone and functions like it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Upgrade",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "It has more features than the old phone it replaced.  Still learning what they all are."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it!!",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "I use to have the Google Pixel 5 and 6 and absolutely loved them then I switched to the Samsung Galaxy Z Flip 5, loved the phone but got a new job where that phone would not survive long in because of crumbs and icing if you know you know, so I thought about switching back to the Google Pixel I was gonna get the 8 but saw the 9 releasing soon so I held out and I'm so happy I did I love it Soo much even more so than my Samsung Galaxy Z Flip 5, the camera is way better and so is the battery Life. The phone works really smooth the graphics look amazing I'm so happy I got this phone and came back to the Google Pixel phones.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the phone",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Not much to say except that everything works well and as expected.  It has some features that I have not explored yet.  I would like to note that I had a lot of difficulty finding a screen protector that works with the on-screen fingerprint detector.  Finally I purchased a Caseology screen protector that works.  I would highly recommend using this protector. https://www.amazon.com/dp/B0D4NNBXB5?ref=ppx_yo2ov_dt_b_fed_asin_title",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "10/10Love IT"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I LOVE THIS PHONE but..",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "I'm returning it because it's so expensive, buying it was an impulsive decision and now days later I realize I'm out of $800 bucks, it's not worth it because I can get other similar-ish phones for way much less. The battery is great as well as the speed. Love the refresh rate, however the phone does heat up when on for long periods of time. Sound quality great, screen size OK -- I miss small phones. Overall great phone, but it's too expensive, so I'm returning it. ☹️",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Lo que esperaba",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Fan de los Pixel, justo lo que esperaba, recomendado."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bluetooth",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "I switched from an S24 Ultra to this phone. I lost some features I love with Samsung, but the camera is what sold me on this phone. However, I am going to return it and buy from Google as I am having issues with it connecting and staying connected with Bluetooth devices. Has anyone else had this issue?"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice phone",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "Our first pixel after many years of motorola and Samsung's . My wife is really happy with it, charged quickly, very functional, it was easy to setup, biometrics are great and camera fantastic..",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Highly recommend!",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "I've been using the Google Pixel 9 for two weeks, and it’s fantastic! The OLED display is super smooth, and the camera quality is exceptional. Google’s AI-powered image processing really impressive. The battery easily lasts a full day, even with heavy use. It’s definitely a premium phone, but worth it for the performance, camera, and long-term support. Highly recommend!",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone!",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Powerful, easy to use, intuitive design, good camera and battery life."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen celular",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "Buena resolución, buena batería."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best cell phone I ever have.",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Really good, take the best photos."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I made the switch...",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "After being an iPhone user for years, I finally decided to give Android a chance again.And I absolutely LOVE this new, Google Pixel 9!!!It feels good in your hand, is very fast and the AI features integrate into all areas you'd typically use your cell phone for.Highly recommend this device!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "It has a great size and feels like a high quality phone, all the other software features are great, overall its worth buying.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very pleased with this phone",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I will say that after buying this, i found out that with  GOOGLE Fi , you can get the phone 300 dollars cheaper if you sign up with them.  Its fine though, im so excited to have a fancy phone.  My last one was straight poverty.I am in Wyoming i want to try the satellite feature if i ever get in trouble.  But lets hope that doesn't happen!",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very good phone!",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "This is the first Google phone that I have ever used, and I am impressed. For someone who uses google services quite often, it is super useful to have a phone with all of that stuff built in. Also, the camera quality is amazing!",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Major upgrade over the 8",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "Gonna keep this short and simple, the battery is leaps and bounds better than the 8 line of phones, same goes for the processor as well but thats a given.  only complaint is how it works with some networks, I have visible from verizon and it often switches between 5G and LTE alot.  Dont know if thats a hardware/software issue or a network issue but i'll figure it out",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Me caso con pixel",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "Hice el salto del pixel 6 al 9 después de que el 6 me funcionó bien por todo el tiempo que lo tuve, el 9 de momento va todo bien y la calidad del teléfono se siente mejor que la del 6",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great camera",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I love the camera and the color, wish you could customize more of the phone like font, icons, themes etc like the one+",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Takes way to long to setup",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "I bought one for me and one for my wife.  After spending 3 hours working to get all apps setup on mine, I gave up. The copy was good but every app has to be done. individually.  We were really looking forward to this phone.  Being older there has to be a better way.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT PHONE",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Awesome phone with an awesome camera!! I love the size!! It fits my smaller hands perfect!!  Love it!!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Real good for the money",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "Working well"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "Great phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING.",
      "date": "Reviewed in the United States on November 3, 2024",
      "body": "Bought the phone for my mother, she LOVES it.The google Ui is so seamless with everything google.Screen is gorgeous.Super fast.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Works as expected. Much faster than my old Google Pixel 6 pro. Smaller too."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "This is an excellent phone. Returned a Samsung model because of all the 3rd party plugs, especially Samsung’s own duplicative apps. This is so much better using the bare OS without the constant intrusions.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mobile phone",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "Excellent phone and great price"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Battery, fast charging, fast and great cameras",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Excellent excellent excellent"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen teléfono",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "Buen teléfonoBuenos materiales de construcciónSe siente gama premium"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "Google pixel 9 I love I like everything that have",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "Bought it for my boyfriend and he loves it!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "Excellent"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent cell phone",
      "date": "Reviewed in the United States on September 6, 2024",
      "body": "I like all  the programs",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome Phone",
      "date": "Reviewed in the United States on August 29, 2024",
      "body": "Super cool AI features, durability and battery also excellent.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone, good side,Item arrived soon",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "Value for money",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth the money, item needs to be refunded.",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "The phone still lags and on occasion freezes to where the home button doesn't work. Camera isn't that much better from the pixel 6. I tried contacting amazon for 1 hour, seriously difficult to get a hold of someone, but I guess that's on purpose. I bought this pixel 9 and had it for only 4 days and it says 30 days refund, now Amazon tells me it's a non-refundable item. what a joke. I'll be cancelling my membership.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love my new Pixel 9",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "A+",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Nino abierto y ligeramente usado",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "El producto llegó conarcas de haber sido utilizado y sucio"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ABSOLUTE GARBAGE",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Not only did it take 36+ days to receive my refund but this camera quality on this so called phone was absolutely terrible! I mean come on it was like I was using a Leap Frog kids toy camera or a Nintendo 3ds camera it was that bad!! I EXTREMELY DO NOT RECOMMEND THIS GARBAGE SO CALLED PHONE!",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent Phone, Fuzzy Sound in Headphones at First",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Overall, I think this is a pretty good phone. The camera quality in the rearview is good, especially in good lighting. The front camera is excellent; it enhances the details of your face and has a crisp, clear quality. I also like the AI features of the phone. It is nice to be able to erase things that are not needed in the background of pictures. I also like adding things to the background for fun. It is fun to mess around with, but it could be better. It won't always generate what you ask for. Additionally, the fingerprint and face recognition on the phone are excellent; the phone always opens upon recognition of my face or fingerprint. In terms of the battery life, it is just okay. It lasts all day with heavy use, but I have to charge it after that. Sometimes I have to charge it sooner than the day's end if the brightness is high. I've had phones before that last for a couple of days before I need to charge them. Another issue is that if I'm running Google Maps and Spotify at the same time, the phone starts to heat up. It has never overheated from doing this, but it is something that I've noticed. Also, my phone calls sounded fuzzy in my headphones from the beginning. I know that the headphones weren't the problem because they work fine on any other device. However, I tried resetting the Bluetooth, and that seemed to fix the issue. If there the issue doesn't come up again, then I'll bump up the score to a four. However, if I have more issues with this, then I'm going to be irritated.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Pixel 3 was better.",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "This phone is evidence of the tech worlds deep overselling of AI. Out of the box, the gestures to swap between open apps on your phone and close them is virtually unusable. The gesture to circle something and Google search it, that's what's easy. Screen capture on a button on the side? Nope, launch the AI assistant, which is just the old assistant with a new name. Fortunately you can bring back the virtual buttons in the settings, rendering the phone almost functional.Just not for voice mail or MMS messages which I keep receiving errors on. Custom support chat can't even be bothered to read what you tell them so you have to type it three times, and their solutions just don't work. Up next on my list? Spending hours on the phone with their customer support.The phone feels great, but it's so slick, it slid from the center of a hardcover book (library book with the protective cover) off my side table with no force applied. Case is a must for grip. Even for flat surfaces apparently.This phone was a big jump for me from a Pixel 3 to a Pixel 9 and so far, nothing about the 9 is impressive outside of the fact that it made it through the day with battery to spare. When I got my 3 I was blown away. What I got a few days ago is unimpressive for six full years of development time.For the cost and the time jump. I wanted to be wowed. I was not wowed. The phone still takes good photos, you get good volume out of the speakers, although I think I liked the tone of my 3 better. Oh well, maybe in another 6-7 years Google will make a phone that functions better in its fundamentals instead of chasing unnecessary features in response to fragile tech trends.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Medium quality phone, could have been better",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "After a month of use, I guess I was not very impressed with this. It works terribly during calls as the microphone turns off and you have to reset it multiple times, restart the phone or have other person call you. Camera quality is also okay, not too great for the price. I haven't experienced much heat from the phone. Screen quality is okay. Overall it gives a feel of medium low range phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Not Great",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "Side by side comparison between my Pixel 7 and my Pixel 9 I had to wonder where is the upgrade? Surprisingly photos in both low and high lighting are near identical. The Pixel 9 photos have a warmer tint and reduced sharpness but otherwise the camera in real world use hasn't been noticeably upgraded. The UI is the same as they both run the same version of Android and they are both equally responsive. The fingerprint reader on the 9 is noticeably improved and there are a few AI gimmicks thrown in. If your phone is 5+ years old this is probably a good choice for an upgrade, otherwise you should wait for more noticeable hardware improvements.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Factory Unlocked",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "This phone is carrier unlocked, but the bootloader has been encrypted and the 1 year warranty has expired.A factory unlocked phone should not have the developer options encrypted.It’s no doubt a nice phone, but not if you would like to make use of the various developer options.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I got this on sale for 33% discount.",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "I mean if the standard price was 550(that's how much i paid before tax), this would 100% be a 5 star product.  If i could give it 3.5 stars i would.  I only bought this cause cause my pixel 4a is showing some age and seems like a great phone for the next 5-7 years.My only thing is that you can't really rate a phone after a week, a month, or even a year.  I bought it cause it seemed like a pretty good deal at the time but early adopters of new technology often have that \"what if i waited\" mindset when a more polished version arrives a year later.Solid phone so far, would never pay full price for it, but if I had a crystal ball I could give a better review"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bluetooth",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "I switched from an S24 Ultra to this phone. I lost some features I love with Samsung, but the camera is what sold me on this phone. However, I am going to return it and buy from Google as I am having issues with it connecting and staying connected with Bluetooth devices. Has anyone else had this issue?"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great camera",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I love the camera and the color, wish you could customize more of the phone like font, icons, themes etc like the one+",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Takes way to long to setup",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "I bought one for me and one for my wife.  After spending 3 hours working to get all apps setup on mine, I gave up. The copy was good but every app has to be done. individually.  We were really looking forward to this phone.  Being older there has to be a better way.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth the money, item needs to be refunded.",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "The phone still lags and on occasion freezes to where the home button doesn't work. Camera isn't that much better from the pixel 6. I tried contacting amazon for 1 hour, seriously difficult to get a hold of someone, but I guess that's on purpose. I bought this pixel 9 and had it for only 4 days and it says 30 days refund, now Amazon tells me it's a non-refundable item. what a joke. I'll be cancelling my membership.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Nino abierto y ligeramente usado",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "El producto llegó conarcas de haber sido utilizado y sucio"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ABSOLUTE GARBAGE",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Not only did it take 36+ days to receive my refund but this camera quality on this so called phone was absolutely terrible! I mean come on it was like I was using a Leap Frog kids toy camera or a Nintendo 3ds camera it was that bad!! I EXTREMELY DO NOT RECOMMEND THIS GARBAGE SO CALLED PHONE!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lied about being refurbished?!",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Pretty sure this phone was refurbished. Everyone I talk to hears themselves talking! I use a cheap pay by minute phone and no complaints! If you want to buy a \"new\" phone go the the real network website or store!! So disappointed ☹️😞",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No está desbloqueado para todo los carriers como dice",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Antes de comprar este producto asegúrense de revisar la guía de compatibilidad de pixel y que funcione en su país, ya que Google bloquea el 5G en países donde no se vende el producto, por normas no puedo publicar el link, pero una búsqueda rápida en Google usando las palabras pixel 5G compatibilidad países debe llevarlos. Hay muchos foros donde el tema se habla ampliamente",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of the Google Pixel 9 phone",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "This phone is very flimsy and poorly made the back is made of glass and it shattered on me in less than two months. I carried my Samsung phone in my back pocket for over five years with no problems !!! This Google Pixel phone is poorly made junk and I will never buy another Google product. Why would they make a phone case out of glass and why didn't the screen break before the case maybe I could understand that !!!",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT an UNLOCKED Phone",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "This phone is not \"unlocked\" as advertised. This phone is locked to Mint Mobile and cannot be activated by any other carrier.Addendum: The seller gave me a full refund despite its restocking fee policy. So, maybe it was just a mistake.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    broke 1st day",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "wierd glitches started when trying to leave voice messages on Whats App... then just now when attempting to open my phone (which I didn't turn off??) my pin# wasn't accepted WTH! had to remove my sim card insert it into my old Pixel 3A XL to see if my pin worked & of course it did! what a mess. return & replace maybe",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone does not meet its specifications.",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Most of the phone's claimed features do not match reality. For example, the 50-megapixel camera cannot produce images larger than 9 megapixels. Additionally, some functions available on all Android devices are completely unavailable, such as app cloning.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SIM Tray Missing",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "The phone is excellent, but it arrived without a SIM Tray.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No headphone jack",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "This phone doesn't have a headphone jack.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just okay, heavy",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "I love the shape of the pixel 9. Reminds me of an iphone. What I hate is the protruding camera in the back. It adds weight to an already heavy phone. I hate holding this phone so much because of the weight and how imbalanced it feels. If you have a protective case on, the weight is even worse.  The camera quality isn't anything spectacular as I was hoping for. I don't get why this phone was so expensive. The camera AI feature is trash. I used to have a pixel 3a and that size/weight phone was the best and it had an awesome camera. Simple is better for me."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    An inferior device comparred to Samsung",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "the only redeeming quality of this garbage is the long battery life. Camera is subpar. Settings are lacking. Operation isn't smooth. I'll be going back to samsung as soon as i feel I've gotten my money out of this POS."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid this phone if you want to call somebody and put it to your ear.",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Avoid this phone like the plague.  It sucks.  The ear proximity sensor turns the phone on while it is at your ear, your cheek pushes the screen and you don't know what happens.  Almost always hangs up on everybody.  To use it, the user MUST use a bluetooth device or the speaker phone.  Worse, when you are talking to somebody, it will not allow you to use the phone, the screen senses that your thumb is your ear, and it turns off the screen (so you have to use speakerphone to look at your phone while talking.).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Getting better - But have to factor in how Google treats employees",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "I got a Pixel 9 directly from the Google store because they offered the most generous trade in policy (Samsung needs to step it up here). I had a Pixel 7 and I will tell you objectively that the 9 is a great improvement. The camera is better than the S24 IMO and it feels more premium than older models. However, the Pixel is not as fast and noticeably not as smooth as the S24 when scrolling. They boast a high refresh rate on this model, but the icons just don't flow as smoothly as a S24 when scrolling. The difference is noticeable..Samsung has this iPhone smooth scrolling experience, the Pixel 9 doesnt.Now, why the very low review if the phone is decent? One must consider the whole picture including the ethics of the manufacturer when purchasing. It was reported to me from an inside source that Google is firing (not laying off) early career employees right before the holidays. Reading in between the lines my interpretation was that they are firing (thus damaging the careers of young professionals) vs. laying off to save a few bucks. If true, this sort of potentially unethical behavior should be reflected in the consumer sentiment and reviews. In my case this was a gift, but I would have bought an S24 for this reason on my own.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9 Pro XL inherited severe long-lasting pixel problems",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "1. Moving your non-image/video documents from earlier pixel to a new one is still mission impossible... Copying through USB-C on Windows PC is the only option (per Google sales) but the copying is broken constantly2. Still very fast battery drainage, poor power saving control,  poor WiFi-cell switching, blocked icloud email access, blocked Baidu cloud access...After all, Google is a SW company, not really a (top) device company.Great camera though."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its a good for nothing phone.",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Its a good for nothing phone. Never ever buy it, we moved from Iphone to Pixel 9 , after 3 moths it stopped working and they are asking $690 for refurbished device. Never buy this device , you are going to loese money ,,,",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    este telefono una ******",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "por favor google arreglen el soporte de google fi"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Save your money as you will absolutely hate this piece of garbage. You have been warned",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Save your money as you will absolutely hate this piece of garbage. You have been warned. It is a heavy brick that has a never ending list of settings (you will never get to all of them) all so Google can take your data from you and use it for ads and worse. Nothing on this phone is new or unique, the AI stuff is crap, the current version of Android is decidedly worse than older version, as they aren't adding good useful features. It is ALL about taking your data and marketing to you. It is time to break Google up into a handful of smaller companies (Apple needs to be broken up too).",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow charging, blurry pics and bloat",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "My pixel came preloaded with every single Google app. Many like Google TV will not uninstall. The wireless charging is terrible. Going from 30%, with adaptive charging disabled, using a 15watt charger takes 8 hours!! Pics in low light have a hard time focusing. Trying to get a pic of textthat isn't blurry is difficult. Definitely a downgrade from other flagship phones.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is good but heats a lot esp when charging",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "Heating issues, heating issues do not go away after initial usage/updates. Gets uncomfotably hot when charging. Returning and evaluating other options.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wanted to like it.",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "The dimensions are good.The pictures could be better. The performance could be better. Compared to my s20, this phone lags a noticable amount. The screen looked like it had burn-in or splothiness that wouldnt go away (onvious grain).  Photos are meh.  The call quality is crap, it's processing of information is slow, And it's 4 years newer. I wish I never bought this phone. Keep searching."
    },
    {
      "reviewerName": null,
      "title": "Según yo tiene varios bugs es sistema operativo de Google.",
      "date": "Reviewed in Mexico on February 17, 2025",
      "body": "Tiene bugs"
    }
  ],
  "productDetails": {
    "productTitle": "Google Pixel 9 - Unlocked Android Smartphone with Gemini, 24-Hour Battery, Advanced Camera, and 6.3\" Actua Display - Obsidian - 256 GB",
    "asin": "B0D7HWG255",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Google Pixel 9 with Gemini gets the best of Google AI first, so you can take amazing photos, make edits like magic, and get things done even easier",
      "Unlocked Android phone gives you the flexibility to change carriers and choose your own data plan[1]; it works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers",
      "The award-winning Pixel Camera includes a 50 MP main sensor for incredible image and video quality, and a new 48 MP ultrawide camera for stunning Macro Focus",
      "Make your photos better than you can imagine with Google AI; take a picture and be in it too with Add Me[2]; Best Take helps everyone look their best; and with Magic Editor, you can reframe photos, reimagine the scenery, and more[2]",
      "Get more info quickly with Gemini, your built-in AI assistant[3]; instead of typing, use Gemini Live; it follows along even if you change the topic or switch the question[30]; and Pixel Screenshots helps you save things you’ll want to remember later"
    ],
    "boughtCount": "400+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Google",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$749.00$749.00$749.00",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$624.99$749.00$749.00",
    "buyUsedAvailability": "Only 1 left in stock - order soon.",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "MaxProductSales (SN Recorded)",
    "soldByUsed": "MaxProductSales (SN Recorded)",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 9,
    "startingPrice": "$624.99",
    "url": "/gp/offer-listing/B0D7HWG255/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0D7HWG255",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Google Pixel 9",
        "SIM Tray Ejector",
        "1m USB-C to USB-C cable (USB 2.0)"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$749.00",
    "listPrice": "$899.00$899.00",
    "savingsPercentage": "-17%",
    "standardDeliveryDate": "Sunday, March 23",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}