{
  "asin": "B07P6Y7954",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone XR",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "The Apple iPhone XR is an excellent device with a sleek design, vibrant display, and impressive battery life. The performance is smooth and reliable, making it perfect for everyday use. Overall, it’s great value for the price, especially for Apple fans",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smooth Performance & Great Camera!",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Smooth performance, good battery life, very durable, nice black color, screen protected, and Great value!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Phone arrived promptly, was well packaged.  In excellent condition.  Took it to iphone doctor in area where info was transferred to it.  Everything is working fine.  Better phone for hubby.  Very happy with purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value for an Unlocked iPhone XR Despite Minor Wear",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "I have had this product for a few years and it still runs well enough to keep for now. Please be aware that the \"crack\" seen on the front of the phone was NOT there upon arrival, that is in fact a slightly cracked screen cover I installed personally after purchasing.The Apple iPhone XR, 64GB, Black (Renewed) is an excellent choice for those looking to get a high-quality iPhone without breaking the bank. As a renewed product, it offers great functionality and performance, making it a worthwhile investment.Performance and Quality:The iPhone XR performs impressively well. The A12 Bionic chip ensures smooth operation, and the battery life is commendable. The 6.1-inch Liquid Retina display is vibrant and clear, making it perfect for media consumption and everyday use. Despite being a renewed product, it functions just as efficiently as a brand-new phone.Value for Money:At this price point, the iPhone XR is a fantastic deal. You get all the features and capabilities of an iPhone without the premium price tag of a brand-new model. For those on a budget, this unlocked version provides flexibility and the freedom to choose your carrier.Condition:However, it’s important to note that the phone does come with some visible wear and tear. While these cosmetic imperfections do not affect the device's performance, they are noticeable. For instance, there might be minor scratches or scuffs on the screen and body. This is expected with a renewed product, but it’s something potential buyers should be aware of.Overall:Overall, the Apple iPhone XR, 64GB, Black (Unlocked) (Renewed) is a solid purchase. It delivers high performance and quality at a reduced cost, making it an excellent value. While it’s not perfect due to visible wear and tear, it’s a small trade-off for the significant savings and the ability to own a high-functioning iPhone. I would definitely recommend it for anyone looking to get the most out of their money.",
      "helpfulVotes": 42
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10/10 Excellent Condition",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Hello I received my IPhone XR Red 128 GB and it’s in excellent condition as it says only downside is the battery health is at 82% which is not great, but I can replace it for cheap. Everything else is perfect! It came in a nice box with a SIM card opener tool which I needed. It had a film protector on it from scratches and smudges. Everything took 2 hours to update and transfer iCloud storage. It works great, I don’t have any complaints. I really recommend getting this in excellent condition as it was really cheap only $208! You can’t beat that price! Anyways I give this a 10/10!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, great price!",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Phone was in excellent condition, no scratches, & unlocked.  I was able to easily transfer my SIM card & information from my old phone.  Highly recommend this seller!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    XR Red 256gb",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Almost in perfect physical condition with VERY minor scratches on it. Have been using since December 2024 and it works great. Upgraded from 6s plus and am extremely happy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone and quick delivery",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Phone so far is greeeat, I've had it for about two weeks now and it came perfect no scratches or anything. Only problem I have is the charging, I have to put the charger in multiple times to get the phone to stay on charge, but I don't know if that's a charger problem or a battery problem so I have to get a new charger to find out, but otherwise it's been really good and I would recommend, and if it lasts me a good two years I'd probably buy it again."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    1st Time Apple iPhone User",
      "date": "Reviewed in the United States on August 10, 2020",
      "body": "The phone I received was by all estimations brand new. Not a mark on it and fully charged. However, being new to the Apple World, I can honestly say Windows & Android are both in plain, simple, super easy to understand English. Apple is not. Even its keyboard is not a full Standard Keyboard, like it is with Windows & any Google machine. Android is Google, that's why I say it that way. No getting around it. Just keeping it short & to the point. Apple's iPhone keyboard takes extreme amount of effort to use because it is not the Standard keyboard of every other operating system. Thankfully, I was able to connect a Bluetooth keyboard to it. Otherwise, it's a serious no-go for keyboard use.As for Apple's iPhone Touchscreen, again, I find it sorely lacking. There's no such thing as the simple pinch & zoom on it. That particular luxury seems to be found only within the Camera & Picture sections. You'd think it'd at least be within the iBook section but it's not. On most everything Windows or Google, every app is not just touch & activate, but also affords the luxury of pinch & zoom as well as easy swipe & easy app close & dismiss. Can't say that about the Apple iPhone.And for some unknown reason its WiFi also keeps turning itself on. I can't seem to keep it off no matter how often I manually turn it off.For Apple being so USER-FRIENDLY, I cannot at all say that it is. In fact, IT IS ANYTHING BUT USER-FRIENDLY.  If the Apple World was so user-friendly, then it would be a very simple and easy transition from the Windows or Google platform to Apple. And I can honestly say it is Not at all simple or easy. I was so hoping it would be as simple & easy as my Windows machine & Android phone, but sadly, it's actually quite maddening.If you enjoy Kindle reads, you'll need to install the app for it. But I can also tell you, Apple's iBook seriously pales in comparison to Kindle. Ironically, the Google Search Engine is installed on Apple's iPhone but Kindle is not. I avoid Google anything & everything as much as can be done. But for Apple to deny Amazon's Kindle Apple on its phones, seems almost a crime.I have yet to install the Kindle reading app or to test out the camera on the iPhone. When I do I'll update my review. But currently I can't say it's anything to brag about. And I most certainly did not expect to see Google's Search Engine/Web Browser on it.Size wise, it's the exact same size as my Sony Xperia Z3v. It still functions quite well. Not perfect, but well enough for me since I have it locked to call, text, Kindle reads & camera.  I can easily read, pinch & zoom & highlight my Kindle reads, pictures & text messages on it. Can only do that with pictures on the iPhone. So for it being so great, I actually find it quite limiting. Not because it's an iPhone, but because the Apple creators decided to create a platform that is quite complex and extremely arduous to use. Apple created its own \"language\" that must be learned in order to navigate the complexities of its Eco-system.  Even now, trying to login to the Apple App Store, no keyboard appears so I can actually install Apps necessary for my personal use. Yet you're required to sign in to it. How can you sign into the App Store when NO KEYBOARD APPEARS TO LET YOU?! So, even if I did not want to use the phone feature, but instead use it as a computer tablet, I cannot because it won't let me login to the App Store. ... Like I said, to anyone new to the Apple world, it's quite a infuriatingly maddening conundrum. If Apple wants to gain new customers and retain them, then Apple needs to change how it operates. And if Apple is supposed to be the safest of all online platforms, then it should not sport Google's web browser.The phone I received was/is like brand new. Operating it though, takes considerable patients as it is quite the learning curve. It should not be so difficult to transition from Windows, Android or Google to Apple. They all made sense to everybody from the moment they came out because they were in simple English and easily understood and simple to navigate because of it. Apple on the other hand, not by a long shot. Even Apple's touchscreen capabilities sorely lacks in comparison. And that's sad. You'd think their touchscreen capabilities would be at least on-par with Windows, Google & Android but it is not. You'd think Apple's touchscreen capabilities might even be better than Windows, Android & Google, but no. Thus far I can find nothing to brag about regarding Apple anything. I was so hoping to find something better about Apple. Instead, I'm greatly disappointed and left seriously frustrated.The iPhone itself came fully charged and appears in brand new condition. It also came with an original Apple Charger.I give the seller a stellar 5 star rating, along with the iPhone I received.I give Apple itself a mediocre 3, even 2 star rating.So to anyone new to the Apple world, maybe an iPad would be easier to use. I started with a phone since I need both a new phone & a new computer and figured Apple would be a serious upgrade to Windows and for sure compared to Google's Android. ... Apple is not at all user-friendly to a first time user. Only Windows, Google & Android can actually claim user-friendly bragging rights, from day one for any first time user.Apparently I need either direct Apple support or YouTube's Apple education in order to learn how to make the best use of this phone.  I don't fault the phone for anything. It's an Apple thing. It's very nearly like you gotta go to MIT to learn it. And that's just not right.Will update as I learn how to navigate Apple's world & extremely clunky Eco-system.1st Time Apple iPhone User Assessment. -Phone - good. - can't give it high marks due to Apple itself.Apple - not worth all the money & certainly nothing to brag about.",
      "helpfulVotes": 203
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Acceptable comes with few scratches but it came fine",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "No so bad got one for my sister she been asking for apple phone because androids aren’t great. For an acceptable condition it was good it came with just scratches around her button parts but so far it works and functions well."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ramrai lagyo",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Smooth as hell . phone is in good condition.  I would have been happy if the charger was original but no worries"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just received it - perfect",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I just received it.  Perfect so far. I’ll let you know later - I literally just got it 5 minutes ago.  I only got it for filming purposes- 256GB can’t go wrong with an older iPhone with 4K CAMERA.Update - a month later. I just wanted to add that this phone is perfect. I do have the iPhone 13 Pro. I got that one when it first came out and let me tell you I hate that phone. I like this phone so much better even though it’s much older, I feel like it works and cooperates so much better than the 13 pro. There is nothing wrong with this phone. I love it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "So far so good. I have only had this phone for a day. It arrived a day early. It was clean both inside and out, and you couldn't really tell that this wasn't a brand new phone. The XR has most all the features that anyone would need or actually use (who needs a 3d camera really) and it gets a perfectly clean signal and sound. All I had to do was put in my SIM card, my zip cade and log into iCloud. For the money, if this lasts a year or two it will have been worth every dime.It was missing the charger, but they agreed to send on right away, so that wasn't a problem."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    price",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "OK price for a IGPHONE 10"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Muy buenos teléfonos salen muy buenos y no están bloquiados"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "It took a little bit for delivery. And it was somewhat hard to get it switched on with my service. But it’s on now and seems to be working fine"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great renewed iphone",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "it was exactly as described great battery life and packaged well. i have purchased several iphones for my family with no issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good deal",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "good deal"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Calidad",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Se lo compré a mi hermana menor para que tuviera con que jugar y a ella le gusto mucho"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Enjoy",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "I’ve had my phone for years and I absolutely love it!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    If you can’t afford a new battery, don’t get this phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Ok for the price. I bought 4 of these for my kids because they need phones to communicate with me after school. The batteries are all trash. The battery life is awful and it came at 80% battery health but the phones die after about 30 minutes of use. There are scratches, which I don’t really care about as long as they don’t turn out to cause problems. I just wouldn’t recommend unless you have money for a new battery. I bought 4 phones and every single one of them needs a new battery because they overheat. If you don’t have money for a new battery as well as the phone then you don’t really have money for this phone because my kids will absolutely need a new battery. I’m returning the phones this weekend.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Product",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "This product has held up extremely well since purchase, came with a screen protector. There have been no problems with the iOS or the hardware."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    In a good condition except some side scratches",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Looks in a good condition except some side scratches."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No surprises",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "seems to be exactly as advertised"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal for the price",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Looks like new. Great job."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Super fast shipping and phone was in perfect condition as if it was brand new. Zero complaints!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The quality of the item",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "The phone is fully functional and look brand new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I really like this phone.",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "This is my first Apple phone and so far I love it. As others have said though, the battery only has 82% capacity but for the price I can live wit it.Phone is in very good condition with no scuffs or scratches.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect!!",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "The phone is in immaculate condition, my daughter is so excited and happy about this “new” phone. Definitely a satisfied customer!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "So far so good I will do a update in the next month"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good work Fuction",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Looks like new,so far so good!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Very Good phoneI love it so much ❤️"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Get this phoneee!!",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "everything is perfect even came with a screen protector this is a great purchase!!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s good",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I’m currently on it now doing reviews. I have it four stars because from the moment I bought it there has been a problems with the screen. It had some discoloration however I was to send it back to them and didn’t so I guess that’s on me.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Totally satisfied with this refurbished phone.",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "I was apprehensive about getting a refurbished phone, however I must say there have been no issues with it and it was in almost perfect aesthetic condition when I received it. I will buy another certified refurbished phone when the time comes but there is nothing wrong with this one."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I’m not one of those need the newest iPhone people I just want whatever phone I have to work and this one does just that. I was impressed at how clean it is considering it’s refurbished… you would never know unless I were to say something. Super happy and the price was a great selling point as well!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First impression!!! Was great!!!",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "It's from AT&T, Perfect!!! Excellent 👍🏽 top of the line..Great Buy!!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone XR",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Honestly I was afraid to buy a refurbished phone, but after getting it I wasn’t disappointed. I’ve been using it for over a year and a half and it’s still working good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great used iphone!",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "So far so good for a pre owned! My daughter loves it!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed and expected better.",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Initially it was fine while unboxing.The camera lens was chipped, and there was noticeable wear on backside of phone.Once it was charged and the phone transfer process was started it functioned.Then midway into transfer the screen went blank and it wouldn’t detect anything on touch screen. The transfer process had to be paused and the phone had to be reset to function again. After resetting the transfer process completed. I put it in a special case and of course installed a tempered glass screen protector.The next day while attempting to use the phone the screen went blank and wouldn’t initialize or detect touch and the phone could not be used.Again it had to be reset and restarted so the screen initialization and touch detection would start working again.It did not come as it was described in the original description. This was my first renewed experience and purchase of an Apple phone on Amazon. I am disappointed and I expected better. I expected a normally functioning phone without problem and reliability issues.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Good graphics and quality  amazing purchase phone features are excellentWorth every penny durability of the phone is good functioning well and it picks up great reception  color  is good",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "This is my second refurbished phone and I’ve never had a problem with either one. It was just time to upgrade. Works great, quality is great. I recommend trying it out!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like a new phone. Works fine.",
      "date": "Reviewed in the United States on May 24, 2024",
      "body": "The exterior is in perfect condition and so far it’s operating like my previous one iPhone XR. I had accidentally ordered the one that was only 2g (which no one should want) and the seller responded and my cancellation was approved and I got the phone a day earlier. This phone has 4g.The battery: I tested this one. I got 8.2 hours from 100% to 3% with it in Low Mode purposely doing battery-sucking things such as downloading all my apps while a long update was happening, watching videos, syncing stuff from iCloud such as photos, playing a game, etc. The phone was a bit warm and working hard. They guarantee that it will be at least at 80% capacity and some people are lucky to get more. Mine came at 79% which is not a big deal and I just can’t be without a phone.80% isn’t terrible unless you constantly are doing battery sucking things. Don’t fret. My previous one was four or five years old and was at 80% before it got destroyed. They say you lose 1% a month. Not mine because I did battery saving things. At home I would plug it in since I watch battery-sucking things like long YT videos. Often I keep it in low mode and the screen turns off quickly-I have to put in my Lock Screen password a lot which is annoying but it saves usage. When I charge it I practically turn off the light. Turn off background refresh on apps that aren’t that important to be refreshed. Keep your screen brightness as dim as you can handle. I think using it in airplane mode helps. I keep location services off until an app needs it. If you put it on Never so you don’t have to keep tapping the screen, that seriously sucks up the battery. If you take lots of photos and videos, say on vacation, you might want to bring an external battery charger. Limit your notifications on your Lock Screen because all that lighting up sucks your battery. Look at your battery health to see what you’re doing.80% isn’t bad. It depends what you do on it and how you set your screen.",
      "helpfulVotes": 43
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My phone is perfect!! I love it !! ❤️",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Just got my phone yesterday and the battery life is amazing , no scratches or cracks! It was fully charged when I turned it on! Brand new phone !!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Happy with this purchase!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone xr",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Excellent product clean working perfectly",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works as advertised",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "As advertised"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy bueno",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "A pesar que es reconstruido me ha salido súper bien , todavía lo tengo"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "Good product"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the price",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Works excellent"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery concerns and slight scuffs",
      "date": "Reviewed in the United States on May 5, 2022",
      "body": "Everything on the outside seems perfect despite some slight scuffs along the edges of the phone that a phone case easily covers and micro scratches on the screen that you don’t see unless the screens off and you hold it up at different angles.My main concern has to do with the battery Amazon had installed into the phone, as soon as I set my phone up, I got an alert claiming the batter may be in-authentic and in-turn, will affect my phones full capabilities.The only reason I’m being generous on my rating is because I think the issue has more to do with Amazon than the seller.Amazon is sending me a new phone and I’ll be updating my review as soon as I get the new one in the mail about 12-15 days .Update:The only good news  I have to report is that the phone arrived sooner than the 12-15 days they said it would take…The bad news is, the replacement I received was in worse condition than first… The second phone arrived to me and the first thing I noticed was the front speaker and filthy it was. There was so much dirt and crud caked into it, that it was stark white .. I could just tell by looking at it, that it was going to effect the sound quality which it definitely did (I even tried cleaning it but it was cemented in there). I started  to wonder if they even inspected the phone at all because they claim to clean their phone’s  thoroughly so if they didn’t even notice that, and then I went to turn the phone on, the battery was already completely dead which is already a bad sign because you’re expecting a “renewed” phone to have all new parts meaning it should have been almost fully charged … so if the replacement phones battery was completely drained, how would they have looked at it to even inspect it unless something was wrong with the battery that caused the phone to drain while it was shut off but then that circles back to the inspectors again and them not properly doing their job. if the battery was faulty, they should have caught it and fixed the issue before sending it out…once the phone got a charge, I did notice that  I wasn’t getting any alerts about the battery being in-authentic like the first phone did so I believe the 2nd phone still has all its original parts but then it shouldn’t be considered renewed…  the phone also took a really long time to charge and as I mentioned, the sound quality was horrid.I just hate this cat and mouse game of having to send phones back and forth and having to reset them and transfer all my date over and over again so I just decided to suck it up and keep the first iPhone I got and pray it works out because I’ve read stories of Apple locking users out of their phones if it’s believed their phones have in-authentic parts including batteries. I’ll try to remember to give anyone who wants to know, an update in a month or so.Update 02/26/23-Phone still works and I haven’t had any major issues expect the the battery life doesn’t hold a charge for long and the camera quality is horrid. I don’t think I’ll be getting an iPhone ever again. Android is way better in my opinion .",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great CS Tho This iphn Not For Me",
      "date": "Reviewed in the United States on February 23, 2024",
      "body": "Seller I Give 5 Stars For Promised Shipping & Packaging & Accepting The Phone Back Even A few days past the 90 Day Return Policy. The phone was in Very Good Cosmetic Condition. Also had a screen Protector on this phone. Also The Transfer off Ny iPhone 7 to The iPhone XR was Quick & Easy.I wanted to like the iphone RX But For Me I like the smaller iPhone feel For Better Handling for My small hands.Also, My phone usage is a few lengthy calls per day & google or FB Market Place Searching & once in a while I open My email.The iPhone had Several issues Right Out The Box:I had to connect the phone to charge at least 4 times each day.Charge did not last for even a lengthy Phone call.Also, The Speaker was muffled I had to keep the volume medium to low to avoid the blasting muffled sound of receiver speaker.I also many times would click over & over on a link or to edit or go to next page etc & often after several attempts just give up. Maybe the touch sensitivity or Screen Protector.But also weird was clicking sometimes & go silent in same text or search while I was typing.I like that I have the option to try a refurbished iPhone at reasonable price & if it doesn’t work out May return up to 90 days after receiving.I did find and purchase another smaller iPhone refurbished from another seller here on Amazon.I Appreciate Amazon & The Sellers For Their Customer Service & Products Available for Purchase.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Purchase So Far Despite a Couple of Minor Issues",
      "date": "Reviewed in the United States on June 3, 2020",
      "body": "This is my first phone purchase in almost a decade. I am going from an iPhone 5s to an iPhone XR.I asked someone for advice for where to purchase my next iPhone. I have a lack of trust when it comes to purchasing phones on the internet after hearing about so many stories of people being scammed. I was told by a couple of people that amazon has registered users so I gave it a try.So far I am happy with my purchase. The iPhone is in like new condition with no major scratches. However, there are two little scratch indentations on the front screen. They are hardly noticeable because they are to the side of the front just off the LCD screen and screen protector and do not interfere with the use of the phone.When it comes to the actual phone itself, the big screen, sound quality, and fast processor are something to smile about. Apple outdid themselves with this phone. The only thing that will take some getting use to is the big slim design. I find it hard to reach some parts of the screen while holding the phone in one hand. I think there is an adjustment period. The phone was incredibly easy to set-up. I just had to back my old iPhone up to iTunes and then restore that backup on the XR.I do not like how there is no headphone jack and that the phone only has 64g storage but this can be overlooked. (I know that I also have the option of purchasing a different model that has better storage and a headphone jack I just thought it is worth mentioning for anyone considering to buy this item.)Pros-Great price. Fast shipping time. Sold from someone trustworthy. Honest listing and as described. Came with screen protector and SIM removal tool. The phone indicates that the battery life is at 95%.As a phone, great quality overall. The LCD screen is big and bright. The sound is fantastic. The processor is super fast (I think one of the fastest processors you can purchase in a smartphone).Cons-The phone came with a knockoff charger not an OEM (original) Apple charger or headphones. Yes, using an Apple charger versus using a knock off makes a difference, look into it if you do not believe me. Fortunately I have my old Apple chargers. The screen has a couple miner indented scratches. My finger covers the mic at the bottom of the phone sometimes when I record videos. The audio gets blocked or becomes scratchy.I made this review as detailed as possible because I greatly benefited from other reviews made by other people that purchased this phone.One major takeaway from all of the comments on this listing is to be careful that you may or may not get a phone that has some sort of issue. I think this comes with the territory when it comes to purchasing a renewed phone. When you are spending a lot of money on a phone you expect quality and consistency. For a couple of hundred dollars more I could have bought straight from Apple, but I am happy I got to save that money.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Great condition! Quick delivery! Very happy"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El teléfono 📞",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Está bueno el teléfono pero llego rayado asta el momento no hay fallas en el, lo único que cuesta escribir con el teclado son dos cosas nomas pero en lo demás está bien"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Durable",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Survived a car crash... The car did not survive",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "It works when it wants too I’ve had better fromAmazon before tried me like a chump"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "It did have a scratch on the screen that it shouldn’t have but otherwise it’s a nice phone. I’m still happy just a bit disappointed that should have been caught.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very good",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "very good"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mostly unhappy",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "UPDATE: After resolving the missing SIM card tray issue, I was happy with this phone for about a week.  Immediately after an Apple IOS update came through, I began receiving notifications on the phone that the battery was not an authorized Apple battery.  Then the phone began acting strange, turning itself on and off - at first multiple times in a day and then constantly, so that it was essentially fully unusable.  I contacted BidAllies and they apologized and authorized a return for a refund.  The original packing had been disposed of so they advised me pack it carefully.  When they finally issued my refund after \"testing\" it to be sure it was defective, they deducted $18 from my refund for not including original box.  I hope no one reading this receives this phone, because although it was flawless-looking it was fully unusable - if you do, be sure to keep the box!  I'm disappointed in BidAllies and would not buy from them again.I needed to replace my iPhone, chose a renewed iPhone XR.  It arrived in 2 days and looked perfect - no scratches on screen, battery max capacity at 96%.  At the last step of transitioning from old phone, when I went to put my Verizon SIM card in SIM tray  there was no SIM tray, just an opening for it. The seller wanted a photo as documentation - crazy since that proves nothing, I could have just taken it out!  but I sent photo and they sent a replacement SIM tray.**Hopefully helpful note, to save someone else from trouble I faced: When I took SIM out of old phone but needed SIM tray on new phone to insert, the removal of my SIM without immediate reinstallation triggered Verizon to suspend my phone number for potential SIM fraud.  I spent 1 hour online chat with Verizon rep who was unable to get restriction removed, then advised to go to local Verizon office and I spent 2 hours (no exaggeration) getting my phone number back. Apparently SIM stealing is a new thing and with two-factor authentication the carriers are taking risk super seriously.  Moral of story: check your new phone to be sure it has a SIM tray before you switch over!Overall, except for SIM tray issue - seller was good and renewed phone seems great so far!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything but the speaker",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Everything works perfect but the speaker was the only thing that was broken but it is what it is."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone XR",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "Ordered iPhone XR looks great screen and phone itself looks brand new. I am very pleased with it. This is my third iPhone that I have ordered. I ordered two recently for both of my daughters and now I have ordered this one for myself. I highly recommend buying from the seller."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly what I expected",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Great quality!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "The reconditioned iPhone XR was in excellent condition and looked like new.  Battery health  is 100%.  I'm very pleased with the condition and value of this phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ease of operation",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "Overall good purchase"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    An excellent purchase",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "This is my first I-phone purchase, previously having used only android phones.  The phone arrived in very good to excellent condition.  The screen and body were in excellent condition.  A tiny amount of prior use was evident at the point where the charger connected to the phone.  The phone was charged and ready for use.  Following the prompts on the phone, I was able to transfer my contacts from my android phone to the I-phone over WiFi with no problems.  Due to my arthritic hands,  I had difficulty inserting the SIM card, but a quick trip to a nearby Apple Store solved that issue. I will purchase a refurbished phone in the future when the need arises.  Also, the phone arrived overnight.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone xr",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "The phone itself I hope is good! The screen protector I hope is what's broke and not the screen itself. It came this way. Other than that so far still figuring it out but like it. Battery doesn't seem to last very long though (which was the problem withy older phone andis the reason I got this phone to start with)."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I mean it works",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "it’s got lines like burnt into the screen and the keyboard lags when typing. the other three phones i got worked just fine but this one in particular has its faults"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2 years of having this phone",
      "date": "Reviewed in the United States on August 5, 2024",
      "body": "I’ve had this phone for almost 2 years now and it has been very good for its price. The battery health was at 84 I believe when i bought it and is now 81. The phone only had a super small dent on the circular part of the camera, and was only noticeable if you really examined the phone. The phone looked perfect besides that. The phone does overheat easily now sadly and freeze somewhat frequently, but during the first year it was honestly not happening. The phone gets worse the longer you have it obviously but I guess you can’t expect a renewed phone to last for a long time and I don’t regret buying this :)",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect First iPhone!",
      "date": "Reviewed in the United States on August 1, 2022",
      "body": "I’ve been an Android user since the beginning but finally decided to switch to Apple based on recent and upcoming Google changes.Very happy with this iPhone XR! I chose this model because it was new enough while not being too heavy an investment.  I was using a MotoZ and this XR is equal in size and efficiency. I also used a Samsung Note10 and this is a bit smaller.  The size fits nicely into my small purse and pockets. I chose the 256GB because I know having a faster phone with more storage matters. Nothing worse than a sluggish device.The face recognition works great and is much handier than using my fingerprint. I haven’t had any issues logging in regardless of how my hair is styled and whether I’m wearing glasses or not.I love the color! It’s more of an orange than red. The camera is faaar better than any of my previous phones, except for the Sony I once owned.This model came with the power cord, power plug, and ear pods making it ready to go straight out of the box. Just needed to give it a good charge before using.Buying refurbished devises has been something I’ve had only success with. I’m always careful and do my research on the seller before buying. Plus I invest in the extended warranty through Amazon plus in this case I chose Apple Care. Money is always a huge issue for me but in this case I won’t buy without the added protection. Phones are too essential not to.Learning the Apple layout and differences has been new but not a struggle. I find the biggest issue is the power button is on the opposite side of the device. For things I haven’t known how to do I’ve used Apple.com and searched Google.It’s impossible to get away from Google completely but at least I know my info is safe now.I would totally recommend this seller and product to friends and family!",
      "helpfulVotes": 52
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value for money",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "I was skeptical purchasing a refurbished phone but it looks new. Works great and my daughter loves the colors!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazinggg",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "This phone came spanking brand new no crack no scratches nothing at all this is amazing I love this iPhone 10/10 definitely would recommend amazing thank you so much",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost Perfect",
      "date": "Reviewed in the United States on May 24, 2022",
      "body": "I was a bit nervous getting renewed but I'm on a budget and I had to buy this plus the Apple Watch 6 for health tracking purposes. There is absolutely no scuffs, dings, or scratches. The only way you can tell it is renewed was battery life was about 89% Which isn't horrible. It still lasts me the day and as this isn't brand new, I'm not dinging a star for that. (Plus I believe that is better than advertised)This along with the watch were my first ever Apple products. I previously had a Moto Stylus and a Samsung Galaxy Active 2 Watch. I wanted a watch that would alert me when I had an Afib episode, which the samsung didn't. A lot of afib patients suggest Apple watch for this, which meant I needed an Apple phone.The battery, even new, I don't think would have outperformed my Moto but that's a thing Moto is kinda known for is their big batteries. But as mentioned before, it lasts me all day.I LOVE the blue color. I bought a rugged clear case from local store so that I could protect it while still being able to see the pretty color.Had zero problems putting Mint Mobile on it, so unlocked as promised. Never used an esim before so that was really neat.The apps are amazing and far more varied than Android. That night time wind down is no joke, but I like it. It really is great at making sure I don't pick up my phone and just mess around after bed time and I like that it gives me a little warning so I can go read or do something to wind down for bed.Display is clear and nice.Performance is snappy. A little sad there's not a headphone jack but that's pretty typical these days. Just nice to have something for when your earbuds run out of juice. But it synced upOverall, I know this phone is a bit older in 2022 but I honestly feel like it's almost better than some of the flagship Android phones that are new at a lower price. Overall, I'm really happy. It's really helped become a health tracker as much as a phone. I'm getting why people like Apple now and will probably buy more apple products in the future.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Barely lasted a year",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "Got this phone for my dad because he needed a new one. It worked well at first with some things that wouldn’t work occasionally but that’s to be expected with an older model iPhone.About 8 months in it started deteriorating pretty quickly starting with the storage. It got to the point that he couldn’t take any pictures because he doesn’t have enough available memory despite him clearing out nearly all of his texts (which is what was said to be taking up so much) and he has 9 apps that he downloaded. He’s supposed to have 64 gb yet every day it says he’s out.Now his phone is hardly usable. Siri and any voice operations work about 30% of the time. The phone often won’t wring when he receives a call and when he’s trying to do stuff on it, it’s unresponsive a lot and occasionally bugs out and freezes. It’s now at the point where we have to get him a new phone… one year later",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT REFURBISHED PHONE! Don't hesitate!",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "I researched a lot of sellers this one had the best reviews. Great price too! Looks brand new! No scratches anywhere! Came with brand new block and charger! Instructions and nicely packed in it's box HOWEVER, AMAZON THREW IT IN A BOX WITH NO PACKING SO IT WAS THROWN AROUND WITH NO PROTECTION INSIDE THE AMAZON BOX! THE IPAD I ORDERED CAME THE SAME WAY!! WTF!! THIS IS AMAZON'S FAULT NOT THE SELLER'S!",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good deal..",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Came exactly as described, not a single imperfection. Like brand new!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Rough Body but Works Fine",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "I ordered this to replace my iPhone 8. The phone works fine but has a rough body with some scratches and chips. I decided to keep it but I'm disappointed that it is not in the excellent condition as described on the listing.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Exelente",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "Tal y como se describe entrega rapida y lo mas importante en buenas condiciones  gracias"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I would purchase again",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "Works Great, Would purchase again"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy With It",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "This product works very well and I am happy with it thus far. I'd much rather buy a used phone than pay a ridiculous prices for a newer iPhone. I bought another user iPhone through Amazon and they both work well. If you can get past the fact that someone has used it before, it's worth considering."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived on time, packaged well, and in very good condition.",
      "date": "Reviewed in the United States on November 1, 2022",
      "body": "I purchased this phone with the intent of having it for a very short period of time.  My plan was to use it as a trade-in since my previous phone was too old to qualify (iPhone 6 Plus).  I purchased the phone for around $250 and got an $800 trade-in value on an iPhone 14 Pro Max, when switching from one carrier to another.  I'd been with the previous carrier for 20 some years but it was time for a change.The only thing that kept me from giving this 5 stars, is that it had non-Apple parts on it that the new carrier was somehow able to identify, maybe battery, maybe screen?  Perhaps there is some history somewhere of previous iPhone repairs.  Anyway, the replacement parts were determined to be acceptable and the $800 credit was given.  I ended up using the phone for a couple of weeks while waiting for my new phone to come in.  The phone functioned to my satisfaction.I didn't rate the face recognition because after two attempts, I did not get it to work.  My wife said I wasn't doing it right and that may be the case.  I was trying to follow the camera with my eyes when moving the phone around in the circle.  The app completed, be then said I was unable to use face recognition.  The front camera did work, so again, perhaps the failure was unrelated to the phone.For anyone who wants to try to save a few hundred dollars on trading in a phone, this may be the way to go.  As I found out though, there could potentially be some risk depending on the parts used for any repairs made.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good emergency phone for 8 year old",
      "date": "Reviewed in the United States on July 14, 2024",
      "body": "I know. 8 is young for a phone. Circumstances vary.  So to any other widowed dads who need their child to have a phone within your guidance-  you can use Wi-Fi only, iCloud address for text and FaceTime without a SIM card. Good for emergencies. You can manage and approve apps etc and keep separate iCloud account for privacy. WorksGreat for videos, games and Emira and IXL reading and math programs. You as a parent can control frequency, screen time, content etc. I expect this phone to last 3 years minimum. Works great. I get a pop up toReview and approve any app. I can set session duration or total minutes screen time with parentalControls. I opted for more memory and sharing my iCloud allocation to off board photos and videos so it works well with games.  Apple still supports and you can search online for which products phase out Apple support and when.  This was not inexpensive but a good value for my requirements. And the little guy learns responsibility and conversations about safety online.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A little slow at times.",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "The fact that it’s unlocked means it works with a variety of carriers, which is a big plus. However, I’ve noticed that the phone can be a little slow at times. While it handles basic tasks like texting and calling with no issues, I’ve experienced some lag when switching between apps or when multitasking. It’s not terrible, but it can be a little annoying, especially if you’re used to newer models. The battery life is decent, though I found myself charging it more frequently than expected."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works Perfect!",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "My fiancée ordered this and has been using it for months, it has given him no problems! GREAT product 10/10 recommend",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product for the price 👌",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Battery good durability, all functions good, looks great 👍",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Chips and Heating",
      "date": "Reviewed in the United States on September 6, 2024",
      "body": "There are a couple of chips in the paint, as seen in the pictures. Doesn't really bother me because the phone serves it's purpose just fine. The only issue is that the phone gets decently warm after a few moments of use. It cools down quickly but also warms up quickly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good case",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived and works as intended.",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "I got exactly what I ordered and in perfect working order and for being used looks damn near brand new! Thank you."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great seller....",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "This seller had wonderful reviews and that is the ONLY reason I bought my phone from them. Unfortunately, the phone had a glitch with the on/off button and after several talks with Amzazon techs it was best to return the phone.  Things happen with shipping sometimes, who knows, I had to send it back and had no problems with the return request.  Ordered a replacement today from them again and I know it will be in great condition.  Loved the phone, just had a glitch that probably happened during transit.  The phone was in FAB condition and I know my new one will be great as well.  Will update upon receipt of the new XR phone..can't wait till Tuesday:)"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had it since Jan. 10/10 first time with one without a home button",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "Brought dis back in Jan. and I still haven’t switched everything over from my 7plus yet lmao. I changed my mind to go ahead and get an iPhone without a home button. I’ve gotten real adjusted to everything and fell in love. Tha special updates etc dat comes with it and that’s on it makes my day forreal. I do plan to upgrade again to prolly like a 13 or 14. I want one even bigger. Ik ts EXPANSIVE🤣but Lord’s willing, I can find one that’s brand spanking new , hella storage space, and fits my budget.  :)",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good quality",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "I was sceptical of buying a phone as accepted quality but honestly I'm glad I did. This company is amazing at what they do and my bf is happy with the phone and he's very picky, the batter life is great for a used phone, and the functionality is as though it's brand new he's gonna get used to the size again lol."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great buy!",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "Overall great buy for a kid! Keyboard has a few glitches but he didn’t complain too much."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came just as the photo showed!",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "N/A",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow charging",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "But it was in excellent condition,unlocked and renewed, good price for my son who isn't that carful with phones"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Excellent Condition but totally funtional",
      "date": "Reviewed in the United States on April 20, 2024",
      "body": "I bought from Kojak Sales an excellent condition but it came with some hard scratches at the lower edge of the screen, it’s not excellent but the battery health is 91% that is good and the screen seems to be original with True Tone. The phone is totally functional despite the aesthetic detail. Overall is pretty good. I think that the third parties seller make sure the iPhone meets the conditions described before shipping. The seller was responsive for resolving the problem but the ideal would be to receive what you pay for.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I works like new for a fraction of the price",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "I wouldn’t mind buying from this seller again. I should follow this store for future purchases!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Excelente producto mi teléfono en perfecto estado gracias"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not just for you be videos!!!",
      "date": "Reviewed in the United States on September 1, 2024",
      "body": "I like that when my niece looses her YouTube video watching device another can be procured and this one lets her ignore my calls and texts."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Looks brand new. Face ID no fingerprint. Not too small or too big perfect for me. Love the color I got. Works perfectly",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    If you can’t afford a new battery, don’t get this phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Ok for the price. I bought 4 of these for my kids because they need phones to communicate with me after school. The batteries are all trash. The battery life is awful and it came at 80% battery health but the phones die after about 30 minutes of use. There are scratches, which I don’t really care about as long as they don’t turn out to cause problems. I just wouldn’t recommend unless you have money for a new battery. I bought 4 phones and every single one of them needs a new battery because they overheat. If you don’t have money for a new battery as well as the phone then you don’t really have money for this phone because my kids will absolutely need a new battery. I’m returning the phones this weekend.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed and expected better.",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Initially it was fine while unboxing.The camera lens was chipped, and there was noticeable wear on backside of phone.Once it was charged and the phone transfer process was started it functioned.Then midway into transfer the screen went blank and it wouldn’t detect anything on touch screen. The transfer process had to be paused and the phone had to be reset to function again. After resetting the transfer process completed. I put it in a special case and of course installed a tempered glass screen protector.The next day while attempting to use the phone the screen went blank and wouldn’t initialize or detect touch and the phone could not be used.Again it had to be reset and restarted so the screen initialization and touch detection would start working again.It did not come as it was described in the original description. This was my first renewed experience and purchase of an Apple phone on Amazon. I am disappointed and I expected better. I expected a normally functioning phone without problem and reliability issues.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery concerns and slight scuffs",
      "date": "Reviewed in the United States on May 5, 2022",
      "body": "Everything on the outside seems perfect despite some slight scuffs along the edges of the phone that a phone case easily covers and micro scratches on the screen that you don’t see unless the screens off and you hold it up at different angles.My main concern has to do with the battery Amazon had installed into the phone, as soon as I set my phone up, I got an alert claiming the batter may be in-authentic and in-turn, will affect my phones full capabilities.The only reason I’m being generous on my rating is because I think the issue has more to do with Amazon than the seller.Amazon is sending me a new phone and I’ll be updating my review as soon as I get the new one in the mail about 12-15 days .Update:The only good news  I have to report is that the phone arrived sooner than the 12-15 days they said it would take…The bad news is, the replacement I received was in worse condition than first… The second phone arrived to me and the first thing I noticed was the front speaker and filthy it was. There was so much dirt and crud caked into it, that it was stark white .. I could just tell by looking at it, that it was going to effect the sound quality which it definitely did (I even tried cleaning it but it was cemented in there). I started  to wonder if they even inspected the phone at all because they claim to clean their phone’s  thoroughly so if they didn’t even notice that, and then I went to turn the phone on, the battery was already completely dead which is already a bad sign because you’re expecting a “renewed” phone to have all new parts meaning it should have been almost fully charged … so if the replacement phones battery was completely drained, how would they have looked at it to even inspect it unless something was wrong with the battery that caused the phone to drain while it was shut off but then that circles back to the inspectors again and them not properly doing their job. if the battery was faulty, they should have caught it and fixed the issue before sending it out…once the phone got a charge, I did notice that  I wasn’t getting any alerts about the battery being in-authentic like the first phone did so I believe the 2nd phone still has all its original parts but then it shouldn’t be considered renewed…  the phone also took a really long time to charge and as I mentioned, the sound quality was horrid.I just hate this cat and mouse game of having to send phones back and forth and having to reset them and transfer all my date over and over again so I just decided to suck it up and keep the first iPhone I got and pray it works out because I’ve read stories of Apple locking users out of their phones if it’s believed their phones have in-authentic parts including batteries. I’ll try to remember to give anyone who wants to know, an update in a month or so.Update 02/26/23-Phone still works and I haven’t had any major issues expect the the battery life doesn’t hold a charge for long and the camera quality is horrid. I don’t think I’ll be getting an iPhone ever again. Android is way better in my opinion .",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El teléfono 📞",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Está bueno el teléfono pero llego rayado asta el momento no hay fallas en el, lo único que cuesta escribir con el teclado son dos cosas nomas pero en lo demás está bien"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mostly unhappy",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "UPDATE: After resolving the missing SIM card tray issue, I was happy with this phone for about a week.  Immediately after an Apple IOS update came through, I began receiving notifications on the phone that the battery was not an authorized Apple battery.  Then the phone began acting strange, turning itself on and off - at first multiple times in a day and then constantly, so that it was essentially fully unusable.  I contacted BidAllies and they apologized and authorized a return for a refund.  The original packing had been disposed of so they advised me pack it carefully.  When they finally issued my refund after \"testing\" it to be sure it was defective, they deducted $18 from my refund for not including original box.  I hope no one reading this receives this phone, because although it was flawless-looking it was fully unusable - if you do, be sure to keep the box!  I'm disappointed in BidAllies and would not buy from them again.I needed to replace my iPhone, chose a renewed iPhone XR.  It arrived in 2 days and looked perfect - no scratches on screen, battery max capacity at 96%.  At the last step of transitioning from old phone, when I went to put my Verizon SIM card in SIM tray  there was no SIM tray, just an opening for it. The seller wanted a photo as documentation - crazy since that proves nothing, I could have just taken it out!  but I sent photo and they sent a replacement SIM tray.**Hopefully helpful note, to save someone else from trouble I faced: When I took SIM out of old phone but needed SIM tray on new phone to insert, the removal of my SIM without immediate reinstallation triggered Verizon to suspend my phone number for potential SIM fraud.  I spent 1 hour online chat with Verizon rep who was unable to get restriction removed, then advised to go to local Verizon office and I spent 2 hours (no exaggeration) getting my phone number back. Apparently SIM stealing is a new thing and with two-factor authentication the carriers are taking risk super seriously.  Moral of story: check your new phone to be sure it has a SIM tray before you switch over!Overall, except for SIM tray issue - seller was good and renewed phone seems great so far!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I mean it works",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "it’s got lines like burnt into the screen and the keyboard lags when typing. the other three phones i got worked just fine but this one in particular has its faults"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Barely lasted a year",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "Got this phone for my dad because he needed a new one. It worked well at first with some things that wouldn’t work occasionally but that’s to be expected with an older model iPhone.About 8 months in it started deteriorating pretty quickly starting with the storage. It got to the point that he couldn’t take any pictures because he doesn’t have enough available memory despite him clearing out nearly all of his texts (which is what was said to be taking up so much) and he has 9 apps that he downloaded. He’s supposed to have 64 gb yet every day it says he’s out.Now his phone is hardly usable. Siri and any voice operations work about 30% of the time. The phone often won’t wring when he receives a call and when he’s trying to do stuff on it, it’s unresponsive a lot and occasionally bugs out and freezes. It’s now at the point where we have to get him a new phone… one year later",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A little slow at times.",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "The fact that it’s unlocked means it works with a variety of carriers, which is a big plus. However, I’ve noticed that the phone can be a little slow at times. While it handles basic tasks like texting and calling with no issues, I’ve experienced some lag when switching between apps or when multitasking. It’s not terrible, but it can be a little annoying, especially if you’re used to newer models. The battery life is decent, though I found myself charging it more frequently than expected."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good case",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Great"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was ok",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Ran pretty slow and wasn’t great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "Shipping took a while, and battery health was at 82% so not exactly \"renewed\". I'm going to keep it because I don't want to go thru the hassle of a return and re-ordering something else. But I would not buy from this vendor.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed premium",
      "date": "Reviewed in the United States on February 22, 2024",
      "body": "I’ve purchased several of these iphones, as you get a 365-day warranty if you purchase “Renewed Premium” rather than “Renewed” which only comes with a 90 day warranty/return window.. you do have to pay extra for the additional warranty, but it’s worth it for me, as the phone is for my son!The first phone worked well, until the speaker stopped working! I returned the phone, received a full refund, and purchased the same phone again.The second phone worked fine, but after a few months, “lines” appeared on the screen, even though there was no damage to the phone/screen itself. I purchased the same exact phone as I had previously, renewed premium, which has a 365-day warranty. But Amazon closed the return window after 90 days and wanted to charge me a $50 restocking fee to return the phone! I already paid more money for renewed premium, just to have the extra warranty, so I wasn’t going to pay an additional $50 to return a defective phone because someone on their end made a mistake with regards to the warranty! I contacted Amazon several times before speaking to a manager who looked into it and saw that it should have a 365 day warranty!!! Only then was I fully refunded for the defective phone! But what a hassle! Nevermind the fact that you have to erase the iPhone before returning it, wait for them to receive it, then refund you! And when you get the new phone, you have to set it up again. It’s not a big deal, but a pain to have to repeat the same process again and again.I reluctantly purchased the iPhone XR for the 3rd time, also renewed premium, and for now it works! I purchased this iPhone again, even though I’ve had issues with them in the past, because it is cheaper than a brand new iPhone, and MOST importantly, I get a year to return it if/when something goes wrong. With a new iPhone, I don’t get a 1 year return window. I’m hoping this phone will outlast the others and I don’t have to worry about returning it, again. Should something happen to the current phone I have, I will return it and I will not purchase for a 4th time!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was okay but I ended up not needing it",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "The phone itself worked but I ended up not needing it and returned it. I am still awaiting the refund and then saying it’s “received”. Warning that returns seem to take forever despite arriving quickly.The phone itself worked purchased was the coral one, 256gb. The picture of the phone is to show the crack in what was said to be a phone in “excellent condition.” There were scratches on the side of it as if it had been dropped. Aside from that, it looked fine. The box had something like dried coffee or something on it. I think my first review was rejected due to me providing proof of the packaging being damaged upon arrival."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life and Screen Quality not very good.  IPhone has inherent issues.",
      "date": "Reviewed in the United States on March 26, 2022",
      "body": "The Good:The phone is fast and responsive.  Apple provides many nice useful features and utilities.  The camera is very good.  Face recognition works great.The Bad:Battery life isn't very good.  Neither is the screen resolution.If using this phone with wifi calling and there is no cell data, the phone will usually not receive mms messages that include pictures sent from Androids and you will have no idea these messages were sent to you.  Sometimes they will load when you go to a 4g area, but not always.  Same thing happens with voicemails.  The fact that a phone (and it is the phone, not the carrier) will lose text/voice messages is intolerable and unacceptable.  Apple is aware of these issues.Another inherent issue with Iphone is when using a web browser and you want to watch a video on a web page, the IPhone will not play it.  Instead it will open a new tab and download it.  Apple is aware of these issues but hasn't rectified them.  And because of that I plan to return this phone, abandon IPhone, and go back to Android.If going from Android to Iphone, be aware that in addition to the issues above, you lose some very good features, such as the ability to use an microSD card for extra (and removable) storage, a 3.5mm audio jack, and the ability to easily web search images via the camera.Other thoughts:My premium renewed phone came with 92% battery.  It arrived in great cosmetic condition.  The battery doesn't quite make it through the day, and that is with moderate use.  Due to a combination of battery life and known issues that Apple has refused to resolve, it is time to head back to Android.  Hopefully you have better luck.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is an honest review after 3 months of use.",
      "date": "Reviewed in the United States on April 25, 2022",
      "body": "I ordered the iPhone XR 132gb in RedSo first impressions after receiving the phone: The phone was in a plastic sleeve laying freely in the box, wasn’t really secured, and could just slide around in the phone box.So when I opened it I saw a quite noticeable scratch directly in the center of the screen, about an inch in length. It had a screen protector on so it was smooth, but noticeable at an arm's length and further for sure so not what I was expecting.When I opened it the batter capacity was at 98% so I was pleasantly surprised.The camera and back of the phone is in pretty good condition and the camera quality is nice.The audio and touch are good on it too.So the only major issues are as follows:After the first month of use, I noticed that when I would be talking on the phone during a call or texting the screen would suddenly go black. I could still hear the person on the phone and hear buttons when I touched the screen but could see nothing but a black screen. Now it has been 3 months and it happens occasionally still which is quite frustrating. I have to hold down the lock button to restart and fix it, otherwise, it can go dark for as long as 3 minutes.Also, the battery is deteriorating pretty fast, it has dropped from 98% to 95% already in a matter of 3 months.Overall Pros: Camera works well, good storage, nice audio, body in good condition, and came with a screen protector appliedOverall Cons: Scratch in center screen noticeable at arm's length, battery deteriorating pretty fast, the screen randomly goes black and freezes, did not ship in a secure phone box",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ONE WAS COOL... ONE WAS HOTTTTTTTTTTT!",
      "date": "Reviewed in the United States on May 13, 2021",
      "body": "I bought 2 of these iPhone XR's.  My sons was great, he had it up and running in just a few minutes!I didn't have the same luck.  First the unit was scratched... (I had never purchased anything \"renewed\" so that was a surprise to me... ) it also had a sizeable crack/dent on the lower right corner... which was also a shock.  But I figured that is just how refurbished phones looked... the camera looked pristine...and that is why I wanted a newer iPhone model... so I was okay with it.The trouble started when I was setting up the phone... this sucker started getting HOT!  I thought it was because it was being activated... or something... again... I have NEVER purchased a refurbished phone... so I had no idea.  Then after set up... I was done using it.  I sat it on my nightstand and didn't think about it again.When my daughter called me later that afternoon, I picked up the phone... and it was HOTTTTTTTTTTTTT...  I mean iron your clothes hot...  I asked my son if he was experiencing the same thing... and he was not... I asked my daughter if any of her iPhone had ever burned her hand... her answer was \"no\" as well... so I had to return the phone...as something much be wrong with it.I went to print out my return label... and noticed the seller has written that all returned phones with incur a 15% RESTOCKING FEE!So you're telling me... YOU CAN SELL ME A DAMAGED PHONE... AND GET $40-$50 bucks PROFIT?So there is NO incentive to EVER care about sending out good products?That could be a second stream of business all to itself... sell a damaged phone... get money on the return... rinse and repeat!  I WILL BE FIGHTING THIS TOOTH AND NAIL!  This is OUTRAGEOUS!",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not very good",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "I received it with scratches, the battery is horrible, and it lags incredibly. Also it will always say the device is from/located in Missouri for some odd reason.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s alright bought it brand new",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Said new but it kicks me off of apps and screen blacks out and shuts off at 20% and lower",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I’ve had better!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Phone seems to work fine, minus the fact that the microphone doesn’t work when using speaker phone. This is extremely inconvenient, but I can’t afford to not have a phone by sending it back. I just wish the seller/ restoration person did a full quality check on their items before selling back. Its Lame. I would not suggest this seller."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is bad",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Battery drains so fast."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A little glitchy",
      "date": "Reviewed in the United States on April 2, 2024",
      "body": "The phone is in beautiful condition not a scratch anywhere and the screen is all smooth and shiny and just perfect. I’m struggling with the phone being glitchy like not being able to keep up with me as I text and I am a very slow Texter at 58 years old! When someone sends me a message and it has a GIF, the whole phone gets striped and kind of fuzzy and stuck as if it were showing some big interference in a Syfy movie. I’m really not sure if this is to be expected when you buy a phone that is several Generations old? I have updated it and everything transferred as it should, I’m just having the glitch issue And not sure if I should report it or not, but thought I would share on here",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incorrect Model Number",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "While this iPhone came in great condition, the model is incorrectly labeled as US model number A1984, which is not true. This model is A2108. Bought this phone to create a second phone line on spectrum and per the listing it states the phone is Model number A1984, but once I turned the phone on and looked up model number it’s in fact , A2108 model, which spectrum does not accept. Have to return for this reason."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will Get You From Point A to Point B",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "I purchased this over the summer while I was doing my internship because I gifted my iphone 13 to my mom when she needed a new phone. It worked well for it's price and age for a while and then it started freezing on me at random times and I'd have to take 3 minutes to do a hard reset on it. Quite annoying at times, it's renewed quality started catching up to it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad but not as good",
      "date": "Reviewed in the United States on November 18, 2022",
      "body": "I ordered the iPhone Xr in ¨good condition ¨ and it came in okay condition, to be honest. The phone did come with scratches which were very noticeable on the side of the phone and on the top (Luckily there were no scratches on the camera) I was fine with the scratches and the color coming off and expected it since I did buy the phone in good condition, And I wasn't too bothered by it because I was just gonna put a case on it and no one would notice. The phone did come with tons of little scratches on the screen, that you can't see at all with a screen protector on, but off, it was very noticeable (if you look at it closely) It looked like someone ran their nails on it but it again it was fine because I had a screen protector on it.The battery life on the phone was 87% which is not too bad and was better than I was expecting.All in all, I love the phone so much, it's amazing in my opinion and I couldn't care about the cons, But if you're a person that cares a lot about the cosmetic features and the quality of the phone, Then I recommend that you either buy it in excellent condition (can't guarantee it'll be better since I don't know) or you just keep looking. Ill update you in 3 months!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charger is cheap",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "The charger literally broke in 2 weeks after normal plugging in and out socket. The prongs got stuck in socket because they were not put in securely. Heads up get a different charger when buying"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overheated",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "The phone just came in today and hasn’t even been on for an hour and is overheating. It says phone needs to cool down. I’m going to take to a phone tech tomorrow and see what they say but I’m pretty I will be sending this phone back for a refund."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works but its kind of glitchy",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "The product works but its very finicky, notice lots of small bugs and it is slow/you can see inout delay between when you click and when it does things"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected",
      "date": "Reviewed in the United States on September 12, 2023",
      "body": "Bought this to replace my iPhone SE that wouldn’t charge anymore. I figured it was an older model so I’ll get a newer one. Since these refurbs were the same price as a brand new SE, I said why not.Out of the box, everything looked good. It had a clear tear off screen protector I kept on while setting up in case I had an issue and had to return it. Once I switched over service and iCloud data, I removed it. I saw what I thought was just dust under the cover, but once I removed it, it was actually 2 gouges on the upper part of the screen. Small, but damaged none the less. I opened the Amazon app to see what the expectations of conditions I should have, and once the screen had a white background, it showed a dead space of discoloration on the lower left of the screen that I can actually see as I write this.Now I saw people have issues with the battery. Mine also shows an “unknown part”. Product description on Amazon says they guarantee battery capacity of AT LEAST 80%. I have no idea what mine is since it’s a non factory replacement. While setting up, I noticed how hot the back of the phone was getting. I’m not sure if it’s because it’s not an apple cert replacement, or the amount of processing it was doing while setting up. At the start of writing this review, phone percentage was 39%. 10 minutes later, 34%, which seems like a lot to lose that quickly.Collectively, it’s not what I was expecting as all these issues should have been fixed prior to sale. I understand it’s a refurbished phone, but refurbished means fixed in my opinion.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not very satisfied",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "I paid for a phone that’s supposed to be in “excellent” condition but it came in FAIR condition instead. The phone has scratches on all the corners & it’s a red phone. It’s got a few scratches on the back of the phone too. The battery life on the phone is 83%. Not thrilled with the phone but not able to purchase a new phone. Weigh your pros & cons before purchasing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Over heats",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Over heats from moderate use it’s not excellent when it comes to functionality",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed 🤔",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "I was pleased that the phones cosmetic condition was like new. The battery depletes very quickly and has a health percentage of 72. I would have expected the battery to have been replaced since this is a “renewed” item.I am going to replace the battery myself.Still a good value in my opinion.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2/5",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "I purchased this phone last year around April and started having issues with it not even two months later. I thought it would get better so I kept it for almost a year and it’s gotten worse. My phone is very slow, freezes up, autocorrect doesn’t work, and kicks me off apps that I use."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not that great of a deal",
      "date": "Reviewed in the United States on December 3, 2023",
      "body": "Had to send first phone back because it had issues connecting to the apple server then wouldnt connect to wifi. New phone, I had to find an old sim card to put in it so phone would work with wifi as I dont plan on purchasing a phone service for this phone.  Have to spend another $100 for a new battery so not such a good deal.  It will end up costing a little over $300.  Seller is quick to respond when you have questions. Had to fight with amazon on getting a refund for the first phone.  Was told 3-5 days them 2-4 hrs then 5-7 days then 10 days then finally should now get within 3hrs of this posting.  Fingers crossed! Seller is very quick to respond to questions which is good. The phone isn't that good of a deal when the battery has to get replaced at around $100 additional cost to consumer.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone xr",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "I received the item, the battery is only up to 79% which is a bit low compared to what I saw in the reviews and the exterior looks like it has some scratches, but nothing major, but I only received the charging cable without the charging port"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not quite sure",
      "date": "Reviewed in the United States on September 2, 2024",
      "body": "Phone cosmetics were good. Did have problems with transferring data, but seems okay. But there is buzzing bursts on microphone when notifications come on :(. Don’t know if this is a big issue for further operations for microphones"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issues after issue",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Phone keeps having issues like it keeps saying the battery isn’t recognized and now the screen keeps freezing at least once a week to the point to only fix it is to let the phone die because you can’t restart the phone due to the screen being completely unresponsive.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Took a risk, we’ll see how it goes",
      "date": "Reviewed in the United States on July 15, 2023",
      "body": "The physical body of the phone was exactly as described. No visible scratches or marks. I was sent the correct color. The phone even came with a screen protector already installed. The charging cable and power block were not Apple brand (as stated in description). It didn't come with original packaging (this is the first phone I've purchased from Amazon so wasn't sure what to expect). The phone wasn’t fully factory reset, but I was able to reset it myself easily so not a big problem. Then, just trying to transfer data from old phone to this one took about 5 hours not because there was just soo much to transfer, but because the software update stalled for so long. Had to contact Apple support for help to force update iOS. That finally worked, and everything transferred. Seems to hold charge. Screen functions properly. Did a few test phone calls and texts and everything seems to be in working order. Hopefully this purchase was successful and the phone lasts like I want it to. Should anything change I’ll update my review.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent is a bit of a stretch",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "Came with an easily 1/4 inch, pretty deep scratch on the front upper part of the screen. I was expecting the minor scratches and scuffs but not a gouge.Had several small dings in the metal that took off the paint, as well as paint scratched off around the bottom speakers."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought this for bday gift of my hubby,it’s his first try of using iphone,l.",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "The phone is in good condition,looks like brand new but the only downside is that when you call or answer the call you cannot hear anything unless you put it in loudspeaker."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be cautious of the refund policy.",
      "date": "Reviewed in the United States on December 10, 2022",
      "body": "This was refunded to a gift card, not the account it was purchased with! I bought two of these phones for my daughters. They worked great, but the charger cord didn’t stay in one. I started a return for the one that wouldn’t charge consistently and ordered another one so I could make sure the new one worked before I sent in my return. Upon returning it, the refund went to an Amazon gift card, not the account I purchased it with. So instead of spending nearly $600 on two phones, I spent roughly $900 for two phones and an Amazon gift card. I thought this would be okay, because I could just get a couple visa gift cards for the people I had intended to give cash to for Christmas. Wrong! Amazon doesn’t allow you to buy visa gift cards with the Amazon gift card balance. I’ve been a loyal customer for over two decades and always been happy with products and returns when needed, but this is new and shady to me. I KNOW I selected that I wanted the refund to go to my credit card. The phones have been great, but I wouldn’t have done it if I had know it would cost me $300 extra that could only be used for Amazon purchases."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a faulty phone 😡😡😡",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "I order the XR to replace my business phone that was an older model as an upgrade . I was excited to open the box and see that exterior of the phone was in mint condition no major scratches. The phone was a beautiful  color red and everything went well with setup. My excitement  was short lived, as i started to charge the battery the phone started to get extremely  hot and wont keep charge above 80 percent. Than when the battery life got down to 50 percent the phone overheated and shut down and restart with a battery life of 1 percent . I contacted the seller and told him about the issue , he told me that i can return the phone and he will mail me a new one. As i explained to him i lived in the Bahamas and i used a freight forwarder to get the phone the bahamas , and it will cost me the price of the phone to ship back.  He left it at it was my responsibility to get the phone back to the United States . Fine!Now , I had to find and pay an apple authorized company in the Bahamas to fix the phone that i expected to be in working and fully functioning. Extra money i didn’t expected to spend. I wish the seller would have given me a small portion of my payment back for shipping me a faulty phone . But no point in crying over spill milk now . But i just want to say to person living in a country outside of the united states to be very careful when ordering from this seller.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "Upon initial receipt of the phone there were a few minor scratches to the housing. In addition, the phone’s microphone didn’t work (at all) when receiving or calling out when not on speaker or the use of head phones. Also, the camera quality wasn’t as great as I had expected. I had ann XR prior to this one annd the picture quality seemed better. Regardless, after several months of use, the battery began to rapidly decline, phone would get really hot (even when not in use) and then on June 30, 2024 the phone completely crashed and died. Like the hard drive totally but the dust and phone will not turn on. The phone was easy to set up initially, however, with the issues I had from the start I don’t think it was worth the time or money. Am really disappointed i didn’t get much time out of this one and had to spend more money to purchase a new phone and lost some data.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issues with Face ID and Screen.",
      "date": "Reviewed in the United States on January 20, 2023",
      "body": "The positives:The phone overall was great. I purchased the 256gb and it came with a 92% battery life which honestly I was even shocked by since that's 12% more than guaranteed. It ran smoothly and whatnot, everything was working, or at least I thought it was.The negatives:The Face ID is completely broken, it won't work at all. I tried multiple times but kept getting hit with the \"Face ID is not available right now, try again later\". I tried everything I could including contacting Apple Support. Apple support confirmed that the screen of the iPhone was not a genuine apple screen and was third party, which likely broke the Face ID. Also unrelated to the Face ID but about the screen still, it shut off randomly out of no where and would not turn back on. I still heard audio coming from the phone, but the screen was black... I had to do a hard reset of the phone using Find My iPhone from another device to fix it. Not that bad, but still scary.Nonetheless if you don't mind not having Face ID possibly, then this phone is nice.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent but kinda disappointing",
      "date": "Reviewed in the United States on January 19, 2024",
      "body": "My review is based off of my experience with other \"Excellent Renewed\" products, and this one was honestly just a little disappointing. Everything works fine but there are scratches on iPhone such as around the edges, the screen and back, and area the camera. Nothing a case can't hide, but for an excellent renewed, I expected something in better quality like I have received before, but it is said in the description there will be minor scratches, I guess that is subjective. Another thing that was disappointing was that it was supposed to be guaranteed at least 80% battery health, mine came in at 78%, not much off the guaranteed 80%, but I would like for my product to have came in as promised. The problems aren't a huge deal, but kind of just disappointing.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone XR",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "No charger was included in my box .. for the amount of money that was paid I should’ve gotten a wall and car charger"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "Looks good. Still trying to know why the battery goes out quickly"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nothing to like about it!",
      "date": "Reviewed in the United States on May 12, 2023",
      "body": "I have literally hated this iPhone from first hour after setup. In a matter of 1 hour to two hours , this iPhones battery life drops to 20% after an overnight charge. Facial recognition is so very buggy. It fails most of time. Everything about this iPhone seems bugged. Feels like key stroke logging on every page I open, when I can get it to open. There is nothing smooth and snappy about this iPhone compared to my others. I hate having to be forced to attempt several actions to complete one simple process. I don’t know if it’s related to a bad computing processor or what. The audio and video are not great. Pictures look and sound worse than what I have seen on others who own this same phone. It has a terrible connection issue with everything I try to connect it to, either with Wi-Fi or Bluetooth. My phone calls constantly disappear and I cannot press prompt buttons during a phone call. Worse than this is that I keep getting phone disconnects on almost every call. I took my same cellular SIM card and moved it back into my older iphone and this never happened over several phone conversations. I have to yell loud throughout my building to get the person on the other line to even hear me. This is so frustrating! There seems to be a constant issue with apps running on this phone. I always have to delete them and reinstall them again to get them to work again. Super annoying! I’m not sure why the camera recording or listening light keeps coming on. I have everything turned off. I want to take a shower, a shat and a shave in private thank you very much! I can nag so much more on this phone but it is only going to raise my blood pressure. Doc says to take it easy so with that said, here ya go, I’m sending this back to you in better condition than which you sent it to me. Didn’t even come in an iPhone box of with documentation. Keep your personal literature out of my shipment.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker Issue",
      "date": "Reviewed in the United States on December 9, 2019",
      "body": "The phone looked great!  A couple of surface scratches on the top right of the screen, but that's to be expected I guess with a used phone.  I wasn't really concerned with those small issues. I transferred everything from my old phone and completely set up the new phone and everything was great!  I was soooo excited and felt really great about my purchase,.....until I made a call.  It wasn't until I had invested several hours into the new phone that I realized the ear speaker has a shattery sound and makes it difficult to hear the other person on the call.  The speaker does technically work, but the voice sounds muffled and shattered, like an old busted car speaker.  I really hate it because I like the phone and spent so much time setting everything up to be personalized to me.  If I new the quality of the speaker before hand, I would have returned it immediately, but at this point I think I will just deal with it.  I don't like change and it took me forever to upgrade from an Iphone 5S (crystal clear speaker btw) to the XR, and unfortunately it was just a bad experience because of the speaker issue.  The phone is excellent other than this one issue, but a key feature of the a phone is to have conversations with others right?  I needed this phone for my personal and business use, so I hope the speaker doesn't continue to degrade.I'm not sure how the company tests for sound quality and clarity, but I would encourage everyone if you decide to purchase a used phone, call someone on the phone first before personalizing it to you.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Life battery 78%",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "They promised 85%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging  is horrible",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "This phone DOES NOT HOLD CHARGE.  I wish I would have returned it because of that, but I traveled and time passed. I cant even hear properly to have a conversation. I have to use speaker phone. Disappointed."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    restarts itself",
      "date": "Reviewed in the United States on May 5, 2023",
      "body": "I needed a new phone, right? I had to save up money for a long time because I'm in high school and didn't have a job. I wanted a phone with a lot of storage because I'm into photography and take a lot of photos. I got my phone and after a week the right speaker quit working. I could have returned it because of the warranty it came with but, personally didn't care because I always use earbuds anyway and I didn't want to deal with switching phones again. After 3 months when the warrant was gone, the phone started to restart itself about every 30 min. and stay off for up to 10 min. Nothing I did could make it turn back on when it did this. But I couldn't return it! So I decided to just deal with it and I've been dealing with it for about a year now! One time I got stranded in a sketchy place because it restarted and I didn't know where I was and I had to wait 10 min. for it to turn itself back on. I contacted Apple and they said to update it so, I did but it only fixed it for a month. So I tried updating it again, but I didn't have enough storage, so I went and deleted a TON of stuff so I could update it. I finally got rid of enough stuff to do it (I was trying to back my stuff to the could so that I could reset my phone to see if that would fix it) When  I was about to update it and it restarted. Ok, no biggie right? Well, when it finally turned back on it started freaking out and the screen kept freezing and going black. So then I restarted it. it turned on fine but then when I went to update it it said my storage was full! with what?! I have no idea!!!  I'm sick of dealing with this!!!! idk if I'm unlucky but every refurbished iphone I've bought from Amazon has not been good!",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "When I first received the iPhone, it was an un working condition after around an hour and a half of troubleshooting with friends, Amazon, Apple, and everything I figured out that I needed to download iTunes onto my computer update the iPhone, and then it proceeded to work. this was an additional two hours of my life that should’ve never been taken away from me. The phone works, but there’s a lot of extra steps that if you’re not technologically aware of could cause you a lot of problems."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked ok in beg but slow, hard to text & Started glitching and screen going blank",
      "date": "Reviewed in the United States on May 8, 2024",
      "body": "Worked ok at first but showing signs this will not last more than 6 months & I take a gamble at returning as I run the risk of a subjective assumption made on condition & would leave me without a phone or the money to purchase. Too much of a gamble. Will not purchase by this means again"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Christmas Gift Failure",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Cant connect this phone because it is locked my service provider cannot connect it for that reason. This was supposed to be a Christmas gift for my grandson on12/25/24. My daughter has a message out to Edge Cellular in hopes that they can do something to fix it. Frustrated!!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as advertised",
      "date": "Reviewed in the United States on November 12, 2023",
      "body": "The back of the phone looked great and the storage and color were correct. However. It said like new condition. The phone screen was horribly scratched. They tried to hide it via screen protector but I could still see some. I then removed the preinstalled screen protector (I am picky about which one I use) and saw that the phone worse than it should have. I also noticed that there is space in between the screen and the phone casing. Even tho the phone works as it should, cosmetically it should have not been labeled as like new condition. And the fact that they tried to hide the damage with a screen protector is shady. After reading further reviews I checked to make sure the device wasn’t reported stolen. Thankfully both imei were clean.If you get a phone from here, just expect more cosmetic damage to the device."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    item came scratched",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "So far the phone looks great, However it came damaged as the screen is scratched up and definitely not the quality that was boasted about. at first i’d thought it was the screen protector, but after removing it and looking closer, the phone came like that!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not great",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "This is the second phone I’ve bought within the last year. I paid more this time thinking it would be a better phone. Nope. Second day of my daughter using the phone it won’t swipe up. The first one started glitching after 5 months got so bad couldn’t even see the screen. So be careful. I know there’s a chance in buying used that’s exactly why I paid more because it was supposed to be top notch phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible customer service",
      "date": "Reviewed in the United States on September 6, 2022",
      "body": "The phone works as should and quality is not bad as well. However, I was unable to connect my phone to any Bluetooth devices as the phone would not pick any of them up when trying to pair. I contacted the seller and went through troubleshooting steps which did not fix the problem. I was told to sign out of the phone and send a screenshot to prove I was signed out and they would send a return label for a replacement. I’m not exactly sure the relevance of this. Return label was sent and I was asked to send proof that the phone was sent back through postal service. I’m not sure the relevance of this either as there is a tracking number on the return label. I respectfully asked for a $20 credit as I would now have to pay two activation fees with my carrier (which actually turned out to be three fees as I needed to reactivate my old phone while waiting for the replacement to come in which equals out to $40 extra I should not be shelling out). I was told they don’t know what an activation fee is, that their phones are all unlocked, and to send proof of the activation fee and they would research it and make a decision. I’m not sure what planet these people are from but it’s definitely not here.. Do better.Update: I sent the proof of return to this company and now they say they don’t have this phone in stock and will refund me once they see the condition of the phone. The worst company ever.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okay",
      "date": "Reviewed in the United States on July 27, 2024",
      "body": "Battery never really held a charge. It looked and functioned correctly. Very annoying that I always it on the charger. Probably would not  buy again!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected!!",
      "date": "Reviewed in the United States on May 29, 2024",
      "body": "Visible parts of phone is in great condition, the only down side about the phone so far is that it has a line on it when the device turns on. As if it comes from water damaging, this is what I get for buying a refurbished phone. Good thing it’s for my 11 year old, but not happy about that at all."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Falta de información",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "La batería del teléfono no es originalNo dice la vida de la bateria"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Flawed screen bummer",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "Really nice phone except for a flawed screen.Also had to pay for the return on a barge!Hope I get my money back."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone xr",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "Phone is working well except battery drain quickly without use anything."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Touchscreen not great",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "When swiping the screen to get apps to clear, it’s not as responsive and takes a slow firm touch to swipe away. I changed the touch accessibility settings too and it’s still slow."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective battery",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "Phone runs out of battery; in 5 hours.Have to find someone to change the battery for a new one.Meanwhile o have to keep it connected all day. Too much problem."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok refurbished phone for price",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "Great condition but speaker for phone was less than stellar had to put it on speaker just to hear my conversations. Was purchased in a pinch and did its job"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Face ID doesn’t work",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "Phone looks good and operates fine. Only down side is I paid $205 for a “good refurbished” and the Face ID doesn’t work. It also gets hot while charging. Should at least advertised that the Face ID was not functioning.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Face D doesn’t work and scratches",
      "date": "Reviewed in the United States on April 29, 2024",
      "body": "I thought by it being liable excellent that it was go be a still.. but it’s pretty scuffed overall a clean 3.5-4 stars cause I still  like the brand . And Face ID doesn’t work well it give u trouble .the quality a 8.5 it’s pretty nice"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data was not cleared completely from previous owner",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Phone is fine for what it is, but the data was never completely wiped and the ios system was very outdated. Had to spend 2 hours just to get it set up to where I could transfer my data."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Straight junk",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Terrible battery and slowed to a crawl after return window was up. My friend had the same model he bought new, still going smooth even if his speaker no longer works. Despite having the same model in better physical, shape I can’t do anything. I cant type a sentence much less take a picture. So save you money if you want the words you type to show up when you type them and in order. Save your money if you might wanna use expect it to possibly take photos or god forbid a video, good luck getting the camera to stay open and not crash. Even after waiting and taping again and again. Save your money if you wanted to listen to music uninterrupted by stutters and freezes like you bumped your cd player. Seriously, just save you money.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came as Acceptable",
      "date": "Reviewed in the United States on May 20, 2024",
      "body": "The phone works good, it tend to get hot when it on charge, it came with a little scratch beside the charging port and a little crack down a the bottom glass can barely see, also after two days the phone was at 94 then it drop down to 90% overall I would give it a 6/10"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed excellent condition",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "Bought this phone for my teen daughter who absolutely loves it. With that said I am personally disappointed as I paid extra to get a renewed phone in excellent condition witch by there definition should have no scratches or cracks in the screen and no scratches or scuffs and cosmetic damage but the phone I received has a Crack at the top of the screen. It is small and seems minors and my daughter didn't care so we are keeping it but I should not have to pay extra for something I didn't get!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone not so great",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I’ve had this phone for almost 30 days. Already the phone is glitching. Screen gets frozen a lot. Sometimes I can’t even get it to light up. Dropping apps while I’m still using them."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had to return",
      "date": "Reviewed in the United States on May 9, 2024",
      "body": "I bought this phone around May 1, 2024 and had to return it. The phone was in great condition but once I tried to activate it, the screen kept freezing, and would not allow me to go through the process of activating rhe Phone, so I had to return it"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Voice speaker doesn’t work",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Phone works voice speaker when calling someone doesn’t work they can’t hear me speak"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Noticeable damage",
      "date": "Reviewed in the United States on June 23, 2023",
      "body": "I loved that it only took 2 days to receive my iPhone XR. They shipped it the same day I ordered. It’s the right color and has almost no  marks, a few scratches right around the camera. Set up was easy since I previously had an iPhone, all I had to do was insert the same SIM card I used previously, they even gave a guide for it. So far everything on the phone works, face recognition, cameras, speakers, but I’ve only had it a day. Was even fully unlocked and was added to my plan.Update: it has been less than 90 days since I ordered the product. ( June 22nd to sep. 1st) There is now dead pixels across the entire bottom of the screen. The speaker is no very quiet on full blast, and the cameras have a hard time focusing.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Understand what they sell",
      "date": "Reviewed in the United States on April 14, 2024",
      "body": "The phone was in good physical shape. However, it was sold as refurbished. The battery had to be replaced as soon as it arrive. Full capacity was 80%. The charger didn’t work. If the devices were actually refurbished these items would have been in like new order. The phone does work. So 50/50 on the review. Shipping was easy; delivered day early.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    False Description",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Just purchased. Excellent condition was last one in stock. APPLE recommends replacement of battery at 80% this “excellent condition “ is at 85% feels like I received a good condition one but paid the price of an excellent one. Which is upsetting it have scratches and chips. If i wanted a good condition one i would have ordered that. Feels as i am being lied to.. customer support wont do anything to help said i have to return it and get a refund and thats my only option. If i do that i lose all my stuff as i transferred from another phone and that one is data erased already. They cant even give me a credit so i can order a scratch repair for it",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Eh",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Liked to turn off by itself but got me by for awhile."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed? Not so much.",
      "date": "Reviewed in the United States on June 13, 2024",
      "body": "Only nine months after purchase (but after the return window has closed) the phone is acting up. Very glitchy. I do not recommend purchasing a renewed product from Amazon."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The screen is not working like it needs to. Otherwise, the phone works good.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I received the iPhone X a couple months back and now the screen is not working properly. I am not able to text only voice text and that is not what I spent $170 on for a phone. I’m disappointed. The phone should function much better especially for the money that was paid out and for the time that I’ve had it. I have ordered other phones in the past from Amazon and I’ve never had any issues with Amazon reimburse me for a different phone?"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok",
      "date": "Reviewed in the United States on January 20, 2023",
      "body": "It works a lot better than my old phone, so I can’t really complain. However, I will note that it has some glitches. The screen doesn’t always respond to my touch, it seems to overheat quite easily, and it’s had some issues with my CarPlay. Every once in a while while using CarPlay, it switches to the speakers that are supposed to be used when you are on a phone call. I don’t know why it does this while playing music, but once I pause it and replay it, it stops. Also, it does this completely randomly, so I really don’t know what triggers it.  I also noticed that the Siri function doesn’t always go off or hear what I say properly. I haven’t had any other issues with the phone other than the slight glitches, but depending on my mood it can be quite frustrating. Seems to be an OK quality."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t buy from this seller",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "I bought a iPhone from this seller that came with some issues that it’s almost impossible to use the phone. The phone turns on and off frequently. One minute is on than suddenly turns off when you are in a middle of a call or texting. Also, the phone shows a full battery and then after minutes shows a empty battery.I asked the seller to replace it.However, they refused it. The problem came since the beginning of the purchase. I bought to my mother that lives in another country. I wasn’t able to return it before the 90 days as the phone was in another country. I explained the situation and requested the replacement as my mother is here in USA right now and I’m able to return the phone. It just passed a few days from the return policy. Even though my explanation, they denied the return. Don’t buy from them."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I ended up returning it after a few weeks",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "Back in 2020, I had this phone and I really loved it. At that time, the phone broke, and I ended up selling it. Recently, I had sold a new iPhone and wanted to give another one of these iPhones a chance. I decided to order it and had it for a few weeks, but a problem I noticed almost immediately was that the battery drained very quickly and sometimes the phone would freeze. I live a fast-paced life and need to use my phone all the time for work to get directions and go places, which frustrated me. So, I had to return it after a few weeks due to the technical issues."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pay attention to the sellers and their ratings",
      "date": "Reviewed in the United States on July 9, 2022",
      "body": "I will usually only buy from HYBRID IT. They are the safest to buy from in terms of getting a phone without much or any damage. I’ve tried unsuccessfully to buy from backmarket and the sellers there , but it’s very hit or miss. I’ve had phones with tons of damage show up and been very disappointed. So I purchase usually exclusively from hybrid it on Amazon. Their prices are a bit more than their competitors, but the phones come in like new condition most of the time.This XR I purchased looks very new, but I am really disappointed by the battery health. It’s 80% which is as low as you can go on Amazon. For reference my husband purchased an XS Max from Hybrid and the battery was at 96% . 80% means I’m putting another $100 out at Battery Bulbs Plus to replace it within the next month. So that’s disappointing, but I guess that’s the gamble."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nope.....",
      "date": "Reviewed in the United States on April 17, 2024",
      "body": "i was very excited for this phone  but ive had to return, the screen protector came broke, they not even to change that( i changed since i had a new one) . the little holes where the sound comes off was dirty, and i bought the renewed one the one whos almost new, not the still good or fair to use,  my impression is they havent cleaned the phone at all, thats what it seems, battery life 78, for almost new very poor battery life.  the system for some reason was also not responding quite well. if it was only fair to use or still good to use i would be okay but i bought the opotion almost new and the one i received was nothing close to that.... dont know if they mistake the option i selected and paid or was really that what people been giving 5 star...."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s ok",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "It gets hot fast and had a problem with it shipping I thought it was gonna get there the 15th but ended up showing up the 18th when I paid to get it the 15th but it’s a good phone works well charger was broken!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Good",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "Got the phone yesterday set up everything and the next evening it kept shutting down by itself. Will update later."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health not good",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "Battery health is 88%. Not impressed at all"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    About the product description was exaggerated",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I noticed that the battery capacity is only 76%, which is below the stated guarantee in the product description. The listing clearly mentions: \"Tested for battery health and guaranteed to have a minimum battery capacity of 80%.\"  Given the discrepancy between the advertised and actual battery capacity, I am concerned about the value of this purchase. Battery drains fast",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on July 5, 2024",
      "body": "Lots of issues. Will be returning.Siri acts wierd, App Store vanished, cheap replacement material"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY!!! SELLING STOLEN PHONES",
      "date": "Reviewed in the United States on June 17, 2020",
      "body": "I am wanting a FULL REFUND. This phone is STOLEN. I just went through AMAZON and tried to request a return & I  am currently waiting for the seller to respond. The phone did not come with a charger nor a manual. Upon inquiring about that, they \"emailed\" me a copy of a manual. Did not address the issue about the charger. I've spent nearly my entire day (6/17/2020) at an At&t Corporate Store. The phone came in what looked to be great aesthetic condition in a clear bag inside a regular cardboard box(No original packaging at all). I went to AT&T to have the phone activated. After trying repeatedly to activate the phone over a time frame of 5 hours, they proceeded to ask me where I purchased the phone from. I advised them and showed them the receipt information. They advised me that they were trying to activate the phone but, kept running into multiple error issues with the SIM and phone ID. They input new SIM's, etc. The representative got the phone to activate for a minimum of about 7 minutes total. After activating the rep tried to make a call to verify that the phone operated and the phone dial tone gave an error message of  \"blocked from network use\". The at&t representative and a manager messed with it multiple times and could not get it to work. The supervisor at that point advised us that AT&T along with all the other cellular companies monitor SIM cards and phone ID's for stolen or lost traffic. This phone was apparently reported stolen according to the phone ID. She stated they would not activate it, refused to give the phone back to me until I called the cops, and filled out a report. I've contacted the Seller with a message requesting them to GIVE ME MY MONEY BACK ASAP as I want to send this stolen phone back to them. I want NOTHING TO DO WITH IT. A police report has been filed.",
      "helpfulVotes": 52
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish I had bought from Apple",
      "date": "Reviewed in the United States on June 28, 2023",
      "body": "Then phone looks fine and performs well most of the time. But then it doesn't. e.g. it recently decided to treat incoming phone calls with a banner instead of a ring tone. I did had not changed any settings. I even opened settings and changed the setting back to audible from banner. The banner persisted.  The battery also behaves strangely once the charge falls below 75%.  I called customer support - a pale shadow of the robust customer support offered by Apple - a labyrinth of mindless recordings blathering, \"how can I help you today?\" - accomplishing nothing.  I wish I had paid the extra $100 or so and purchased my phone from Apple. (I own a Macbook Air and Apple support has been phenomenal.)"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broken camera",
      "date": "Reviewed in the United States on March 4, 2024",
      "body": "When the phone first came in everything was going good but once I tried to use my back camera it was broke just showing purple , if you are going to by this phone PLEASE look at the reviews first !"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dont bother!",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "I got this to replace my iphone8+ which finally went bad. This phone is total JUNK !!!! It has absolutely no volume control I have to stand in a room that is totally silent just hear what sounds like an extremely low whisper. Do yourself a favor and just buy a NEW phone from your service provider. I have had to go thru changing my phone number three times because of my old phone (which was at 10 years old) ten times a better phone than the junk I bought off Amazon. And now I cannot check my account balances, cannot call or receive phone calls I cannot do anything. This purchase was my biggest mistake and I have lived to regret ever buying it! Now I cannot even pay my bills on line",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not 100%",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "The screen was damaged slightly at the top right corner. Having been without a phone for over a week, it was not worth the trouble of sending it back and getting a replacement.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s junk",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Would have gone lower on stars if I could have!This phone should never have been listed to sell!It had been a piece of junk from the first week we got it! It will burn your hand if held to long, plus the screen it’s so big suddenly you can’t get it reduced! It freezes up several times day! I’m really a palled this was ever on line saying it was totally refurbished! BS"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It worked",
      "date": "Reviewed in the United States on January 5, 2024",
      "body": "I believe the price was a bit high for an outdated item but I did need it and the seller provided it on an greed price. I was hoping the screen would be less scratched but I do have a spare from old phone that can be used if I find it that annoying. I have the small board that copies the main board serial number to install on the replacement screen for the true tone. I know, not the usual review...."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Annoying changes from previous iphones.",
      "date": "Reviewed in the United States on March 5, 2021",
      "body": "As far as the shipping, packaging, etc. very good.The reason for low ratings is due to changes Apple has made to their phones more recently (including the XR).I should state before making my points that I like clear,  easily used technology, and am a little old fashioned. Never the less, here are the reasons I am unhappy with the phone.1. No home button. It makes navigating rather difficult - especially quick navigation. I had to completely relearn how to do everything on the phone which I wouldn’t have figured out if my brother (who has the same phone) hadn’t shown me.2. Changing some home button features to a side button - like siri, which I had to deactivate because I kept setting her off.3. They “enlarged” the screen by extending it up around the camera. I am constantly accidentally activating the functions they attached to those areas. Just picking up the phone I have to actually pick it up by the camera most times so I don’t waste time getting into a menu I don’t want and have to get back out of.4. Because everything is operated by swipes, often times I swipe a little one direction and instantly have things on screen I never intended to get into. Rather frustrating. Seems more sensitive than the 6S was.5. Battery life is decent. Not amazing. I have to charge it every night, which in my opinion a modern phone should last longer than one day, but it is what it is.In conclusion, if someone just needs a phone upgrade, sure, grab a XR. If anything I’ve mentioned sounds annoying, maybe look for something else.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I guess you get what you pay for",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "I was excited and got the excellent condition one and it had good reviews.  Excellent condition had a color spot on the screen, is super slow to respond to buttons most of the time ans the battery dies quickly.  Def super disappointed but i guess it does make calls."
    }
  ]
}