{
  "asin": "B09V5LDZQ4",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished as new (Excellent) indeed",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "Although this phone took longer to ship than stated when I placed the order, I was delighted when I opened the box and held this stunning-looking phone in my hand. The phone looked new in every aspect, except for a few hardly noticeable scratches around the charging port. The phone was unlocked, allowing me to use the SIM cards I own. The charger provided is not a genuine Samsung charger, but it looks good in quality and does the job. This phone's camera and screen display are dazing, as they say. The only downside of this phone, a well-known and well-documented fact with all Galaxy S22 phones, is that it tends to overheat when using applications like the camera for extended periods. This phone's battery is only 3700mAh, and when compounded with heating and extended use, it can quickly drain the battery. However, I already researched and knew this issue before buying this phone, and this fact doesn't bother me very much. As my first Amazon Renewed purchase, I am glad my experience was superb. I hope this phone doesn't disappoint down the road.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy S22 Smartphone Review",
      "date": "Reviewed in the United States on June 19, 2024",
      "body": "OverviewThe Samsung Galaxy S22 is a flagship smartphone that represents the cutting edge of mobile technology. As a factory-unlocked device, it offers flexibility for use with various carriers. With a sleek design, impressive hardware, and advanced camera capabilities, the Galaxy S22 is designed to cater to both casual users and tech enthusiasts.Design and Build QualityThe Galaxy S22 boasts a refined and modern design, with a premium glass and metal build. It feels solid in hand, with a sleek and elegant aesthetic that is characteristic of Samsung’s high-end devices. The device is available in various colors, catering to different style preferences.DisplayThe phone features a 6.1-inch Dynamic AMOLED 2X display with a resolution of 2400 x 1080 pixels. The screen offers vibrant colors, deep blacks, and excellent brightness levels, making it perfect for media consumption and gaming. The 120Hz refresh rate provides smooth scrolling and a responsive touch experience.PerformanceUnder the hood, the Galaxy S22 is powered by the Snapdragon 8 Gen 1 (or Exynos 2200, depending on the region), paired with 8GB of RAM. This combination ensures top-tier performance, allowing for seamless multitasking, smooth gaming, and efficient handling of demanding applications. The device runs on Samsung’s One UI, based on Android, offering a user-friendly interface with a plethora of customization options.CameraOne of the standout features of the Galaxy S22 is its camera system. The phone is equipped with a triple-camera setup on the back, consisting of a 50MP main sensor, a 12MP ultra-wide sensor, and a 10MP telephoto sensor with 3x optical zoom. The camera performs exceptionally well in various lighting conditions, producing sharp and detailed photos.The 8K video recording capability is a notable highlight, providing incredibly high-resolution videos that are future-proof and offer impressive clarity. The front-facing 10MP camera also delivers high-quality selfies and video calls.StorageWith 128GB of internal storage, the Galaxy S22 offers ample space for apps, photos, videos, and other media. However, it lacks a microSD card slot, so users looking for additional storage will need to rely on cloud services or opt for a higher storage variant if available.Battery LifeThe Galaxy S22 is equipped with a 3700mAh battery, which provides decent battery life. It supports fast charging, wireless charging, and reverse wireless charging. With moderate use, the phone can easily last a full day, but heavy users might need to top up the battery by the evening.ConnectivityAs a factory unlocked device, the Galaxy S22 offers great flexibility for use with different carriers. It supports 5G connectivity, ensuring fast data speeds where available. Other connectivity features include Wi-Fi 6, Bluetooth 5.2, NFC, and USB Type-C.Additional FeaturesFingerprint Sensor: An under-display ultrasonic fingerprint sensor provides secure and fast unlocking.IP68 Rating: The device is water and dust resistant.Stereo Speakers: The phone offers a great audio experience with its stereo speaker setup.ConclusionThe Samsung Galaxy S22 is a powerful and versatile smartphone that excels in design, performance, and camera capabilities. Its 8K video recording, premium build quality, and vibrant display make it a standout device in the competitive smartphone market. While the absence of expandable storage might be a downside for some, the 128GB internal storage should suffice for most users. Overall, the Galaxy S22 is a solid choice for anyone looking for a high-end Android smartphone with cutting-edge features.",
      "helpfulVotes": 60
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent little phone",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Received the refurbished phone. Generic packing, no manual, no charger. In good shape, no scratches.Battery drains quickly under heavy use such as gaming or videos. Since I do neither, it does not matter to me. Side buttons are small and do not always respond at once when switching phone on.Other than that a good price for a 3 year old phone. Fairly quick to respond, nice camera. Sound not so great. If you look for a good solid phone that does everything a modern phone should at a fraction of the price of a new one, I would not hesitate to recommend this S22."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works nicely",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "When I received the phone, it was packaged very nicely and there wasn't any visible signs of damage, it looked brand new. The s22 is a bit smaller than my old note 8 but it fits better in my pocket for when I'm at work so that's fine. The phone itself is really good, it works perfectly and it does everything I need it to do. I was able to use smart switch to transfer everything from my old phone so there wasn't any interruption between the phones. My only complaint is that the charger that came with it is a little too short for my preferences but that's an easy fix. Overall, the s22 is a good phone and I recommend it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not receive what I ordered",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "I wanted to wait a few days before writing a review so I could test the performance of the phone. Upon initial un-boxing I was immediately disappointed. I had ordered a white phone, but instead I received a pink one. I would've been okay with getting a black, green, or even maroon, but I got the one color I did not want nor did I order. Also in the listing description it said I would receive a charging cord, adapter, and sim pin key. I only got the charging cord. The phone was described as being in excellent condition however I would not say that is the case. I think it's in good/great condition, but not excellent as it has a few minor scuffs along the sides. The screen itself had no scratches that I could tell.The first day of use setting everything up I noticed the phone was starting to overheat. It's been almost a week now and have not had any issues with overheating since. I will update my review once I've had a chance to use the camera for a long period of time and see how it performs after prolong usage.The battery life is not very good, but I have access to a charger most of the time so it hasn't been a big issue.Giving this phone a rating of 3 stars for now. If I had received what I ordered I probably would rate 4 stars.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Well my phone was unlocked and the battery life is good, it's better than my z flip 3 battery life. Everything works perfectly fine .it came with a samsung 45 watt charger I think but it works fine, about an hour to charge from 0 to 85",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is new looking.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "The phone looked brand new.I ordered the wrong size though. And of course, my old phone is working again. I lost the sound but now it's back again. I will keep the phone just in case. Thank you fast delivery too!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Happy With This So Far: Great Phone for Great Price, But Some Key Downsides",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "I've been a huge fan of buying 1-to-2-generation old refurbished Samsung flagship phones. This is my second of them and I know some other people who have done it too and it's a great deal. This phone was top-of-the-line about two years ago. It is still a huge upgrade for me, replacing my 4-year-old Galaxy S10e that i obtained similarly back then. Very cheap, I was able to get this one for $235 which is a steal, this is much better than new phones in the same price range.Things I like about this phone: it's relatively small, very fast, the display is super crisp. It's great at getting signal, and wireless networks and bluetooth pairing all work beautifully. I usually talk with a headset but phone calls without a headset are fine. The camera is great quality-wise.Things I dislike about this phone: I would prefer it to be smaller. Phones keep getting bigger. The Galaxy S10e was slightly bigger than I like, and this one got a little bigger AND heavier. It feels bulky in my pocket. Also I don't like the location of the camera, because it tends to make the cases for this phone be very thin near the edge of the phone, which tends to make them break in that spot. And this is a design flaw with the phone, not the case, because the way the phone is made there is an area around the cameras that bumps out in such a way that makes it so you can't make that part of the case thicker. iPhones did a better job of this design, allowing for a slightly thicker piece of case.And the other downside is the bloatware. Samsung is awful for the bloatware. there are some notifications that are very hard to turn off, like the one about \"Find Your Phone\". Samsung is constantly pressuring you to sign into their service, and it makes it very difficult to sign out. Two-factor authentication required to sign out? What a farce. This phone made me very frustrated at the people who designed it.Lastly, the other things I really dislike about this phone, which unfortunately follows industry trends. There is no 3.5mm jack. I used that heavily and I really miss that. It's a big downside because now I can't use corded headsets, which I prefer in part because you don't have to change them. AND this does not have a removable battery.The battery going is usually the reason I have to replace my phone, so lacking a replaceable battery limits the lifetime of the phone. Replacing the battery is affordable if I can do it myself, if I have to drive to a store and pay someone to open the phone up to replace the battery, it's not really worth it. So basically the lack of replaceable battery makes this phone shorter-lived for me...especially since the battery life is perhaps not quite as good as it could be. It's not terrible, but you really do need to turn power saving on from the start. I also recommend charging only to 80% to prolong the life, and then just charging more frequently. This device seems to run a little hot which tends to make batteries wear out fast, so definitely watch that.With these limitations, I think this phone is still a great buy. But it does have some design flaws that unfortunately Samsung has not addressed in their newer phones. The whole industry has been moving in the wrong direction IMHO, planned obsolescence, making their devices non-repairable. I hate it. And because of it I refuse to buy new products. Buying old products like this is my way of protesting the industry. I refuse to pump big money into an industry that isn't representing my values and the things I care about in life.",
      "helpfulVotes": 155
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost didn't buy it because of the other reviews!",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Take some reviews with a grain of salt. I almost didn't buy it because of the other reviews, glad I took a chance. I ordered the Samsung S22 advertised as excellent, and it arrived in excellent to perfect condition. I am currently on MetroPCS, and 2 reviews stated none compatibility...I've posted pictures that PROVE this phone can be used with MetroPCS. I'm also posting this review via my new phone. I'm very glad I took a chance, and I hope to help anyone coming here looking to add this phone to their MetroPCS plan. Highly recommend this phone, in the excellent or higher category. Well deserved 5 stars for the service and phone condition.*Also, in reference to the speaker defect with the S22; pressure can build up but that's most commonly associated with the stick on camera lens protector people put on after purchasing the phone. Those people have unwittingly covered the small vent hole designed to allow for pressure changes within the phone. 10 minutes of research and I know for sure I don't have to worry about it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wrong color, still works.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I gave 4 stars because the phone does work and is in beautiful condition. The only issue is that I did receive the wrong color, but because I'll always have a case on it anyways and don't want to deal with returning it, I'm happy to hold on to this one. Aside from not receiving what I actually ordered, I am satisfied with my purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finish flaking off.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I like the phone but it didn't come with any directions and basics like turning it off are different from previous Samsung galaxy. Also thr finish on the right side of the phone is flaking off. Like the size and color and function so far."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I received my phone the next day after ordering day prior",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "I have not had enough time to Check-in. Check and see the quality seems to be faster. It's just like everything this new and technology.It's a learning curve"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phones perfect",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Love the phone , you see very minor scratches but it hold charge very good charges very fast also no issues with over heating"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it!",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Excellent waterproof phone. Great camera quality. Battery is durable for the most part. Holds charge for a good time. It's not too weighty, not too light. Came in excellent condition as promised."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I've had this for 3 months now, works great so far.",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Great camera vs my old phone, this one is working great after 3 months so far. Battery life is very good. I'm happy with my purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Work perfectly",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Still working perfectly after 2 years"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the quality I had expected but worked well!",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The device was a bit more scuffed up than I had hoped for, but it was only on the sides which was easy to cover up with a case. The front and back of the device were like new, and it functioned well with good battery life."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "The phone is in excellent condition. Looks brand new.  Sim is unlocked to the carrier in my region, would definitely recommend the seller.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    my first renewed product & loving it",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I was skeptical when i purchased this renewed product but this phone has been nothing but great since i received it. Great quality and great pic."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on September 2, 2024",
      "body": "First off let me start by saying this phone is great for the price it feels high quality it looks like a well made phone and it did not come with any scratches or any physical damage the performance is great but the one downside I am finding after 1 week of use is its battery life it only lasts 11 hours on power saving mode and 8 hours on normal mode another thing is depending on the screen protector you have the finger print sensor is going to be slower which I'd quite obvious but I attached a photo of the phone and a photo that the phone took when ever I'm out and I take pictures against an iPhone people allways comment on how great the quality and for the price you cannot get any better in terms of scratch resistance I would suggest getting a tempered glass and a case because it can scratch easily. For gaming the performance is amazing aswell it's just the battery that stops this phone from having 5 stars but maybe if we bought it new I wouldn't have that issue.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy customer",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "This Galaxy S22 came to me in perfect condition.  I couldn’t find any signs of use anywhere although I know it had a prior owner.  So it was well cared for, inspected, cleaned and tested before offering it for sale.Maybe the most important aspect in purchasing a used phone is the battery.  I waited a week before writing this review so I tell more about how long the battery lasts. I start charging at 20% and stop at 80% to preserve battery life as much as possible.  Even so, the S22 is lasting well into the second day, even with the heavy use needed in setting up a new phone.The phone was shipped right away even though I ordered on Christmas Eve.  It arrived several days ahead of time despite taking 3 or 4 days to travel from New York to Virginia.Good job Value Deals.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked and in mint condition.",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "eSim worked perfect with Xfinity modbile. The phone is in mint condition.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    SAMSUNG S22 PANTALLA DELICADA",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "La primera vez, que tuvo una caida, se daño la pantalla",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smaller but powerful",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "This phone is a bit small. I had the Samsung A25 the S22 is noticeably smaller. However it has really cool features and I like it alot!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "It's in good condition"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crystal",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Pretty good and it was spotless! No issues so far - it’s as like a new phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "This phone came as advertised... excellent condition. Cosmetics: A+No scratches anywhere.  Functions great. Packaged with instructions,  charger and SIM ejector.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks Like a New Phone",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "I received the phone yesterday. It looks like a brand new phone. My very old SIM card went right in and all of my info was transferred seamlessly through Google, with walk through by the phone itself.We never buy new phones in our house, and have always had great luck with refurbished phones. Who in their right mid would pay $1,500 for a freaking phone??",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Got this for my mom and she loves it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Nececito información",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "No puedo usar el teléfono está bloqueado me puedes dar la contraseña o debo regresarlo"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good product",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The product came perfect the only issue is the original charger but everything good"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks amazing 👏",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "Looks absolutely pristine, no exterior flaws",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great  looking phone screen small",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "IT  is smaller than I had thought it would be need a binger viewing screen if you wear glasses and cannot see any close up  phone is not for you It was smaller than I thought But looked great no scratches excellent looking <but for me if I didn't have my glasses on I wouldn't be able to see screen"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Great product"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Absolutely Awesome!",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "I purchased this for my grandson and he loves it. It was charged. The cost was epic! If you are a Samsung fan, this phone will absolutely do it's job! At a cheaper price."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker issues",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Phone came in great looking condition. The speaker is very low even up all the way. Every time I go outside into the cold the speaker crackles and pretty much doesn't work you can't hear anything. Plus even on battery saved the battery dies very fast"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worse condition than labeled but works fine",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Product was listed in excellent condition but there are obvious marks of wear around the charging port and a few scratches on the body. Disappointed in the false use of excellent condition.  Should have been labeled as good."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition but with a few flaws",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "This is my third time getting a renewed/refurbished phone. The previous two times, the phones were indistinguishable from new. This phone looks and works great so far, but there are a few minor issues. First off, the fingerprint sensor will not work. It appears that there is a screen protector on, which might be why. Secondly, it was configured to be for Canada not the US. Thirdly, there's a scratch on one of the lenses. Fourthly, the battery seems a bit old- runs hot, doesn't last as long, and takes longer to charge. Overall I'm satisfied with the model, and the price, but a bit disappointed in these items.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good.",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "The phone was in excellent shape with one minor scratch on the back. It came with a"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Factory unlocked Samsung Galaxy S22",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "It came just as stated and works great!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung cell",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "This phone was very easy to connect to our AT&T account"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seller corrected mistake",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "Phone was in good condition. Was skeptical of the model 901w since many have posted reviews of it being only usable in Canada. Although, it is the model from Canada, I had no problems activating it on my Verizon network. I would have given the seller 5 stars but my phone arrived with no sim card tray. Therefore making it very inconvenient to activate the phone in the time frame that I was trying to do so. The seller did correct the mistake and I had no problem communicating with the seller. For all the given reasons is why I gave the seller 4 stars and not 5. If the sim card tray would have been with the phone, this would have been a great transaction. Thank you for correcting the mistake",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "Small"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Surprisingly good condition",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I ordered two Samsung Galaxy S22 sold as refurbished and in Very Good condition.  When they arrived, I was quite happy with the overall condition of the phones.  The first phone was nearly spotless.  The second phone had numerous noticeable cosmetic defects around the edges, but was otherwise also in fantastic condition.  The screens on both were immaculate.  I would imagine they screens were replaced before sale because they are absolutely spotless.  Phones powered on and worked without issue.  Overall very satisfied."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfection",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "First phone I've purchased from Amazon. It was refurbished with not a mark on it. Perfection. Couldn't be happier with Amazon and the seller."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Phone Was displeasing but customer service was GREAT!",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "The phone was not what i expected. Scratches and cracks but it does work fine. I reached out to the seller and i was really surprised at their response, they answered in a timely manner and even refunded a percentage of the order for my dissatisfaction and troubles. I would buy the phone because it does function well but it may not appear how you want it to on the exterior side. Great Customer Service though that is hard to find."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    New phone",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "It was like a new phone!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No problems with the refurb. S22 camera great, battery and fingerprint sensor are disappointments",
      "date": "Reviewed in the United States on September 19, 2023",
      "body": "It's a real step up from my S9, especially the camera, especially 3x wide mode for close ups of small things.But the battery time between recharges and also the fingerprint sensor is a major step down. Needs a charge in the afternoon if I've used it heavily that day. So I got a power pack and that helps, but it's a shame I needed to do that.As for the fingerprint sensor, it just doesn't work half the time. S22 locks you out if you try repeatedly, and then you have to wait a while before it lets you try again.It came in almost-like-new condition but not in original packaging, no clear plastic protecting the glass, and without the quick start guide, which is downloadable (and I didn't need it). What I needed was the Samsung Smart Switch app, which sync'd my S9 apps, though not my app data. For example my voice-recorder data is still stuck on the old phone, not sure how to get that moved.Another minus was I couldn't get real accident insurance from Samsung or my carrier so I would have to go with 3rd party. Too much fine print for me to believe it's any good, so I'm `self-insured'. if I break the screen, it's never going to have any trade-in value and then I'll be looking for another refurb in the $400 price range. Better than paying like $200 for insurance and possibly deductibles for the next few years.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but battery sucks",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Great phone but battery sucks."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So happy with the phone",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I purchased the phone for my daughter and she is very delighted. Replaced a cheap phone from major carrier with very limited storage. No longer have to worry about downloading too many apps. Clear pictures.Great value."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as described",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Not the same as described.  Only 5.9\"  case suggested not fit.  Hard to find case and screen protector.  Phone seems to work ok.  Finger sender a little finicky but can always use pass.  Would send it back but already have set it up.  Very time consuming."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No estaba excelente estado",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Salió con bordes rayados"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked Not Compatible With Verizon",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "The unlocked Verzion is incompatible with Verizon. I was unable to activate it even with tech support. Not sure if the Verizon variant will actually work but I would recommend purchasing a different phone if you're on Verizon.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My new refurbished Samsung S22 telephone.",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "I really like how this phone performs. But everytime it starts up an At&T logo comes up and it has AT&T Epps come up on it. I thought I purchased a totally unlocked phone. So much for that."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Phone looks new and works fine. would not hesitate to buy again if needed."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not that bad",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "First off, the phone arrived very quickly. Ordered it because I just needed a phone after one I had got damaged. The description said the phone, a cable and a charger was included in the box, but there wasn't a charger. There's a few scratches on the top right corner but a case will cover them. Two small deep scratches on the screen which will not impact or hinder the usability. Overall I am thankful with the Galaxy S22, it is a set up from my Galaxy Note 10 Plus which I have been using for over 2 and a half years.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed in sound!!",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "I have now had the phone for about two and a half months. Getting worse all the time can't hear people, goes dead in certain areas, sometimes volume is loud sometimes it's so soft I can turn everything up all the way and still can't hear people.  Refurbished phones have no warranty so I guess I'm out of luck. I don't think it was ever refurbished in the first place I think they just resold it. Beware of this company!!!!!!!Phone looks good, not a scratch on it.  Screen is hard to keep clean almost looks like it is not the original screen.  Can deal with that.  The main problem is the sound.  Very scratchy, cuts out during conversation, at times people can't hear me.  There are times sound is really loud and next it is so soft you can barely hear. Frustrating trying to carry on a conversation.I would never buy from this company again, as it seems they did a poor job of refurbishing this phone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone for a Great Price",
      "date": "Reviewed in the United States on May 29, 2024",
      "body": "I was a little unsure of how to feel before buying a phone from amazon like this, but I made a great choice. There is literally no issue with this phone, it charges great and has a great battery life, no cracks or chips or anything. The face recognition is a bit buggy so I chose not to use it, but I think that is more of samsung's fault more than anything else. Also for the fingerprint reader, it works great but for those who don't know, if you have a screen protector, you have to look through settings to make the screen more sensitive so that it goes through better (its labeled as such under settings>display>touch sensitivity). Otherwise, great phone that can handle a great amount of pictures and apps.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Early days, but So Far, this reconditioned phone is perfect.",
      "date": "Reviewed in the United States on February 8, 2023",
      "body": "I've been looking for a Galaxy S22, not a + nor an Ultra, because it's smaller, about the same size as my S10E, but much faster and more powerful.  I cannot tell how this reconditioned one, costing half what a new one cost, is different from new.  Transferring all my data and apps left only re-entering passwords and setting ring tones. So far, it's been the most seamless upgrade I've gone through for a cell phone.Update: after 2 days I'm pretty sure I'm keeping this phone. It's only about 1/8\" longer than the S10E it's replacing and is actually a bit lighter.  I had a few minor issues such as moving over Memo Pad--it whined about it being for older systems and Memo Pad Tools transferred the data to the wrong directory, but that was easily worked around. WhatsApp crashed and I had to reinstall but it's fine now. Battery life, which has been a problem in many reviews, is still better than the S10E... So far so good!Removing one star because getting this phone unlocked has turned out to be more problematic than it should be.  It's a T-Mobile phone, but T-Mo cannot unlock it (they tried) because it's been reconditioned. T-Mo contacted Samsung, no luck there either.  I tried an unlock service, they couldn't, and kept my $28 and won't refund it.  I've gone back to Amazon, on T-Mo's recommendation, and they are contacting the seller to try to get the phone unlocked.  I LIKE that it's a T-Mobile phone because it gives you free WiFi calling anywhere there's Internet, but I need it to be unlocked so I can use local SIMs when I travel.  I really prefer to have only one phone, and not have to play the risky game of switching SIM chips.  A dual SIM phone is useless for that if it cannot be unlocked.  So, until this is resolved, I'm not going to activate the eSIM and will use the SIM chip I had in my old phone.Final remark. Usually a phone can be unlocked but this one cannot. Not by a 3rd party unlocking service, not by Samsung, the manufacturer, not by T-Mobile, to whom the phone is attached, and not even by the vendor who wrote to me:\"Unfortunately we can't guarantee that these stock of phones are able to be unlocked. This is why we are selling them as locked to a specific carrier. We also are unable to assist in unlocking this phone since we sold it as locked.\"I'm leaving it at 2 stars because the vendor and Amazon are allowing me to return it. I've wiped the phone, which I really liked, and am forced to order a new one from Samsung at double the price, but if it cannot be unlocked then it defeats the purpose of buying it, which is to be able to use other carriers' SIM chips, specifically ALIV.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well, battery so-so",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "I've had it a week now, and it works fine as far as I can tell. I am very pleased indeed with the camera. It came with many scratches, but only along the fine edges. The screen is clean. The battery isn't very good, but it according to videos I've seen the battery on these things isn't great. It also heats up quite a bit, and I think that's to be expected from the S22 as well. All in all I'll keep it because it works well and it was cheap. Good value.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new and works",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "Everything was fine. The phone looks and operates like new. I would have given a 5 star however Samsung seemingly newer phone isn't as good as my S10. Maybe I'm getting old."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    it is a refurbished phone so might have very minimum esthetic details, function-wise it works great",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "functioning and appearance is great, would recommend 100% if you are not wanting to spend money for a new one."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fantastic Thank you",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "I bought this for my son after buying on from TEMU for the same price only to have to send it back due to being Globally locked. This one, my son states he is more than pleased. He states not 1 scratch, no marks and if he didn't KNOW it was renewed, he would have thought it was BRAND New!! he contacted the carrier, and it was simple to turn on and use my network. I/we do not buy New technology every time it comes out, the last phone he had for 7 years. I hope this one last as long. Thank you for selling a GREAT Product!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "After reading some reviews I was wondering if I made a bad buy with the s22. However, to my great surprise when I received the phone it was in pristine condition the colour is so beautiful, it came with a screen protector. It's like a new phone to me that's working great thus far. Upgrading from an s10, i was also impressed by the camera quality. My only problem is the finger sensor that seems to be annoying so I used a lock code to unlock my phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great!",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "The phone works great so far! I've had it for over a month now and haven't had any issues with it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phone",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "The Phone arrived like new with a charger. The only problem i'm having is that the chargerbarely worked when it arrived. It takes a very long time to charge' atleast 6 hours. All of my other samsung phones didn't need  charging fot atleast 2 days. This phone barely gets through half of the day and is not heavily used."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a factory unlocked device as like it says",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "The phone I received was not factory unlocked but instead a t mobile unlocked ,phone looks good overall",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty but didn't work for me",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Unfortunately, was disappointed because I love the color of the phone and the size and how beautiful the photos are but immediately the phone kept overheating charging and sometimes just talking on the phone.  The battery didn't last long and the phone charger they sent with the phone did not fit.  I have this phone for a couple of weeks.  I love the feel of the phone so I have ordered another one from another company and I am returning this one.  Note: I did purchase a warranty with the phone but didn't want to start out using and pay extra money so best to return.  It is definitely a remanufactured phone but I have purchase other from Amazon and had no issues with the phones"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Surprised t the Quality",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Phone came in really excellent condition, no scratches or screen issues. It was unlocked and I easily added to my carrier. Very happy with the purchase"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is everything top reviews said it would be",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "The phone came in excellent condition, without a scratch or imperfection. The S22 is several steps up from my previous Galaxy phone and is everything the top reviews billed it to be. The only complaint is that the battery drains at an alarming rate. I write this off as being due to a smaller phone with a smaller battery with a whole lot of power to draw the battery down quicker. I charge my phone to 85% to extend the life of the battery and thus take this into consideration when assessing battery drainage. As far as buying a refurbished phone is concerned, I am very pleased with my Galaxy S22 purchase and will always buy refurbished phones in the future at a great discount.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Spam calls blocker",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "This phone is pretty good except I'm very disappointed that the phone doesn't really block spam calls. It's got a  built-in spam call block in the phone and I activated it as supposed to but spam calls are still coming constantly very disappointed in that aspect of the phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy S22: A Top-Notch Smartphone with Impressive Camera, Display, and Performance",
      "date": "Reviewed in the United States on March 19, 2023",
      "body": "I recently purchased the Samsung Galaxy S22 Smartphone in Phantom White (Renewed) and I am thoroughly impressed with this device. The phone is factory unlocked, which gives me the flexibility to use it with any carrier, and the 128GB storage capacity is more than enough to store all of my photos, videos, and apps.The camera on this phone is nothing short of amazing. The 8K camera and video capabilities allow me to capture stunning, high-quality footage and the resulting images are incredibly clear and detailed. I love the fact that I can take professional-level photos and videos with just my phone.The display on the Samsung Galaxy S22 is also fantastic. It is incredibly bright and vivid, making it easy to see even in direct sunlight. The long battery life ensures that I can use my phone throughout the day without worrying about it dying on me.The fast 4nm processor is another standout feature of this phone. It runs very smoothly and quickly, which makes multitasking a breeze. I can switch between apps and tasks without any lag or delay.Overall, I highly recommend the Samsung Galaxy S22 Smartphone to anyone in the market for a high-quality Android cell phone. The renewed version is an excellent value and performs just as well as a brand new device. You won't be disappointed with this purchase!",
      "helpfulVotes": 47
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Phone Great Price",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "I wrote a review on this phone the other day that was totally inaccurate. I took the phone to get activated and the agent said that it was locked and I purchased an unlocked phone. The phone wasn’t locked, the agent just didn’t want to do their job. I called the toll free number, got it activated with no issues. I was about to return the phone and the seller reached out to me with suggestions and they were very kind and helpful. I apologize for previously giving a one star review for what I now know is A-1, top tier service. Thanks for your help.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Minor Scratches, good working phone",
      "date": "Reviewed in the United States on December 22, 2023",
      "body": "I waited for some time to leave this review as some customers stated that phones started working worse in a few months. I got the S22, the phone was unlocked, it was properly packaged, and there were scratches on the phone, as expected, as the phone was previously owned. While booting (which was done in the summer), the phone overheated, but it was a one-time thing that happened during the setup. The camera gets laggy and hot if in use for a long time(like a realllly long time). Overall, the CPU used with this model has the issue, so overheating is not a big deal or a surprise. During everyday life, it works great, takes good pictures, and sounds okay; the fingerprint sensor works fine, and so does the face recognition. The only thing I am not very sure of is if the phone is waterproof, but it's easy to check; I just need to meet a technician. Overall, it is a good product with enough value for the price. It came with a cable AND a charging block that gives super fast charging. I wasn't expecting it, but it was nice to get. Overall, battery life is okay; my previous phone worked almost the same, so nothing too bad for me. Also, I have turned on the battery limitation (it can only charge up to 85% now), and I still go through 2/3 of the day. I always have a charger by my side and never really drained the battery, but I guess it would go through the day with constant use.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone works well.",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "We sent a note to seller originally that product did not work & wasn’t listed as described,  & would not turn on. After filing the complaint we put on a better charger & got it up & running. The marks on outside edges won’t be seen when I put it in protective case. We are pleased with this item.Sorry for the poor review originally submitted.Thank you."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "I got this phone being skeptical because of reviews, but it's a great phone. Had to get it programed by metro cellular, but that's how they do all of their phones. Great price, Great phone, a few superficial scratches on the corners, but that's under a case anyways. Would buy from this seller again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Todo bien por el momento",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Llegó con una rayita en la esquina pero no se ve casi.Del resto se ve muy bien recién me llegó.Esperaré unos días a ver si sigue funcionando bien.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works",
      "date": "Reviewed in the United States on July 22, 2024",
      "body": "It works no problem, came factory reset and unlocked as it should have; There was some gange on some parts of the phone possibly from prior adhesive. Even a refurbished phone should come completely clean, the cleanliness alone is why it lost a star. Camera is great, no noticeable scuff marks on screen or sides, looked great, and so far works great.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price and good product",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Very good conditions for the price, came unlocked, battery is ok and only minimum details. I think its totally worth for the price.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not in condition promised",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "the phone is just fine and it works I'm just a little upset and I don't know if this happened in transit or if anything else happened but the camera came cracked, it said it was in excellent condition and I assumed that would mean that there was no issues with the device the camera is still usable, everything works I just feel a bad bit lied to"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Good"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective and I have to deal with it",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I but this phone a few days ago and it is defective. The charging Port is intermittent like it has bad solder or something and for some reason the screen won't rotate even though auto rotate is enabled. I talked to Amazon to try to get it replacement so I could transfer my data before I sent this one back and they told me that I have to buy a new one to transfer my data to and then I'll get a discount. Then I can send this one back and get a refund. This seems absolutely ridiculous I guess I'll have to jump through the hoops."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone condition is fine, but the phone OS sucks LOL",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "Coming from a Google Pixel, the operating system on this Samsung is baaaaaad. The voice text is horrible and it's just not as intuitive or quick as the Galaxy, but it works and it's the same relative size as the Galaxy 5, which is what I wanted, so sureeee"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    huh",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Runs hot, Haven't used yet.."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    misleading",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I purchased the Unlocked one and it wasnt unlocked. I'm not the best with handling tech things like this myself so this was a major disappointment. I honestly dont even know what to do now since I cant seem to figure out how to get it fully unlocked?!! As of now, i feel like i just wasted a bunch of money on a phone I cant use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Verizon Unlocked",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "This phone recommended as it is Verizon compatible and was easy to get set up.  We had previously purchased the same phone from a different vendor and even though it was unlocked the other vendors phone was incompatible.  Apparently there are different methods / formats for unlocking a phone and this vendors phones work."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    May quit connecting to mobile network out of nowhere. Device malfunction.",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Phone worked fine for about 3 months.  Then suddenly wouldn't connect to mobile data. After a long time on the phone with my network provider they determined it was the phone that was the problem.  And that sometimes when you buy a phone from a place like this this happens.  And of course no help from the seller. I suggest not buying from this seller."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bello",
      "date": "Reviewed in the United States on August 18, 2024",
      "body": "Estéticamente hermoso aunque no fue el color que se muestra … su funcionamiento en prueba apenas lo recibo . Sin detalles estéticos! O no se persiven a simple vista ."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smartphone came quickly and as described",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I have been buying my smartphone for various sellers on Amazon for year. I was very pleased with my latest purchase - the smartphone arrived on time and as described.  Color, specs, and condition were all perfect.  Box came with useful instructions, a charger, and a SIM tray card opener.  Setting up my phone was a breeze."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Much smaller than I thought.",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I purchased this product about 3 months ago. Only switched over from my old phone last week. I don't think that I can keep it. Screen size is just too small.I've gotten used to the screen size of my old A71 and I can't reconcile myself to this newer phone. Gonna have to trade it in or something."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bag battery and charging terminal",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "Phone is in good condition but the battery lasts less than a day and the charging port is messed up. Looks like something was jammed in the port and the cable comes out easily. Still can't complain for $250",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Phone looks and is like brand new, there were no marks and so far is working very well . Very happy with purchase and seller ."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent price",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I've bought four so far for myself and family.  Zero issues."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Shouldn't be labeled as excellent condition",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "It said in excellent condition but had noticeable scratches, it should be labeled as good or acceptable condition in my opinion. The led screen looks somewhat damaged, kind of like burned. When you leave a page too much time in a screen and after a while you change or close the page or app, but you can still see the previous page or app on the screen. Well, is the same effect, if you open a white background, you can see some light red spots and and rectangles on the screen. I'm only keeping it because I needed a new phone and don't have time to wait for another one. Other than that, everything works fine for now.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, bad battery",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "The phone’s battery life is poor. Seems to be a common concern but also the age of the device should be taken into consideration."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything A-OK with Phone!",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "1. Looks like a new phone.2. Works like a new phone.3. T-Mobile wanted almost $1k to put me in a nice Samsung phone.4. This phone was under $300 delivered.5. I am a wise steward of The Lord's money.The choice was obvious.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Great product"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't purchase again",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Although refurbished, the phone is pretty beat up with terrible touch ups along the border of the phone(looks like someone drew on it with a sharpie. Also the phone tends to freeze often weather trying to unlock the phone or just using it. Will not buy again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    oops",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "bought the wrong phone S20 Ultra was the same price wasn't paying attention due to fatigue and frustration of my phone hitting the ground and not turning back on and only having about 3hrs of sleep after getting off work after having 4hrs of sleep, 3days later thought i got scammed by some chinaman and turned out i didnt get scammed the box it came it was just cheap but phone works great 10/10 i didnt get scammedtldr, bought  the wrong phone it ended up being the right phone",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price / quality ratio",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "I got this phone back in July, it November now and my phone is still is good condition. The battery life is average, not bad though; it lasts most of the day. I like how you how choose colors that aren't always in store.In my opinion, it's was well worth the buy!",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not receive what I ordered",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "I wanted to wait a few days before writing a review so I could test the performance of the phone. Upon initial un-boxing I was immediately disappointed. I had ordered a white phone, but instead I received a pink one. I would've been okay with getting a black, green, or even maroon, but I got the one color I did not want nor did I order. Also in the listing description it said I would receive a charging cord, adapter, and sim pin key. I only got the charging cord. The phone was described as being in excellent condition however I would not say that is the case. I think it's in good/great condition, but not excellent as it has a few minor scuffs along the sides. The screen itself had no scratches that I could tell.The first day of use setting everything up I noticed the phone was starting to overheat. It's been almost a week now and have not had any issues with overheating since. I will update my review once I've had a chance to use the camera for a long period of time and see how it performs after prolong usage.The battery life is not very good, but I have access to a charger most of the time so it hasn't been a big issue.Giving this phone a rating of 3 stars for now. If I had received what I ordered I probably would rate 4 stars.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker issues",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Phone came in great looking condition. The speaker is very low even up all the way. Every time I go outside into the cold the speaker crackles and pretty much doesn't work you can't hear anything. Plus even on battery saved the battery dies very fast"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worse condition than labeled but works fine",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Product was listed in excellent condition but there are obvious marks of wear around the charging port and a few scratches on the body. Disappointed in the false use of excellent condition.  Should have been labeled as good."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but battery sucks",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Great phone but battery sucks."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as described",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Not the same as described.  Only 5.9\"  case suggested not fit.  Hard to find case and screen protector.  Phone seems to work ok.  Finger sender a little finicky but can always use pass.  Would send it back but already have set it up.  Very time consuming."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No estaba excelente estado",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Salió con bordes rayados"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked Not Compatible With Verizon",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "The unlocked Verzion is incompatible with Verizon. I was unable to activate it even with tech support. Not sure if the Verizon variant will actually work but I would recommend purchasing a different phone if you're on Verizon.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed in sound!!",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "I have now had the phone for about two and a half months. Getting worse all the time can't hear people, goes dead in certain areas, sometimes volume is loud sometimes it's so soft I can turn everything up all the way and still can't hear people.  Refurbished phones have no warranty so I guess I'm out of luck. I don't think it was ever refurbished in the first place I think they just resold it. Beware of this company!!!!!!!Phone looks good, not a scratch on it.  Screen is hard to keep clean almost looks like it is not the original screen.  Can deal with that.  The main problem is the sound.  Very scratchy, cuts out during conversation, at times people can't hear me.  There are times sound is really loud and next it is so soft you can barely hear. Frustrating trying to carry on a conversation.I would never buy from this company again, as it seems they did a poor job of refurbishing this phone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Early days, but So Far, this reconditioned phone is perfect.",
      "date": "Reviewed in the United States on February 8, 2023",
      "body": "I've been looking for a Galaxy S22, not a + nor an Ultra, because it's smaller, about the same size as my S10E, but much faster and more powerful.  I cannot tell how this reconditioned one, costing half what a new one cost, is different from new.  Transferring all my data and apps left only re-entering passwords and setting ring tones. So far, it's been the most seamless upgrade I've gone through for a cell phone.Update: after 2 days I'm pretty sure I'm keeping this phone. It's only about 1/8\" longer than the S10E it's replacing and is actually a bit lighter.  I had a few minor issues such as moving over Memo Pad--it whined about it being for older systems and Memo Pad Tools transferred the data to the wrong directory, but that was easily worked around. WhatsApp crashed and I had to reinstall but it's fine now. Battery life, which has been a problem in many reviews, is still better than the S10E... So far so good!Removing one star because getting this phone unlocked has turned out to be more problematic than it should be.  It's a T-Mobile phone, but T-Mo cannot unlock it (they tried) because it's been reconditioned. T-Mo contacted Samsung, no luck there either.  I tried an unlock service, they couldn't, and kept my $28 and won't refund it.  I've gone back to Amazon, on T-Mo's recommendation, and they are contacting the seller to try to get the phone unlocked.  I LIKE that it's a T-Mobile phone because it gives you free WiFi calling anywhere there's Internet, but I need it to be unlocked so I can use local SIMs when I travel.  I really prefer to have only one phone, and not have to play the risky game of switching SIM chips.  A dual SIM phone is useless for that if it cannot be unlocked.  So, until this is resolved, I'm not going to activate the eSIM and will use the SIM chip I had in my old phone.Final remark. Usually a phone can be unlocked but this one cannot. Not by a 3rd party unlocking service, not by Samsung, the manufacturer, not by T-Mobile, to whom the phone is attached, and not even by the vendor who wrote to me:\"Unfortunately we can't guarantee that these stock of phones are able to be unlocked. This is why we are selling them as locked to a specific carrier. We also are unable to assist in unlocking this phone since we sold it as locked.\"I'm leaving it at 2 stars because the vendor and Amazon are allowing me to return it. I've wiped the phone, which I really liked, and am forced to order a new one from Samsung at double the price, but if it cannot be unlocked then it defeats the purpose of buying it, which is to be able to use other carriers' SIM chips, specifically ALIV.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phone",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "The Phone arrived like new with a charger. The only problem i'm having is that the chargerbarely worked when it arrived. It takes a very long time to charge' atleast 6 hours. All of my other samsung phones didn't need  charging fot atleast 2 days. This phone barely gets through half of the day and is not heavily used."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty but didn't work for me",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Unfortunately, was disappointed because I love the color of the phone and the size and how beautiful the photos are but immediately the phone kept overheating charging and sometimes just talking on the phone.  The battery didn't last long and the phone charger they sent with the phone did not fit.  I have this phone for a couple of weeks.  I love the feel of the phone so I have ordered another one from another company and I am returning this one.  Note: I did purchase a warranty with the phone but didn't want to start out using and pay extra money so best to return.  It is definitely a remanufactured phone but I have purchase other from Amazon and had no issues with the phones"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Spam calls blocker",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "This phone is pretty good except I'm very disappointed that the phone doesn't really block spam calls. It's got a  built-in spam call block in the phone and I activated it as supposed to but spam calls are still coming constantly very disappointed in that aspect of the phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not in condition promised",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "the phone is just fine and it works I'm just a little upset and I don't know if this happened in transit or if anything else happened but the camera came cracked, it said it was in excellent condition and I assumed that would mean that there was no issues with the device the camera is still usable, everything works I just feel a bad bit lied to"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective and I have to deal with it",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I but this phone a few days ago and it is defective. The charging Port is intermittent like it has bad solder or something and for some reason the screen won't rotate even though auto rotate is enabled. I talked to Amazon to try to get it replacement so I could transfer my data before I sent this one back and they told me that I have to buy a new one to transfer my data to and then I'll get a discount. Then I can send this one back and get a refund. This seems absolutely ridiculous I guess I'll have to jump through the hoops."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    huh",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Runs hot, Haven't used yet.."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    misleading",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I purchased the Unlocked one and it wasnt unlocked. I'm not the best with handling tech things like this myself so this was a major disappointment. I honestly dont even know what to do now since I cant seem to figure out how to get it fully unlocked?!! As of now, i feel like i just wasted a bunch of money on a phone I cant use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    May quit connecting to mobile network out of nowhere. Device malfunction.",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Phone worked fine for about 3 months.  Then suddenly wouldn't connect to mobile data. After a long time on the phone with my network provider they determined it was the phone that was the problem.  And that sometimes when you buy a phone from a place like this this happens.  And of course no help from the seller. I suggest not buying from this seller."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Much smaller than I thought.",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I purchased this product about 3 months ago. Only switched over from my old phone last week. I don't think that I can keep it. Screen size is just too small.I've gotten used to the screen size of my old A71 and I can't reconcile myself to this newer phone. Gonna have to trade it in or something."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Shouldn't be labeled as excellent condition",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "It said in excellent condition but had noticeable scratches, it should be labeled as good or acceptable condition in my opinion. The led screen looks somewhat damaged, kind of like burned. When you leave a page too much time in a screen and after a while you change or close the page or app, but you can still see the previous page or app on the screen. Well, is the same effect, if you open a white background, you can see some light red spots and and rectangles on the screen. I'm only keeping it because I needed a new phone and don't have time to wait for another one. Other than that, everything works fine for now.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, bad battery",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "The phone’s battery life is poor. Seems to be a common concern but also the age of the device should be taken into consideration."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't purchase again",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Although refurbished, the phone is pretty beat up with terrible touch ups along the border of the phone(looks like someone drew on it with a sharpie. Also the phone tends to freeze often weather trying to unlock the phone or just using it. Will not buy again."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition is pushing it",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "Phone works fine so far, but it has scratches all over the side and I paid for excellent condition so if your looking at anything lower be careful, also the sim card opener was very cheap and broke almost instantly"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not hold charge",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "Somewhat disappointed.  Battery does not hold charge well.  Dies quickly."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't add and sd card",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "Phone works fine."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had screen scratches",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "Excellent suppose to be no screen scratches but had some.  Looks like previous owner didn't use screen protector."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's an ok phone. Came with a scratch at the back of the phn",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "It's an ok phone. Came with a scratch at the back of the phn."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t see much change from old Galaxy s9!",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "Old phone still worked, but thought it was time to treat myself to newer phone. Can’t see much difference, even with camera! Easy transfer of apps & personal info but pain to re-enter all passwords. Bought refurbished S22, but hanging onto old phone in case I need to go back!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "The phone is everything that I expected, except the battery doesn't last long, only last a  few hours and I am not running all my apps on the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone in great condition, can't use with visible",
      "date": "Reviewed in the United States on October 3, 2024",
      "body": "Phone not able to be used with Visible by Verizon... but the phone itself is in great condition. I'm keeping phone and changing service. Just wanted to make others aware there are some companies it isn't unlocked for."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery 👎🏾",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "Got phone early also with a  charging cable only. Phone has a few small scratches but looks great. However my biggest problem is the battery runs down really fast. Phone is not using and battery is going down. Battery only last approximately 3 and half hours while using. I use my phone a lot so constant charging. 3 stars due to battery"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had trouble at first",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "Unable to use the phone, amazon sent a damage phone plus it was delayed 3 days and i still had to pay extra $8 to return it and i got amazon prime. Edit, the phone was damaged by the sim card tray but got it fixed for a small fee and was able to use it"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Excellent\" condition with cracked camera lens",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "The phone I ordered was a renewed S22 in \"excellent\" condition. Initially, it looked perfect but on closer inspection, there was a crack on the top rear camera lens."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Spam calls",
      "date": "Reviewed in the United States on July 20, 2023",
      "body": "Great phone with feature you won't see in a pixel. Conversely, it lacks native features you come to expect unless you use an additional app. I do' like that. The less apps th better IMO.Phone arrived in fantastic condition, unlocked with developer mode enabled. Which they used to unlock the original AT&T phone. This phone is not \"factory unlocked\" as AT&T does not sell unlocked phones.Once I simmed it and started using the phone my robo calls more than doubled. Common sense tells me the phone itself is at fault somehow was it was manipulated by the seller? Anyway when It gets damaged beyond repair (I do this every several months or so) I'll buy a new phone straight from google. I get the best results that way.In conclusion the S-22 was top of the line phone a couple years ago and a great daily driver for the price despite all the samsung crap. Despite this I grant only three stars for the robocalls annoyance!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad speaker sound",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "speaker phone was very low,even though it was on highest setting.the ear speaker seems to fade in and out too"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone bad battery",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Phone is in great shape. Battery however is not phone shuts off under 20% meaning the battery is about done."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Item came with defective battery. They won't replace, Issue un resolved. Not happy."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Maybe A New One is Worth The Price?",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I bought this one to replace one I had bought just over two years before. I didn't want to spend again over $800 for a new one. However, less than a month after getting this used phone, the speaker began failing. I'll keep it, but don't recommend it. If you can afford a new one, go for it!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good phone",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "The phone was good, but the company took so long for a refund, and when they got the phone they said no refund because it didn't come on time. I only got a refund because I complained to talk to Amazon about it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was like new, but NOT unlocked",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I was excited to receive this beautiful phone, but when I turned it on, a T-mobile greeting appeared on my lovely \"factory unlocked\" phone. The seller is going to email a shipping label to return the phone & will provide a full refund. I'm SOOOO disappointed!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall good in this price",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "Problem is when I plug in for charging it says moisture detected and couldn't charge phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, but",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "I know its refurbished and I don't expect perfect but the fact there's a scratch right by my front face camera causing a slight glare on my photos irks me."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Ni biene en español",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "Kiero ablar con el vendedor"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen Bleeding - 6 Months",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "I've had the phone for almost 6 months - Screen bleeding has started so I just ordered a new phone. This one didn't last long."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, but overheats and shuts down often",
      "date": "Reviewed in the United States on July 25, 2023",
      "body": "This is a nice phone, and the camera takes outstanding pictures.  The phone arrived in excellent condition, as advertised.  However, this phone, and probably many in its generation have a design/fabrication issue where the phone will overheat and shut down often, and for no clear reason.  Once it shuts down the phone will be not be usable for 30min to an hour until it cools down, and it can then be restarted. Although this happens more often on a hot summer day, I would still expect the manufacturer to design and test phones for warm weather operation.I would not fault the seller for this issue, as the phone arrived in excellent condition. I will try to return, and get a replacement which will hopefully work better.  But buyers may want to be aware of this potential problem.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I Don't like it",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "I guess I didn't read the size and got the small one, does not have a port for earpods ( yeah I still use those ) I really don't like it but I don't have the money to send it back and wait for a refund and get another one. Battery will last only a day and I don't even use it that much. Other than that works perfectly fine.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in \"excellent\" condition",
      "date": "Reviewed in the United States on July 5, 2024",
      "body": "The phone arrived fast, and it seems to be pretty snappy and cameras are good. However, its condition does not seem to be excellent, but rather a very good or good. It has some scratches on the sides and it has a bump too. Pretty dissatisfied with it, but I guess a case will cover it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Horrible reception, poor battery life, and useless features that can't be turned off."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery quality  poor",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "I really needed a phone at the time and got this one, was excited  till I got it the phones charges  fast and loses charge  just as fast or faster at time I'm  really disappointed... A52 is doing way better than this phone",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It may have been refurbished, but...",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "I bought this phone on June 7, 2024.By September, texting was becoming a little difficult; the left side of the keyboard needed a bit more pressure on the keys to type correctly.Tonight, Oct 27, 2024 it became impossible to get some of the left side of the keyboard to work at all.My 90-day warranty ended just as I suspected something was going on.I guess I should have panicked & sent it back at the very 1st Typo!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Galaxy s22",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "The phone is nice but the screen is not installed correctly"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Sería bueno que venga con el cargador",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "Todavía no lo he podido prender porque se me esta haciendo cumplido conseguir un cargador, porque no vino con cargador, solo con el cable"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective, waste of money",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "I ordered the phone for my husband in late August and it arrived earlier this month. It looks in pristine condition - no dings or scratches and it arrived packaged well. Camera works well. Fast, responsive touch screen. It just won't stay on. Despite our best efforts, the longest the phone stays on is about an hour. It just keeps shutting down mid-use without warning of any battery loss or anything. Amazon was contacted and we were assured that they would work with the seller to get a replacement. I got a confirmation email about the correspondence. That was a week ago. We still do not know what is going on so this phone is just sitting by the bin cause it isn't worth using for anything but looking pretty.Edit: I tried to return the phone for a refund but the Amazon site just gives a qr code - not a printable shipping label like they used to. I do not live in a country with any place that does Amazon returns. So I had to FedEx it to someone in the US. FedEx marked it as delivered but it was not, so I'm not even sure this dead phone will reach Amazon in the return window for a refund. Hundreds of USD down the drain.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    battery life is not good",
      "date": "Reviewed in the United States on April 10, 2024",
      "body": "The phone quality is good, the over all performance is good and this is why I gave it a 3 rating, The main problems is the battery lasts about 2.5 hours with medium use. I am a business owner and don't have time to charge every 2 hrs, but if you don't mind that, its a great phone. Seller was very kind and issued a full refund upon receiving the item back. great job.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not happy",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "It's only charging to 84% and keep getting messages about moisture when wanting to charge."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    8/10",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "El teléfono está 8/10… cuando compre decía q estaba 99% de bateria , lamentablemente llego 81% de batería !"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not so Excellent Condition",
      "date": "Reviewed in the United States on November 3, 2024",
      "body": "ordered Galaxy s 22 excellent condition. upon arrival I turned phone on. Phone lit up and was charged. At the top of the screen there were what appeared to be pink burned in words and symbols in the screen where it should have been white. I would not consider this as the standard of excellent. Phone is being sent in for refund."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wrong description.",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "Did not come with charging block and not excellent condition by standards listed. Visible damage over 12\"."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Solo está en idioma ingles",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "Está en buenas condiciones pero no sé puede cambiar a español solo en ingles"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine for a few months",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "Got mine in July, but by October it was freeze and restart a couple times a day.  No idea why.  I've needed to do a hard restart multiple times as well."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, alot of scratched up spots",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    The phone itself works fine, and has plenty of storage, but at first look you can see the phone looks like it's gotten scratched and hit multiple times on the side, not enough to damage it but, definitely doesn't look new.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its nice and all, but...",
      "date": "Reviewed in the United States on April 28, 2024",
      "body": "It freezes up my music every couple minutes which is infuriating. Didnt know about the lack of expandable memory either, and currently its sapping me on that very quick, and wont seem to let me stop it. Oh hey, its nice and all though."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dissatisfied",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Decided to give this renewed thing a try…very dissatisfied with the condition/look of the phone and the charging cable is not charging the phone😵‍💫"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in excellent condition",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "Just got what was supposed to be \"excellent\" condition, and it is all kinds of scratched up.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Disappointed",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "I had waited a long time to upgrade my phone and was excited to place the order for this Samsung S22. It arrived in good order and transfer of data was seamless. However, I ran into issues with activation of the phone with Verizon. After more than two hours on the phone with multiple levels of Tech Support trying to work through the issues, it was determined based on the IMEI number the phone still had an outstanding balanced owed by the previous owner and therefore could not be activated. I felt comfortable making the purchase through Amazon but now I am not sure they have the best vendors supplying these renewed phones. I would have thought that the vendor would have ensured the phone was usable and no outstanding charges owed prior to offering it for resale. I have returned the phone and been assured by Amazon I will receive a full refund. I will not purchase another phone from Amazon.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As described",
      "date": "Reviewed in the United States on November 4, 2022",
      "body": "Edit: I don't remember why I gave this phone a 5 star rating, I must've been sleep typing. Anyway, but for the things listed below, it's garbage. The on-screen fingerprint reader is a deal killer - significantly slower and more finicky than the 9+ reader on the back of the phone (the only reason I got a new phone to begin with was because mine had/has terrible cell reception). It's actually so useless that I'm leaving Samsung. When I returned this S22 I fired up my old S9+. Now I remember why I didn't want to get a new one. With Samsung phones, it's always 1 step forward - 2 steps back. Sure the new ones are more powerful, but the features you're giving up by \"upgrading\" aren't worth it.The phone is powerful, fast, compact, light, great cell reception (huge difference and very important for those who live on the edge of town). Sitting right here the S22 has 3 bars, and my S9+ has 1 bar. Unfortunately I ended up with an S22 with a bad battery and the seller telling me to deal with Samsung - so I returned it and am now back on my old phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Shuts Off in Car. Overheats.",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "Phone works fine but using it in the car, with Android Auto and Google Maps causes it to overheat and shut off. My wife's A50 does not do this. Keeping an eye on the return window. Disappointed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "Didn't realize it was refurbished"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The battery drain is it's Achilles heel.",
      "date": "Reviewed in the United States on July 28, 2023",
      "body": "I'm a big android fan and purchasing another Samsung Galaxy device was an easy choice - my third Galaxy phone.  However, this is my first time buying a refurbished device. I think it will be my last.  The battery drain is worst than even my Galaxy S6+ I use for my 8 year old son. I use a iPhone Xr for work and that battery is superb. Alas, I'm returning it.  I might try the S22+ as the battery is larger. Otherwise, I might be switching to an iPhone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buggy",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "The bad:I figured the battery life would have gotten better from the last gen of phone but it did not.The current firmware is buggy and you cannot add widgets to the home screen either.The edges of the screen are not as responsive when a screen protector is on. Even after increasing the sensitivity.Maybe it will correct itself in time.The good: the battery life isn't awful it's just doesn't last all dayThe camera is fantastic.The screen is super clear.Bluetooth has longer range than the s21.The phone call quality is pretty decent."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap non manufacturers parts",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "The phone worked, but the battery would drain quickly. The back of the phone cracked to pieces as I was putting a protective cover on it. The glass on the front looked like it was poured onto the phone. That was strange. It didn't really affect the use of the of the phone, just not pretty."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DOES NOT WORK WITH VERIZON!",
      "date": "Reviewed in the United States on June 3, 2024",
      "body": "We needed a Verizon phone, and expected that a refurbished one from Amazon's \"cell phone store\" would be a reliable purchase.  This turned out to be false.  This phone is locked, and the only way to possibly get it to work with Verizon is to travel 50 miles to a main Verizon store in a larger city to try and get a code to unlock it.  What a complete waste of time and money.UPDATE:  After going to a main Verizon store, even with their code, they were unable to get the phone to connect to their 4G network for any length of time, so phone was defective as well as locked out of Verizon."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery is terrible",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "Phone is in good shape, one small dent in the back of case. Phone would be Great if the battery life wasn't so terrible, it runs out half way through the day.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Interface and Battery Life",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "After using this phone for approximately 1 yr, I have concluded that the Interface used on this phone is graded a \"D\" at best. Contacts, Messaging, Home Page, the whole ball of wax just seems clumsy and un-user friendly. I've had cell phones since 1996. This Interface ranks up there as the most frustrating of all of them. Plus the battery life is poor.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Alot of scratches",
      "date": "Reviewed in the United States on August 3, 2024",
      "body": ""
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    False advertising",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I wish I could give no stars. This phone is not a US phone and not usable in the United States through Verizon. Due to a family death I never started to use the phone till recently and I can't use it at all now.  Their ad shows 3 choices to select from nothing says unlocked!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a US Phone",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "This is the third S22 phone I ordered off Amazon.  After checking the IMEI # it turns out that the chipset is the Exynos 2200, which is used for the international phones, not the Snapdragon core used in the U.S. phones. Besides that my carrier said it was not compatible with their system because of a CDMA issue. Qualcomm holds all the critical CDMA patents. If Samsung wants to ship phones with Exynos processors into the US, they have to pay a hefty royalty for the CDMA modem. All in all, I wish I could have kept the phone as it was in beautiful condition as an excellent grade renewed phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    battery does not hold a charge",
      "date": "Reviewed in the United States on October 26, 2023",
      "body": "Having had an S10e, I really like the S22. However, this battery did not hold a charge. I left the house at 9am with 70% battery and made 2 1-hour calls during the day. By 5pm the battery was at 10-15%. I charged it fully before going to bed and then had to re-charge again the next morning. I will be ordering another S22 replacement.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone does not hold a charge",
      "date": "Reviewed in the United States on May 29, 2024",
      "body": "Unfortunately I had the S22 for 30 days and found it does not fit my needs. I noticed the battery goes down and must be charged often throughout the day. The phone also gets hot when in use. I am not one to even use cell phones a lot. Decided to return the phone after my city was hit with a horrible storm.  I tried preserving the battery by actually turning the device off and use it for emergencies only. The phone died after a very short period of time leaving me without communication....ugh.  I need a more reliable phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Failed within 8 weeks",
      "date": "Reviewed in the United States on March 18, 2024",
      "body": "Upon receipt I noticed that there was some leftover blue residue around the perimeter of the front screen. I didn't think much of it at the time. After about 8 weeks of use without any warning or incident the screen stopped working. The phone could still receive phone calls, but the user cannot open the phone to receive the call - or do anything else on the phone for that matter. This is sometimes referrred to as the 'black screen of death'. The screen is permanently black, and the user cannot reset or restart. Effectively, the phone is broken.After contacting Samsung technical support I brought the phone to a certified Samsung repair center, uBreakiFix, and was told that an after market screen was installed, which caused the black screen. The repair would be $300, or about $50 less than what I originally spent on the phone.This is unacceptable quality and durability. I should have bought new, but I was trying to be economically and environmentally conscientious. I am trying to return the device since it is less than 3 months old since purchased from Amazon.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on April 25, 2024",
      "body": "Couple of small scratches on the screen but a glass cover seems to hide them."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn't Connect to Network",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "The phone worked perfectly fine with wifi, however;  it couldn't connect to AT&T network.  I worked with 2 separate AT&T customer service reps and even replaced the SIM card.  They told me it was an issue with the phone which they couldn't service.  The phone was sent back for a refund.  The seller provided good communication and refunded my full amount.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Absolute Garbage",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "From the time I received this junk, it began to die. There were lines running up and down the screen, dead spots and defects - for example it wouldn’t read my old SIM card nor would it read the brand new one I had to buy for it. The battery zapped so quickly and by the end of the evening the screen was blinking black and white. I could not even dial a number without something coming up on the screen about brightness or battery level and I sunk $250 into what was said to be in “excellent” quality. The seller 2ndphoneclub obviously doesn’t review his products before shipping them out. They ought to be permanently banned from selling on Amazon. Don’t claim your device is in “excellent” condition when nothing works.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition is really more like average at best",
      "date": "Reviewed in the United States on March 7, 2024",
      "body": "I am really disappointed having seen pictures in the other reviews. I purchased one of these renewed phones that is supposed to be in excellent condition which apparently means that it doesnt have scratches and blemishes you can see from 12 inches away which is completely false.The frame of my phone has some serious wear and many scratches. All of it clearly visible from a distance. I doubt the previous owner even used a case or did anything to protect it. The frame has damage on the corners which look like they could have occurred from dropping the phone. The back also has damage.Used or not, refurbished or not, I would not even classify this phone as \"good\" condition let alone excellent.I am very disappointed. Since I am in desperate need of a phone and do not want to go through the hassle of shipping it back and getting another phone, I will just toss this phone in a case and hope it lasts.I wont be buying renewed again. I recommend you avoid doing so as well.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't waste your money",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I paid for an unlocked phone, but what I got was an AT&T phone. The battery is completely drained and cannot keep charge. This is absolutely ridiculous. Why would this be certified if they sell products like this?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone goes silent on calls",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I knew a renewed phone was a risk, but it is frustrating that after only 4 months of use it is not functioning as it should. When I'm on a call with someone it suddenly goes silent on my end, while the other person can still hear me. I call back and it works for awhile before going silent again. I ruled out potential Wifi or cell service issues with trial and error, but now that I know it is definitely the phone, it is too late to return.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Zero stars first of all, the phone's battery blew up after few charges and second of all , when trying to use the phone in another country it says that the phone is not clear or is stolen",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor quality",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "I purchased a new phone in excellent condition for $267. I received a phone with chips on 3 of 4 sides of the phone. The seller does not respond to messages. Do not purchase from this seller!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on July 11, 2023",
      "body": "Bought the Samsung galaxy s22 phone arrived a few days later phone was in amazing condition no scratches no cracks looked brand new until I put my SIM card in and didn’t work also looked on the bubble wrap it came in it said t mobile although seller was very fast with responds and refunded my purchase"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    telefono reacondicionado \" excelente estado\" . la bateria dura medio dia con suerte",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "mal. telefono reancodicionado promocionado excelente estado. falso¡¡¡ la bateria dura medio dia. ademas carcasa con rayas. lo voy a devolver."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    PHONES ARE JUNK",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I ORDERED 2 OF THESE PHONES AND THEY WERE BAD RIGHT FROM THE START. TRIED CHARGING THE FIRST ONE AND IT WOULD NOT CHARGE. AFTER PLAYING WITH ACOUPLE DIFFERANT CHARGERS I FINALLY GOT IT TO CHARGE. WENT TO START IT UP AND THE TOUCH SCREEN DID NOT WORK. DID NOT EVEN TRY THE SECOND PHONE, JUST PACKED THEM UP AND SENT THEM BACK. I WILL BUY NEW ONES INSTEAD OF GETTING SOMEONE ELSES PROBLEMS.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone might be stolen",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Phone is still in service with a provider so I'm unable to switch my service to it. This is absolutely something that should be checked before reselling it. I have no way of contacting the previous owner and getting it removed from their service and it seems the phone could be stolen considering."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible purchase no quality control",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The phone was loosely in the box with no protection or screen protector. The bezel is scratched as well as the screen. It was incredibly dirty and the charger and speaker ports were full of gunk. When attempting to use, it loses 20% in a 15 minute period of the light usage."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Isn't working properly",
      "date": "Reviewed in the United States on May 25, 2024",
      "body": "Love the size and look but it isn't working properly.  I get cut off from almost every phone call.  They last from 4 to 10 minutes then they can't hear me but I can hear them.  HELP  Been to the AT&T store now 5 times and they keep helping me by refreshing, went to ESim, turn on Airplane mode for 30 sec. and off and reset...It still isn't working all the time....still getting cut off!!!!!!!!!!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They don't refund the money. Avoid this seller!",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "I received a phone that looked brand new, but the battery didn’t even last a day. If I watched some YouTube, then only a few hours. I returned it through Amazon’s return process, but they refused to refund my money, citing a restocking fee. Shockingly, the phone cost $254.94, and they charged $254.94 as the restocking fee. I can’t understand how Amazon allows a seller to operate such a scam. Avoid this seller at all costs!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The worst purchase I have ever made",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "They sent me a defective device, it doesn't read any type of SIM card, when you insert the SIM card it goes into emergency mode. The front camera is blurry, I'm currently in Uruguay and it's very expensive to return the product. Terrible experience, I paid $290 for a brick."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    screen",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "The screen is full with scratches and the phone"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone NOT Excellent Condition",
      "date": "Reviewed in the United States on March 7, 2024",
      "body": "I purchased a refurbished S22 for $305. Phone came 2 days early, but had micro scratches on the screen and a large chunk missing from the phone housing—definitely NOT excellent condition although it did power on. Decided to return because when you pay $305 for a product in excellent condition, you expect what you pay for, even though I am keeping in mind it is a refurbish. They made me PAY for my return on a faulty product which THEY wrongfully sent me. The price was also increased from $305 to $324 in the half a day it took for me to inspect the phone and request a replacement. Currently waiting on the replacement.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery runs low quickly",
      "date": "Reviewed in the United States on September 19, 2023",
      "body": "Phone looked pretty new. I loved that. Almost no scratches. It gets warm during usage and that's just texting and worst of all the battery doesn't last long. I wanted to upgrade from my A71 but my A71 is doing much better than this S22 with battery power. A71 lasts all day with average social media and use. I placed S22 for charging until full and within 3hrs it was already at 50% with just minimal use. Photo and video was is good, sound is good but the battery power is why I am giving it 2 stars because who wants their phone to die on them. I can never go without charger or power bank",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was still locked",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Phone was locked and spent hrs trying to get it set up b4 the service provider realized it was still locked n told me I had to get a different one"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Network Unlocked.",
      "date": "Reviewed in the United States on May 28, 2023",
      "body": "I spent countless hours trying to figure out how to get my phone to work with either Verizon or T-Mobile. Nothing would work. Couldn't figure it out until finally I deduced it down to the fact that this phone is not actually network unlocked. My phone in particular is locked to the AT&T network. When using a third party carrier the only ones that would work are the ones that use the AT&T network. Everything else doesn't work, the SIM card literally does not register. I don't know what to do next. I may need to send the phone back. Fortunately it's still within the time frame to return the phone. I've contacted the seller but haven't heard back from them yet about this problem.",
      "helpfulVotes": 2
    }
  ]
}