{
  "asin": "B0CTW8TXGH",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone For A Low Price",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I got this for my 11 year old daughter since she lost her other phone , nice size , the functionality is great, it’s not 5G but the speed works fine for her. We received the phone today so we haven’t gotten a chance to see how the battery life is as of yet. This phone is light weight & the blue color is nice . For the price I can’t complain, also it was an easy set up",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone budget phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "It's really good 4G phone it's much like my moto g power 5g 2024 it has the same features and it does have Dual speakers and has Android 14 turbo charger 50MP camera, I have no complaints. It goes to 60 HZ to 90 HZ you can choose either one. Good phone good Price 👌🏼",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Bad, but A Bit Laggy",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "I am writing this as someone who doesn't own a cellphone in the usual sense. I owned the HP iPAQ long before \"smart phones\" where ever though of. Basically, that was a smartphone without the phone. To this day, that is the ONLY reason I own a cellphone - as a pocket computer. I do not activate them, nor do I use them as a phone, so I cannot comment on those aspects. I also disable/uninstall every single google/tracking app/\"feature\" so I cannot comment on those. I CAN discuss this as a computer, though.As a pocket computer, this is fine. It's not great, but that is only because it comes SO loaded with tracking and google-tied services, some of which cannot be disabled. The battery life seems pretty good. The screen is nice and large. I'd prefer it if it were a LITTLE bit wider, but... The camera is much better quality than my old phone.One thing I DO notice, though, is that there seems to be a lag, especially when processing animations. For instance, playing solitaire, there is a slight lag in clicking the deck and the cards turning over. The final animation, where the cards fly around after you win, glitches and lags a bit, there, too. I don't know if my disabling half the phone has anything to do with that, but I wouldn't think so. Speaking of solitaire... the narrow screen aspect makes that pretty hard to see. Unless you play a game that allows rotating the screen.. better put those peeper on!For the price, though, if all you want is a basic, get you by cellphone, especially of you just want to use it as a computer, you could do worse...",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better quality than I expected for the price point!",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Perfect phones for my kids apps. They broke their Amazon tablets and I didn’t want to spend much, so this phone was perfect budget friendly replacement. They watch movies, the screen is big and good enough quality to keep them busy when they need to relax and watch their screens before bedtime or while I make dinner! Really a great phone.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing cheap phone for GPS mapping",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "I like to use a dedicated device for offline maps when exploring National Forest and BLM land (with Gaia GPS).  In the past I've use old phones - they were soooo slow.  I debated about getting a cheap tablet but saw this somehow and decided to give it a try.I saw a review or two that said you could use the phone like a wifi device but nobody confirmed the GPS chip worked without activating cell service.  Well, I am confirming it does.  I did not activate cell service and the GPS chip works in my map apps when in airplane mode.It really is amazing that this phone is $50 normally, and $40 when on sale.  For a use like mine, it is an incredible value.  Heck, the case I use is $12 and over a quarter of the price of the phone itself!  So glad I found this instead of buying a renewed/refurbished flagship that was already outdated.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Must get!!",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Great loud sound, fast speed. Big screen, Fast charge. I was nervous about activation but it was so smooth and easy to do! Was able to connect it online at home. Just follow the step by step instructions on the phone package. It includes everything needed to activate . Awesome phone service too! Get it don't overthink it! Thank you!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good phone for the price!",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "This android phone is very good for the price. The battery life, speed, and fingerprint reader are all very good quality. The phone is a nice and big with a 90hz display, and the phone is made out of metal, not plastic. I like that it allows you to add a SD card for extra storage. Although it is locked to Tracfone, if you get the 10 dollar plan for 2 months, you can reach out to them to unlock it! I really recommend this phone!",
      "helpfulVotes": 38
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good and cheap",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Phone was great until it fell down like 12 inches then boom busted screen",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works out to about $12 a month(+ tax maybe) if you buy a yearly plan.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Easy setup and activation.I doubt that the camera is actually 50 megapixel, but it is a nice camera with a bright flash.Internet loads as fast as my desktop on both wifi and cellular...(I think I had to toggle a setting to make sure it checked for and used Wifi before using Cell Data...)Starts with like 72 apps preloaded, only had to remove about 7 data/powerhogs.This would have been a $10,000 computer in the 1990's.It is amazing what we have failed to accomplish with our advancements.Definitely amazing what we have accomplished too though.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MP3 player",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Was going to purchase an MP3 player but instead got this for $40. It was great for that, comes with stereo which I was surprised. You usually only get one speaker on phones, even some iPhones only have one.The screen leaves a lot to be desired, bad colors, low res and not backlit enough. I'm just using it as a media player so it's not a deal breaker for me. If it was my everyday phone that would get annoying rather quickly.Since it's Android based I was able to use a cracked Spotify APK and Stremio to get all my music and video streaming needs for free. Couldn't do this on my regular iPhone....(This is the 4G model does not have 5G for those who need it, with wifi it's plenty fast for my streaming needs)Battery life has been good, going on 4 days with one single charge. Just been using it to listen to music and the occasional video.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Deal for 23 Years as TracFone Customer",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Have been using this for a few months. Not as a phone. I have a Samsung TracFone for that. I use this for everything else. It is quick to respond and battery lasts longer than I would expect. Recharges in a couple hours. Omitting a star bc apps can't go on SD card",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    new phone",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I really like the phone, I just have to learn what all the features are used for. Monique Screen quality is very good.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone for the price",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "4 1/2 year old grandson loves it he said I am so happy to get a new phone price was great , phone is nice works fast easy to set up ..",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Yes!",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "So far I really like it. Definitely an upgrade from what I had. Doesn't seem cheap or lagging. Had a easy time getting everything transferred. Recommend.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its ok but lacks processing power.",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Overall this phone has just been adequate but has some drawbacks. The overall build feels like a 40 dollar phone and doesn't compare top a flagship phone. It is almost entirely made of plastic. That said, it seems durable enough.The screen is clear and bright but I don't know what kind of glass they use but it doesn't seem to be super hard as there are lots of tiny scratches and swirling after only a couple weeks of use and I don't even carry in my pocket a ton.The biggest drawback is in processing speed and power. This phone struggles to keep up with games. It works. It's just choppy. I am replacing a 7 year old galaxy S8 with broken screens on the front and back that hasn't been updated in ages and that phone still outperforms this one.All in all, if its just for texting and normal phone tasks its probably just adequate. Just dont expect too much from it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Ecxelente celular",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Estoy enamorada de este celular buen material todas sus funciones trabajan al 100% no le arrepiento de esta compra de tantas que e hecho en Amazon sin duda es una de mis mejores elecciones gracias por entregar calidad estoy feliz 😀",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I Like it",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I'm 70,  Samsung J-7 died after 6 years. bought this, transferred my tracfone plan to it.  For the price, imo, can't beat it.  Although I bought  it Jan 17 for 49.95, price was 39.95 by Mon Jan 20",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I got this phone after my iphone broke and I liked it but I have sense given it to my daughter and we haven't had any issues",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "My son uses it like a tablet.  It works great and is very responsive.  You can't beat it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for the price.",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Surprisely nice for a cheap phone.  Tracfone activation took 4 attempts.  It did activate after 4 tries.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Motorola Phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Great phone. New in box. Sim card is built in. Just buy an airtime card and you're up and running. Battery lasts for days!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Works great 👍",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functions nicely",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Functions nicely",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great product",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "love  this phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "This isn’t my first choice but it does what I need it to do. I probably won’t be using it for anything else than making calls and texts so I can’t really comment on most of the features.  Battery life is average (one day), this is a 4G LTE so not as fast as a 5G LTE. It feels a bit flimsy but not sure if that’s because I’m used to the weight of an iPhone or that I have neuropathy/ carpal tunnel. I don’t like the smaller screen phones cause my hands aren’t tiny and the keyboard for texting is a bit smaller than I’m used to, for the same reasons I stated previously. But I give it 5 stars cause it's pretty much as I expected and it does what I need it to do. I wasn’t looking for “bells and whistles” or anything outside of usability and user friendliness.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Mucho más de lo que esperaba",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Me agrada que la batería dura alrededor de 48 horas  El sonido es muy bueno , es rápido en navegar en internet ,  aunque solo lo uso con wifi. Lo compré  para usarlo en unas app que en realidad consumen mucha batería con otros teléfonos  la batería no duraba nada. Con este teléfono dura hasta dos días. Estando la aplicación abierta  todo el tiempo  lo ame. Me a sido muy útil lo volvería a comprar sin dudarlo",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Affordable",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Nice phone at a great price",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thumbs up",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Great phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "As advertised",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cellphone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "And it works",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone and service for the price!",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "I needed to replace my second phone. I have used TracFone for my second phone for years because it is cheap and has great reception in my area. But this phone while not built from the best materials it is pretty good and has all the bells and whistles. I am very happy with it so far!",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "It is a much better phone that what I was expecting,more for your money.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to navigate",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Great phones",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Item",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Great Item to use as a electronic Bible! Very lite weight to carry in your purse or pocket!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Recommend"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product and value",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Best Tracfone. My old phone is a Motorola and I had it for 5 years. I definitely needed an upgrade and wanted to stay with Tracfone and Motorola. I love my new Motorola phone. Great phone at a great price!!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Maravilloso",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Your will not disappointed"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it for the price",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "I am loving it so far and is perfect for what I need it for. Also it is a good alternative until I can afford an upgrade to different phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tracfone is the best",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "I’ve had tracfones for ten years and have never been dissatisfied. Excellent customer service along with fantastic reception just about anywhere….even driving in the middle of nowhere in New Mexico. Get one and save thousands!  I use my data and texting as much as I want and rarely have to worry about running out and if I do I can reload in less than two minutes right from my phone. GET ONE!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low cost, good battery life, decent camera",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "Low cost, good battery life for sure. The camera is much better than the one in my previous smartphone, but it's no iPhone camera either. Still, it's decent.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Durability",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Love it",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clunky",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Great example of “you get what you pay for.”Im keeping it, it works for my purposes, but if you have another $50-$100 to spare just get a used Samsung or iPhone bc this is clunky and limited. Lots of tediousness, button repetition, (you have to press enter like 70 times for it to register and unlock), turns off if it “thinks” you’re not looking at it lol, it randomly beeps occasionally for no apparent reason while on silent…but if you just want to send occasional texts and take calls it works(ish.) on the upside, I’ve dropped it pretty badly multiple times and it is perfectly fine, so it’s durable lol",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    price",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "its just a good and a good deal"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Easy to figure out how to use it use it all the time"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far,so good",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Only had it a few days but good sound,reception and a lot of bells and whistles especially for $40.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "This phone is faster and has more storage than my older one.  Also has up button and down button for sound  I really like this phone and great price.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lags",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Not sure how calls and texts do with this phone as i only bought it to play PokemonGo.  There is a decent lag while playing and also when loading or turning the phone on.  Otherwise haven't had trouble"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disposable",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "As with my previous Moto G phones, the charging port only lasts about six months.  But given the price of the phone, it's a \"burner\" phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My granddaughter loves this",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "My granddaughter loves it. She has called every one in family. Download her games. She takes beautiful pictures with it. She stays off my phone. And she can call her mom without using my phone. I thank God for that little phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really great",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I got this phone for someone across the world from me right now because he broke his and it works perfectly great definitely recommend if looking for a affordable phone 10/10 period",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "It is a great phone got it for my son for Christmas. It has a great battery life only charged it once since Christmas. Great sound quality. It has a very fast speed and and great size for him to watch his movies and shows without it being to small.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the money",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Good phone for the price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is a great upgrade",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Upgrading from my 2019 phone, the storage, operating system, and processor speed feel like butter.  Very responsive and is frustration free!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fun",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "Plenty of room. Fast, simple, Cool",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone Exactly what I wanted!!",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Best Phone I had long Time .Super fast Processor Cheers To Moto and Amazon! Battery life is perfect,like the color,More memory than ever had!!Verify Durable,Size is perfect for gaming!",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for the price",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "Great for the price. It's quick, responsive to touch and works great for my 11 year old!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I had problems.... I could not get it to work right with tracfone....",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "I could not get it to work right for Tracfone, but it could have been me too....",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow phone but it works...",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "I bought this with intention to not be my main phone and as a second phone for personal use. I do wish it was unlocked but for $50 you really cannot go wrong with it. It's a solid phone with a great operating system.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone for the price.",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "I live in a trailer and this phone gets great reception! Historically, I always purchased LG phones for that reason and of course LG has stopped production. I can use Samsung but they are pricier, so when I found this product I was very happy.  I did not give it five stars because I seem to be experiencing a little bit of trouble with screens freezing which just happened last night and the jury's out as far as where that's going.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Former IPhone Users Review",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "I have had the best experience with this inexpensive phone!  My last phone was the iPhone XS Max that cost $1000. I got this one because the iPhone was giving out and I have had a couple of Android phones before. I’m so pleased with this little guy that I will advertise for Motorola for free!  It does everything I need and with the Google Play Store I can get any app or game and it handles it all with no problems. If you’re on the fence about getting this phone, get off the fence and buy it already haha. Really solid phone especially for $50",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I was having technically difficulties with my iphone so this was a great option for an emergency phone and only had to pay $10 for unlimited talk and text for 30 days! Love it!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Problems with this phone",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "This appears to be a good phone.  However, I am not receiving a pop-up notification when I receive a voicemail message.  The only way I can find out if I have a voice message is to dial *86.Also, this phone occasionally won't display/receive pictures/images.  I have to turn the phone OFF, then turn it back on for it to download/receive a picture which someone has sent me.  So I don't know that I have a pending picture if the sending party doesn't tell me they sent me a picture.I don't know if this is a problem with MY particular phone or if this is a problem with this particular Motorola style phone.I have contacted Tracfone technical support on several occasions and they have tried to fix these issues by doing an upgrade and having me turn the phone off and on.Nothing works permanently to fix these two issues.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for the price.",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "50 bucks and it runs really well and has a decent amount of storage. I was with straight talk, and called customer service for Tracfone, and they said it wouldn't work, but fortunately they were wrong, all I had to do was put in the sim card and easy peasy up and running. So I hope this gets to you, if you try the same thing, but I'm not going to take any points off for that, just a learning momeent.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for the price",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "This phone model, released in February 2024, turned out to be an extremely pleasant surprise.  In the previous year, I bought and had trouble with two other makes in the $1000 range.  My main interest for buying such expensive phones was the advanced cameras, not just communication.  It turns out that this inexpensive phone has almost the same photo capabilities and other capabilities as the expensive devices. In all ways it has been serving me very well so far.Oct 21, 2024  After using this phone for some time to take photos, I have found, that even with the 50 MP lens, the picture quality is far from as good as for the expensive phones.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly what was needed!",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Purchased for my elderly mother. Easy to use and set up!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the Trac phone",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "My 9 yr old grandson loved his gift perfect for him",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great device",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "BeautifulG",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked in only part of my wood balloon frame house",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Caution!  Amazon lumps together similar items in the review. If the exact model is not listed in the review, the reviews may not be for the particular item you want.Motorola has a new model every year, but always the same model name. With only two years support from date of manufacture, check carefully that you are not getting an obsolete model.  Demand to know the year of the model.As a WiFi device, it works fine and has one game loaded.  The phone service didn’t work inside my house so it is just a device for a game to me.Only worked in some parts of my home. Per customer support, YMMV depending on trees in the way."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for my preteen!",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "Great phone with all the bells and whistles!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tracfone",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Works great!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issue",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Phone easy to use . But I had some issues with my the device stop holding a charge.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far,So Good",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "The phone turns on fast,ease of use, quality is fare for the price I paid. It’s a nice size phone 📱 6 inches.I liked mine, so I ordered one for my son as a Christmas gift 🎁",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost perfect",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "I really like this phone. Only complaint I have, is the battery needs recharging way more often than my old phone. Other than that, I'm pleased with this purchase.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value. Better than I expected",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "Works very well. Has all of the features I need and not too much crapware. The only thing it lacks is NFC and wireless charging which I don't really need. It would be nice if every time it updates it didn't install extra software I don't want. At least I can delete any crapware unlike some cell phones.",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Big Improvement over My Moto G7",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "It's faster, has a nice display, plenty of memory, great battery life. The first charge lasted for five days of on time, with 20% still left (though there was no \"talk time\" during that, of course if you do a lot of talking or web browsing and such you can probably expect more like two days or so of battery life) ).I really wish I had bought two of these when they are on sale for Prime Day -- one to use mainly as an everyday mobile, one to use as a \"home phone\",  or just as a substitution for a tablet.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good basic back up phone",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "You can't buy this phone in retail stores anymore since Verizon bought out TracFone. Good for emergency use or a back up",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    grate phone",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "I purchased these phone in a hurry because I have broken my other phone All the phones that I had of being the effective At first I didn't know If it's if it was going to be good But after having it for a while I can tell you it has a great screen Awesome speakers It wasn't very expensive And I can put a SIM card in a memory card And expand it for the price it's a great buy I also bought a little case for under $10 And even though I'm not crazy about bigger phones I really like these one .",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    easy to set up",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "love the touch screen feature!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent for the price",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "A lot faster than my previous Tracfone Samsung Galaxy A03s, with more storage and RAM. I like the more vanilla Android UI compared to Samsung's as well. Very happy with it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does its job and great price.",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "Very competetive with higher priced phones. Like it a lot.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone great price",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "My last Motorola phone lasted about six years. This new 2024 Motorola g play phone looks great, beautiful sapphire blue. Good clear glass screen, easy setup great battery life. Good job Motorola keep up the good work.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nice phone",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "ordered it for my dad. he likes it, and i do also",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Good phone not lagging unlike the 32gb",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for $50 and it's SafeLink Comparable",
      "date": "Reviewed in the United States on June 11, 2024",
      "body": "For just $50, this phone is an unbeatable value! With 4GB of RAM and 64GB of storage, it's a great device for the price. While it does come with some pre-installed bloatware, most of the unwanted apps can be easily deleted. Plus, you can use your SafeLink Wireless SIM card with this TracFone, which is a huge bonus. The sound quality is excellent, the cameras are decent, and the phone is surprisingly fast. If you don't mind using Google apps, you'll find a ton of pre-installed options. Overall, I highly recommend this phone - it's a great buy! If you're looking for a SafeLink-compatible device, this is the one to choose.",
      "helpfulVotes": 33
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "You took care me when I received a bad phone. Thanks",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    returning/not 5G",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "returning",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great size and color",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "Got this phone for my daughter and I swear it's as good as my Galaxy s23 except the camera",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Well worth the money",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "Comes brand new in box works wonderfully and I would definitely let others know about it and also buy it again for myself",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "Was very pleased with this product works very good",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for my son",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "My son is very happy with this phone and it comes with a SIM card and a plan so it was a mistake for us to buy the bundle.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to work with",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "I like the way the phone fits in your hand  over all its a great product",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    FANTASTIC",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "Tons of storage. Camera has micro feature. Use it all the time as a magnifying glass but better. Battery life so so",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good stuff",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "Easy swap SIM card w current tracfone. Works good. Easy setup. Quality.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING CELLPHONE AT A GREAT PRICE",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "Both of our 2016 Samsung cellphones were having issues and very slow and not holding a charge for too long. We upgraded to this amazing Motorola 2024 model cellphone, and they are easy to operate and full of great features. You really can't beat this deal especially at this low price.  Both cellphones and cases for under 120 bucks! Thanks Amazon!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice and cheap phone",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "It is a good phone, I do not use it a lot but I have no issues with it so far. It has been a month now",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome new phones",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I bought two phones for my sons and they arrived new in a box and the set up was very easy. I love it I may switch my phone number to this company as well.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone for the money",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "I needed a Verizon compatible phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    For the price, this is an excellent phone",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "Nice phone for the price, does everything i need it to do",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Phone quality",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent purchase!",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "Love this phone! Easy to navigate, modern,  great battery life, great price! Very happy with my new Motorola! 👍❤👍",
      "helpfulVotes": 2
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its ok but lacks processing power.",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Overall this phone has just been adequate but has some drawbacks. The overall build feels like a 40 dollar phone and doesn't compare top a flagship phone. It is almost entirely made of plastic. That said, it seems durable enough.The screen is clear and bright but I don't know what kind of glass they use but it doesn't seem to be super hard as there are lots of tiny scratches and swirling after only a couple weeks of use and I don't even carry in my pocket a ton.The biggest drawback is in processing speed and power. This phone struggles to keep up with games. It works. It's just choppy. I am replacing a 7 year old galaxy S8 with broken screens on the front and back that hasn't been updated in ages and that phone still outperforms this one.All in all, if its just for texting and normal phone tasks its probably just adequate. Just dont expect too much from it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clunky",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Great example of “you get what you pay for.”Im keeping it, it works for my purposes, but if you have another $50-$100 to spare just get a used Samsung or iPhone bc this is clunky and limited. Lots of tediousness, button repetition, (you have to press enter like 70 times for it to register and unlock), turns off if it “thinks” you’re not looking at it lol, it randomly beeps occasionally for no apparent reason while on silent…but if you just want to send occasional texts and take calls it works(ish.) on the upside, I’ve dropped it pretty badly multiple times and it is perfectly fine, so it’s durable lol",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lags",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Not sure how calls and texts do with this phone as i only bought it to play PokemonGo.  There is a decent lag while playing and also when loading or turning the phone on.  Otherwise haven't had trouble"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disposable",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "As with my previous Moto G phones, the charging port only lasts about six months.  But given the price of the phone, it's a \"burner\" phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow phone but it works...",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "I bought this with intention to not be my main phone and as a second phone for personal use. I do wish it was unlocked but for $50 you really cannot go wrong with it. It's a solid phone with a great operating system.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Problems with this phone",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "This appears to be a good phone.  However, I am not receiving a pop-up notification when I receive a voicemail message.  The only way I can find out if I have a voice message is to dial *86.Also, this phone occasionally won't display/receive pictures/images.  I have to turn the phone OFF, then turn it back on for it to download/receive a picture which someone has sent me.  So I don't know that I have a pending picture if the sending party doesn't tell me they sent me a picture.I don't know if this is a problem with MY particular phone or if this is a problem with this particular Motorola style phone.I have contacted Tracfone technical support on several occasions and they have tried to fix these issues by doing an upgrade and having me turn the phone off and on.Nothing works permanently to fix these two issues.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked in only part of my wood balloon frame house",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Caution!  Amazon lumps together similar items in the review. If the exact model is not listed in the review, the reviews may not be for the particular item you want.Motorola has a new model every year, but always the same model name. With only two years support from date of manufacture, check carefully that you are not getting an obsolete model.  Demand to know the year of the model.As a WiFi device, it works fine and has one game loaded.  The phone service didn’t work inside my house so it is just a device for a game to me.Only worked in some parts of my home. Per customer support, YMMV depending on trees in the way."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issue",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Phone easy to use . But I had some issues with my the device stop holding a charge.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good basic back up phone",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "You can't buy this phone in retail stores anymore since Verizon bought out TracFone. Good for emergency use or a back up",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    returning/not 5G",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "returning",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Instantly not pleased watch out for what is not in the discription",
      "date": "Reviewed in the United States on September 17, 2024",
      "body": "This is not completely like the moto g 2024. No finger print scan, no Dolby speakers, more.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery not very good",
      "date": "Reviewed in the United States on September 4, 2024",
      "body": "The battery doesn't stay charged nowhere near as well as some other phones I've had. Other than that it's an okay phone. I wouldn't recommend it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Weak battery",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "battery does not stay charged  for very long.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Sim card!",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "We worked on setting up this phone for 3 hours, finally had to call the Support line.  She worked on trying to set up the phone over and over again.  After an hour she had us take out the Sim card because the numbers weren't matching or something.  The paperwork stated that the Sim card was already installed in the phone.  We open the door for the Sim Card and to our surprise, there wasn't a Sim card there.  4 hours down the drain!  Wish the box or paperwork would have stated that!  Now we're ready to return the phone back to Amazon.  What a waste of time.  Hope this didn't happen to other people.",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gave to my son",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "It works perfectly",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    High rip off potential",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Half a star if I could.  Customer service is a joke. Tried to tell me none of my credit cards could activate it despite my using them right before activation.  Couldn't assure me my info was safe.DON'T DO IT!!! DO NOT BUY!!!!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Choose a different make.",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "This Motorola phone really leaves a lot to be desired.  Ridiculously long boot time, touchscreen not responsive.  Other issues, too.  Battery drain is unbelievably excessive, even after following all suggested tactics for reducing battery drain.  I cannot recommend this phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't charge",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I bought this as a cheap back-up phone. Upon receipt, I tried charging it to 100% prior to using it. However, it took approximately 4 hours to charge from 59%-72%: phone is being returned."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Piece of Crap",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Don't buy this phone. One day I had to restart the phone to swipe the screen. This went on for a while. Today I can't even do that.  I am very upset, and I don't want to have to buy a new phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does read the sim card",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Product is too bad . It doesn't work. It's so annoying 😑 once I insert in my simcard, I get a response that cellular network is not connected"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very glitchy",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "The phone worked amazing did all the right things till 24 hours after buying it and turning it on it forced me to do a system update now it's just a glitchy broken phoneThis seemed intentional",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    getting the rest of order.",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "love the phone,but still need what is missing,of order."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Look elsewhere",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Won't work, won't let me return. Complete waste of money."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    In able to use the product",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "The fact that it's a locked phone.It should not be sold online",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    True details",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Phone is l8cked and can't use it"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Inacurrate Information",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "This product doesn't post accurate information. I bout it and was trying to activate it with another carrier but it didn't allowed me. They want me to stay with them for 12 months. Yet they sold this phone with a recommendation of another service carrier next to it. If you buy this product, you're stuck with them for 12 months or pay an additional fee over $100 to get unlocked.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone couldn't connect to the internet.",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "The phone would not connect to the internet. I took it in to several professionals including my internet company and they couldn't get it to work. After all this, my return window closed. Now I am stuck with a useless phone and out the money. We are seniors on a fixed income and are very frustrated.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This isn't an unlocked device. It's a contract phone",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "You aren't buying an unlocked device. This is a contract phone, hence the low price. I returned it and didn't use the service but there are plenty of reviews online. Educate yourself before committing to buy this product because it comes with conditions that aren't for everyone.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No funciona",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Este teléfono no sirven no se pueden usar porque están bloqueados",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    replacement phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "doesn't work, only comes on once in a while, keeps shutting off",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I hate it",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "bluetooth seems low power for audio I hate this phone over my 6 years old LG",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will not accept a TracFone AT&T SIM card",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "I have been using an TracFone issued AT&T SIM card in multiple phones over the years, which we since Verzion has zero coverage at the In-laws house in the country.  This is the first TracFone locked phone that has not accepted the SIM card.  I was hoping to use TracFone a little longer before switching to an AT&T based MNVO.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Another Tracfone Piece of Junk!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Wouldn't even start up.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible!!!  Impossible to put togetherIII",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "Sending this Motorola back to you....ASAP!!!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone is no good not working. Refund me my money",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Phone Not working",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    unlocking",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "still haven't been able to get it unlocked, cant use it for a replacement on the free phone program",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    be very careful",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "This phone arrived without any papers anything that suggest that this is a new phone and this is a legal transection",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't open my TracFone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I can't open my locked Motorola TracFone"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid if you an Apple/iPhone user",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "If you are an Apple/iPhone user, avoid Tracfone/Motorola/Google/Android pre-pay cell phones. That way lies madness. If you are a Google/Android user, you might stand a chance. Struggle to get Tracfone to activate the phone. Struggle to add minutes. Appear to have it set up and working..... next day additional Google/Android hoops to try to jump through.... next day even more hoops... phone won't ring. They can call me, but I can't hear them.... Texting tested good, now doesn't work. I can call them, but it says they are not available, but adds the call to their Recents list. Basically, if you are an Apple/iPhone user (even with years of tech experience).... you are toast. Admittedly, the same may hold for Google/Android users who try Apple/iPhone.Got them a relatively inexpensive ATT Apple/iPhone12 prepay package that has worked well."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT GET THIS PHONE!!!!!",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "This phone loves to crash out of apps randomly, the keyboard can take forever to appear at times and will randomly disappear when trying to type. I try and restart it to fix it and that can take as long as 5-7 minutes to do it. And it can take forever to exit an app or online tab. Highly highly recommend to not get this phone if you are looking for a good reliable phone. IT IS CHEAP FOR A REASON!!!!!! Solid example of getting what you pay for."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk phone NOT WORTH THE MONEY",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Well first the delivery guy left the package at the wrong location, not where it was supposed to be delivered to.The phone itself is a bug infested, google locked piece of junk not worth a penny and very disappointed in Motorola. Used to make good phones now like everyone else it’s junk!I can’t get mail sent, it queue everything, the phones keyboard doesn’t type the key you press, I can go on and on.If google wants phones to work like this, then give them out for free and pay for the service. This phone is just a joke.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used phone and for use only in USA",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "1.You sent used phone with the sim inside.I bought and paid  for a new one…..2.You didn’t write clearly that it is for use only in USA"
    }
  ],
  "productDetails": {
    "productTitle": "Tracfone | Motorola Moto g Play 2024 | Locked | 64GB | 5000mAh Battery | 50MP Quad Pixel Camera | 6.5-in. HD+ 90Hz Display | Sapphire Blue",
    "asin": "B0CTW8TXGH",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "6.5\" HD+ 90Hz Display with Corning Gorilla Glass 3. / Snapdragon 680 processor.",
      "50MP sensor with Quad Pixel Photo Night Vision. / Dolby Atmos and Hi-Res Audio.",
      "5,000mAh battery for up to 46 hours of battery life. / 64GB of storage + 1TB more with microSD card. / 4GB RAM, expandable up to 6GB with RAM Boost.",
      "Carrier: This phone is locked to Tracfone, which means this device can only be used on the Tracfone wireless network. A Tracfone plan is required to activate this device. Activating is easy, upon receipt go to Tracfone Website and select “Activate” and follow the prompts.",
      "Compatible with our no-contract Unlimited Talk & Text plus Data plans starting as low as $20/month plus taxes and fees. To find the Tracfone Plans available to purchase, please go to our TF - Amazon Brand Page linked below the product title."
    ],
    "boughtCount": "5K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: TracFone",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "10K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 10,
    "startingPrice": "$39.88",
    "url": "/gp/offer-listing/B0CTW8TXGH/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0CTW8TXGH",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Motorola Moto g play, USB Charging Cable, Quick Start Guide"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$39.88",
    "listPrice": "$49.99$49.99",
    "savingsPercentage": "-20%",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}