{
  "asin": "B08XBND9N3",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "It worked great, ensure that your around a strong WiFi to use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Illegal advertising by seller. Terrible Service",
      "date": "Reviewed in the United States on February 20, 2024",
      "body": "Illegal advertising by seller. Package front and back both state: \"Unlimited Talk, Text, & Data\". But on the front bottom, it states, \"3G Data\", and the listing details state: \"3GB of High-Speed 5G 4G LTE Data.\" How can it be limited to 3G of data if it clearly states \"unlimited data\" on the package front and back. I contacted the seller, Ultra Mobile\" about this and asked the same question. They referred me to Amazon to complain to you, if I received the wrong SIM card. However, I was starting to message back to them in the chat that I did not get the wrong SIM, I got the one I ordered, but the seller has put misleading info on the package. Before I could even send that reply message, the chat rep from Ultra Mobile ended the chat as soon as they sent me the message saying to contact Amazon about it.Set up was very complicated, took a very long time to try and get this all straightened out. The activation instructions said I have to change the settings for Access Point Names, which was a long process. But it also seemed as though the Access Point Names were automatically configured during activation.I am unable to access voicemail unless I reset network settings to factory default settings on my phone, which I don't want to do, since I am only trying out this SIM on my phone, and plan to revert back to my Tracfone network. If I reset network settings, all data, bluetooth, & wifi settings will be deleted. That would mean that when I reinstall the Tracfone card, I will not be able to access my voicemail on that network, plus I won't be able to log into my wifi or use my previously paired bluetooth devices with my phone.When the phone is initially set up, and I call my home phone from the mobile using the SIM card, it comes up as \"April Bailey\", which is not me. There is no way to resolve or change this. Ultra Mobile said they would escalate that, but I dont know if they will fix it.I have had two chats with their customer service, which both went about 1 hour. The chat reps seem to be chatting with multiple people at the same time, so their responses usually take a very long time & they never admit to chatting with multiple people simultaneously when asked directly about it. They claim they are checking resources or having system issues. Most of the chat time is spent waiting for them to respond. When I asked why the physical packaging says \"unlimited data\" on the front and back, while the plan says \"3GB of data\", they could not explain that and told me to contact Amazon, then they dumped me off the chat without warning, which was so rude and unprofessional. Both chat experiences were bad.I did try calling one of the 80 countries and enjoyed the free call and text on that. But I would not recommend this company due to the above issues. I also reported them to Amazon, who said they would escalate the issue of false advertising.",
      "helpfulVotes": 56
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fácil de activar",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Exelente"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Useful",
      "date": "Reviewed in the United States on October 1, 2024",
      "body": "I bought this card for an iPhone. I used it on a trip to three countries. I activated it and it worked perfectly in the United States, both for calls and texts. Then in Colombia it worked, but the calls were very low. The text messages didn't work. Then in Venezuela it was the same as in Colombia, calls with a little difficulty and no text messages. I think it's a good option to not be left without communication if you're going to travel. It's super easy to install the SIM card, the app and control the recharges.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great spend",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Service quality is good, cost is good as well as the coverage, the plan I chose though doesn’t provide a lot of data quality but that’s fine for me as that’s only needed when am traveling",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ultra Mobile should make if clear that the 3 GB all over their product is only good in the US.",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "The \"3GB\"  of data is not good in Mexico which is why I got it. After a bunch of research and hunting and pecking on the Ultra Mobile site, I found our you could add 5GB of data in Mexico for $5 additional using the Go Roam Mexico Data Pass. Ultra Mobile should make if clear that the 3 GB all over their product is only good in the US."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Funciona en Venezuela.  SMS a veces lento",
      "date": "Reviewed in the United States on May 13, 2024",
      "body": "Al instalar la SIM Ultra Mobile como SIM #2 en el celular Xiaomi, en ajustes (settings) aparece T-Mobile.  Ultra Mobile es un Mobile Virtual Network Operator (MVNO) que compra y revende cobertura T-Mobile.  El 1 de mayo 2024 T-Mobile compró a Ultra Mobile. Compré la SIM con 3GB por $19 mensuales y lo utilicé tres semanas en Texas, Florida, Panamá y Venezuela para llamadas telefónicas, mensajitos, data, WhatsApp etc.  En Venezuela, sí recibo mensajitos de claves de bancos, incluyendo BofA y familiares.   Con roaming, probé llamanado a USA estando en Panamá y Venezuela.  Funciona, pero mejor llamar WhatsApp via WiFi que no tiene costo.A fin de reducir la mensualidad, al vencer el mes, cambié el plan mensual de 3 GB $19 al mínimo, $15 mensual. Al hacer un solo pago de $120 por un año, hay descuento que equivale a precio de $10 mensuales.  Ofrecen seis planes.  Determine el conveniente según el uso que le va a dar.  T-Mobile es mucho más costoso.En Venezuela, Ultra Mobile trabaja con partners Movistar y Digitel, por tanto, nótese que como cualquier celular en Venezuela, depende de la cobertura y congestión del operador local.  A veces los mensajitos tardan en llegar a Venezuela, dependiendo de la hora del día.    Encuentro que entrando y saliendo de modo avión en el teléfono, y también  mensajitos en la app de Google Messages en la computadora con Windows 11, mensajitos parecieran llegar más rápido.Ultra Mobile es buena solución para cobertura internacional, Venezuela incluida.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everyone please avoid using Ultra Mobile.",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "We bought 2 1-month 3G plan SIM cards for our Costa Rica trip. They worked well the first 2 days, however they became totally not functional in a sudden since the 3rd day being activated. We are very sure it's not due to the data running out because each of us only consume 300-400mb the first 2 days. The SIM cards can sometimes detect the local signal, however, no data can be used anyway. It is frustrating to meet this kind of the situation during the trip oversea.Their customer service is useless. The chat window on the official website is a chatbot and not helpful at all. Once you asked to talk to the real person, the window will be gone.They also provided an US number to be reached. However, the SIM card is useless, how can we make the international call?",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Separate the product from the service",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "Okay. I am going to review both the product and the service differently.The sim card is easily activated. You need to be in the US when you activate it. Inside the US, you will get a new phone number and wifi calling needs to be enabled through ultra Mobiles website. It wont work until you do.Now the hard part... the service..i took a vacation in Brazil. My phone worked literally only the first day; I started having issues right after the phone restarted.The problem is that literally every place that i am at (except very close to the airport) is considered to be roaming. If this is the case for you, youll need to go to their website and add international roaming credits for it to work. The current rate is 25 cents usd a minute for talk, and 2 cents per texts. I'm not entirely sure on the data rate....but they do have a support number to call, and they can help you fix issues.Keep in mind, just because you have internet that does not mean you can make calls. Just because you can make calls doesn't mean you have Internet.You need to actually check the coverage maps of wherever you are going and make sure to have roaming credits because you'll never really know when it's needed.To get my phone working in brazil (i have an android), i needed to go to settings, mobile data, then select the SIM card and make sure that the carrier setting was at auto select. This didnt work until i tried to connect to a non functioning network and it tood me to enable automatic registration..after that, the only issues I have are related to my coverage area.5 stars for the sim.3 stars for the service.. I wouldn't have gotten my phone to work without having a technical background.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Suitable",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Not the best service at my location. Mostly happy with the easy setup. Emails about renewing can get annoying. I only need the service for a month or less for a trip, nothing more ... Anyways it suits my needs",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thanks mi phone",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "It works well"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excelente",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Excelente"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Sim prepago útil",
      "date": "Reviewed in the United States on February 28, 2024",
      "body": "Compré la SIM para mis vacaciones en Miami Beach. La configuración un poco difícil, si bien descargué la App no habilitó la señal. Pude activar al enviar un mensaje de texto con el IMEI del celular al número que informaba el cartón que protege el chip. Incluye una herramienta para sacar el chip, muy útil al no portar un clip en mi viaje. La señal en la ciudad entre 10 a 15 MB, suficientes para mirar planos, Uber, lo básico. Al ir al muelle de Miami a un crucero la señal ya no funcionaba, por fortuna en la ida y regreso la empresa de crucero dispone de señal wifi para poder llamar Uber. El número celular local no lo utilicé nunca. Fue una compra útil a bajo precio, considerando que otras opciones parten de 40 dólares en otras compañías.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good SIM card for USA",
      "date": "Reviewed in the United States on June 27, 2022",
      "body": "At first I bought it would be a simple plug and play like other countries. That is not correct. I found the setup instructions a bit unclear and setting up through sms only didn’t work at all. However, once I downloaded the ultra app (which I didn’t want to do at all), the setup was relatively smooth. Also it was nice to be able to monitor the data usage through the app.Only twice  did the data not work and I simply closed the app and restarted the phone and it worked again.I was mostly in the countryside so reception was usually not amazing but still acceptable for navigation and messaging.One note: I had access to WiFi a lot so didn’t use even half the data purchases but wanted to have the biggest data just to be safe. It might be better/cheaper to get the 3gb and add more manually once it is out.I don’t know why it is so hard to get a data SIM card in the USA but this is a good option amongst a lot of bad options.Also I got a local phone number to use for free for phone calls and sms which was very useful",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    T-mobile coverage is very spotty",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "The coverage by T-Mobile focuses on busy areas -- they neglect many residential areas and provide only voice and slow data service. \"Main street\" gets 5 bars but moving away 300m (1/4mi), reception drops down to 1 bar !! And data-speed drops significantly. This doesn't happen in the middle of nowhere -- this happens within 5mi form Apple HQ in Cupertino !!In other parts of the US, I have driven 4+ hours without getting any T-mobile coverage at all. Not even in the hotel in a small town. Local residents told me, I should have used A or V service instead.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    early thoughts....",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "price good, however this number has had tons of notifications and spam calls from previous customer. I've spent everyday black listing/blocking 8+ different callers and notifications from previous persons bank notifications! I unsubscribed to everything immediately when I realized these would be ongoing if I didn't cancel them somehow.set up wasn't difficult.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    \"Ultra Mobile: ¡Mi nuevo mejor amigo en la red!",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Desde que cambié a Ultra Mobile, mi experiencia con el servicio celular ha mejorado notablemente. Este plan de $19 al mes me ofrece todo lo que necesito: llamadas ilimitadas, mensajes de texto y 3GB de datos 5G.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Simple to use",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Simple  to set up.does what it says",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish I knew",
      "date": "Reviewed in the United States on February 14, 2024",
      "body": "Although I love the fact its $60 for 60gb of data here are things I wish I knew.1. create an account right away and update your email because if your phone gets stolen or lost you cannot retrieve it and your only option is to get a new sim and phone number.2. Never activate it online as Ultra mobile will break every neve in your body and only charge you money for a phone plan you already paid for. I already lost money on this service, and had it not been for the 60 bucks for 60 gigs I would have told them to get lost. Instead activate a new sim through the phone.3. If you are converting a sim to esim make sure your contact information is up to date or else customer service will just waste your time and tell you there is nothing you can but get a new number and sim.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "Very easy to activate, excellent cell service. highly recommended",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't leave home without first thoroughly checking functionality!",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "I bought this SIM card for travel while in Banff, Canada. I thought I had verified mobile data while in the States, but maybe I had Wi-Fi on and didn't know it. So I thought mobile data was working. Then in Canada, it wasn't -- ever, no matter how may times I spoke and chatted with Ultramobile technical support who had me reset, reboot and call my previous carrier for a three-way technical support call to get the phone unlocked which Ultramobile first said it was, but then agreed that it wasn't. I wasted HOURS of my vacation on many support chats and calls. Finally, back in the States, I called Ultramobile support again and they had me turn off mobile data and do a network reset under Settings -> General Management -> Reset -> Reset newtork settings -> reboot and it worked! But no longer need mobile data since I am no longer in Canada! Ugh.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for when I'm visiting",
      "date": "Reviewed in the United States on June 1, 2024",
      "body": "I always pick up a SIM card when  I'm in the country visiting family. This has definitely been the best SIM yet. Received it the day I arrived, coverage is good and it comes with international calling credit. Only downside is I feel my 5G data depletes quicker than I actually use it",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Funciona por fuera de USA",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "Esta sim funciona perfectamente en Colombia, recibe y hace llamadas hacia USA, y también recibe mensajes de texto. La recomiendo para quien necesite utilizar un número de USA desde latam, ya que recibe llamadas y mensajes de texto. Útil para verificar cuentas de bancos,  de paypal, whasatpp, o cualquier otro tipo de verificación por mensaje de texto"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Affordable and Reliable Prepaid Card for NYC Travel",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "I got this prepaid card for my dad while he was visiting. It worked great in NYC and is much more affordable compared to T-Mobile and other options."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Signal",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "They must improve access to the application, but even more importantly they must improve the signal offered, it said that there was a signal available in Italy and since I arrived I have not had a signal data mobile, otherwise they have good plans but the details of each plan are not clear enough.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Consider something else",
      "date": "Reviewed in the United States on May 19, 2024",
      "body": "As good as it sounds and as easy as it sounds , it’s not.. It’s day two of trying to get a phone number and activate the phone. It shouldn’t be this difficult",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fine for short term needs, coverage isn't great",
      "date": "Reviewed in the United States on June 10, 2024",
      "body": "For short term needs, it's the best option you'll find. Coverage isn't always great and data isn't always very fast, but it does the job.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was so easy to use!",
      "date": "Reviewed in the United States on August 3, 2022",
      "body": "We've always had a cellphone service provider in the US. But with extended upcoming international travel, we decided to port our numbers over to VOIP providers and eliminate our cell service.This little sim card did the trick for us. It let us keep access to data when we weren't near a wifi source. When we purchased our phones a couple years ago, we made sure that they were unlocked. This made switching from our carrier's sim to this one a snap.We just followed the directions on the package and had data access in no time. We had no tech issues, so I can't rate tech support, but had a great overall experience.Since we had ported our phone numbers over to a wifi service (one to Google voice, the other to iPlum) we still had access to our regular phone numbers, so the one that came with this sim was irrelevant to us. It was really the mobile data we were after.And given how easily this worked, now we know exactly how we'll fill our data needs on any trips back to the US. 👍  Yay!",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's good",
      "date": "Reviewed in the United States on July 16, 2024",
      "body": "It's good and easy to install",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Perfect Way to Test the Ultra Mobile Network",
      "date": "Reviewed in the United States on June 30, 2023",
      "body": "The Ultra Mobile 7-Day Trial Kit is a great way to test the Ultra Mobile network without committing to a long-term plan. The kit comes with a SIM card, 100 minutes of talk, 100 text messages, and 100MB of data. The SIM card is compatible with most GSM unlocked phones. Once you have activated the SIM card, you can start using your Ultra Mobile service right away. The talk, text, and data will be available for 7 days.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fair deal",
      "date": "Reviewed in the United States on June 28, 2024",
      "body": "I am fairly satisfied",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone service",
      "date": "Reviewed in the United States on July 2, 2024",
      "body": "Easy to activate"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast Delivery",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Very fast delivery and product is of good quality"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "It works great for me signal strength and data are good. You have to call ultra mobile to get activated took a few minutes to finally get the right number from T-Mobile but after that a few extra seconds and I had everything working great 👍",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works Great",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "How easy it was to install Nice"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wifi required for activation",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "The odd thing about this simm card is that you need wifi for activation, which somewhat defeats the purpose of getting it.  Even after going through activation, the signal for mobile data is not uniform across the US.  The data speed and network is not that reliable.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Might Be Worth a Try",
      "date": "Reviewed in the United States on April 28, 2022",
      "body": "I may have caught them on a bad day, but the first day I tried to activate the SiM card, their website was down. I tried for a few hours and no luck. Finally, I called their customer service line and they were able to activate the service. It was a few hours wasted, at best, but it gave me pause to consider whether or not this was a regular occurrence for them? Ultimately, I decided against this service, but I wouldn't hesitate recommending people give it a try, as it was good after that first day.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had to return",
      "date": "Reviewed in the United States on May 26, 2024",
      "body": "The phone I had purchased this item for was an out dated 2G model.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okay",
      "date": "Reviewed in the United States on May 12, 2024",
      "body": "Connectivity.. phone calls drop often and internet is not strong. Calling to USA calls drop a lot.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Encantada",
      "date": "Reviewed in the United States on September 2, 2024",
      "body": "Usé este chip en mi ultimo viaje y vale decir que funciono todo perfecto! Instale el chip en el avion y desde antes de aterrizar en miami tenia recepcion. La volvere a usar",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very useful for travelers",
      "date": "Reviewed in the United States on October 1, 2024",
      "body": "Second time buyer and works perfect for travelers, easy install and setup instructions.You can make overseas calls whilst on travel, recommended.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well",
      "date": "Reviewed in the United States on March 15, 2023",
      "body": "I was visiting USA for 4 months so I didn’t want to sign up with any phone company. I was unsure at first to try using this sim . However I must say I can’t complain about the service I received it was perfect throughout my stay .",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Recomended to buy",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "Good quality of service , easy to instal - with help of customer service if it's needed, fast delivery, low price, verall satisfaction of using it",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Harassment Calls Ruin It All",
      "date": "Reviewed in the United States on May 14, 2023",
      "body": "I had a terrible experience with a phone card recently, not because of the carrier but because of the constant spam calls. The number associated with the card receives more than 20 calls a day from Jamaica and New York, and it seems to be linked to multiple accounts. It's so bad that I'm scared to use it.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Insufficient",
      "date": "Reviewed in the United States on January 21, 2024",
      "body": "I purchased this SIM for a month abroad in France. I followed the set up instructions, which were pretty vague. I chose the option to have a different number, rather than keep my regular one. It gave me a U.S. formatted number, and when I arrived in France, I could not make any calls to French or American numbers. I also purchased 15 GB of data, which I have been unable to activate despite following the instructions in the app. I do have \"data roaming\" on, but that hasn't fixed it.In order to access customer service, you have to place a call. I cannot place calls, so I cannot reach customer service. I can send and receive text messages, but only when I am connected to WiFi. I can receive calls, but cannot place them. I asked my Professor for help (since he is regularly abroad) but he couldn't fix it either.I've gotten by, but it's far from ideal and kind of scary not to have reliable contact or internet access in a foreign city. I don't recommend this SIM.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect so far",
      "date": "Reviewed in the United States on July 11, 2024",
      "body": "Day 2 of using this and this has been perfect so far. Activated fine on a Samsung S20 phone. Used for US talk and SMS so far and faced things have been smooth",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor plans",
      "date": "Reviewed in the United States on January 23, 2024",
      "body": "You rather get a Tello sim.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The best solution when I'm in the US",
      "date": "Reviewed in the United States on August 18, 2024",
      "body": "Quality, installation and value for Money are eccellent! Absolutely easy to use and service plus connectivity are perfect❣️Approved❣️"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You get what you pay for",
      "date": "Reviewed in the United States on January 2, 2024",
      "body": "Coverage is spotty in some locations and tech support is close-to-clueless.Pay a little ore and get a sim card from a company with good support.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works every where",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "Yes product very good, use everyday. Easy set great coverage",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fine",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "Fine"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on January 27, 2024",
      "body": "I don’t have a US number so going home from abroad was really easy with this SIM card. The only negative is that someone signed up for texts from a few companies so I got a few ad texts intended for someone else. Not a big deal. I had a good experience with this product!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No SIM card is the message",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Trying to activate phone but it keeps saying that there is no SIM card and it has been installed."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works, if it is installed",
      "date": "Reviewed in the United States on December 1, 2022",
      "body": "We went into a seller shop to install. Because I didn't get an email or anything else. The guy in the shop helped me and then it was working really good. Price is good.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Yes yes yes",
      "date": "Reviewed in the United States on September 16, 2023",
      "body": "I’m not gonna lie, this took 3 minutes and zero hassle. I been without a phone for a week after a boost mobile run-around. I am beyond happy to get hassle free phone service. Thanks SO MUCH for not giving me high blood pressure. THANKS. I’m too happy honestly, but for real it was so easy.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked very well in a UK phone",
      "date": "Reviewed in the United States on June 29, 2024",
      "body": "Fast delivery.  Was goid value for what l paid.  No regrets purchasing it  and would buy again",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Tarjeta usa",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "Buena recepción y cobertura"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy a different card",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Best advice is not to buy. It's painful to get it activated. Very disappointing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Difficult to transfer your own phone number",
      "date": "Reviewed in the United States on July 26, 2022",
      "body": "If you want to activate it with your own phone you'll need to get information from your current carrier. I was overseas and couldn't do this very easily. Was hoping to transfer my own number but it was too much hassle. This is the reason for 3 star rating. Otherwise, easy to activate and had immediate coverage.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal",
      "date": "Reviewed in the United States on January 12, 2024",
      "body": "I had a friend visit me from Germany.  She popped the SIM into her Samsung Galaxy A71 and within a couple of minutes had internet access, a USA based phone number, and could call back home for free.  Very nice indeed.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Deal. Better than Metro",
      "date": "Reviewed in the United States on October 16, 2023",
      "body": "I purchased Ultra Mobile for my kids’ phones. It’s cheap, the service is good, bill pay is easy. I had so many unlocked phones laying around and didn’t want to get an expensive service. (BTW this sim works in T-Mobile phones if y’all are tired of paying them high bills 👀)",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the product",
      "date": "Reviewed in the United States on June 11, 2024",
      "body": "I liked this product, it’s so easy to set up and takes less then a couple minutes to set up."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped working in a day",
      "date": "Reviewed in the United States on March 5, 2024",
      "body": "I tried using it in Mexico, specifically in Merida. l activated it beforehand in the US and I assume when activating and putting the postal code I need to put the Mexican postal code? That was unclear. It worked fine for a day and it stopped working so I had to get a different sim. Disappointing and a waste of money."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    no sign up deal with this card",
      "date": "Reviewed in the United States on November 23, 2019",
      "body": "The 5 dollors I payed for this would not go towards the plan I signed up for. Yes it did reveal that its service worked on my phone atleast in SLC and it seem the carrier works in all major cities and along most interstates. If you have never be a member you can get the same amount of months free as you pay for on sign up plan offer valid till the new year but not on this card go straight to website.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of money for use in Italy",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "I found this card virtually useless during my Italy trip.  We enabled international calling on my wife’s phone for $10/day and it was a life saver for calls and mapping.  We decided to try this SIM card in my phone as an alternative, however it rarely if ever worked, even though it validated good for Italy.  If we had to rely on my phone for anything we would have been in big trouble.  Maybe this SIM card would be fine in US, but was worthless in Italy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't beat it for the price",
      "date": "Reviewed in the United States on February 20, 2022",
      "body": "15.00 ultra prepaidWorks great on a plum flip phone. The second day I had a issue with it customer support don't waste anytime troubleshooting .all I had to do was pull it out put it into a unlocked android phone turn it on and turn it off and let it sit for 2 minutes then turn it back on then turn it off and take it out and put it back in the flip phone and it's working great now no issues.. this phone is just a backup emergency phone I might use maybe twice a month if that can't beat it for the price..🤣😂😎😋"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As described -",
      "date": "Reviewed in the United States on April 12, 2022",
      "body": "The service is as described. I had an old Nokia 4G phone that was unlocked and GSM. I bought this to have a phone speciafically for biz texts. I wanted a new number so essentially it was plug and play.The negative is for a lack of step by step instruction in the activation card. I found the way it was laid out confusing at first. Fortunatly the process is forgiving, but if you have an Android phone, like I do, you should troubleshoot like I did before tossing out the card for not working.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the cost",
      "date": "Reviewed in the United States on September 15, 2021",
      "body": "I ordered this SIM for my spouse  for $19 plan and it's been worst the cost for the services that it provides, unlimited text and call within US and outside US calls free for limited countries including India. In some places network coverage is less during travel but in city and towns has good coverage.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Super easy to install and get running",
      "date": "Reviewed in the United States on October 5, 2022",
      "body": "I was making a trip to the US and my Canadian wireless provider would charge me $10 per day to use my phone in the US.  So I decided to try this and was super happy!  A month of service for $19.99!I swapped out my SIM card and put this one in, went to the website, entered in the info I needed to and I was up and running within 10 minutes.I highly recommend this!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Limited coverage",
      "date": "Reviewed in the United States on January 3, 2022",
      "body": "I came to the US from the UAE with a completely unlocked Xiaomi Redmi Note 10 Pro Max. I've had no issues using this phone in other countries, but in the US I could only get 2G data at best. The 4G access was \"forbidden.\" I contacted the Ultra support team a couple of times and they were absolutely fantastic and worked really hard to try to solve the problem. In the end, it was chalked up to Xiaomi being banned (along with other Chinese phone makers) in the US, but I later learned that this ban was removed for Xiaomi. I can't really say what the issue was, but it was annoying and, except for the decent mobile voice network, it was a waste of money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trial kit is a scam",
      "date": "Reviewed in the United States on November 29, 2020",
      "body": "This is the worst product. We bought it and started using the trial pack and since the network was good we wanted to start using the full pack (whose sim they give along with the trial pack). We tried doing it online by a link sent by ultra. however each time we used it to activate the new sim, it said that 'we do not recognise this number' or ' this number doesn't exist'. We tried reaching out to customer care and we have spend literally 2 hours each day for 3 days telling them/ explaining them THEIR product. They kept explaining us to try doing it online inspite of us telling them wat difficulty we faced online. They replied that 'maybe it's too early to activate the full-version kit ... Wait till the last day of your trial'. We did that and still got the same response from another customer care executive. Next call to customer care...we were transferred to atleast 3departments and had to explain our problem atleast to 3different people. AND INSPITE OF ALL OF THESE, MY SIM US NOT ACTIVATED.Tired of all this, I got another sim. So in short... Do not buy this ever",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tmobile only",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "This phone only works with TMobile. TMobile does not have coverage where I ordered it for. Make sure TMobile works before you buy this phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for armature technicians.",
      "date": "Reviewed in the United States on February 12, 2024",
      "body": "Had to take it to a telephone technician who spent half a day transferring data from an existing cell phone service to get my current phone number.  Downside is the service could not be activated because the sim card did not work.  Sending it back for a sim replacement."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great service",
      "date": "Reviewed in the United States on July 22, 2022",
      "body": "My husband and I wanted to stay connected and have data on our annual holiday in the US but didn’t want to have a big roaming bill when we returned home. We decided to try this SIM card and boy was it worth the money. Activation was simple. The service worked flawlessly. Data was fast. I gave 3 stars for Tech support because I didn’t actually need it.  Going forward we will be using this every time we travel.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data can’t be used outside US",
      "date": "Reviewed in the United States on May 13, 2024",
      "body": "I bought this SIM card with 10GB data to use while traveling in Canada. Browsed through some reviews and activated it before I left US. Though I did enough preparation but the first issue encountered was there was no signal when I arrived at Canada. Had to spent one hour trying their methods and ended up contacting their customer service via chat on airport wifi to have this resolved. The second I suddenly lost internet connection and again spent like an hour trying everything and then customer service told me it simply is because the 10GB data they advertised can only be used in US. The description they put on the website was so misleading. “Unlimited international talk, text, and 10GB of 5G,4G LTE Data”. What a scam.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived fast. Works flawlessly.",
      "date": "Reviewed in the United States on December 24, 2019",
      "body": "Arrived quickly worked flawlessly. Bought a phome to replace my Verizon phone that wouldn't hold a charge. The phone I received was GSM only so I decided to order Ultra Mobile GSM sims. They arrived quickly. You get two SIM cards. I used the trail SIM first and then ported my number into the permanent SIM. My trail SIM was still active after porting my number into the permanent one. Service with Ultra so far is pretty decent although txt messages do tend to be delayed when comparison to Verizon but over all I'm satisfied and happy because the price is much cheaper than Verizon.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    n/a",
      "date": "Reviewed in the United States on January 18, 2024",
      "body": "n/a"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked reasonably well (eventually) but caused scam transactions on my credit card",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "The set up was a problem but eventually got it to work via the App (which I didn't want on my phone).  The product works reasonably well.  In trying to extend the subscription via the app on my phone, I somehow got re-routed to a different site.  I cancelled the re-routed transaction and never extended the coverage but the damage was already done.  My credit card was hit by two scam sites....smartyplus.net and shipmentfree.com.  My credit card had to be blocked and the transactions investigated.  It is a headache!!!  Don't use the app for extending your coverage or at best be very careful!!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hard to Get Customer Service",
      "date": "Reviewed in the United States on August 18, 2024",
      "body": "Confusing on what is actually included. Reached out to customer service to get clarity before traveling and could not reach anyone despite multiple attempts. While traveling I reached out again and couldn’t get anyone. While stuck my data roaming ran out and I couldn’t load more minutes. Called customer service and they said they could do it over the phone but they transferred me then the message said there was an error and hung up on me. So unhelpful and frustrating. Purchased card for me and my son and my son is having trouble using his. Would not purchase this again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No funcionó",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "No la pude utilizar, me salía error."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not good",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "To activate the sim card is time consuming.Ultra mobile is a joke.do not waste your money,is just junk."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't work for me",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I bought this for a trip to Peru. It did not work there.  To be fair, I didn't read the description as thoroughly as I thought.  It says it would work in Peru, but only for calls.  I ended up buying another Sim card one I got to Peru.Setting up the card was an absolute brain killer. The website is glitchy and you have to continually restart the process.  Definitely would not recommend.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to an active the physical sim ....",
      "date": "Reviewed in the United States on April 21, 2024",
      "body": "Great and very easy to get an active by myself from Ultramobile/active . 👍👍👍",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It simply works.",
      "date": "Reviewed in the United States on November 25, 2023",
      "body": "Activation is quick and easy. Website UI, account creation and management is clear and simple. Reliable network, straight forward pricing.  $19 value for $13 - what's not to like?"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t bother",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Because Amazon suggested this bundle I assumed that it was needed. It is not necessary. It just really confused the set up of the phone we bought and led to a couple of hours of unnecessary frustration before my son realized that he had not needed it in the first place. What a waste of money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective product and Ultra’s bad service",
      "date": "Reviewed in the United States on March 2, 2023",
      "body": "I received two purple SIM cards, they have a ICCID on its back. when I tried to activate the first card, I was asked to enter an 11-digit number which wasn’t shown on the card. Then I chatted with Ultra support agent the first day who promised the problem would be solved in hours. But it didn’t. The next morning, another support agent said I need to give their tech team another 24 hours. 24 hours passed, and I was told to give them another 24 hours…I contacted them again the other morning, chatted with them for hours, finally, I was told that I had to return the product to Amazon and get a SIM card on their website with a $15 plan… it’s a waste of time and I don’t have the intention of buying their products. Defective product and bad service!But Amazon provides a good service for returning it and getting a refund.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pain to transfer a number",
      "date": "Reviewed in the United States on January 9, 2022",
      "body": "It was a nightmare to transfer my existing phone number. We had to reach customer care several times and it took over 30 hours to get the new sim activated. Not recommended if you are looking for something quick and easy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data plan doesn’t work in China",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Was in Beijing and Shanghai for 2 weeks. Very disappointed that the 30 day 10GB of data purchased for this card didn’t work in China. Had to revert to my Verizon by the day plan. Major disappointment."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Compatible",
      "date": "Reviewed in the United States on December 5, 2022",
      "body": "Item not compatible with Samsung galaxy A13",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Included Data is not international",
      "date": "Reviewed in the United States on November 29, 2023",
      "body": "It states \"Ultra Mobile Prepaid Phone Plan with Unlimited International Talk, Text and 3GB of ... Data\" but the data is not international.  I had to purchase more services to make this work with data.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Utter crap",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "I was sent this with a cell home purchase in a pair suggested by Amazon.  This would not work with the phone.  I requested return but got replacement instead I then returned both cards and got No Refund!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on December 18, 2022",
      "body": "Not a bad purchase"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY!",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "DO NOT BUY!As soon as I crossed the ocean and landed in Europe this card stopped working as a phone and as an internet. This put me in a very difficult situation. I was very upset.If you do not want to have problems do not buy this card!It is better to pay your provider or buy a card at the place of arrival",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Service stopped two days into use",
      "date": "Reviewed in the United States on July 16, 2024",
      "body": "I would not recommend this card. I went to Norway and changed out my SIM card. I activated my service for 30 days once I got there. I had great service for about 24hrs and then nothing. The service just quit. I would have full bars but the cellular data didn’t work.  I calling for customer support and the call wouldn’t go through. I will not be buying this card again when I travel."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Limited verification option",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "Be careful in buying this plan.If you need access to the App and you make an error; the only means of verification is text message. If you are outside the US you may not be able to access your account at all. I also tried the chatbox to resolve the issue.The Customer Service chatbox is frustrating. I have to be calling my bank to stop the monthly payments."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on December 30, 2023",
      "body": "I had never heard of this service before but it is great and easy to set up"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    easy setup",
      "date": "Reviewed in the United States on February 9, 2024",
      "body": "every easy to set up and cannot beat the price! Call quality is good as well.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Absolute waste of money, do not buy!",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "I should have trusted the reviews. This card doesn’t activate easily like the instructions lead you to believe. You have to call the frustrating helpline which is usually down for hours. The after giving them all your info, it turns out that the card doesn’t come preloaded with the first months balance which have already paid amazon. So they expect you to pay it again, or the card won’t work. I had to talk to amazon to get a refund. NEVER AGAIN.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with older Samsung phone",
      "date": "Reviewed in the United States on June 26, 2024",
      "body": "Amazon seller description indicated this SIM card would work with my Samsung Galaxy S9 for use in Canada, Mexico, and the US.  After hours of \"troubleshooting\" with Ultra Mobile's support team, they said the phone will not work in Canada.  This has left me stranded in Canada without a phone and no options.This could have been avoided if UltraMobile would have been honest about compatibility with phones and networks."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappounted",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "This Sims card was advertised with the jitterbug phone and it doesn't fit this phone, I can't turn this phone on at all with this card. I'm not sure why amazon would advertise the Sims card with the phone I bought since it won't work with it! I've wasted $15 unless amazon will take it back."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Illegal advertising by seller. Terrible Service",
      "date": "Reviewed in the United States on February 20, 2024",
      "body": "Illegal advertising by seller. Package front and back both state: \"Unlimited Talk, Text, & Data\". But on the front bottom, it states, \"3G Data\", and the listing details state: \"3GB of High-Speed 5G 4G LTE Data.\" How can it be limited to 3G of data if it clearly states \"unlimited data\" on the package front and back. I contacted the seller, Ultra Mobile\" about this and asked the same question. They referred me to Amazon to complain to you, if I received the wrong SIM card. However, I was starting to message back to them in the chat that I did not get the wrong SIM, I got the one I ordered, but the seller has put misleading info on the package. Before I could even send that reply message, the chat rep from Ultra Mobile ended the chat as soon as they sent me the message saying to contact Amazon about it.Set up was very complicated, took a very long time to try and get this all straightened out. The activation instructions said I have to change the settings for Access Point Names, which was a long process. But it also seemed as though the Access Point Names were automatically configured during activation.I am unable to access voicemail unless I reset network settings to factory default settings on my phone, which I don't want to do, since I am only trying out this SIM on my phone, and plan to revert back to my Tracfone network. If I reset network settings, all data, bluetooth, & wifi settings will be deleted. That would mean that when I reinstall the Tracfone card, I will not be able to access my voicemail on that network, plus I won't be able to log into my wifi or use my previously paired bluetooth devices with my phone.When the phone is initially set up, and I call my home phone from the mobile using the SIM card, it comes up as \"April Bailey\", which is not me. There is no way to resolve or change this. Ultra Mobile said they would escalate that, but I dont know if they will fix it.I have had two chats with their customer service, which both went about 1 hour. The chat reps seem to be chatting with multiple people at the same time, so their responses usually take a very long time & they never admit to chatting with multiple people simultaneously when asked directly about it. They claim they are checking resources or having system issues. Most of the chat time is spent waiting for them to respond. When I asked why the physical packaging says \"unlimited data\" on the front and back, while the plan says \"3GB of data\", they could not explain that and told me to contact Amazon, then they dumped me off the chat without warning, which was so rude and unprofessional. Both chat experiences were bad.I did try calling one of the 80 countries and enjoyed the free call and text on that. But I would not recommend this company due to the above issues. I also reported them to Amazon, who said they would escalate the issue of false advertising.",
      "helpfulVotes": 56
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ultra Mobile should make if clear that the 3 GB all over their product is only good in the US.",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "The \"3GB\"  of data is not good in Mexico which is why I got it. After a bunch of research and hunting and pecking on the Ultra Mobile site, I found our you could add 5GB of data in Mexico for $5 additional using the Go Roam Mexico Data Pass. Ultra Mobile should make if clear that the 3 GB all over their product is only good in the US."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everyone please avoid using Ultra Mobile.",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "We bought 2 1-month 3G plan SIM cards for our Costa Rica trip. They worked well the first 2 days, however they became totally not functional in a sudden since the 3rd day being activated. We are very sure it's not due to the data running out because each of us only consume 300-400mb the first 2 days. The SIM cards can sometimes detect the local signal, however, no data can be used anyway. It is frustrating to meet this kind of the situation during the trip oversea.Their customer service is useless. The chat window on the official website is a chatbot and not helpful at all. Once you asked to talk to the real person, the window will be gone.They also provided an US number to be reached. However, the SIM card is useless, how can we make the international call?",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Suitable",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Not the best service at my location. Mostly happy with the easy setup. Emails about renewing can get annoying. I only need the service for a month or less for a trip, nothing more ... Anyways it suits my needs",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    T-mobile coverage is very spotty",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "The coverage by T-Mobile focuses on busy areas -- they neglect many residential areas and provide only voice and slow data service. \"Main street\" gets 5 bars but moving away 300m (1/4mi), reception drops down to 1 bar !! And data-speed drops significantly. This doesn't happen in the middle of nowhere -- this happens within 5mi form Apple HQ in Cupertino !!In other parts of the US, I have driven 4+ hours without getting any T-mobile coverage at all. Not even in the hotel in a small town. Local residents told me, I should have used A or V service instead.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    early thoughts....",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "price good, however this number has had tons of notifications and spam calls from previous customer. I've spent everyday black listing/blocking 8+ different callers and notifications from previous persons bank notifications! I unsubscribed to everything immediately when I realized these would be ongoing if I didn't cancel them somehow.set up wasn't difficult.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish I knew",
      "date": "Reviewed in the United States on February 14, 2024",
      "body": "Although I love the fact its $60 for 60gb of data here are things I wish I knew.1. create an account right away and update your email because if your phone gets stolen or lost you cannot retrieve it and your only option is to get a new sim and phone number.2. Never activate it online as Ultra mobile will break every neve in your body and only charge you money for a phone plan you already paid for. I already lost money on this service, and had it not been for the 60 bucks for 60 gigs I would have told them to get lost. Instead activate a new sim through the phone.3. If you are converting a sim to esim make sure your contact information is up to date or else customer service will just waste your time and tell you there is nothing you can but get a new number and sim.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't leave home without first thoroughly checking functionality!",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "I bought this SIM card for travel while in Banff, Canada. I thought I had verified mobile data while in the States, but maybe I had Wi-Fi on and didn't know it. So I thought mobile data was working. Then in Canada, it wasn't -- ever, no matter how may times I spoke and chatted with Ultramobile technical support who had me reset, reboot and call my previous carrier for a three-way technical support call to get the phone unlocked which Ultramobile first said it was, but then agreed that it wasn't. I wasted HOURS of my vacation on many support chats and calls. Finally, back in the States, I called Ultramobile support again and they had me turn off mobile data and do a network reset under Settings -> General Management -> Reset -> Reset newtork settings -> reboot and it worked! But no longer need mobile data since I am no longer in Canada! Ugh.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Signal",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "They must improve access to the application, but even more importantly they must improve the signal offered, it said that there was a signal available in Italy and since I arrived I have not had a signal data mobile, otherwise they have good plans but the details of each plan are not clear enough.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wifi required for activation",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "The odd thing about this simm card is that you need wifi for activation, which somewhat defeats the purpose of getting it.  Even after going through activation, the signal for mobile data is not uniform across the US.  The data speed and network is not that reliable.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had to return",
      "date": "Reviewed in the United States on May 26, 2024",
      "body": "The phone I had purchased this item for was an out dated 2G model.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okay",
      "date": "Reviewed in the United States on May 12, 2024",
      "body": "Connectivity.. phone calls drop often and internet is not strong. Calling to USA calls drop a lot.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Harassment Calls Ruin It All",
      "date": "Reviewed in the United States on May 14, 2023",
      "body": "I had a terrible experience with a phone card recently, not because of the carrier but because of the constant spam calls. The number associated with the card receives more than 20 calls a day from Jamaica and New York, and it seems to be linked to multiple accounts. It's so bad that I'm scared to use it.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Insufficient",
      "date": "Reviewed in the United States on January 21, 2024",
      "body": "I purchased this SIM for a month abroad in France. I followed the set up instructions, which were pretty vague. I chose the option to have a different number, rather than keep my regular one. It gave me a U.S. formatted number, and when I arrived in France, I could not make any calls to French or American numbers. I also purchased 15 GB of data, which I have been unable to activate despite following the instructions in the app. I do have \"data roaming\" on, but that hasn't fixed it.In order to access customer service, you have to place a call. I cannot place calls, so I cannot reach customer service. I can send and receive text messages, but only when I am connected to WiFi. I can receive calls, but cannot place them. I asked my Professor for help (since he is regularly abroad) but he couldn't fix it either.I've gotten by, but it's far from ideal and kind of scary not to have reliable contact or internet access in a foreign city. I don't recommend this SIM.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You get what you pay for",
      "date": "Reviewed in the United States on January 2, 2024",
      "body": "Coverage is spotty in some locations and tech support is close-to-clueless.Pay a little ore and get a sim card from a company with good support.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No SIM card is the message",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Trying to activate phone but it keeps saying that there is no SIM card and it has been installed."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy a different card",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Best advice is not to buy. It's painful to get it activated. Very disappointing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Difficult to transfer your own phone number",
      "date": "Reviewed in the United States on July 26, 2022",
      "body": "If you want to activate it with your own phone you'll need to get information from your current carrier. I was overseas and couldn't do this very easily. Was hoping to transfer my own number but it was too much hassle. This is the reason for 3 star rating. Otherwise, easy to activate and had immediate coverage.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped working in a day",
      "date": "Reviewed in the United States on March 5, 2024",
      "body": "I tried using it in Mexico, specifically in Merida. l activated it beforehand in the US and I assume when activating and putting the postal code I need to put the Mexican postal code? That was unclear. It worked fine for a day and it stopped working so I had to get a different sim. Disappointing and a waste of money."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    no sign up deal with this card",
      "date": "Reviewed in the United States on November 23, 2019",
      "body": "The 5 dollors I payed for this would not go towards the plan I signed up for. Yes it did reveal that its service worked on my phone atleast in SLC and it seem the carrier works in all major cities and along most interstates. If you have never be a member you can get the same amount of months free as you pay for on sign up plan offer valid till the new year but not on this card go straight to website.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of money for use in Italy",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "I found this card virtually useless during my Italy trip.  We enabled international calling on my wife’s phone for $10/day and it was a life saver for calls and mapping.  We decided to try this SIM card in my phone as an alternative, however it rarely if ever worked, even though it validated good for Italy.  If we had to rely on my phone for anything we would have been in big trouble.  Maybe this SIM card would be fine in US, but was worthless in Italy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Limited coverage",
      "date": "Reviewed in the United States on January 3, 2022",
      "body": "I came to the US from the UAE with a completely unlocked Xiaomi Redmi Note 10 Pro Max. I've had no issues using this phone in other countries, but in the US I could only get 2G data at best. The 4G access was \"forbidden.\" I contacted the Ultra support team a couple of times and they were absolutely fantastic and worked really hard to try to solve the problem. In the end, it was chalked up to Xiaomi being banned (along with other Chinese phone makers) in the US, but I later learned that this ban was removed for Xiaomi. I can't really say what the issue was, but it was annoying and, except for the decent mobile voice network, it was a waste of money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trial kit is a scam",
      "date": "Reviewed in the United States on November 29, 2020",
      "body": "This is the worst product. We bought it and started using the trial pack and since the network was good we wanted to start using the full pack (whose sim they give along with the trial pack). We tried doing it online by a link sent by ultra. however each time we used it to activate the new sim, it said that 'we do not recognise this number' or ' this number doesn't exist'. We tried reaching out to customer care and we have spend literally 2 hours each day for 3 days telling them/ explaining them THEIR product. They kept explaining us to try doing it online inspite of us telling them wat difficulty we faced online. They replied that 'maybe it's too early to activate the full-version kit ... Wait till the last day of your trial'. We did that and still got the same response from another customer care executive. Next call to customer care...we were transferred to atleast 3departments and had to explain our problem atleast to 3different people. AND INSPITE OF ALL OF THESE, MY SIM US NOT ACTIVATED.Tired of all this, I got another sim. So in short... Do not buy this ever",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tmobile only",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "This phone only works with TMobile. TMobile does not have coverage where I ordered it for. Make sure TMobile works before you buy this phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for armature technicians.",
      "date": "Reviewed in the United States on February 12, 2024",
      "body": "Had to take it to a telephone technician who spent half a day transferring data from an existing cell phone service to get my current phone number.  Downside is the service could not be activated because the sim card did not work.  Sending it back for a sim replacement."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data can’t be used outside US",
      "date": "Reviewed in the United States on May 13, 2024",
      "body": "I bought this SIM card with 10GB data to use while traveling in Canada. Browsed through some reviews and activated it before I left US. Though I did enough preparation but the first issue encountered was there was no signal when I arrived at Canada. Had to spent one hour trying their methods and ended up contacting their customer service via chat on airport wifi to have this resolved. The second I suddenly lost internet connection and again spent like an hour trying everything and then customer service told me it simply is because the 10GB data they advertised can only be used in US. The description they put on the website was so misleading. “Unlimited international talk, text, and 10GB of 5G,4G LTE Data”. What a scam.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    n/a",
      "date": "Reviewed in the United States on January 18, 2024",
      "body": "n/a"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked reasonably well (eventually) but caused scam transactions on my credit card",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "The set up was a problem but eventually got it to work via the App (which I didn't want on my phone).  The product works reasonably well.  In trying to extend the subscription via the app on my phone, I somehow got re-routed to a different site.  I cancelled the re-routed transaction and never extended the coverage but the damage was already done.  My credit card was hit by two scam sites....smartyplus.net and shipmentfree.com.  My credit card had to be blocked and the transactions investigated.  It is a headache!!!  Don't use the app for extending your coverage or at best be very careful!!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hard to Get Customer Service",
      "date": "Reviewed in the United States on August 18, 2024",
      "body": "Confusing on what is actually included. Reached out to customer service to get clarity before traveling and could not reach anyone despite multiple attempts. While traveling I reached out again and couldn’t get anyone. While stuck my data roaming ran out and I couldn’t load more minutes. Called customer service and they said they could do it over the phone but they transferred me then the message said there was an error and hung up on me. So unhelpful and frustrating. Purchased card for me and my son and my son is having trouble using his. Would not purchase this again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No funcionó",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "No la pude utilizar, me salía error."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not good",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "To activate the sim card is time consuming.Ultra mobile is a joke.do not waste your money,is just junk."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't work for me",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I bought this for a trip to Peru. It did not work there.  To be fair, I didn't read the description as thoroughly as I thought.  It says it would work in Peru, but only for calls.  I ended up buying another Sim card one I got to Peru.Setting up the card was an absolute brain killer. The website is glitchy and you have to continually restart the process.  Definitely would not recommend.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t bother",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Because Amazon suggested this bundle I assumed that it was needed. It is not necessary. It just really confused the set up of the phone we bought and led to a couple of hours of unnecessary frustration before my son realized that he had not needed it in the first place. What a waste of money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective product and Ultra’s bad service",
      "date": "Reviewed in the United States on March 2, 2023",
      "body": "I received two purple SIM cards, they have a ICCID on its back. when I tried to activate the first card, I was asked to enter an 11-digit number which wasn’t shown on the card. Then I chatted with Ultra support agent the first day who promised the problem would be solved in hours. But it didn’t. The next morning, another support agent said I need to give their tech team another 24 hours. 24 hours passed, and I was told to give them another 24 hours…I contacted them again the other morning, chatted with them for hours, finally, I was told that I had to return the product to Amazon and get a SIM card on their website with a $15 plan… it’s a waste of time and I don’t have the intention of buying their products. Defective product and bad service!But Amazon provides a good service for returning it and getting a refund.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pain to transfer a number",
      "date": "Reviewed in the United States on January 9, 2022",
      "body": "It was a nightmare to transfer my existing phone number. We had to reach customer care several times and it took over 30 hours to get the new sim activated. Not recommended if you are looking for something quick and easy.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data plan doesn’t work in China",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "Was in Beijing and Shanghai for 2 weeks. Very disappointed that the 30 day 10GB of data purchased for this card didn’t work in China. Had to revert to my Verizon by the day plan. Major disappointment."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Included Data is not international",
      "date": "Reviewed in the United States on November 29, 2023",
      "body": "It states \"Ultra Mobile Prepaid Phone Plan with Unlimited International Talk, Text and 3GB of ... Data\" but the data is not international.  I had to purchase more services to make this work with data.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Utter crap",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "I was sent this with a cell home purchase in a pair suggested by Amazon.  This would not work with the phone.  I requested return but got replacement instead I then returned both cards and got No Refund!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY!",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "DO NOT BUY!As soon as I crossed the ocean and landed in Europe this card stopped working as a phone and as an internet. This put me in a very difficult situation. I was very upset.If you do not want to have problems do not buy this card!It is better to pay your provider or buy a card at the place of arrival",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Service stopped two days into use",
      "date": "Reviewed in the United States on July 16, 2024",
      "body": "I would not recommend this card. I went to Norway and changed out my SIM card. I activated my service for 30 days once I got there. I had great service for about 24hrs and then nothing. The service just quit. I would have full bars but the cellular data didn’t work.  I calling for customer support and the call wouldn’t go through. I will not be buying this card again when I travel."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Limited verification option",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "Be careful in buying this plan.If you need access to the App and you make an error; the only means of verification is text message. If you are outside the US you may not be able to access your account at all. I also tried the chatbox to resolve the issue.The Customer Service chatbox is frustrating. I have to be calling my bank to stop the monthly payments."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Absolute waste of money, do not buy!",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "I should have trusted the reviews. This card doesn’t activate easily like the instructions lead you to believe. You have to call the frustrating helpline which is usually down for hours. The after giving them all your info, it turns out that the card doesn’t come preloaded with the first months balance which have already paid amazon. So they expect you to pay it again, or the card won’t work. I had to talk to amazon to get a refund. NEVER AGAIN.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with older Samsung phone",
      "date": "Reviewed in the United States on June 26, 2024",
      "body": "Amazon seller description indicated this SIM card would work with my Samsung Galaxy S9 for use in Canada, Mexico, and the US.  After hours of \"troubleshooting\" with Ultra Mobile's support team, they said the phone will not work in Canada.  This has left me stranded in Canada without a phone and no options.This could have been avoided if UltraMobile would have been honest about compatibility with phones and networks."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappounted",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "This Sims card was advertised with the jitterbug phone and it doesn't fit this phone, I can't turn this phone on at all with this card. I'm not sure why amazon would advertise the Sims card with the phone I bought since it won't work with it! I've wasted $15 unless amazon will take it back."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Ultra Mobile runaround!",
      "date": "Reviewed in the United States on December 13, 2023",
      "body": "I wanted a mobile plan that was less expensive! I read their info and it seemed just what I needed!  When the package arrived I immediately followed the instructions! Unfortunately it isn’t working! I can’t dial out or receive call’s and messages! I have made contact with the company and they keep asking for information! I complied! This is the last excuse because they want me to take a picture of the SIM! If this doesn’t work I want to return it to Amazon for a refund! Ultra has refused to refund my money!!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Only trial sims",
      "date": "Reviewed in the United States on March 6, 2023",
      "body": "You will need to purchase another sim if you buy this. It was two trial sims (for me) and customer service said I’d need to buy another one to get service. This was a waste of money.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Timeline for Usage",
      "date": "Reviewed in the United States on December 15, 2023",
      "body": "You have to use it within a certain time frame. Doesn't matter if you haven't used one minute. It expires quickly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do NOT buy for Alaska - no data at all",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "I bought this card to use on an Alaskan cruise. The data worked in Michigan and Minnesota on the way there, but when we got to Alaska we had no data anywhere - Anchorage, Seward, Icy Strait Point, Juneau, Skagway, Ketchikan. Everyone around us had data, so it wasn't a signal issue, the card would not work in Alaska.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't work",
      "date": "Reviewed in the United States on August 13, 2023",
      "body": "I ordered this SIM Card to use while I was in Canada for 2 weeks.  i went through the whole process of keeping my number and calling my phone carrier to have my phone number unlocked.  Well, it didn't work.  I didn't have internet and was unable to call on my phone.  It made it a little difficult because a lot of our tickets were on my phone.  I had to find Wifi to pull up the tickets and then hurry and have them scan it. Very inconvenient",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn't use",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "Couldn't use , phone had no sim port returned bc of that"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice company, but will not work with older phones not Super-LTE compatible",
      "date": "Reviewed in the United States on January 4, 2022",
      "body": "It's a nice company with good customer service and good plans. However, after installing the SIM card in my phone and talking with a rep when it failed to work, I learned that my phone, being older and not super-LTE compatible, would not work with their network. So make sure that your phone is compatible with that type of network before getting the SIM. I went with another provider, also on the T-Mobile network, but which offers both Super-LTE and regular GSM LTE. I cannot say I should have done my homework because I did not see that info prior to my purchase, or by looking up the website after the rep talked with me.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Never worked",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "Got this SIM card for a familiar visiting from abroad and unfortunately it never worked!! So annoying. We called the customer service and they couldn’t help to make it work. So I wouldn’t recommend this product."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Only get LTE internet",
      "date": "Reviewed in the United States on December 24, 2021",
      "body": "I bought this to have Internet during Xmas trip to California.Only got LTE internet. The speed was too slow.The web pages took several minutes to load.I called the Tech service and they told me it was 2 T-Mobile internet towers that went down and didn’t gave any estimate for solving the issue. After complaining they offered me $5 of credit… Come on :-/Not good for internet!I’ll update this review when they solve the problem.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work as it claims",
      "date": "Reviewed in the United States on May 16, 2023",
      "body": "If there was a 0 star rating, I would give it that instead of a 1 star.  I bought two calling cards to use when we were in Bermuda for a week.  Tech support said it could not be activated until 3 days into our trip.  I waited patiently and it was never activated.  I had no service all week until I got home and our regular mobile company reactivated my phone number. Stay away from this company and save yourself some aggravation."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on November 24, 2021",
      "body": "Decent, had a few times data wouldnt work but overall good. Fast trip to US did the job",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This does not work",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "I purchased a $19 per month with 3G of data. On activation, the plan gave 250mb of data. When I contacted Ultra customer service, I was told that Amazon sent the incorrect sim card and for an additional fee, I could access the 3G monthly plan. I will never purchase another card from Ultra again!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "My daughter took a trip to Ireland. We purchased to save on call costs. This was a waste of time and money. It did not load/link up to towers and did not work at all."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not work in the Dominican Republic -- Don't purchase",
      "date": "Reviewed in the United States on May 13, 2024",
      "body": "Activated in the US and look two days to start working in DR.  By that time most of the 3GB was gone and the SIM wasn't even enabled.  I've purchased dozens of SIMs in various countries over the years, and I would not recommend or purchase again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Signal",
      "date": "Reviewed in the United States on October 11, 2023",
      "body": "No signal in most areas in New York/New Jersey and data speed sucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn’t work",
      "date": "Reviewed in the United States on March 13, 2022",
      "body": "Didn’t work with my unlocked phone « Blu »",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data worked fine but could not make or receive calls most of the time.",
      "date": "Reviewed in the United States on January 1, 2024",
      "body": "Took it to Branson, Mo. and the data worked fine but I could not make or receive phone calls for the whole week I was there. Tech support was nice enough and tried to help but was not able to. Just said to remove the sim, wait 30 minutes, and put it back in. However, that didn't solve the issue so I gave up trying."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This was a scam.",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "I bought 2 sim of 5GB at $24 and 1 sim of 3GB at $14(discount applies only once)Supposed to be 5GB sim had only 250MB which used up in 1 day.3GB sim is still working. I got scammed and  angry."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective",
      "date": "Reviewed in the United States on June 23, 2023",
      "body": "The SIM card that I received was defective. Wasted hours on my vacation trying to set it up myself and calling the help line multiple times before they came to the conclusion that it was defective and I should get a refund. Not worth your time, especially if you are visiting the US and only need it for a short time. I would recommend any other SIM card."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not exactly Unlimited International Talk",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "On my third call I received an automated voice message that I was out of international time. It seemed like a good idea to get a sim for an international trip. This is not the sim to purchase if you plan to make calls."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    6G data used up FAST!",
      "date": "Reviewed in the United States on June 12, 2023",
      "body": "Got this plan for visitor to use in US. I dont know how they calculate the usage of data line, but all 6G used up in a few days. Talked to customer service at 611, they cannot tell me what time or date the usage of the data line. We still have 20 more days left for the plan, but it is useless without any data line."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY!! ULTRA WASTE OF TIME AND MONEY - NO CUSTOMER SERVICE",
      "date": "Reviewed in the United States on October 25, 2022",
      "body": "Complete and total waste of time. Took three days to transfer my phone number and then no service - Invalid SIM card from Ultra.  So Ultra has my phone number, but I have no service.  Ultra only has customer service by phone (no phone service), no online chat service available. Service states it is activated, but no service.  Moreover, activation started two days before anything happened. In other words, a 30 day servie is really 28 days or less. AVOID!!  Customer service is like all these pre-paid phone services, non-existent.  They just do not care.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    T-Mobile Service with Telus CAN-US Plan is HORRIBLE",
      "date": "Reviewed in the United States on November 13, 2023",
      "body": "Find a way to test Cellular vs. Network compatibility BEFORE purchasing !! Also, it's a T-Mobile Network and T-Mobile Service with Telus CAN-US Plan is HORRIBLE. I had a Telus-T-Mobile network problem, now I have a duplicate problem with this SIM card. The network comes and goes as it pleases, and absolutly no Data works.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not work no customer service",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Lost all the $and had to buy one overseas"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trial sim card comes with no activation code",
      "date": "Reviewed in the United States on March 18, 2023",
      "body": "Go to their website to activate the trial sim card. It asked for activation code (ACT code). However, there is no such number on neither of the two sim cards. I should read reviews before purchase. A couple of reviewers reported the same problem recently. I also called them technical report and after hold on for quite a while and I was told to return to Amazon. What a waste of time!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Neither card will activate",
      "date": "Reviewed in the United States on May 28, 2022",
      "body": "After confirming compatibility with my phone it asks for the Act code a second time and the web page just hangs.  Their customer service tried with the same hung page result.  They then entered a ticket with tech support stating it will take 24-48 hours to get back.  Waste of time and money, avoid free trial orange cards.  We have used the purple cards in the past and are still using Ultra mobile services on those SIM cards.Wondering if amazon is taking used card codes back after the $5 is claimed and ignorantly reshipping as new....?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid at all costs",
      "date": "Reviewed in the United States on October 14, 2022",
      "body": "Complete scam. Do not buy! I thought I'd take a chance, even after the numerous bad reviews. Would not receive calls or SMS 85% of time, even after multiple hard resets and removal/reinstallation. 2GB of 5g is an outright lie. Cut off after approx 500MB and then unusable. Had family try to call me right next to them for most of a week and my phone would not ring 9/10 times. Avoid at all costs!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid this brand as fast as you can",
      "date": "Reviewed in the United States on August 19, 2022",
      "body": "I activated the SIM card pretty smoothly but the card itself is BROKEN! I tried it on five different phones (apple and android) and my iPad, they both couldn’t detect the SIM card. And the ultra mobile customer service told me there is nothing they can do. It caused me A LOT LOT LOT of TROUBLE after I landed another country.TBH, I want to leave negative stars.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Eso no esta bien",
      "date": "Reviewed in the United States on July 8, 2024",
      "body": "Es targeta no se puede activar.  Llamo al número al cliente quw viene ahí y cae la llamada a t-mobile y ellos no activan eso"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    T-Mobile-- bad news",
      "date": "Reviewed in the United States on May 27, 2024",
      "body": "While trying to get a #, T-mobile tried to take another $47.00 off my bank card. The bank blocked it just in time. Needless to say, my phone is still worthless without a #. Screw it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be Careful and check compatibility before buying this product..!",
      "date": "Reviewed in the United States on December 11, 2021",
      "body": "As a frequent customer on Amazon, my advice to Amazon is to be a little more careful when allowing these cheap overnight small vendors with bad quality products..!  Ultra Mobile has my device listed as compatible, but their SIM card still does not work. I am a network engineer. If I cannot make it work, most like it is very difficult for the average non-technical customer to make it work.. this SIM card may work on some devices, but there is zero technical support and honestly, I think it’s a “cheap piece of crap..” !",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I can't activate this sim card on my phone",
      "date": "Reviewed in the United States on March 13, 2024",
      "body": "I can't activate this sim card on my phone, I dialed the service phone number and have to wait for a long time so I hand up. Bought MINT sim card later and immediately got auto activated."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Prepaid card",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "Didn't work with phone money waisted"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    junk",
      "date": "Reviewed in the United States on October 17, 2024",
      "body": "dose not work with artfone, amazon won't do a refund, i hate amason."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No good support for the cards",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "No help from the company just hang ups"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't activate multiple SIM cards. Louse service. DON'T BUY",
      "date": "Reviewed in the United States on June 7, 2020",
      "body": "I've tried to resolve this with Ultra Mobile several times. Each time they give a different answer. None of them work.You can activate these as a 7 day trial easily enough, but their system does not allow you to move to a regular plan or active the second SIM card.They tell you to use the website. Then they say to use the website from your phone. Then they tell you to use the app. All of these result in the same error message - something went wrong.Save yourself the frustration. Get something else.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheqp",
      "date": "Reviewed in the United States on March 9, 2021",
      "body": "It doesn't work  on all GSM phones",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not working",
      "date": "Reviewed in the United States on August 16, 2024",
      "body": "It only works FaceTime when there is wifi. Artemps to call customer service but they don’t answer."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    this will charge every month. Not a one time charge",
      "date": "Reviewed in the United States on April 4, 2024",
      "body": "Be aware. While this states its for one month, I was charged for several months without a notice. When called, they refuse to refund, even though I never used the card again after the month."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overpriced",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "Overpriced"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work, can not set time",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "Does not work can not set time."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad",
      "date": "Reviewed in the United States on April 26, 2023",
      "body": "It worked for 2 hours then it don’t work no more"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for current ultramobile customers who want to keep their number",
      "date": "Reviewed in the United States on April 24, 2021",
      "body": "Doesn't work if you're trying to keep your current number and you are already an ultramobile customer. Instead just call the customer service and they will send you a new sim card for FREE.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of $$",
      "date": "Reviewed in the United States on December 6, 2023",
      "body": "Phone would NOT recognize SIM card. Gave me a message that phone is locked, phone is Not locked. Just a piece of junk! Customer service department was not helpful and insisted my phone was locked."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No fue util y no practico.",
      "date": "Reviewed in the United States on May 4, 2023",
      "body": "No se pudo instalar."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can’t use overseas",
      "date": "Reviewed in the United States on October 23, 2022",
      "body": "Can’t use overseas should state that in bold print!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would be great if it worked",
      "date": "Reviewed in the United States on March 28, 2023",
      "body": "The installation instructions do not make sense. I went on to the website to activate my trial and none of the cards I bought have a 11 digit activation code. Tech support could not help and could not activate it. Waste of money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy malo",
      "date": "Reviewed in the United States on June 8, 2023",
      "body": "Nunca funcionó"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SIM card did not work",
      "date": "Reviewed in the United States on August 23, 2023",
      "body": "Bought this and the SIM card did not work and customer service was not helpful in solving my issue. Will not purchase from them again. I have used the same SIM card before with the same phone but it wasn't working this time"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlimited calling",
      "date": "Reviewed in the United States on March 23, 2022",
      "body": "I was on the phone with my mother in Russia for 30 min when I was disconnected with a notice \"You do not have enough credit to continue this call\".It is advertised as unlimited texts and calls to over 70 countries, Russia included . Scam.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "It sucks it keeps double charging me. Thought here and on the site for the card. Total scam"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not work",
      "date": "Reviewed in the United States on August 27, 2024",
      "body": "I am traveling to Europe and this sim card does not work"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad data pack",
      "date": "Reviewed in the United States on March 28, 2024",
      "body": "Data pack isn't good. It doesn't allow you to use internet when u r at some places coz it doesn't catch network. Better get mint mobile or other network"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No unlimited 4g/LTE as promised",
      "date": "Reviewed in the United States on December 14, 2021",
      "body": "This card advertised 2gb of 5g internet and Unlimited 4g/lte for a month. I am traveling, and as soon as the 2gb were used, the connection dropped to 0.02mbps! Called customer service, who told me I only bought 2gb and if I needed “real unlimited data” I would have to pay an additional 30 USD, which is more than double the initial amount paid. A Total scam.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Useless phone card for international use",
      "date": "Reviewed in the United States on May 30, 2022",
      "body": "The phone card is advertised for global international use which is not the case. My husband is very frustrated in France with an useless phone card. He will need to purchase another one there that works with his unlocked phone for calls in France",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy 3G and only get 250M?",
      "date": "Reviewed in the United States on March 15, 2024",
      "body": "Just activated a 3G prepaid SIM yesterday and I only got 250M data. And there is not even a tech support to call. So disappointing!"
    }
  ],
  "productDetails": {
    "productTitle": "$24/mo. Ultra Mobile Prepaid Phone Plan with Unlimited Talk, Text and 5GB of 5G • 4G LTE Data (SIM Card Kit)",
    "asin": "B08XBND9N3",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "No Contract 1-Month Plan on the T-Mobile 5G Network",
      "5GB of High-Speed 5G 4G LTE Data",
      "Unlimited Nationwide Talk & Global Text",
      "Unlimited Talk to 90+ International Destinations",
      "Unlimited Talk & Text in Mexico & Canada",
      "Monthly International Call Credit",
      "One-Time International Roaming Credit",
      "Free Mobile Hotspot & Wi-Fi Calling",
      "Bring Your Unlocked Phone SIM Kit"
    ],
    "boughtCount": "100+",
    "boughtPeriod": "in past month",
    "brandInsights": {},
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B08XBND9N3",
    "overviewProductType": "SIM_CARD",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": null,
      "items": []
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$24.00",
    "listPrice": "N/A",
    "savingsPercentage": "N/A",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "Friday, March 21",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}