{
  "asin": "B0CYQCQTN5",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasantly surprised it was brand new, unlocked and undamaged !",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I was surprised to see there was no bubble wrap or shipping paper inside the box so my phone box wouldn't be bouncing around throughout shipping. But luckily the phone was unopened and undamaged.It's a bit smaller than I expected but the screen size doesn't affect my texting at all. Operating software is smooth, picture is crisp and clean; camera is incredible, it came unlocked and all I had to do was put my Boost Mobile sim card from my old phone into this one and download a boost configuration app, so it was really easy switching everything over. Just plugged one phone into another to transfer all my apps and data from my old phone..It fits nicely in my hand and my pockets.. it's not heavy so my pants aren't being weighed down by it.I must say I'm inpressed by this Pixel, I've used the 2xl and the 7 pro and always was impressed. The 8a is worth every penny.  Ppl were complaining about fongr print reader but there's an option in your settings to turn up sensitivity to your screen and specifically your fingerprint reader. But you have facial recognition so really you never will need that fingerprint reader ..But I guess to each their own.I'd suggest buying phone if you're looking to downsize.. but I can see that being a bigggggg turnoff for a lot of customers. The screen I basically 6 in.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value phone",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "I am a pixel 8 user and bought this pixel 8a for my mom. Side by side, the main differences between these phones come out to the pixel 8a's slightly smaller screen, the pixel 8a's slightly larger screen bezels, and the case (which are very negligible when using a protective case).While many reviews and comparisons on the specifics between the pixel 8a's and 8's screens have been done, I can tell you that to my eyes the screen quality looks virtually identical. Same goes for the camera and image quality. I think overall the pixel8's camera+images might look a little cleaner, there are some lighting's conditions where I have found that the pixel8 a's camera out performed my 8's.Ultimately, for me at-least, the biggest difference between the 8a and the 8 that I have noticed is charging speed. My pixel 8 feels like it charges almost ~1.5x-2x the speed of this 8a. Which is really nice when taking advantage of Google's 80% battery capacity limiter. Despite needing to charge my phone a little more often with 80% capacity enabled, I can routinely get ~25% if not more of my phone charged on my 20 min drive to work.Overall, this 8a and 8 have been my favorite phones I have ever purchased. The front facing and rear facing cameras are both incredible and very easy to use. Both were purchased for $400, they offer essentially the best features from flagship smartphones, and are guaranteed 7 years of feature and software updates. Samsung and other brands might offer Android phones with more powerful hardware, but as a former Galaxy user, the overall experience the pixel 8a and 8 offer feel much more premium to me.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price for great phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Very pleased with this buy. Phone is working perfectly and battery life is good."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall good phone with some flaws",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "So, I've been using the 8a for about 6 months. I upgraded from the Pixel 5a due to support for that supposedly ending soon. I saw the 8a on sale so pounced. I'm mostly going to compare the 8a to the 5a. Keep in mind I really liked the 5a.8a vs 5aBattery life : 5a wins (slightly). I'm not sure how they compare on mAh but the 5a kept a charge a little longer. That's not to say the 8a won't last long. It pretty much always gets me through the day and I don't really feel held back by the difference.Screen: 8a wins (slightly). 8a is a little crisper, overall both are very good. Downside to the 8a is the screen size was a hair smaller I believe.Camera: 8a wins solidly. 5a took good pictures. 8a is even better, especially in low light. I also found the 8a AI editing feature to be handy at times.Charging: Mixed bag. 5a had a faster charging speed (although no Turbo charge). But I like having the wireless charging in the 8a which the 5a didn't have. After about 2yrs of 5a use the port was kinda loose. Wireless charging should negate that later problem of the port wearing out.Functional speed: 8a wins. 5a wasn't slow, but 8a is a little snappier.Headphone jack: 5a wins only because the 5a had one, 8a does not have a headphone jack. Most of my headphones/ear buds I use are wireless, but I still use a few wired ones. But you can get an adapter which has worked fine for the 8a.**Fingerprint reader/sensor: 5a wins by a long shot. This is the reason I removed a star. The 5a fingerprint reader on the back of the phone worked right nearly every time (except with moist fingers). The 8a in screen finger reader works more than half the time, but was is far less accurate than the 5a method. To make matters worse, I think the Pixel engineers forgot most people like to put a screen protector on. With a screen protector on the 8a, the fingerprint reader is nearly useless. (I had tried resetting the fingerprint scans to no avail). Maybe this wasn't the engineers' fault. Maybe a sales exec thought a fingerprint sensor on the screen sounded cool so demanded it while the engineers said it needed more work. But I digress.Out of frustration, I had started using the less secure face unlock which does work reasonably well. But the face unlock doesn't work well if you're wearing sunglasses or in dimly lit rooms. So, I've had to type the numerical unlock a lot more with the 8a.Overall this is a good phone at this price point that does most of what the expensive phones can do. But they need to overhaul the fingerprint sensor. Either move it to the back again or improve it so that it a) works nearly every time and b) works with most screen protectors.",
      "helpfulVotes": 123
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned even a main frame computer programmer could not get it to work properly",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "I bought this 5 days ago. The initial set up was quick. I am now on day 5 of finishing of the set up🥴  I has leftout so many things. I am having to set tons of preferences. None of them were added. Nor was any of my software transfered. That will probably take me a week to get installed and setup. I have a Nokia. So I don't know which phone is not transferring completely. My old phone is a G4 and this is a G5 and that maybe pert of the issue also, but I was told it should not be 🤷🏼‍♀️ I worked Tech Support 20 years at a college and helped students with software issues helping use their laptops, tablets. When I was in the computer lab I was uncharge of install and troubleshoot software on the colleges Macs and PC's over our Intranet. Mac's and computer graphics were my specialty. I understand and can support various devices such as laptops and tablets and normally phones and teach them the basics of how to use 95% of software programs we teach until they get to the advanced stages and while installing / transferring and setting up new phones was not list of things the college did. I was allowed sit with the students and staff and instructors and teach setup a few college related things like setting up their phones to access our network and  their emails on our servers. I wasn't supposed to spend more than 15 minutes with each student when we were busy when we were not I would teach them more. After 15 minutes I set them up with a one of our technicians assigned to help with more complicated problems as my  main job was answering the phones and helping staff with minor issues or writing them up a ticket and assigning them to technician to help with classroom issues.This install and transfer has been a royal pain and taking way long than it has with my other phones!!!Can't tell you eases of use except that it seems like everything I do needs permission to access or troubleshooting. Which is a pain especially since it is supposedly storing the passwords. Like I said I don't know which phone is responsible for all the problems, but I almost feel starting from scratch and not transferring data might have been quicker.1 month later...Took it to my brother who has programed main frame computers couldn't get it to work after several hours. He said to return it!!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone in all respects!",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Loving this phone already after just one day. Used to have a pixel 3 and went to a Samsung for a year. Bad choice. This pixel 8A is a much better phone and speaks my language. I mostly do text messaging and the other phone would not understand my speech. It also would not download some pictures I received or emojis. It was a used phone and that was a lesson learned too. I highly recommend the pixel 8A.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really enjoying my 1st pixel",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "3rd pixel in the family, my first. Wanted a better phone than I normally buy, wanted an android. Great camera, charges fast, long lasting battery",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Christmas gift got a fantastic deal and really like these android phones. Great picture quality, easy to use and maybe the best updates I've had yet.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I've had less than a week so far. Will edit as time goes on",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Reviewed at a few days.Pros. Similar to the phone I upgraded from (pixel 3axl). Camera is fine. Speed is fine. Screen is fine.Cons. I don't like the fingerprint reader on the front. The battery takes forever to charge and seems to drain faster than my last phone. Wish the notification sounds had upgraded. I'm not a fan yet of not having a back button."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best budget android phone in 2025",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "If you want a really good phone for cheap in 2025, this is the one to get. It doesn't have fancy features like wireless charging that are built into the non-\"a\" models, and the CPU is technically a little slower... but you'll never notice. In practice, this is a minimal-bloat-and-shovelware Android system, delivered as Google intended it without bizarre modifications \"just to make it our own\" from some third party vendor.You'll also get security updates faster and more frequently than from third-party vendor phones, which is nice. In short, like I said: this is the phone you want this year, if you want to really nail the bang-for-the-buck meter."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    One week in....",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I am pleased with my first week with this phone. It is smaller than my last phone and I love that. I'm still learning all the settings, but it has been easy to operate thus far. It is graphically pleasing. I wanted a higher end budget phone and this fits my needs. I am pleased with this purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wired headset problem with Pixel 8a",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I purchased this phone as a replacement for a Pixel 4a and returned it. The quality of phone calls was poor. I purchased a second Pixel 8a from Google as part of their Pixel 4a battery replacement program and it also had poor sound from a wired headset. I was using a 3.5 mm to USB adaptor purchased from Amazon.I also found that my calls without using the wired headset were as expected. The headset had worked well on the 3.5 mm plug on the Pixel 4a. I did not make the connection that the 3.5 mm to C adaptor was the problem.In researching this I found that the 3.5 mm to USB adaptor needs to have a DAV chip to convert digital to analog. Appears from Internet research Samsung has the same problem and solution."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bootloader enabled if thats what your looking for.",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "This Pixel phone was bootloader enabled which is what I required, also carrier unlocked. Worked perfectly for me."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente cámara",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Excelente cámara la mejor que he tenido, me llegó sin inconvenientes y no fue difícil pasar las cosas de mi anterior celular, descarga las apps del celular anterior"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOVE THE SIZE😍",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "I personally don't like to use iPhones, because of its cost and restrictions. Google pixel 8a was a good purchase for me, I bought it refurbished and it's just great 👍. I have one question though, why does the screen keep dimming with use. I need to ask google pixel 🤔"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is decent.. just dont drop it on a hard surface from any hight",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "The phone's internals are decent, but I should have just gone with a refurbished pixel 8... I ordered a case and screen protector late and while waiting for it, I was working out and it dropped out of my pocket to my basement floor (I admit it was my stupid mistake) but I expected the screen to hold up better. I'll be trying some glass polish. But I know my iPod from 7+ years ago held up much better. But the internals are much more solid.I do know, I'm not buying a new screen for this thing. I'd just rather go with an iPhone next time.."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Switched from Samsung to Pixel because of the price. Takes a little bit to get used to. So far so good. Plus no add-on apps."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice hardware, marred by software between underwhelming and just bad",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "Hardware-wise. the phone is light, nicely sized, and performs well.  However, the software user experience is just terrible and filled with frequent hostility.  If you don't like exactly what is in example screenshots, do not buy this unless you want to spend hours un-Pixeling it.  If you use software from not Google, prepare to work around Google.Customization is just poor, like i-device minimal and then somehow worse.  Google claims half the home screen for their own widgets (search and the barely useful At a Glance) that can't be disabled.  The color choices are heavily restricted forcing Google's choice of bland aesthetic with little way to customize it.  For some reason, widgets are HUGE despite the screen resolution and you can't change that, a serious issue when you only have half the home screen just to start with.  There's unusable space all over the screen on every screen.  The second thing I installed after bungling through the incredibly long on-boarding was to replace the Pixel Launcher with Nova, something I haven't even considered needing to do in years on other brands.Many apps are annoying to get working because of heavy-handed Google \"security\" that mostly just gets in the way of non-Google software and nothing else.  I spent hours searching for \"how do you disable\" on function after function to get a usable device.  If Google doesn't like you doing a thing, they (mostly) give you a way to work around that, but it's in the most absurd and hostile ways.  Like having only a \"Cancel\" button with a poorly worded \"do it anyway\" in a font 10% of the size of anything else and somewhere random on the screen nowhere near the button.After 1 day, I'm to the point that I think I'm going to return it and replace it with a phone from anyone else.  I only got this to have a phone with long software support while getting my normal phone repaired, not to be frustrated every time I try to use it.But if you like the Pixel experience and don't want to do anything different without a lot of work, then it's probably just fine.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Android in its purest form.",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "I've been using.... hmmm, let's just say a non-google Android phone for the past few years that, unfortunately, isn't getting system updates anymore.  So I thought I'd give the undiluted version of Android a shot.  I love the \"Robin\" color and that the camera bar doesn't protrude as much as I thought it would.  I like that it has the \"Material Me\" launcher as an option.  It downloads and installs software updates quite fast.  I noticed that there is an option to \"archive\" apps that you aren't using.  I've never seen that before."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "This is replacing my old pixel 4a phone. I loved the 4a but ever since I owned it I would have to occasionally restart the phone due to audio not working. When the notice came out the battery needed to be replaced, I decided to get a new phone instead. How much longer would google keep doing security updates?"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low cost, high quality",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Definitely one of the better phones in this price range."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 8a. Almost perfect.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I like the pixel 8A phone.It's great overall but a bit heavy to hold."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    RECOMENDADO",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Compre el Google Pixel 8A restaurado y la verdad es como nuevo, la cámara, la pantalla, el audio y los chips tanto físico como eSim funciona, definitivamente bueno y recomendado."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love this phone",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "My favorite phone so far. Love the color and has been working great (Had it over a month so far).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent camera",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Pixel 8a works well,calls are clear and crisp. Camera quality is very good and phone comes unlocked so can work with most telecommunication companies. Battery life is acceptable. Would recommend this phone. Will update if necessary in the future",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No sim card",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "What happened to the sim card all phones come with a sim card man come on"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "I am giving it 4 stars because previous Pixel phones had no trouble with the location in Family Link whereas this phone does not always update it.Otherwise a great device like all Google Pixel phones that we've had."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Android in it's purest form",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I have been a computer engineer for over 30 years and I have used a number of different phone brands over the years.  For years I was a big Samsung user. In my mind, there is no choice but Android for a phone OS. Google is the developer of the Android system.  I got really tired of all the  \"bloatware\" added by the phone companies and the manufacturers.  None of it was necessary. They were trying to add enhancements and differentiate themselves from the competition. Nothing wrong with that, but I was tired of these \"enhancements\" being the source of bugs and performance issues.I wish I had bought a Pixel years ago. Everything functions seamlessly and the performance is superior. The camera is the highest quality you can get in a phone. I am very happy I made the change and this one was the best value on the day I needed to purchase.",
      "helpfulVotes": 60
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost perfect...",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I would've loved to give this 5 stars, but the kick-stand is useless when the phone is placed in a vertical position. Which happens to be the only way I use it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good cell phone",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "EXCELLENT"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good midrange phone",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "I have had this pixel 8a for about two months and paid slightly more for 256gb.  The phone is easy to use, plenty bright even in full sunlight, with good battery life.  The camera and photo editing are a big step up from my old phone, and I especially like the guaranteed 7 years of updates as this is more than double what I had before.  The cell and wireless connections are quite good across multiple countries.I'm not a power user, and really appreciate this quality phone at half the price of the premium models.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfectly adequate phone for most uses, but not a good videography phone.",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "While slightly on the smaller side this phone is perfectly adequate for most users. The unfortunate part is the cameras. While this phone was touted as a great device of videography, the cameras are well... DUMPSTER FIRES! Reviews all over the internet say that the cameras are great for content creation, 4k60 resolution ect, ect. Well these cameras HATE movement, diagonal tearing, pixleating (I know, IRONIC!) and not even Resolve can fix it. The only thing that makes them work good is LOTS OF LIGHT and staying still. Then yeah the quality is great, but in low light or action just forget about. Since the rest of the device works great, I don't feel too bad, but one of the PRIMARY REASONS I choose it not being as advertised just reinforced my hatred of modern electronics. That why I only give it 3 stars."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy with new Pixel 8a",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Happy with wireless charging and increased performance over pixel 6a. I'm generally a pixel fan, and will be  as long as Google keeps the price reasonable for the lower end lineup."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Great phone! I am an iPhone user, but this phone just hit it on spot. The image/screen is clear and easily maneuverable. It is not too chunky or big - just love that!Highly recommended this phone!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wife enjoying it",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Bought this phone as a gift for my wife. It was a nice upgrade at a good price for her."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Espectacular equipo",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Precioso telefono, buenos materiales, impecable, diseño hermoso."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "I like this phone, battery life is awesome.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Warranty support can be challenging",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "If a warranty replacement phone is required, Google expects the customer to produce an invoice that indicates the IMEI number.  Amazon USA does not provide such an invoice.  Circumventing this Catch 22 can be a problem.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google pixel",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "My daughter actually is the one who said that  the pixel is the one I should  get. She checked out a lot of phones.  I like the  size, it's a little  smaller than my old one, which I like. I love the camera,  pictures are clear. Easy to setup.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Pixel still wont let you go to the phone screen if you accessed anything during the call",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I also still have to use the speakerphone for anyone to clearly hear me.  Same flawed technology as the 5a. Friends with I-Phones have great sound quality.  I like the finger print reader but its location favors your thumb.  I sold tons of finger print readers for access control systems.  The thumb and the index finger are the most used for gripping things and they get scratched. The best finger for finger print readers is your ring finger - large enough, least used for grabbing.  Furthermore, its cold and dry now in Chicago and you get constant cracking of the most used fingers and the thumb is the worst.  I liked the old 5a where the finger sensor was underneath.  They should at least allow you to move the finger target to different places on the screen to favor the ring or other fingers.  Otherwise the phone is reliable in the couple months I have owned it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice reworked phone",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Works well; battery is ok and rework makes it look new"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mostly great, but...",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "Overall I like the Pixel. My only major complaint is with the fingerprint censor, as oftentimes it doesn't work. Like constantly. It's beyond annoying. The censor being on the back of the older models seemed to be a much more reliable design.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incorrect Camera Shortcut as Received",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "I purchased this phone for my wife; she prefers an Android phone with a smaller screen that is easier to hold. The Pixel 8a is one of the few Android phones with a 6.1\" screen. As received it worked flawlessly - almost. The advertising shows that double-tapping the power button will activate the camera. That is the way my Pixel 6a worked out of the box. On my wife's phone, double-tapping the power switch returned the phone to the lock screen. If selected from the Home screen, the camera worked fine.After searching in vain for a solution on the internet, I ended up calling the Google help desk. They walked me through the correct setting. To turn on double-tap:- Go to Settings > System > Gestures- Tap Quickly Open Camera. (If it is not activated, it will show Off)- On the next screen, slide the switch to the right to activate the feature.There are other gestures in this page you may also find helpful: Quick Tap, Power & hold power button, etc.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to setup and update supported until 5/2031",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Exactly as advertised, replaced worn out 5A phone, easy to setup."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does't do what you want!",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "the touch screen does not respond well on some sites, if I am on a game I literally have to turn the phone off to get off the game, the back arrow will not respond, very frustrating for me to use most times."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El celular se calienta en una llamada",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "El celular se calienta demasiado cunado estoy en una llamada larga, y aparece una notificación que necesita enfriarse eso nunca me ha pasado con ningun otro celular.Es muy molesto porque hasta siento que me quema."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great entry level phone",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "very straightforward with the review here, the phone can do alot for how small it is.  If you are going to worry about anything on this phone its the battery life and processor, its not ideal for long play on mobile games but this thing can last about 24 hours+ doing anything social media or web browsing.  I recently switched to visible wireless network and it does have some issues switching between 5G and LTE alot but other than that the phone works with most major networks",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I bought this to replace my Pixel 6 which wasn't working well anymore.  Bought this on a Cyber Monday deal that saved $100 on an unlocked phone.  It was very easy to migrate my data from my old phone.  There are several new features on this model such as AI.  So far I am really enjoying the newer phone.  The camera is great also.  Very satisfied with the purchase and the price was definitely right.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price, works as expected, easy to transfer",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "I had a Google Pixel 4a that was starting to crap out and I usually buy technology on Black Friday, but it wasn't going to make it.  So I tried Prime Day for the first time, and this was one of the deals.  Very similar to my old phone, very slightly bigger, but I love that it holds a charge for the whole day.  I found the transfer amazingly simple.  Just had to take a picture of a QR code, and put the phones next to each other and everything moved over.  Magic!  Don't know if it was because it was Google to Google or the phones have just gotten that much better.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the color",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "I've been a pixel fan for past 5 years and yet again Google did not disappoint me. This is a great value phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    dissapointed with the quality and customer support",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "My family has had 5 pixel phones starting with a 5a, 6a, two 7a, and finally this 8a.  The low rating is probably more about prior phones than this 8a phone.  I like the camera quality and that is what drew me to the pixel phones.  It feels like Android is getting a bit more glitchy, but so are most things these days.The reason I bought the pixel 8a is that after a little more than 2 years my old 5a screen stopped working.  you could tell the phone still worked because it still vibrates, but I couldn't get the screen to work.  2 years seemed a bit short for the life of a phone but the cost to fix the screen was too much so I bought a new 8a.Now Nov 2024, my son's 6a which we bought Oct 2023 stopped working Nov 2024 with the exact same issue.  Basically 1 month out of warranty, I reached out to Google, spoke to a representative who wouldn't do anything other than send me directions to a local shop which will charge me about $200 for the screen repair.  I asked for a manager at google and they opened a case and said I would hear back within 24 hours, it has now been a week.The phone in general has been good, but with 2 out of 5 phones having the same issue, I’m wondering how long the others we still use will work.  I will be researching other phones prior to our next phone purchase.  If you plan to purchase a pixel I would recommend the extended warranty unless you trade in your phone yearly.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good for a mid range cel",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Device is working properly and no issues so far!!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    As advertised.  Seems good.",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "As advertised.  Seems good.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen teléfono.",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Un teléfono que cumple con lo que necesito."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love this phone",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I have no complaints with this phone! The camera is great. It's easy to set up and use."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fragile screen and print reader doesn't work well",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Fragile screen and print reader doesn't work well"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First/last Pixel I'll own...",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "Upfront: I'm a Samsung guy, but they're just too expensive for my purposes...not a self-absorbed millennial on a selfie binge.How I got to the P8a: I replaced my old S9 with a Motorola 5G Pro Stylus, which was too big and when laid next to a Samsung work phone would ring (If I was lucky) 15-20 seconds after my work phone using the same app (profile). Sometimes I'd just receive a missed call (phone never rang...) After weeks of surfing the internet looking for a Samsung S23/24 deal I started noticing the Pixel line (8 Pro/8/8a). Finally, I fell for the 8a $499 (+ $100 gift card)...Pros: Light weight. Easy to transfer files from previous phone. Android 14 (7 years of updates (+++)). Perfect hand-sized.Cons: Touch screen is randomly effective in various areas; when touching an app it'll appear to sense (color change), but no action occurs, so sometimes I have to \"angry\" press to get it to take action. Just now, I had the same Motorola latency issue happen (side-by-side w/ Samsung). Signal issue, 5G UC drops to 5G to LTE for no reason (just sitting there. The tower is roughly .5 miles away.In the end I'll keep since it was a $499 - $100 phone.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No more problems",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "When my Samsung phone kept having display problems where I couldn't even read the display it was time to get a new phone even thought the Samsung was just over one year old. I had a Samsung somputer monitor with display problems too. The monitor would flash off/on every time the computer went to sleep or it was powered off/on. Time to get away from Samsung and get equipment that works.I bought a Google Pixel 8 and it worked so well that my wife bought the Google Pixel 8a. Now she has bought one for her sister too.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Super-easy to transition from OLD Samsung Galaxy S8 to Pixel 8a!",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "Phone arrived on time and in perfect condition. I am impressed with how easy it was to transfer the contents of my VERY OLD Galaxy S8 to the Pixel 8a. I anticipated having some difficulty with the two devices communicating with each other but my concerns were completely unfounded. It took about 10 minutes to complete the transfer and I was fully up and running (I had a little difficulty getting Messenger synced but once I restarted the phone, it fell into place and started working). I have only had the phone for one day but am, so far, happy with my purchase. It is a huge upgrade from my VERY OLD phone (have I mentioned that it was VERY OLD?) and at a great price of $399 on sale! So far, I highly recommend.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "I have had this for a few months and I really love it.  The operating system is fabulous and the camera and battery are wonderful.  It's a great phone and I am very glad to have it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Takes great pictures",
      "date": "Reviewed in the United States on September 10, 2024",
      "body": "My husband bought me one.  My brother ran over his other phone so I replaced it with this one.  Size is perfect.  My husband has a more expensive phone but he makes me take the pictures because the quality of mine are better.  It is a easy  to use phone.  I am so happy with this phone.  Have dropped several times with not damage.  My brother love the one I got him and he has managed to not run over this one.  Easy to set up, if existing service just take to phone provider and they can transfer service with ease.  They would rather you  buy one from them, but this was significantly cheaper that the same phone at the cellular provider. Came overnight which as great. Excellent value for price.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    falta mejorar varias cosas",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "es un telefeno, super rapido, buena camara, no como los xl, han perdido magia en el modo retrato, en mi caso el radio bluetooth me salio defectuoso, aparte recalentaba mucho, amazon me ofrecio la etiqueta de retorno, lastimosamnete lo golpe bastante en un viaje, ya asi estaba dificil, pero ten en cuenta que puedes devolverlo si te sucede lo mismo, pero el tamaño es genial y el acabado no esta del todoo mal.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not overheat like others claim",
      "date": "Reviewed in the United States on October 1, 2024",
      "body": "I bought this phone for the camera and AI features. I was a bit worried at first after hearing so many complaints about the phone overheating. I never experienced such issue since my purchases. At first when the phone was optimizing and installing the initial apps and updating etc, it did get a little warmer than normal but once the updates stopped it was back to normal temperature. I am constantly on my phone all day and no overheating issue yet. Phone is always cool and normal temperature. Also the smaller screen size does not affect me. In fact the smaller size makes it easier to hold. This is just my experience. I personally love the pixel 8a.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone!",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "Got this for my daughter. She is in love with it. I have spent some time with it as well. I personally have an S23 Ultra and I think it's the greatest phone ever made. But I do think the Pixel 8 is a close second place. For the price it's #1. This phone takes the most amazing photos for a cell phone! Amazing , bright, crystal clear and colorful OLED display. Looks like an iPhone screen! It charges fast enough, but the batter lasts such a long time. Longer than my s23 and requires alot less energy to charge. Was impressed with the sound. Nice full sound from the speakers, even has some bass. We turned it on, plugged in the Sim card and scanned a code from the old phone and instantly it easily transfered everything from the old phone to the new one. Amazing piece of technology and the price for a brand new name brand phone is unbeatable. She is absolutely in love with it. Thanks!",
      "helpfulVotes": 42
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for my needs",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "I like everything about this phone, but I use it more as a phone and lite computer.  I never thought about buying my phone through Amazon, always from the phone companies.  This is much better.  I'll probably always buy my phones 1 year behind.  Better than my old phone and without the noise of sales people.  I do like the Pixel more than my Samsung Note 20.  The pixel is smaller and since I use Google apps it made things easier for me.  I may feel different if I move away from Google.  Some folks use phones as their primary internet device, I suspect the view is too small if that's how you use it.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Carrier-unlocked, not factory-unlocked",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "The 'OEM Unlock' developer option came force-disabled, until connecting to internet. This is the behavior of carrier-unlocked devices, not the behavior of factory-unlocked devices.If you are intending to flash GrapheneOS: Yes I was still able to unlock, flash, and relock; but be aware and follow their installation steps assuming your device is carrier-unlocked instead of factory-unlocked. Take this for what you will, depending on your own level of tinfoil.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy Purchase",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Love this phone!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charge speed not ideal",
      "date": "Reviewed in the United States on September 25, 2024",
      "body": "Besides the charging speed, this is the best phone I've ever had. Easy switch from Android to pixel phones",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My Favourite Phone",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "I upgraded from the Pixel 7a, to the Pixel 8a, and am in love with it! I've used it for about 3 months now and am blown away at the quality. From the camera, to the processing speed, to the storage compacity! This phone knocks it out of the park and I would choose it over any other brand, can't wait to upgrade to the Pixel 9a!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible camera quality...",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Image quality of the phone is poor compared to my Motorola Edge 2020. Close-up feature is subpar  as well as the overall image quality on the Google Pixel 8a. I thought Google phones had exceptional quality images, guess that's on the top-line, super expensive phones!A great feature, however, is the 6yrs of OS and security updates."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Convert",
      "date": "Reviewed in the United States on June 6, 2024",
      "body": "I am very happy with this purchase, and the phone works quite well. The price is right and there was only a slight learning curve when coming from a Samsung phone. I know google has a spotted history when it comes to sale prices on their other models, so maybe the pricing will not be as strong a driver as the Pixel 7 pros and Pixel 8s go on sale, but I am very happy with this budget model.The battery life last multiple days between charges for me, or for the entire day with heavy youtube usage. It can get slightly warm at times, but no warmer than my S9+ under heavy usage, so I am not concerned. Charge times are reasonable, but I am coming from an older phone, so maybe I am just easily impressed.The finger print scanner works great for me, and when used in conjunction with the face recognition, is pretty seamless.Overall, I am very happy with this phone, and will consider the Pixel phone family moving forward.",
      "helpfulVotes": 40
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wow!",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "Sturdy, thick (to protect the phone) and crystal clear.  Let's the color of the phone shine through.  Exactly what I was looking for.  Yes, the company put their name on the side panel, but it's subtle and doesn't obscure anything.  Just great at a very reasonable price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone and CAMERA",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "I am very happy with my Pixel.  I started looking for a phone with a decent camera so I don't have to carry a \"real\" camera everywhere.  I kept running into suggestions of specifically the Pixel 8a so I dug further.  It's not a \"cheap\" phone but certainly not at the high end either - as a phone it's fine, as a camera I'm finding it superior!  I love the software that lets you do some major editing right there on your phone.  Unfortunately, I am still going to want a camera for long zoom shots, but this one works far better for most situations and in low light, e.g., than others I have had.  Definitely recommended.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, terrible Battery",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "These are great phones, I have had several Pixel phones, but t the ey all have terrible batteries",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "i lov it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pure android",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Best camera I've seen"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Could be better",
      "date": "Reviewed in the United States on June 2, 2024",
      "body": "If your experienceing flickering try turning off smooth display or if your ok with the battery life reduction go into dev options n enable force max refreshrate. The finger print sensor only works on my left thumb my right it won't pick up at all I can put all 4 of the fingerprints as my right n it won't work half the time it seems to be useable with my left though.I got mine when the 100 dollars gift card was aviliable so for my price of 400 dollars I'd say its decent value.I've had no issues with battery life it ends up at 50-70 precent at the end of the day 6am to like 9pm which I'd say is aceptiable (I don't play games on my phone)The screen seems to have some minor color uniformity issues and at least coming from the pixel 3 its heavy n a Lil big for my tastes but for whats available on the market its probably one of the comfier phones to hold onnthw market",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing phone",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "I absolutely love this phone. It's fast and takes excellent pictures. My only wish is that it was larger. The screen is much smaller than I'm use to. However I still love it ❤️",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's an overall extremely good phone",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "Everything about this Google pixel is amazing, from the interface, to the camera, the battery life and the list goes on for what this phone can do. It's easy to use. I'd say the only down side would be that it gets a little hot depending on what you're using or if something makes it heat up. However, that doesn't cause the battery to drain faster.",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Generally good phone, but phone calls often have problems",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Nice phone,  good battery life, but phone calls are often very choppy and garbled. It's called a phone but does not work like one very well. My wife's Pixel 5a works much better as an actual phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Es perfecto",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "Fue un regalo para mi madre ya que se le había roto el que tenía y cuando le mostré este pixel 8a se quedó enamorado y me dijo que le encantó.El teléfono tiene buena cámara, tiene muy buena fluidez entre aplicaciones, cómodo para usarse con 1 mano, cosa que valoro muchísimo porque no siempre quieres tener sujetado el teléfono con las 2 manos.Me gustó tanto que me planteé comprarme el pixel 9 para mi.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the money",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "For the price it's a good phone but it doesn't compare to say the newest galaxy. The camera is decent. The phone is a bit buggy like I have to swipe multiple times to get what I want or I can turn it off and it'll still play a reel. Takes awhile to fully charge but keeps a charge almost all day before needing to be recharged. Sounds decent. It takes a couple more steps to do things vs my older galaxy. Less customizing options. But again it's half the price...which makes it worth it. Overall a good phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent!",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I recently purchased this mobile cover, and I am beyond impressed! The build quality is exceptional—sturdy yet lightweight, offering excellent protection for my phone without adding unnecessary bulk. The precise cutouts for buttons, ports, and the camera ensure full functionality without any hindrance."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    There are better for cheaper",
      "date": "Reviewed in the United States on July 28, 2024",
      "body": "I haven't had this phone for very long but so far, I'm not a fan. Ive always had android phones for personal phones and iPhones for work. I hate iPhones. I'm coming from a TCL 20xl as my personal phone. The only thing I disliked about that phone was the curved glass. So let's compare. The camera quality on this seems on par with the TCL, a phone that was half the price and 3 years older. This phone also has 2 stupid widgets that can't be removed from the home screen. One being the search bar and the other the date in the upper left had corner. So if you want to add a clock widget, you now have the date displayed twice side by side. Let us remove these widgets Google! Next, do you want to add a picture you took (in portrait) as your home screen? Cool, pixel can do that, but it's going to zoom in, cropping out half the people in the photo and there isn't a thing you can do to adjust the photo. It's already in the right orientation and size. Quit auto cropping. Perhaps most severe is it doesn't seem to want to stay connected to my wifi. I had to give it priority on the network just to function.  I'm going to give this thing a try, hopefully I can get used to it. I'll update if I find any that makes this phone stand out above a $250 3 year old phone or if I find more issues.Update: Minus a star. The touch screen also decides it doesn't want to work for a few moments. This especially occurs if the phone hasn't been used for a few hours. I thought it could be a screen protector, but once it decided to unfreeze, the touch screen works fine.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great - Loaded GrapheneOS",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Works great with GrapheneOS",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 8a - Great phone",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "It's fast, easy to use and a good deal at $399.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Another Great Pixel Phone",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "Display is great, very responsive, easy to set up.  We have been using Pixel phones for years now and this is another great phone.  We chose it because my wife doesn't need the fully loaded flagship but she needs a fully functional phone with a great camera.  This comes in at a great price point.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works with Mint mobile.",
      "date": "Reviewed in the United States on August 19, 2024",
      "body": "So far so good. A seal on one side of the box was open, but the seal on the other side was intact. The phone seems fine though. No scratches or scuffs thankfully. I was happy it works with Mint mobile, and the Pixel 8a is a nice change from the Galaxy s22 ultra. I do like that the touch navigation on the home screen is pretty much the same as the Galaxy so it's already an easy transaction. I do think it's weird that it didn't come with a charger plug, but it did come with a cable. Other than that, I'm a fan.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast phone, no charger.",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "Arrived the next day, super quick. This phone is fast, well built, and has a really bright screen. The only con I find is that it doesn't include a charger, just a type C cable and that's it. Most Android phone makers still include powerful chargers and cases, this is pure greed from Google, just like Apple doing the same.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "This is my first Pixel phone. I love it, took awhile to get used to, I'm use to Samsung phones.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice upgrade from Pixel 4a",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "I like most everything about this phone & have no complaints. This is my second Pixel. As long as I stay with Android I'll probably stay with Google Pixel phones. iPhone owners have complimented the look and feel of the 8a.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Justo lo que pedí !!!",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Fue justo lo que pedí, nuevo , fácil, práctico y desbloqueado muy buen aparato."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good phone",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "This is a second Pixel purchase. It works very well and has been trouble free.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm now a Pixel phone fan",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "I jumped to this after being a Samsung Galaxy user. I love the little touches that Google adds to this phone. I haven't had a spam or political call since I put my SIM in this thing, and it's election season",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought for my wife, she likes it",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Replacement for pixel 4.  My wife likes it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lots of advanced features at an affordable price",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "The Google Pixel 8a has most of the same features as the higher end Pixels at a more friendly price. Very solid. Great screen. Very fast. Features the Gemini AI system. One of the best cameras you can buy (although it lacks the zoom capacity of the higher Pixel 8 and Pixel 8 Pro). Very easy to set up and it was easy to switch phones on Mint Mobile -- just a matter of removing the SIM card from the old phones and placing it in this one (it also has eSIM capability). It was on sale for $450, unlocked. That's great value.",
      "helpfulVotes": 43
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fingerprint usually doesn't work",
      "date": "Reviewed in the United States on August 27, 2024",
      "body": "Update: had to use pixel5 for a while, pixel8a isn't better in any meaningful direction to me.Fingerprint in the night is super bright and just blinds you. How this still was not fixed months after release?Moving from pixel5, use 8a for several months now.- pixel 5 had a bad fingerprint sensor, sensor on 8a is ever worse- biggish, when switching between phones I find 5 to be more 'correct fit'- signal connection: ok, same as in pixel 5- battery life: improved- camera: see no difference- ai-ai-ai - prepare to spend some time switching off all ways google wants to collect your data",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Different",
      "date": "Reviewed in the United States on July 28, 2024",
      "body": "This phone is very different from my Motorola.  It is taking me awhile to learn how to use it.  My daughter has one and s friend of my son also has one and they love it. I suppose, in time, I will too.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy transition, intuitively designed,no SD card slot",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "I liked the simple transition to this from my Moto Z4. It was almost easier than when I went from the Z2 to the Z4. I only wish I'd known that you can't use an SD card for extra memory. Had I realized that, I would have probably gotten the 256 gb model. So far though, I couldn't ask for a better experience.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Same that describ",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned even a main frame computer programmer could not get it to work properly",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "I bought this 5 days ago. The initial set up was quick. I am now on day 5 of finishing of the set up🥴  I has leftout so many things. I am having to set tons of preferences. None of them were added. Nor was any of my software transfered. That will probably take me a week to get installed and setup. I have a Nokia. So I don't know which phone is not transferring completely. My old phone is a G4 and this is a G5 and that maybe pert of the issue also, but I was told it should not be 🤷🏼‍♀️ I worked Tech Support 20 years at a college and helped students with software issues helping use their laptops, tablets. When I was in the computer lab I was uncharge of install and troubleshoot software on the colleges Macs and PC's over our Intranet. Mac's and computer graphics were my specialty. I understand and can support various devices such as laptops and tablets and normally phones and teach them the basics of how to use 95% of software programs we teach until they get to the advanced stages and while installing / transferring and setting up new phones was not list of things the college did. I was allowed sit with the students and staff and instructors and teach setup a few college related things like setting up their phones to access our network and  their emails on our servers. I wasn't supposed to spend more than 15 minutes with each student when we were busy when we were not I would teach them more. After 15 minutes I set them up with a one of our technicians assigned to help with more complicated problems as my  main job was answering the phones and helping staff with minor issues or writing them up a ticket and assigning them to technician to help with classroom issues.This install and transfer has been a royal pain and taking way long than it has with my other phones!!!Can't tell you eases of use except that it seems like everything I do needs permission to access or troubleshooting. Which is a pain especially since it is supposedly storing the passwords. Like I said I don't know which phone is responsible for all the problems, but I almost feel starting from scratch and not transferring data might have been quicker.1 month later...Took it to my brother who has programed main frame computers couldn't get it to work after several hours. He said to return it!!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice hardware, marred by software between underwhelming and just bad",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "Hardware-wise. the phone is light, nicely sized, and performs well.  However, the software user experience is just terrible and filled with frequent hostility.  If you don't like exactly what is in example screenshots, do not buy this unless you want to spend hours un-Pixeling it.  If you use software from not Google, prepare to work around Google.Customization is just poor, like i-device minimal and then somehow worse.  Google claims half the home screen for their own widgets (search and the barely useful At a Glance) that can't be disabled.  The color choices are heavily restricted forcing Google's choice of bland aesthetic with little way to customize it.  For some reason, widgets are HUGE despite the screen resolution and you can't change that, a serious issue when you only have half the home screen just to start with.  There's unusable space all over the screen on every screen.  The second thing I installed after bungling through the incredibly long on-boarding was to replace the Pixel Launcher with Nova, something I haven't even considered needing to do in years on other brands.Many apps are annoying to get working because of heavy-handed Google \"security\" that mostly just gets in the way of non-Google software and nothing else.  I spent hours searching for \"how do you disable\" on function after function to get a usable device.  If Google doesn't like you doing a thing, they (mostly) give you a way to work around that, but it's in the most absurd and hostile ways.  Like having only a \"Cancel\" button with a poorly worded \"do it anyway\" in a font 10% of the size of anything else and somewhere random on the screen nowhere near the button.After 1 day, I'm to the point that I think I'm going to return it and replace it with a phone from anyone else.  I only got this to have a phone with long software support while getting my normal phone repaired, not to be frustrated every time I try to use it.But if you like the Pixel experience and don't want to do anything different without a lot of work, then it's probably just fine.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfectly adequate phone for most uses, but not a good videography phone.",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "While slightly on the smaller side this phone is perfectly adequate for most users. The unfortunate part is the cameras. While this phone was touted as a great device of videography, the cameras are well... DUMPSTER FIRES! Reviews all over the internet say that the cameras are great for content creation, 4k60 resolution ect, ect. Well these cameras HATE movement, diagonal tearing, pixleating (I know, IRONIC!) and not even Resolve can fix it. The only thing that makes them work good is LOTS OF LIGHT and staying still. Then yeah the quality is great, but in low light or action just forget about. Since the rest of the device works great, I don't feel too bad, but one of the PRIMARY REASONS I choose it not being as advertised just reinforced my hatred of modern electronics. That why I only give it 3 stars."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Pixel still wont let you go to the phone screen if you accessed anything during the call",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I also still have to use the speakerphone for anyone to clearly hear me.  Same flawed technology as the 5a. Friends with I-Phones have great sound quality.  I like the finger print reader but its location favors your thumb.  I sold tons of finger print readers for access control systems.  The thumb and the index finger are the most used for gripping things and they get scratched. The best finger for finger print readers is your ring finger - large enough, least used for grabbing.  Furthermore, its cold and dry now in Chicago and you get constant cracking of the most used fingers and the thumb is the worst.  I liked the old 5a where the finger sensor was underneath.  They should at least allow you to move the finger target to different places on the screen to favor the ring or other fingers.  Otherwise the phone is reliable in the couple months I have owned it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does't do what you want!",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "the touch screen does not respond well on some sites, if I am on a game I literally have to turn the phone off to get off the game, the back arrow will not respond, very frustrating for me to use most times."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El celular se calienta en una llamada",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "El celular se calienta demasiado cunado estoy en una llamada larga, y aparece una notificación que necesita enfriarse eso nunca me ha pasado con ningun otro celular.Es muy molesto porque hasta siento que me quema."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    dissapointed with the quality and customer support",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "My family has had 5 pixel phones starting with a 5a, 6a, two 7a, and finally this 8a.  The low rating is probably more about prior phones than this 8a phone.  I like the camera quality and that is what drew me to the pixel phones.  It feels like Android is getting a bit more glitchy, but so are most things these days.The reason I bought the pixel 8a is that after a little more than 2 years my old 5a screen stopped working.  you could tell the phone still worked because it still vibrates, but I couldn't get the screen to work.  2 years seemed a bit short for the life of a phone but the cost to fix the screen was too much so I bought a new 8a.Now Nov 2024, my son's 6a which we bought Oct 2023 stopped working Nov 2024 with the exact same issue.  Basically 1 month out of warranty, I reached out to Google, spoke to a representative who wouldn't do anything other than send me directions to a local shop which will charge me about $200 for the screen repair.  I asked for a manager at google and they opened a case and said I would hear back within 24 hours, it has now been a week.The phone in general has been good, but with 2 out of 5 phones having the same issue, I’m wondering how long the others we still use will work.  I will be researching other phones prior to our next phone purchase.  If you plan to purchase a pixel I would recommend the extended warranty unless you trade in your phone yearly.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fragile screen and print reader doesn't work well",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Fragile screen and print reader doesn't work well"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First/last Pixel I'll own...",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "Upfront: I'm a Samsung guy, but they're just too expensive for my purposes...not a self-absorbed millennial on a selfie binge.How I got to the P8a: I replaced my old S9 with a Motorola 5G Pro Stylus, which was too big and when laid next to a Samsung work phone would ring (If I was lucky) 15-20 seconds after my work phone using the same app (profile). Sometimes I'd just receive a missed call (phone never rang...) After weeks of surfing the internet looking for a Samsung S23/24 deal I started noticing the Pixel line (8 Pro/8/8a). Finally, I fell for the 8a $499 (+ $100 gift card)...Pros: Light weight. Easy to transfer files from previous phone. Android 14 (7 years of updates (+++)). Perfect hand-sized.Cons: Touch screen is randomly effective in various areas; when touching an app it'll appear to sense (color change), but no action occurs, so sometimes I have to \"angry\" press to get it to take action. Just now, I had the same Motorola latency issue happen (side-by-side w/ Samsung). Signal issue, 5G UC drops to 5G to LTE for no reason (just sitting there. The tower is roughly .5 miles away.In the end I'll keep since it was a $499 - $100 phone.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible camera quality...",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Image quality of the phone is poor compared to my Motorola Edge 2020. Close-up feature is subpar  as well as the overall image quality on the Google Pixel 8a. I thought Google phones had exceptional quality images, guess that's on the top-line, super expensive phones!A great feature, however, is the 6yrs of OS and security updates."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Could be better",
      "date": "Reviewed in the United States on June 2, 2024",
      "body": "If your experienceing flickering try turning off smooth display or if your ok with the battery life reduction go into dev options n enable force max refreshrate. The finger print sensor only works on my left thumb my right it won't pick up at all I can put all 4 of the fingerprints as my right n it won't work half the time it seems to be useable with my left though.I got mine when the 100 dollars gift card was aviliable so for my price of 400 dollars I'd say its decent value.I've had no issues with battery life it ends up at 50-70 precent at the end of the day 6am to like 9pm which I'd say is aceptiable (I don't play games on my phone)The screen seems to have some minor color uniformity issues and at least coming from the pixel 3 its heavy n a Lil big for my tastes but for whats available on the market its probably one of the comfier phones to hold onnthw market",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Generally good phone, but phone calls often have problems",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Nice phone,  good battery life, but phone calls are often very choppy and garbled. It's called a phone but does not work like one very well. My wife's Pixel 5a works much better as an actual phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the money",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "For the price it's a good phone but it doesn't compare to say the newest galaxy. The camera is decent. The phone is a bit buggy like I have to swipe multiple times to get what I want or I can turn it off and it'll still play a reel. Takes awhile to fully charge but keeps a charge almost all day before needing to be recharged. Sounds decent. It takes a couple more steps to do things vs my older galaxy. Less customizing options. But again it's half the price...which makes it worth it. Overall a good phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    There are better for cheaper",
      "date": "Reviewed in the United States on July 28, 2024",
      "body": "I haven't had this phone for very long but so far, I'm not a fan. Ive always had android phones for personal phones and iPhones for work. I hate iPhones. I'm coming from a TCL 20xl as my personal phone. The only thing I disliked about that phone was the curved glass. So let's compare. The camera quality on this seems on par with the TCL, a phone that was half the price and 3 years older. This phone also has 2 stupid widgets that can't be removed from the home screen. One being the search bar and the other the date in the upper left had corner. So if you want to add a clock widget, you now have the date displayed twice side by side. Let us remove these widgets Google! Next, do you want to add a picture you took (in portrait) as your home screen? Cool, pixel can do that, but it's going to zoom in, cropping out half the people in the photo and there isn't a thing you can do to adjust the photo. It's already in the right orientation and size. Quit auto cropping. Perhaps most severe is it doesn't seem to want to stay connected to my wifi. I had to give it priority on the network just to function.  I'm going to give this thing a try, hopefully I can get used to it. I'll update if I find any that makes this phone stand out above a $250 3 year old phone or if I find more issues.Update: Minus a star. The touch screen also decides it doesn't want to work for a few moments. This especially occurs if the phone hasn't been used for a few hours. I thought it could be a screen protector, but once it decided to unfreeze, the touch screen works fine.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fingerprint usually doesn't work",
      "date": "Reviewed in the United States on August 27, 2024",
      "body": "Update: had to use pixel5 for a while, pixel8a isn't better in any meaningful direction to me.Fingerprint in the night is super bright and just blinds you. How this still was not fixed months after release?Moving from pixel5, use 8a for several months now.- pixel 5 had a bad fingerprint sensor, sensor on 8a is ever worse- biggish, when switching between phones I find 5 to be more 'correct fit'- signal connection: ok, same as in pixel 5- battery life: improved- camera: see no difference- ai-ai-ai - prepare to spend some time switching off all ways google wants to collect your data",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blinded by biometrics scanner",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "I was forced to update phones when Google decided to obsolete the pixel 4a I'd purchased a few months prior. Picked this up and hate it. The biggest issue for me is that the biometrics scanner flashes extremely bright and constantly triggers when I'm just trying to open my compacted notifications. I also really miss the compact size of the 4a."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Frustrating.",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "ProsCamera, settings are intuitive, speed of phone is awesome, restarting is quick. Battery life is great, charges quickly.ConsThe fingerprint function is literally useless if you have a screen protector. I haven't tried it without the protector so I cannot speak to that. And the majority \"Google certified\" protectors are not available for purchase on Amazon and need to be purchased on the manufacturers website. Who wants to pay for shipping?? Over half of their offerings lead to a broken page or are no longer offering 8a protectors.The pin option is kind of infuriating. It may seem small but you need to hit enter after entering your pin. It doesn't just open the screen. There's no option to draw a pattern either.It rarely recognizes my face. Therefore I try my fingerprint, ha! And then of course I need to enter my pin.You get what you pay for. I refuse to buy a phone for more than $500 so I guess I will deal.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    its ok",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "It is ok, it serves the purpose so far. It will be completely charged and within 8 hours will need a new charge which is one reason why I replaced my old phone. This camera doesn't have a 1:1 picture size ratio which is what instagram requires now. That is annoying. The phone gets almost too hot to touch at about hour 6. I am not even gaming. Im on 2 social sites + checking emails + texting. It is baffling. The camera works pretty well. I am just not overly impressed and not sure why it is overheating and battery doesn't hold any longer."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It refused to connect to wifi",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "This is the second Pixel phone I bought from Amazon this year, and neither of them was as advertised.This Pixel 8a connected to wifi and started the setup process of transferring apps and data from my wife's Pixel 4a. A text message sent to the 4a during the setup *completely* blew up the transfer process. NOTHING I did with the 8a could restart or resume the migration from the old phone.  Less than 10% of the data had been moved to the new phone.I spent nearly 4 hours between 2 calls to my carrier trying to get the phone working properly. We finally got it to connect to the towers, and receive emails and text messages. But it totally refused to reconnect to Wi-Fi, no matter what was tried. It remembered the Wi-Fi credentials, but never reconnected. At that point, I checked for a system software update, so I thought that might solve the Wi-Fi issue. I pressed \"go\", hoping that downloading 139 MB using data would be worth it. HA! Wrong. After 90 minutes, *NOTHING* had downloaded, at which time I factory reset the phone and started the return.It was a colossal waste of my weekend time.In March of this year, I bought a new Pixel 8 here. The product page said *NOTHING* about refurbished. The phone arrived in packaging clearly marked 'Refurbished'. I did not even try to inservice that one. It went back to Amazon the following day, and I waited weeks to get the refund.I will *never* buy another phone here again.YMMV, but mine is 0. 0 MPG",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not great",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Not the greatest Pixel phone, does the job I guess though.The battery doesn't last as long as the previous Pixels I've had. The sensitivity on the screen is way off, even after trying all the different settings. Unlocking with finger print is never consistent either."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    More than likely returning",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "I have barely installed any apps or anything and this phone gets warm in my hand after using it for 30 minutes it is currently charging right now and very warm.... my house is 64°... but to make matters worse this is the slowest charging device I have had and probably 10 years... it is currently at 30% and saying it is going to be another hour and a half before it is charged full.... more than likely returning for a OnePlus"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poison Pill with Sugar Coating",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I am beyond frustrated with \"phones\" which seek to own our lives.  Every \"feature\" is just corporate America data mining citizens to benefit their own agenda.  \"Don't be evil\" was Google's mantra, and they clearly got past that when the stockholders showed up.  10,000 settings, and and how do any of them benefit us, the humans?  They don't.  I have spent hours trying to shut down the monster Google's Pixel has become, but its simply to much.I'm sure many will disagree with me, but I am tired of my life being controlled by a phone.  I whipped it against the wall in frustration, and lost my purchase price.  I am both relived, and now at a loss as to how to operate in this world when so much depends on big brother in our pockets.Its your choice folks.  But beware.  You will trade your personal privacy for convenience.  Is that worth it to you?  I'm going to pay a heavy price, but I am done with being owned by a phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Takes some getting used to",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Lacks convenience that other platforms have mastered!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow battery charging, slow finger tap response",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "The camera is supherb. The battery charges slowly and does not seem to lst the suggested times. I find the screen slow to respond to finger taps. Slow is a relatively twrm. I switched to the Pixel 8a from a Redmi 12 Pro. The camera  picture is vastly better but everything else is poorer. I found the Xiaomi tweek2s operating system easier to use with more native options.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finger print sensor is horrible",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "I really don't like the new finger print sensor ever since pixel switch from a rear sensor. The sensor on the screen is absolutely horrible and doesn't work 90% of the time. I use almost all the finger print slots for my left thumb and it only works for about a day before it stops detecting it and I have to reset the saved finger prints. This makes it very difficult to open the phone or use apps that allow for biometric unlocking and often times I get locked out instead since it doesn't detect my finger print. I don't know if this is a Pixel 8a problem or if I got a faulty phone but it seems others have had similar issues online",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone but it did not copy everything",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "This is a great phone. Much longer battery life than my old Pixel 2. Setup was easy but LONNNNG. My only complaint is that it did not copy the text editor I had on my old phone. That had a lot of important stuff in it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low battery life",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "The phone has a easy to switch program,easy to set up, however the bad parts---- no memory card slot so what you get is it, very low battery life. i will probably find a new phone soon what a waste of money. I would stay away from this phone.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great photo quality",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "I would give this 5 stars but but it arrived with a chip in the screen. I would request a replacement but I don't feel like dealing with sending it back and the shipping. The phone itself has a great camera, which is what I was after. Just disappeared with it arriving with the crack in the screen",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Underwhelming",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "Upgraded from a Pixel 3a because it was finally starting to fail and crash. It's new, it's fast, but in just about every other way it's worse than the 3a was, which is absurd for a phone released in 2024.A short quick hit list of big things that are worse than the 3a:-runs hot; anything that takes some processing power will make this phone almost uncomfortably warm.-fingerprint sensor. It's no longer on the back, making unlocks awkward, and it's much less responsive. The sensor on the front is unreasonably bright when it's active. I have to redo my print weekly. The PIN unlock is also poorly designed, with unnecessary key presses to get through. The old swipe was so much better. This is a big one, because it makes unlocking take more attention and any use of your phone more annoying. Maybe it'll get me to use it less at least.-charges EXTREMELY slowly, regardless of the charger. Like an hour to go 15%? Hilarious.-the touch screen has some randomly weird responsiveness and sensitivity? This could be a software thing I guess, but, for example, the X button to cancel directions in Maps just simply won't work for me.-the Bluetooth is slower to connect; to pair with my car it typically fails at least twice.The good? The camera is great, and it's minimal on bloatware. Overall I just can't believe it's worse than my phone from 2019. I chose it over some better deals on some older pixel models because of the long-term updates, but with how poorly the charging and heat are when it's brand new I'll be amazed if it lasts that long. This will be my last Pixel.",
      "helpfulVotes": 70
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed! New Pixels = Shrinkflation",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "If you go from a crappy old free Android phone to a new Pixel, it'll feel like an upgrade.If you go from an older generation Pixel to a newer gen, you will see the Shrinkflation all over it. It's a serious downgrade from three generations ago. Yes, it has a faster processor and better camera, but the old ones were already fast and took great pictures so the \"upgrade\" feels minimal. Plus you've now got a smaller screen, no hardware fingerprint sensor, unresponsive on-screen fingerprint scanner, no 1/8\" headphone jack, smaller battery, slower charging, and a big brick of the camera sticking off the back of the phone (5a did not have this).Like most big companies now-a-days, they are coasting on previous good products and name-recognition and partial monopoly on the market while reducing the over-all features and quality of the product over time.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid - Persistent Bluetooth and Network issues",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "Purchased July 2024. The good news is that the tensor processor with 8MB RAM is plenty snappy to handle every workload I threw at it. Long lasting battery and the screen is crisp and clear. Would be a nice phone for the price, but...I have had nothing but problems with Bluetooth devices and the Pixel 8a. Constantly get device unexpectedly disconnected error, have to re-connect and re-pair devices all day. Phone freezes when transferring a BT call from the car to the phone. Took it to UbreakIfix per google support for warranty repair. Replaced the main board, and guess what - the new main board has the same defect. No real surprise I guess. So now I'm 20 hours into trying to get this junk fixed; it's really difficult now since the serial number and imei have changed.Now its an exercise in futility since I already bought a new phone, but I'm curious how bad the google support experience can be - pretty bad so far.I asked for a refund but no bueno.In case you wonder: The Motorola phone before 8a connects and remains connected to all the same BT devices. The Samsung phone after 8a connects and remains connected to all the same BT devices. The Pixel 8a main board, and replacement main board are defective.Before you buy search for network and Bluetooth problems with Pixel 8a.Alas, one star for a defective phone that could have been a great deal. At least I can narrow my phone choices by one manufacturer the next time I shop.",
      "helpfulVotes": 47
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery, heating and Audio issues",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "My Battery lasted less than 8 hrs one the first few days itself, can't imagine how I can use this beyond a year. Expensive product for the quality you get. My old Samsung s20 with a crack on screen still perform better that this. For sure all advanced features etc but without a decent voice call quality it's waste of money",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone so far BUT didn't come with USB C block to charge phone...",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "Phone looks and functions great as of now. Did not come with the USB C block to charge the phone luckily I had one lying around from the Pixel 6 I purchased a few years ago. I will update in a few months.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    New Pixel Phone quit working 3 days after return window closed",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "This Pixel 8a Phone quit working 3 days after the return window closed. I purchased it at full price and it was described as unlocked. My mobile phone provider tried to fix it and could not because it was actually locked and could not even be turned on or shut down. I contacted Amazon Customer service and they gave me a link to the Google Pixel customer service website. Amazon said that I needed to have an email or something from Google Pixel saying that it was an unresolved problem before they could even give me a return label or credit since it was three days after the return window closed. I contacted the Google pixel customer service link provided to me by Amazon customer service and there was not even a phone number so I had to send a message. It has been three days and they have not responded to my inquiry. I am very dissatisfied that Amazon did not actually solve this issue for me. I paid full price and I am getting the runaround. It needs to be said that this is the first time I have ever written a negative review. Who is responsible for this? Amazon or Google pixel? I bought it through Amazon at full price. Needless to say how disappointed I am with both Amazon and Google.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Wi-Fi calling",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "I'm very unhappy with this phone as there is no Wi-Fi calling available on it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    too different for me ....",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "I am used to Samsung phones...and the Pixel is just too different for me...."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Comes in open box",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "In some reason the phone comes in open box. Inside looks new ... Not tested yet."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overheating Issue",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "I was disappointed with the functionality of this phone because it overheated consistently. I didn't know if that was just because it was new and it needed time to acclimate, but it didn't get any better with time or use. I read reviews elswhere that stated that adaptive conductivity could be the issue so I turned that off, and it's still overheated. I hated having a hot hand, It reminded me of when I bought a refurbished phone and had that issue.On another note it was easy to transfer all my data to 8a phone, and it was easy enough to figure out how to use it right away. I didn't mind the fingerprint sensor being on the front of the phone either, which had concerned me before purchase. I hope the phone defect was just a fluke, and doesn't happen to other phones, but I was turned off enough to return it and not want to try another one. My search for my phone will continue.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So so, image quality is way worse than 3a and 4a",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Not happy with pixel 8a after being super happy with 3a and 4a. Bad image quality, meager features."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love this phone but storage",
      "date": "Reviewed in the United States on May 23, 2024",
      "body": "This phone runs great and the camera is amazing.Only issue so far (1 week in) is the storage space. Everyday it is trying to make me pay for more Google space. Screen quality and sound are good"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great features, but the size is too small for comfortable use.\"",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "While the Google Pixel 8a offers solid performance and impressive AI features, the compact size is a major drawback. The smaller screen makes it difficult to enjoy media or navigate apps comfortably, and typing on the keyboard feels cramped. For those who prefer a larger display, especially for gaming or watching videos, this phone may not be the best option. It's unfortunate because the software and camera are great, but the small size limits the overall user experience.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I preferred my Pixel 5a",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Only upgraded because 5a no longer receives os updates.  8a touch unlock doesn't work reliably, this is a regression.  Everything else is the same, zero improvements. Don't waste your money if only to upgrade.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery drains fast & it gets hot",
      "date": "Reviewed in the United States on August 5, 2024",
      "body": "I don't know if I got a defective one or if this is normal, but the battery drains way too fast. Went from 100% to 80% within 30 minutes with normal use. And this phone got really hot also during normal use. I got this to replace a Motorola Stylus 5G that is 2 years old. My old phone never got hot like this and its battery still outlasts this. I don't know if they are all like this but I'm returning it, this was my first Google Pixel and it's gonna be my last. I only had the phone for a few days and it the battery and the heat were deal breakers for me. Camera is great but not worth the battery & heat issues.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Heavy phone",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "The screen looked nice, but that was about all I liked.This phone was to replace an aging Pixel 4a, due to aging battery.  But the 8a was just enough an increase in size and weight to make it uncomfortable to pocket and to use.  I also didn't like all the crap the phone wanted to do for me, in seemingly every google app it came with. And all the nags were incessant.  I don't want to use AI or Gemini or anything similar.  And the phone battery drained as fast or faster than my old 4a.  And charging took longer than my previous phone.After 2 weeks of trying to like this phone, I finally realized I hated it, so it went back to Amazon and I went back to my beloved Pixel 4a.When my 4a finally bites the dust, I guess I'll look at Samsung phones - if I can figure out a way to remove all the duplicate below-par apps that Samsung forces on their customers.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 8 phone underwhelming",
      "date": "Reviewed in the United States on June 16, 2024",
      "body": "It is a Google phone. I realize now that I actually like Samsung.I'm hoping the phone will take better photos to win me over but that does not appear to be the case as yet",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, but too fragile",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Fall about two feet or even less  with a good cover and dies instantly. Had many phones that had fell from higher and fell many times.... this one died at the first. Disappointed..."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn’t work well",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "It was very slow. Compared to the iPhone. Some functions hard to use. Really could not tell if it was the OS or the phone. Had to return it. Bad battery life.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Check well and return fast.",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "I loved the phone, but I don't usually talk in speaker mode. I can't use speaker mode, even in apps, since the other person can't hear anything. The phone hasn't had any falls or humidity that could've caused this. I can't return anymore, but make sure to test it out.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone gets hot. Terrible battery life.",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "I've used pixel phones on the past and I thought they were pretty good. The pixel 8a however is so underwhelming. It gets hot when doing normal tasks like browsing the web. When using more intensive apps like Google maps, it turns into a mini space heater. I don't understand how the engineers made a phone in 2024 and thought it was acceptable to have such a poorly optimized experience. This battery will barely last me the day on light usage. What a joke this phone is. This phone has made me swear off pixels for good. I will stick with Samsung Galaxy or iPhone in the future.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crap",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I bought this phone a week ago. I had a case and a screen protector on it but when it fell the screen got destroyed.. even for $200 more they cannot repair it they touchpad will not work. My advice is not to buy this piece of crap. I'm not sure if all phones are the same now but I've never had any trouble before. Don't throw away $550 like I did. So much for getting a decent phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Way too many issues with phone",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "This is my second Pixel phone and I so regret buying this.  My Samsung phones have always served me well, but I assumed the Pixel would expand with a better camera and faster processor...BOY WAS I WRONG ON EVERY LEVEL!  The Pixel is quirky and Google forces way too many apps and screen layouts on this phone.  I can't remove the Google search bar or the clock on the home page.  The battery is horrific, I got significantly better battery life from my 3 year old Samsung A53 than I'm getting out of a brand new Pixel.  The charging speed is terrible...it takes hours to charge this phone even with a fast charger.  The picture quality is really what sold me on this phone, yet when compared to my aging Samsung, the Pixel pictures are flat and lifeless.  Never again will I ever touch a Google phone.  I absolutely LOVE all google products...Chromebooks, Chromecasts, Nest speakers, Google WiFi routers, etc, but the Pixels will never find their way into our home again.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love some of it, but really Hate a lot of it!",
      "date": "Reviewed in the United States on October 1, 2024",
      "body": "I am thrilled with many of the features of my new phone and its integration with the Pixel Watch it fantastic.  However, I hate the touchscreen. It is hypersensitive. I swear it seems like you only have to get close and it counts as a click. Also, I am used to actually pressing for a click from my old phone. The Pixel frequently counts that \"fat finger\" click as a \"swipe\" or \"slide\". Many times I have had to click screen buttons 3 or 4 times to get a \"click\" registered.The worst thing is that the touchscreen is not aligned with the images on the screen. I have learned to click everything (like buttons and icons) in the bottom left corner or it will just miss it.I contacted Google Support. After 30 minutes of mind numbingly dumb questions, they told me there is no adjustment and to contact Amazon for support. They will not just replace it under warranty.DO NOT BUY ONE OF THESE. If it was in the 30 day limit, I would return it to Amazon.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't Buy",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "This phone has crashed in me 4 times now within a year. The Google a pixel 8 is worse than the 6. The Google a pixel 6 rarely ever crashed and it lasted me *years.* I am afraid this won't last 1 year. I probably won't be investing in a Google phone again. The only reason it doesn't get 1 star is bc it *i* functional, although terrifying to use."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective phone",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Worst phone ever. The 6 only works 50 percent of the time. If I'm calling a number that has a 6, I have to keep hanging up and trying again and again until it works. It's obviously a defective USED phone. Purchased it during the holidays and didn't get around to using it until the 30 day return policy was over. BEWARE when buying from this seller."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst phone I've ever had",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "This is the worst phone I have ever had.  Keeps disconnecting calls.  Headphones keep disconnecting every 30 seconds.  I've only had this for about a month.  Battery life is about a half a day with barely any use.  I wish I could return this POS.NEVER AGAIN GOOGLE"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    my fourth pixel and I hate it",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "I love Pixel phones, and this is my 4th, but I hate hate hate this one!  Battery life is half that of the pixel 7 -- seriously you think we're going to be okay with that?  But the real issue is the usability.  Touchscreen often requires multiple taps before it responds (frustrating!!) and I think the very slightly smaller size, compared to pixel 7, may also be an issue because I keep missing the keys.  Why would I want a phone that is  going to fight me like this?Another issue:  Scratchy audio. Dude, seriously?Lastly I had trouble connecting Android auto, although truth be told I didn't try all that hard to fix the problem as I was done with the phone by then.Hey Pixel team -- Stop sacrificing quality in order to get your phone to market with features that no one cares 1/10th about compared to core usability.  One more chance:  I'll try the pixel 9, but if you mess that up I am leaving you forever.",
      "helpfulVotes": 62
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for seniors.",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "I had a Pixel 3A and loved it. Needed to update, got the 8A and holy moly, so many bells & whistles for me. Very confusing. Might have to return this phone. Not for seniors. Very disappointed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    uncomfortable heating on its edge after using 10 min & hard to return",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "Got a Pixel 4a before and liked it very much. Got the Pixel 8a this time and am disappointed. The heat dissipation is poor; the phone gets hot after browsing Instagram for just 10 minutes. What's worse, the phone dissipates heat through its left edges, which I can clearly feel in my left hand. As a thermal engineer with degree, I think its thermal design is problematic and not happy about this!The return experience was also a struggle. It only offers one return option—UPS pickup. I work during the day and CANNOT be present for the required 'Adult must be present' for the UPS pickup!!!I wouldn't spend 5 minutes writing a bad review, but after negotiating with Amazon TWICE, this purchasing and returning experience was so frustrating that I had to let potential buyers know. Avoid it and get other phones!",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pray nothing is wrong with your phone.",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Straight away the phone is utterly unusable. Keeps freezing and restarting. Immediately requested a replacement but the price changed by $100 more and Amazon won't send a new one. Super frustrating experience. My only option was to get it repaired. So, why pay new phone price to get essentially a refurbished phone? Don't buy this phone from Amazon. Very disappointing and frustrating experience.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "This thing doesn't want to bluetooth many of my devices. And it has no earphone jack (I don't like wireless earbuds, they're never as good as a cheap pair of standard earbuds). I wish I could return it, but I'm sure that would be a mega-hassle."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible battery",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "Worst battery life of any phone I have ever had. Everything else works well so far, but the battery life kills the usability.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too confusing",
      "date": "Reviewed in the United States on October 1, 2024",
      "body": "I gave this phone 1 star because I found it too invasive. Google wants to know too much. Also when I turn the screen dark to save battery power, I always have to sign back in. Very annoying. Also, it was always interrupting for advise. If I want advise, I'll to to settings. The calendar was annoying. The time wasn't always showing, so I had to open what I had scheduled to see what time I had scheduled it. I returned this phone. I'm a senior, and I don't recommend this phone for seniors. I'm glad Amazon gives me the ability to return. Especially when spending $300 plus to purchase something that you find annoying. Ug!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not working properly",
      "date": "Reviewed in the United States on October 3, 2024",
      "body": "The phone is running at approx. 25% of download speeds and upload at 60% when tested. Also the reception is lower than the old phone. **** Update*** Amazon won't replace the phone, and they won't sell me a brand new phone at the price I paid for the original phone. Amazon wants me to pay $100 more than the brand new phone I'm returning!!!! The Amazon customer service rep would not give me a reason at any other choice other than return it and wait for my refund???!!!!! Wasted hours on talking to my carrier and Amazon. I won't buy electronics from Amazon ever again!!!!!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Photos cannot be attached to emails.",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "Photos cannot be attached to e-mails.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Disappointed",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "I have the 1st pixel phone that came out and I love it. Was excited to get this one. I was so disappointed with the Pixel 8a. Many of the features didn't work properly. When the phone was on lock screen my picture in my gallery would just pop up on the screen randomly, I could not assign personalized ringtones to callers, could not set anyone as a favorite in my call list. Pictures and videos were very bad quality. I returned the phone before I was tempted to throw it in the river!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google pixel 8a",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Two days after activating the cell phone I was locked out. Phone refused my correct pin.  No face recognition. No finger print recognition.  Tried correct PIN number many, many times. No success. Phone might be great if phone could be unlocked. Not worth a penny if you are locked out.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a good phone!",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": ". All pictures show up with a green dot In the photo? And the alarm clock does not work"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "The phone itself isn't bad, but the battery life is horrendous, bordering on unusable."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A fancy phone failed to provide basic phone functionality",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "I bought this one for my wife to replace her old phone. The phone from day one failed to provide reliable cell phone service: she missed many phone calls and text messages, some messages delayed more than 20 mins. Contacted cell phone carrier and google pixel service help. Not much help. Asked a replacement and tried again, same thing. Finally decided to switch to a different brand, everything worked fine then. I searched online and found this is a notorious issue related to google pixel phones. I am surprised that so many complaints, the issues still exist and not fixed.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google Pixel 8a",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "Given it 2 stars because I really like the color and the face/fingerprint sensor, but I couldn't get my messages from my old phone like I could the Google Pixel 2 xl. It's an okay phone, I guess.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing battery life...",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "The battery in this brand new phone did not last more than 12 hours. It is bested by my 3 year old, broken, bad battery life Nord 5G. It heats up very quickly and takes ages to charge. Maybe it was just THIS phone, but I kinda doubt it. Too bad, because the platform is nice. Sharp, clear vid. Fast response.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good features and picture quality but low battery life",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "Pros  Camera Pictures/features  Bare bones Android OSCons  Poor battery Life  Run hot when charging  Finger Print reader use can be a hit/miss",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Heating issues + take a long time to charge",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "It get really uncomfortable when using apps, also take a long time to charge, not acceptable for $400+ phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst phone",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "This phone is unendingly frustrating. It refuses to allow WiFi calling no matter how many updates and times I select to allow it. Texts to other Android users constantly \"unable to send\". It regularly resets the profanity filter on voice to text. No matter how many times I rescan my finger print, it never recognizes my finger to unlock my phone. It never stays unlocked at my house or when attached to specific devices, no matter how often I check the settings. So frustrated.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Reception",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Every phone calls sounds like I'm in a basement where I can't hear the other party"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone was not supported by AT&T, my provider.",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "For some reason, AT&T looks at the phone serial number, and cannot support it. I had to return it and bought a same phone elsewhere, AT&T supports it."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "I upgraded from the Pixel 3a and it's frankly not an upgrade.  A month later and I still use the 3a for some things.  The processor on the 8a doesn't seem any faster than the 3a.  Games hitch in the same places.  I continue to listen to audiobooks on the 3a because the 8a lacks a headphone jack.  Some apps didn't transfer.  Some text messages arrive a day late.  The camera seems a tad worse.  The 8a is garbage.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Must be locked to GSM phones. Was a no go on Verizon",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ugh",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "The fingerprint sensor is complete garbage compared to the Pixel 4, making this thing irritating to use pretty much every time I'm forced to do so. Frequently fails to notify until you unlock, at which point if tells you someone texted and called several hours ago. Pixel phones used to be great but like their search results Google fit greedy and the result is just bad for the user.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid.  Many Pixel 8As are Locked",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "Arrived Locked.  Pixel 8a's have a known issue that many of them are NOT unlocked as advertised.  This apparently is happening at the manufacturing level.  It took about a week of wrestling with the phone and searching online before I figured this out.  You can wait in vain for a software update, but I decided not to hold onto a 400 USD paperweight and returned it.Hey Amazon - This review is about this product.  Funny how hard it is to write a negative review that won't get bounced.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Audio quality is not good",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "Audio is not clear while listening to any audio or watching a vedio, camera quality is also not as mentioned"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Samsung es mejor compra",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "En general el teléfono esta bien, pero por el precio el Samsung s22 es una mejor compra, mejor cámara, mas rendimiento, llevo 8 meses con el, después de una actualización,ncalienta exageradamente hay muchos errores en el sistema donde por ejemplo no puedes tocar botones porque quedan en la parte inferior de la pantalla o al llamar deslizar para contestar y el teléfono sigue sonando, muy arrepentido con la compra",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very big step backwards from my Samsung Galaxy",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "Much smaller than I expected and I found that it was very impossible to get many of the functions that I used to get on my Samsung Galaxy that cost less.I got it because of its reputed excellent camera system, but that benefits is outweighed by its lack of functionality and ease of use."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does NOT Work with AT&T",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Product says it's unlocked and works with AT&T.  Tried swapping SIMs from my other phone and it says it is not compatible with AT&T and I only have calling and texting, no internet/data service.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Freezes too often, returned",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "Returned after less than a week. It is an average phone but it would freeze or lag and certain functions (arrow to previous screen).",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone came open and Usable",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "Received phone and it came in a bag and box was already opened. Powered on the phone and it is asking for the pin or google account of the previous owner. I did not order a refurbished phone this is unacceptable. Returning phone and going to probably order a samsung phone after this and hoping for better luck.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is terrible !",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "This phone is acting up right out of the box. I have to restart it often as the screen goes wild blinking back and forth between screens and the touch pad is pdten unresponsive. Try the Galaxy or the iPhone or anything but this one."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Get something different",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "Terrible. Fingerprint sensor almost never works. No way to bypass to get to enter the code. Big waste of time. Camera is terrible as well. Going from a Motorola to Google phone was a mistake. I'm trying to pawn it off on the kids, but they do t want it either because they hear me complaining about it . It's like I went back 15 years in technology.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was nice",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "Stopped taking a charge after the 3rd day so probably skip Amazon and get it straight from Google. A coworker said to make sure you use the cord and the actual Google branded charging block otherwise the phone won't take it(that doesn't come with the phone.....) I tried that and through my laptop and it didn't work.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It sucked",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Kept dropping calls or breaking up.It was sent back."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Item was not OEM unlocked as advertised.",
      "date": "Reviewed in the United States on September 27, 2024",
      "body": "Item was advertised as Unlocked.Upon setup with carrier was shown to in fact be locked.I have learned my lesson and will never order Pixel Phones from Amazon. Only directly through google store.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked but not compatible with Spectrum mobile",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "The phone is unlocked but not compatible with my carrier Spectrum Mobile.  Th same phone purchased from Best Buy works just fine.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is LOCKED,",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "I received a replacement, and that phone was locked—wasted time.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Only if you don’t need to make calls",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "Seemed fine at first, until I started making / receiving calls. The audio in / out just pops in and out, every single call. Can’t hear them and they can’t hear me. Software was up to date and I tried reinstalling the SIM card a couple of times, no good. Was advised by my carrier that it’s a phone defect. Also noted some glitches with video playback within apps. Had to return.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The battery life is literally false advertising",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "My old phone which I think was a 7a literally had double the battery life of this phone I doubt I will end up keeping this phone I just don't know if there is a new phone that is good enough.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is a scam",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "Ships out defective phones, lies about return/replace policy. The only way to return it is driving to a whole foods, no matter how far away. Unable to mail it. Unable to replace.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product was delivered with seal broken on the box",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": ""
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    THIS PHONE IS JUNK!",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "Keypad doesn't always work and other defects. I had the Pixel 4a and was very happy with it so i purchased this one. The Pixel 8a is junk! SO many defect, too many to write.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    purchased as brand new",
      "date": "Reviewed in the United States on September 25, 2024",
      "body": "It was already opened and used, I purchased as brand new, once I returned, received email that you did not return in original conditions, device freezing and not works properly",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "Not worth the price increase and specs don't perform as good as the 7. Also made from cheaper materials",
      "helpfulVotes": 2
    }
  ],
  "productDetails": {
    "productTitle": "Google Pixel 8a - Unlocked Android Phone with Google AI, Advanced Pixel Camera and 24-Hour Battery - Aloe - 128 GB",
    "asin": "B0CYQCQTN5",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Meet Google Pixel 8a, the Google AI phone; with the incredible Pixel Camera and top-rated security features to help protect your data[1]",
      "Unlocked Android 5G smartphone gives you the flexibility to change carriers and choose your own data plan[2]; it works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers",
      "The Pixel Camera gives you amazing photo and video quality; Google AI helps you create perfect group shots with Best Take and fix blurry images with Photo Unblur[3]",
      "The 6.1-inch Pixel 8a Actua display is even brighter and more vibrant; it’s fast and responsive for smoother scrolling, video streaming, and switching between apps on your phone[4]",
      "Google AI helps with everyday tasks; search anything right from the app you’re in, just by drawing a circle around an image, text, or video[5]; get a summary of emails and brainstorm ideas with Gemini[6]; and avoid spammers with Call Assist[7]"
    ],
    "boughtCount": "500+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Google",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$499.00$499.00$499.00",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$381.25$499.00$499.00",
    "buyUsedAvailability": "Only 7 left in stock - order soon.",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "Amazon",
    "soldByUsed": "Amazon Resale",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 3,
    "startingPrice": "$368.68",
    "url": "/gp/offer-listing/B0CYQCQTN5/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": "Product information",
      "item_details": {
        "section_1_row_1_brand": "Google",
        "section_1_row_2_model_number": "GKV4X",
        "section_1_row_3_model_name": "Google Pixel 8a",
        "section_1_row_4_model_year": "2024",
        "section_1_row_5_builtin_media": "Pixel 8a Phone, SIM Tool, Quick Switch Adapter, 1 m USB_C to USB-C cable (USB 2.0), Support Card",
        "section_1_row_6_manufacturer": "Google",
        "section_1_row_7_model_series": "8",
        "section_1_row_8_specific_uses_for_product": "Gaming",
        "section_1_row_9_upc": "840244708290",
        "section_1_row_12_asin": "B0CYQCQTN5"
      },
      "measurements": {
        "section_2_row_1_item_weight": "6.7 Ounces",
        "section_2_row_2_item_dimensions": "6 x 2.8 x 0.4 inches"
      },
      "video": {
        "section_3_row_1_video_capture_resolution": "1080p"
      },
      "additional_details": {
        "section_4_row_1_operating_system": "Android",
        "section_4_row_2_ram_memory_installed": "8 GB",
        "section_4_row_3_processor_series": "A-Series",
        "section_4_row_4_memory_storage_capacity": "128 GB",
        "section_4_row_5_color": "Aloe",
        "section_4_row_6_sim_card_slot_count": "Dual SIM",
        "section_4_row_7_connector_type_used_on_cable": "USB Type C",
        "section_4_row_8_form_factor": "Bar",
        "section_4_row_9_biometric_security_feature": "Fingerprint Recognition",
        "section_4_row_10_humaninterface_input": "Touchscreen",
        "section_4_row_11_sim_card_size": "Nano",
        "section_4_row_12_water_resistance_level": "Water Resistant",
        "section_4_row_13_headphone_jack": "No 3.5mm headphone jack"
      },
      "display": {
        "section_5_row_1_screen_size": "6.1 Inches",
        "section_5_row_2_resolution": "2400 x 1080",
        "section_5_row_3_display_type": "OLED"
      },
      "connectivity": {
        "section_6_row_1_wireless_provider": "Unlocked",
        "section_6_row_2_cellular_technology": "5G",
        "section_6_row_3_connectivity_technology": "Bluetooth, Wi-Fi",
        "section_6_row_4_wireless_network_technology": "Wi-Fi"
      },
      "camera": {
        "section_7_row_1_camera_description": "Rear, Front",
        "section_7_row_2_camera_flash": "built-in"
      },
      "battery": {
        "section_8_row_1_battery_type": "Lithium-Ion",
        "section_8_row_2_battery_power": "4300"
      },
      "battery_life": {
        "section_9_row_1_battery_average_life": "24 Hours"
      },
      "navigation": {
        "section_10_row_1_gps_geotagging_functionality": "True"
      },
      "warranty": {
        "heading": "Warranty & Support",
        "text": "Manufacturer’s warranty can be requested from customer service. Click here to make a request to customer service."
      }
    },
    "overviewAsin": "B0CYQCQTN5",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Pixel 8a Phone, SIM Tool, Quick Switch Adapter, 1 m USB_C to USB-C cable (USB 2.0), Support Card"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$499.00",
    "listPrice": "N/A",
    "savingsPercentage": "N/A",
    "standardDeliveryDate": "Sunday, March 23",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}