{
  "asin": "B0CWHXVLXG",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I will start off by saying I have no interest in $1000+ cell phones - to me they are disposable devices that get replaced every few years. That said, this is the perfect phone for my purposes. The coverage (carrier dependent), audio, display quality and speed are perfect for my needs. I use the this as - wait for it - a phone - as well for texting and taking some pictures, mapping directions, etc.This is my 4th or 5th Motorola phone, and I have always been happy with the value proposition. Even through my former carrier the Motorola phones have always had much less bloatware than, say Samsung (ugh) which loads up their phones with all kinds of nonsense. When you buy it unlocked it comes with even less bloatware, and you can delete or disable most of it.It is much faster than my old phone, which one would expect, with 8MB of RAM, and 128MB of internal storage. There are several things I like about this phone, a couple being that it still has a headphone jack, and also it will take a micro SD card for additional storage. Both of these features are found on very few phones these days. There are 2 features that are unique to Motorola on the phones I have had, including this one, that are REALLY convenient. You can open the camera app just by twisting your wrist, and you can turn on the flashlight by a chopping motion - no screen to wake up or app to start up - brilliant really.Also, the battery life (5000ma) is phenomenal. I can use it all day, leave it overnight, and it will still have plenty of charge the next day. I really only charge it every other day. I will note that I turn off as many background processes as I can, don't watch movies on the phone (really?), and in general use it as a tool, not a brain-sucking toy (editorial comment :-). If you want a well functioning device and don't want to spend huge dollars this phone may be right for you.",
      "helpfulVotes": 136
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Professionalism in a budget phone!",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "This phone is outstanding! I bought it for my mom. I was upgrading her old a10e Samsung and this phone completely blew away my expectations. It IS unlocked and has 128gb and 8gb of ram. It handles apps like a pro and it's camera is amazing for it to be a budget phone.Setup was easy, all I had to do was attach the cable to both phones and it automatically downloaded all of her apps. It charges fast and has an excellent battery life.It is fast and efficient. I am so happy I went with Motorola. I was going to buy her another Samsung A phone but it had less gb ram compared to this phone and was $20 higher!I highly recommend this phone to anyone looking for a replacement. The screen and display are nice and bright and clear. The volume is excellent on it. Heck, I may even consider one of these when I upgrade from my S10+!",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price on a nice phone",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I've had two Moto Power models.  I like the battery time, and the no frills style of phone.The one frills I liked on my previous model was two of the gestures - shake for flashlight, rotate for camera.  I upgraded the OS shortly after getting this phone and neither of those gestures work on this model.  Perhaps that will get fixed with a later update?Also a little disappointed with the lack of ringtones to replace the dopey one that is the default (it says \"hello moto\", so stupid).  But that is easy to fix so not a big issue.  That spurred me to browse a few and I quickly found one that I really like.The issues are all minor.  Bottom line is this is still the phone I like - good battery life, inexpensive, and functional.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone for the price",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "We have high end Android phones but one family tends to lose or break phones pretty frequently, so I'm not going to get that one a $900 phone.  We got this one as a replacement device after the most recent incident (phone dropped in a lake).  And it is remarkably fast and high quality.  Moto has a nice, clean Android OS.  Setup was very easy with all apps etc. quickly loaded from Play and photos etc. reloaded from the cloud.  The phone performs great with only barely perceptible performance, screen, sound differences from my top end phone and a longer battery life.  A really great phone at this price point.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is very subpar",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "I got this phone to replace my old 4g TCL 30 phone, and I'm pretty meh about the whole affair.The good:It's a reasonably priced unlocked android phone, it works with Mint Mobile (and therefore would work with T-Mobile and Metro, ymmv) and is lightweight and slim. It receives and makes calls and takes pretty good pictures, though I'm not a big picture taking person, so others may have issues, don't know. The 5G service is quite nice and allows for a better connection when we are out in the country than my old TCL 30 4g. The screen is vivid and the look of video/pics/etc is pretty good.The bad:Everything is Google, there is no native barebones alternatives like my old TCL 30. It's annoying being asked to set up all the different google apps every time I need to open one... If I wanted to use all the features of each one, I would. Ex: I just want to see the pictures I've taken, I don't want to be reminded to set up the app to save my pics to the cloud every damned time I open it. I use it to take pics of electrical schematics so I can complete my work without returning to the stand book to verify different connections etc ... It's almost like Google saying \"are you suuuuuure you don't want to\" every time like I'm a child or something.... It's very annoying and slows me down.The UglyBattery life is absolutely horrible. My old phone, with the same battery size, could stream Spotify to my earbuds through an entire shift and not be less than 60% battery, even after 2 years of doing this every Mon-Fri for 9-10 hours a day. The first day I used this Motorola the same way, my battery was down to 30% when I punched out to go home. That's absolutely pathetic. If it wasn't for the fact that this was a sub-$200 phone, I would have returned it and gotten another TCL phone. This is the main reason I gave this a 3 star rating. If you don't stream music all day like I do, or use it all day like a younger person then it would probably last longer. As with most things, your milage may vary....Another serious negative is the button arrangement and shared capabilities, I'll explain.The phone has the typical up/down volume button above the power button on the right side of the screen. The issue comes when the power button is also the fingerprint sensor. It's nice to just brush it to open the phone, but it's absolutely annoying when taking a screenshot or trying to restart the phone. It seems to just spaz out when hitting up volume + power button for a screenshot to restart, or any of the other button combos the phone is capable of.Overall, for someone who doesn't stream music it's a decent unlocked phone, but for someone who actually does it's a no go because of battery life. That and the 'Bad' section above is why this is a 3 star phone at best. I honestly feel Im being generous giving it 3 stars as this is gonna be a $180 paperweight when unlocked TCL 50s hit Amazon....",
      "helpfulVotes": 84
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great features, not crazy expensive",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "For a budget phone, it ticks a lot of boxes.  8GB RAM, 128GB Storage, Androd 14 (15 just arrived), decent display, head phone jack, wireless charging, good battery life, nice camera, works fine on Mint (T-Mobile) 5G. Only challenge is finding a case that supports wireless charging and magnetic car mount, but thats not the phones fault.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    best upgrade from my old phone",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "A big upgrade from my one plus nord n200 5g phone.This phone has 8 gb of Ram and 128 GB of internal storage. It has the physical sim slot and e-sim too. that's a plus.The screen colors are vivid to me and you can boost the refresh rate all the way to 120 hz.Screen size is perfect for me to use dual apps.And you can put Android 15 on it too.Overall this is a great phone and I enjoy it a lot.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice for the price",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Reviews MotorolaIt's a nice budget phone that has what I need. I'm not a heavy phone user, I just need to check messages and mail. Place some online orders and browse the Internet. Occasionally, I take photos. So, this phone is fit for my intended use and the price point is just right.I had a previous Motorola phone which served me well until the battery died and screen cracked in several places. So, I got this Motorola phone which by the look of the specs and the couple weeks that I've used it has been good so far.I bought it for the price, size, battery life, good experience with previous Motorola phone, VoLte and 5g connection.The color didn't matter to me since I put it in a rugged case anyway.The camera takes decent pictures and it seems to do better in low light than my previous Motorola.The battery lasts me a full day on medium usage, no heavy video or music streaming for hours though. I watch maybe around 5-10 short videos on it per day. If you need to constantly stream music or videos on it, then the battery might not last a full day.This phone is a bit on the heavy side though, much heavier than my previous Motorola, especially with a case that I added onto it. But overall, it's working as expected.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gets the job done, won't blow your socks off",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "My old phone, a Samsung Galaxy S10, no longer seemed to be able to connect to network data anymore, and I did everything except factory reset to try to fix it because I have too much on it I don't want to erase and backing it all up is too difficult (some apps are out of date and no longer supported, etc) especially without knowing for sure that a FR would work.So, I bought this phone as a sort of last ditch solution.  Honestly, it's better than I expected.  Nice screen size.  Looks decent.  Has all the capabilities I need on a daily basis.  However, I will say this: there are lots of elements of this phone, despite it being four years newer than my Galaxy S10, that are below the S10's specs: screen resolution is a big one, as is processor speed and RAM. Superficially is the exterior which, unlike the Samsung, doesn't have tempered glass, but I actually kind of like the exterior of this slightly better even if it does look less \"premium\" because the S10's glass on the backside of the phone just smudges and scratches.  Also, the phone is about 6.7oz or so, so it's heavier than the S10 by about a half oz.In terms of the other elements of comparison I noted: RAM is 4gigs vs the Galaxy's 8 gigs, and the Qualcomm Snapdragon 4 Gen 1 is definitely a more budget processor vs the Galaxy S10's processor specs.  The biggest though is the screen resolution at 1612x720 vs the Galaxy's 1440x3040.  The PPI (pixel density) is essentially half that of my old phone, so I definitely notice that in watching videos, and I'm sure you will too if you're going from a more \"premium\" brand.The good?  The camera at 50mp vs the Galaxy's 10mp, the battery at 50mAh which is bigger (but no wireless charging), the screen size, the exterior styling which I actually like, and of course the elephant in the room which is price.Is this a good deal for the price?  Absolutely.  I will be keeping mine.  Though the specs aren't as good in critical areas vs my old phone, nothing beats owning your phone outright at only $150 and not having to be tethered to a network or make payments.  So is it worth it?  Absolutely.  Just don't expect it to perform at the levels of any \"premium\" brand in terms of multitasking or expect the same kind of beautiful granularity on videos.  It's a budget phone, after all, so expect some compromises, but it gets the job done and again, the price is only about 1.5x the *monthly* cost of buying a premium phone from Verizon etc.  So literally, after about 2 months it's basically paid for itself vs buying a \"premium\" brand phone direct from the big networks.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Model Still Checks All the Boxes",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I bought a couple previous versions of this phone and have always been pleased with the choice. As such, when an app started not supporting my last one I realized it was probably time to upgrade. From what I can tell this one is going to at least meet expectations as well.The battery has great life (it will last a few days, even with some streaming) and recharges quickly. The price is very good for the quality. It's perfect for a person who needs a phone that meets all of the basic needs for a smartphone, has great battery life and will not break the bank if you accidentally drop it in the lake.I have always really liked the gesture feature that lets you turn on the flashlight with the shake of the wrist rather than having to unlock the phone and find the button. Really handy if only have one hand free (think trying to rock a baby with the other) or need it turned on quickly"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I've purchased two of these phones for different relatives. Both have worked well. Each was on a different cellular network. Overall, very functional phones that do pretty much everything that you need. There are certainly higher end phones with better cameras and more performance but I never found this phone lacking for the average user. The phone is great for calls, web browsing, basic apps and basic photography."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the price.",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "An excellent value. I've used this phone for about a year now and it's been great. Charges quickly. Battery has a long life. The only disappointment is the lack of a wide angle camera. I'd absolutely buy this phone again for the price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the money",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "This phone replaced a eight year old Samsung S6 that just wouldn’t die…well, until it did lol.Shopped the Verizon store and really didn’t feel like spending $1k on a new phone, or upgrading plans to get a discounted phone. I’m an old retired guy who doesn’t need the latest greatest phone or a costly unlimited data plan just to get a “free” phone. News flash, nothings ever free….fwiw Verizon’s “free” phone would have added nearly $100 a month to our Verizon plan. Found this unlocked 2024 model Moto 5G on Amazon for $149, and I’m glad I did.Even an old guy like me was able to resister this phone to our account from my ez chair, swap the SIM card over and download all my photos and contacts over in about an hour, all from the comforts of home.This Moto 5 has great battery life and works like a charm. Great camera and does all I need it to do and much more. Has some really cool features too, like fingerprint and facial recognition ID, a three finger screenshot feature and I’m sure there’s more, I just need to borrow a 10yo kid to show me how.If you’re looking for a rugged low cost new (2024) phone this one seems tough to beat.And as a bonus it’s a Made in the US Motorola product. Chicken dinner….",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not expensive, but a good solid phone for the price",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Phone has a lot of features. It was easy to setup all my software on it. Price was right for what you get."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Recommended but One star off for size and screen durability",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "I know I shouldn't fault the phone for its size but I just think all phones in general should allow for one handed typing without changing the keyboard. So, this phone gets that.I do like the overall phone aesthetic and I haven't had the issue with the faux leather attracting dirt and the like.The screen is not that durable. I have had many Motorola phones over the years and they almost always take many drops and the like without much of an issue. This one I dropped from hip height once and it cracked the corner of the screen. It may have just hit perfectly, but still disappointed after having it for only a couple weeks.It is fast, nice screen, and the bloatware is easily removed. I recommend.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wonderful phone. Better than bigger brands.",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I have purchased the larger brand phones and none has pleased me as this phone. It's easy to set up and use. All the same features and an amazing camera. My pics are clear and crisp looking. I just love it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I expected better from a phone in this price range.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Pros: Fast, 8GB RAM, great battery life, easy to use like any other smartphone out there, 50MP rear camera, good buttons, good feel.Cons: IPS screen is pretty bad in the sunlight, not water resistant AT ALL, no notification LED(this irritates me a lot), lack of future updates(has Android 15 now, but probably no more major android updates, disappointing). Compass is a little iffy even after calibration(the silly figure 8 or 3-axis dance). I did manage to make it accurate once(pointing exactly north) then wiggled it a little and it decided to point 62° NE. Little to say, I hate the compass on this thing. I'd expect a compass to be crap on a sub-$100 phone, but not $180.Knocking 2 stars off just for the craptastic compass, the lack of a notification LED, and the lack of future updates.If Motorola decides to update the phone more, I'll update and give another star. If I manage to get the compass working correctly, I'll update and give yet another star. But I wouldn't hold my breath. This might be the first and last Motorola phone I purchase."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone at good price",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "I like that it works as advertised. Sound is decent screen is good, storage fine for my needs. Had bought a Moto Razer Plus 23, and really was not as durable, didn't reflect in car like Razer did.For a refu6user it's a great phone so far, and has an external jack for headphones....... Battery is good speed we go to fast anyway.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great phone for the money",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "You just can't beat Motorola when it comes to phones. Works great and holds a charge for several days. My third power g phone and I'll be buying more in the future. Motorola is the only way to go",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Might not be exact color",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Ordered sage green but the phone is Grey. That's the only reason for a 4 star. Other than that it's a great phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    5g is the sheet",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Great phone for the price. I like the speed of 5g. But I like the coverage of 5g better. I can text in places I couldn't before. I text and send photos for work all the time. Now I don't have to walk outside to send photos."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I've had it only for a couple days now, but so far this phone is really worth its money. Battery lasts long, 8 ram + 8 ram extendable memory, esim, physical sim alot, sd card slot, NFC, nice camera, everything works as it should, so I recommend it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't include charger and must use you card from your old phone on buy a new one.",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I bought 2 to replace our old phones. All my data didn't transfer. At first they keep popping up adds for Tic To which is very annoying. You must use the card from your old phone(they don't tell you) and the don't come with a new charger (they don't tell you)."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very easy to set uo",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Only got this yesterday so this Is a very preliminary review. This was unbelievably easy to set up wirelessly. I Like to play music on my phone. The sound is great. No complaints yet. Update: Got this to replace  my moto g 5g (2022) because it wouldn’t update to android 14. I’ve used it a lot. It downloaded the fm radio app from my previous phone and it work perfectly. More updates in a few months.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "This replaced my 2018 z3. This phone works great just as my old z3 did. Had it close to a year now, still getting 3 to 4 days on a charge."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MF Beast of a phone",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "This phone is a beast last me four days on a charge with regular tasks like text, email, calls ECT. And most games run smoothly . Camera is decent for pictures. And it pretty snappy on speed  so if ur looking for a nice phone but this or 2025 model of the g power .and pray and make that cornbread yeee yeeeh",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good sturdy phone for under 200.dollars",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The camera quality wasn't quite what I wanted but this phone was pretty sturdy and I dropped it a lot without a case or any sort of protection before I even put a dent in the screen and it was still usable. I feel like there is a little bit of lag compared to Samsung galaxy's which I am more familiar with. The battery was definitely better than Samsungs I have had. It had a nice weight to it and was very sturdy. I loved the fingerprint reader on it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for your teen.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "My teen has dropped phones in the lake, broken screens on cement, I'm punished their phone in a variety of ways.  This phone is fairly inexpensive to replace and fast enough for them to do what they want with a battery life that keeps them going all day at school."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone works well.  I really wish there were fewer pop ups and stuff like that.",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "I'm really happy with the look and performance of this phone.  Phones seem to not be performing as well as they used to, consequently, I really took my time making this decision.  I'm really glad I chose this one!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Motorola",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Good quality for the price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely a steal",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I have always loved Motorola phones they are so strong, have amazing battery lives, are so easy to use, and have new and exciting features. One thing I will note is that the charging ports will eventually go out on these phones quicker than most."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    * DO  NOT ORDER ANYTHING FROM MOTOROLA WEBSITE *",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "* Be careful when ordering from the Motorola website.*  On 1/3/25 I ordered the Moto G Power 2024. A couple hours later I noticed in a confirmation E-mail that I was being sent the Moto G Play 2024. I immediately sent them an email of the issue and called their \" Customer Service\". I was told it was too late to cancel and it was being shipped. I called back on  Monday- 1/6/25 and was told not to accept delivery so the return can be processed quicker. I was then informed to order the Moto G Power 2024 on Amazon for faster delivery. That makes $380 tied up on 2 phones. I even explained to them that as a senior citizen on a fixed income that this is a hardship to me. It is now 1/18 /25 and the returned phone has not been credited to my Debit card. In the meantime I have been given  a complete run around by Customer Service. \"Don't accept delivery of wrong phone\", then - \"You should have accepted then returned\",  \" I assure you I'm following this case closely\",  \" It's your bank holding up the return\"  ( wait, it gets better)  , \"3-5 days after return is initiated\", and even was hung up on a couple of times.Now my checking account has a negative balance with an additional $35 overdraft fee. The final blow is when I asked if they could compensate me in any way for #1, Sending the wrong phone, and #2, the misinformation I was told and now the long delay in return credit. There answer- \" We can give you 10% off your next purchase.\" 😡",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the money",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "A very affordable and functional mobile phone. It has most of the features that my former Samsung Galaxy had, which I really liked. I wish the Motorola had more and better sound selections as far as ring tone and notification features goes. The ones installed are too electronic, fake and boring for my taste. But other than that, it is a wellrounded, functional and very affordable mobile phone. This is the 3rd one I've purchased and will most likely continue to buy.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phenomenal value",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "I use the Moto G as a second phone for hotspot/streaming, but sometimes I wish it was my main phone because it has so many cool features. The only reason this is not my daily driver is because the top tier phones have better cameras. The double flick of the wrist to turn on the flashlight, the physical fingerprint reader, the sd card slot to expand storage, the headphone jack, the large battery, the good looking screen, the smooth running OS (I do recommend deleting some pre-installed apps); it's got a lot going on for it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a phone, no wires ma",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Good solid dependable phone.  It doesn't have blazing speeds, but it's fast enough for me.  Does everything I needed to do.  At a reasonable price",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid but not spectacular value for the price",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "Came back to Motorola from an absolutely god awful Pixel 8A. I've had mixed results with the G Power phones (2020, 2023 and 2024) and while this isn't the phone I fell in love with in 2020, it is leaps and bounds ahead of the 2023 version that made me abandon the brand entirely.Pros:- It'll run most anything fine.- Minimal bloatware on the phone.- Love having a SD Card expansion back to expand the amount of hard drive space on my phone- I like the faux leather back finish on the phone, feels better than the plastic back of most phones and is good if you have issues with phones slipping out of your hands.Cons:- Brightness is all over the place.  It feels like 91% is retina burning and 90% is too dim. Not sure how to get a better balance.- Battery won't come close to what they're claiming; I'm not a power user (1-3 hours a day gaming), but the battery just bleeds life. Can have a full charge at 7 AM and by 4 PM it's hanging around somewhere between 40-50%.Overall, I'm happy to see that this wasn't total junk like the previous year installment of the series was.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great and low cost",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Love the phone. Really easy to connect to my old phone and bring over all my apps and everything. Don't understand why people want to spend $1,000 for a phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "If you want a reasonably priced phone with a little bit smaller size this is a great choice."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid and worth every cent",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Sturdy and works very well - solid and dependable. In today's market of stupidly over-priced phones, it's a great deal for the money. They technology is 2-3 years behind, yet it is well-tested tech proven to work really well without breaking. It does everything you need. I just recommend getting the largest internal storage available because the SD cards are no longer able to store and run apps. They can only store data like pictures, music, and documents. This change is disappointing, but all the manufacturers do this with the SD cards, now.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Moto Upgrade",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Good size phone. Great camera features. Easily switches between apps. Mostly upsides to phone with the exception that it will not be able to upgrade to the next Android version and does not have battery optimization feature. Recommend to buy up to mid 2025. After mid 2025 look to the upgraded model",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome Phone!",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Amazing phone! Fingerprint reader is positioned within the right facing power button which is perfect. The battery lasts for days based on usage and charges quick. Hotspot enabled, NFC capable, and easy setup with existing Google account. Memory capacity is more than adequate with SD card expansion option. Picture quality and camera lens are awesome. There are some pre installed apps that aren't needed but can easily be uninstalled. This phone is an absolute steal at the current price! I definitely recommend. The phone is unlocked and works with ATT.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for what I needed",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "I broke my old phone, and needed this one fast. I got it on time. in good condition, also the quality of the phone is very nice and pleasing to the eyes. I was very surprised to feel the soft back portion of the phone, I love holding this phone",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functional phone for the money but the pictures are not good.",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "For the money this is a decent phone. The sound is nice - it plays back loud and in stereo - that's a plus. On the downside, there is a noticeable lag when opening aps, surfing the web, using social media - something I don't ever notice when I'm using a more-expensive android or apple phone. Also - the camera is not good. Images often come out blurred, focus is not great, overall image quality is \"bright\" and not pleasing to the eye. For this reason alone I regret buying this phone. I'm going to see if I can get through 1 year with it so as not to waste a functional product, but if picture quality for sharing on social media is important to you - do not buy!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Great phone for the price.  Long battery life.  Meets my needs."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for the money. We don't use for games",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Good phone for the money",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great camera and much improved from previous models.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Works great, lots of storage, great camera, fast, good speakers. Very satisfied. Big step up from previous Motorola purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice replacement phone.",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Phone was great and worked just fine.  I hated the apps and bloatware that were on it though.  I have since changed carriers and phones but for an unlocked cheap phone, this was a great option.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I bought this at the end of 2024 as a Christmas gift for my older brother who is on the autism spectrum. He loved the phone at first and found it easy to use. However, after just ten weeks of responsibile use, it is permanently frozen on the Hello Moto startup screen. Rebooting didn't work. Couldn't do a factory reset. Can't take out this battery. This was a disappointment.Update: after a lengthy phone call to Motorola customer service, where my call got escalated to an upper level technician, I was able to successfully perform a factory reset and the phone seems to be working again. Fingers crossed..."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The Inspiration for All Android Devices",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Excellent item. Plenty of space with room for expansion. It's what every Android Device should aspire to be. All thumbs up x infinity! ♾️👍🏼♾️👍🏼"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My Motorola cell phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I just love my phone n8ce looking does all my tasks well very happy with my cell will oder again thank you"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fairly well",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "I purchased this Moto G 5G phone for my elderly parent, to replace a much older Motorola phone that was quite unhappy.This one activated quickly and didn't have any large dead spots on the touchscreen.A couple minor issues, but we can work around them most of the time. Priced quite reasonably.Motorola Moto G 5G | 2023 | Unlocked",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very good first Smartphone",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "This is my first Smartphone ever, and I'm loving it. It's easy to operate and the most complicated issue that I faced was finding a network carrier that I liked. I started from the very basics. I had NO IDEA what a SIM card was. It took some research and chatting with wonderful techs at various companies. This phone is unlocked, so I pretty much had my choice of networks. Don't be afraid to ask questions, and be sure that your phone (and all the features you want) are compatible with your wishes. I am still learning as I'm going along, and loving every moment of it.I only have one small complaint: I had to buy a charger, as I had no type C ports. They did include a cord, but no electrical plug in. There is also a small key-like item that helps you change the SIM card. It was very helpful. I would've also liked a physical manual, instead of having to scan a code, but I worked it out. 5/5 stars.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Budget Smartphone",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Bought this phone recently for my mom who was in a need of a new smartphone upgrade. She loves the Motorola brand and had a previous phone the Moto G7 which now disconnected. I bought the Moto G 5G as an early christmas gift and as a much needed upgrade. The phone came in next day through Prime delivery. When I opened the box and packaging of the phone it's very environmental friendly and very satisfying. The contents of the box are environmental friendly. The color of the phone which sage green is great and looks gorgeous. The camera and leather back makes the phone's aesthetic is extremely satisfying to the touch. The durability of the phone is very strong and great to the hand. It's great to put a screen protector and phone case for extra protection. The set up of the phone was easy and great. The speed of the phone is like a premium smart phone. The memory capacity is amazing and storage space helps out a lot. If you looking for a phone for your relatives and parents this phone is amazing. Highly recommend.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is pretty good but it is NOT UNLOCKED. It does work with Verizon.",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Had to return the phone because I was unable to successfully transfer my phone data between my old samsung and the new motorola. The motorola offered no solution to transfer data. The samsund had Samsung Switch as the only option, but refused to work with the Motorola. It would not allow the transfer to begin. Worked on it for a week. No transfer possible via wifi, sd card, usb c data transfer cable, nothing worked. So I returned it. Got a Samsung A15. Motorola was a better phone in my opinion with far less junk installed that cannot be removed. The A15 however, had a case available with a sliding camera cover. That was a slam dunk as I had just been wondering why nobody was making cases with sliding lens covers, so when I saw exactly what I imagined for a sturdy protective case I replaced both of our phones with A15's, specifically because of the protective case with camera cover, not due to the phone itself. I spent a lot of time going through the app permissions and uninstalling everything I could and the motorola has way more going for it than the samsung in my opinion.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware no charger included but a good phone otherwise",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Bought this phone to replace my 8 year old Samsung. Though it may be a small matter but I expected the charger as indicated the product description and what’s in the box. It was part of my decision to buy this phone. Get no satisfaction from the seller. My friend went to consumer cellular and bought the same 2024 version for$100, the difference pays for a charger.  Live and learn.After back and forth I received a refund to put towards the missing charger. As far as the unlocked phone:It worked when I went to T-Mobile I ultimately went back to AT&T for  my original service to preserve my discount.The phone needs to be charged every day and with my old charger block won’t even get it to100%. I hope when I get an updated charger block this will resolve the charging issue, even with battery saver on.At first thought it was too large compared to my old Samsung but my camera app is 100 times better with interactive thumbnails. Totally appreciate how fast it is again compared to my old version7 android.Like all new phones I had to delete nuisance apps as I just use the phone for talk, text , photos, email and  my household apps, not someone who uses it for games, shopping or banking.Haven’t taken any photos yet to speak about quality.Last update my family member needed a continuous glucose monitor and as new as this device is does not have RFID to read the sensor for glucose reading.  Seems you can’t download it either.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Value and Performance",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I was in desperate need of a new phone when I came across this Motorola Moto G 5G (2023). For the price, I decided to give it a try. So far, I'm happy with my decision. I'm not someone who relies heavily on my phone for advanced tasks, and this phone offered everything I needed at a great price. I can browse and stream without issues, and the 48MP camera captures great photos. I especially like the macro vision lens for close-up shots, which my previous phone didn't have, and the 120Hz display makes scrolling and gaming pretty smooth. The battery life is great. I easily get through the day without needing to recharge. The Dolby Atmos sound and stereo speakers enhance the audio experience for watching videos, listening to music, or playing games, which I do a lot. Overall, this phone is an excellent value for anyone looking for a reliable device without breaking the bank.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a really good phone at a good price with a quite decent camera",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "Long time used or Motorola phones.  Last one lasted well until dropped right on screen after a gym visit.1. Excellant battery life, often go more than two days without needing a charge. Big plus2. I'm not a gamer, but I do surf and watch U tube a lot. Screen is good, has excellant brightness, but contrast is not as good as with high end screens (totally expected) but I'll keep my cash instead3. Camera is good, really nice color reproduction and good details. Not as clear as my daughter in laws I Phone, but I saved a LOT of money.4. Storage capacity is excellant with the ability to add a compact memory card.  Big plus in my book, these are pretty cheap actually. Amazon Basics microSDXC 128 GB for 12 bucks.  I run a 300GB size because I love videos.  Ohttps://www.amazon.com/Amazon-Basics-microSDXC-Memory-Adapter/dp/B08TJRVWV1/ref=sr_1_1_ffob_sspa?crid=13KWFBDDNU05L&dib=eyJ2IjoiMSJ9.YsDJmjEs8eRQ5lQSPqzljlnEr-iu0RJfWqqkBtOqnV4Ss6HTtweBJ3W8fTdvrmaILWTmkoLEmX5KT67aamhD13dTSaqzWJCobqnS9fn1AWryike0YTATvwwZY3iLVuPdNIGkJzfXUHjODH4lh3rVX3Pu0Fc4Stp3nGuAALxuwx7bNlyPtSi2Ep_Sq2HxjyP7j-DJ-GtknQlvlgcbaCq-rMmIhsBQ4wylaw54Nri5WQs.y97aAf3Aiauu0m5hCWB3-INRwN9jly9_X6yIte0PZHc&dib_tag=se&keywords=phone+memory+card&qid=1730405322&sprefix=phone+memory+card%2Caps%2C158&sr=8-1-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&psc=1ften cheaper than buying the memory in the phone imho. Plus when phone is done you can reused it.5. Size is perfect for fitting into shirt pocket for me at work, even with a case on it.6. Sound is actually decent, but does not emulate hi fi. I realize the phone environment is a huge challenge, but the sound, even with music is not \"Tinny\". Volume is good on highest setting and can easily be heard when sitting on my desk across the room. I've heard phone get a lot louder, but if I want a ghetto blaster I do have some speakers for outdoors and the like usage.7. I'd say you get about 80% of the usage and quality of \"Flagship\" phones with virtually all the functionality at a cost that's about 25-30% of flagship prices. I've had phones fly away riding my motorcycle (Use a GOOD mount lol), dropped, knocked off while working on car and a lot of other usage cycles that are not amenable to good phone life.  For me it doesn't pay to buy top of the line. But I do like having a solid tool to do the job, and this one works great for that.  Stay safe.",
      "helpfulVotes": 117
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid phone, everything works, great battery",
      "date": "Reviewed in the United States on December 25, 2023",
      "body": "Note that I don't have a use for NFC, which I *think* it doesn't have, and I don't use facial recognition, so I can't speak to that.  And I don't play games on it.  But everything I have used works great.Besides working fine, what else is there to say?First, the battery life is great -- I put it on a shelf to just be an alarm clock for 24 hours, and it used about 15% of the battery.  Even with some web browsing and a lot of podcast listening during the day, I have never seen the battery below 45%, charging it once a day.The screen is bright and clear and big (for the phone's size), with refresh rate of 60Hz normally and 120Hz while scrolling (you can tell w/developer tools).  There are better phone screens, but I never find myself wishing it were better.  There is a black dot where the selfie camera is, but that's the price you pay for a wall-to-wall screen.The rear camera is 48M pixels, like the new Google Pixel phones.  I don't know if it's actually as good, but if I want to do art photography, I don't use a phone.  It has a separate macro lens that you can select easily with the camera app, and I have never had trouble getting a sharp photo of anything, yet.  Like the screen, I've never wished it was better.The built-in speakers are unexpectedly good: there's one at each end, and, yeah, they do stereo as well as you can expect for speakers 4\" apart, I guess, but the sound quality and volume are significantly better than typical for reasonably-priced phones.The cell reception is better than the Pixel phones I've used, but, surprisingly, not as good as some Samsungs (cell reception used to be a real strong point for Moto).Unlike most top-tier phones, it has an SD card holder (as well as a physical micro-SIM holder).  So you can add another half a terabyte (512GB) of storage for $20, if you like.  Eat your heart out, iPhone users.  According to Moto, it can take up to 1 TB (1024 GB).TL/DR: I would say this phone does everything well (of the things it does), without doing anything brilliantly, except battery life.  For its middle-of-the road price, it's a VERY good choice.",
      "helpfulVotes": 67
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Moto G - WiFi performance issues",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "*Feb 20, 2025 Update*Honeymoon period is over - two-month update:  After about a month and a half after purchase, the phone started having issues with WiFi connection.  It loses WiFi connectivity almost daily and sometimes multiple times a day.  Other devices on the same network are not experiencing any connectivity issues.  Only Moto G 5G loses network connection for 1-4 minutes at a time.  A quick Google search shows that it may not be an uncommon issue.  I will try to do some more troubleshooting to determine if it is related to WiFi frequency (2.4 vs 5GHz).  Either way, rather disappointing.  Changing overall rating from 3.5 to 2 stars. Overall, the phone is a good value.  Realistically, I think it is 3.5 stars and since I have to go with a whole star rating scale, I am giving it a \"4\".It seems to be a good budget phone.  I had to upgrade due to an ancient version of Android on my old phone and very limited memory.  The days of having an option to move apps to an SD card are long gone and 32GB of memory just doesn't work when OS takes up almost 15GB.Let's move on to the things that matter:- The Good  - Battery seems to last for a long time with an average usage pattern (easily 2-3 days).  Yes, the phone is being used primarily as a communication device (voice calls, SMS and email messaging).  Occasional video playback around 30% of the time.  - It is responsive and very fast on WiFi and 5G (big red) network.- The \"Different\"  - It is big and bulky.  I have upgraded from 5.2\" to 6.6\" screen.  The screen is significantly larger, but the phone itself is thicker, too.  One hand operation is no longer an option and definitely not practical.  - The display is brighter but for some reason seems blurry.  I cannot find a comfortable balance between screen sharpness and brightness.  I tried different display settings but I am still searching for the perfect (or even acceptable) balance.- The camera  - Image quality is good for occasional use.  I am not a professional content creator and find it good enough.The phone was on sale and my impulse buying urge took the better of me.  Am I disappointed?  No, not really.  I read the specs and for the most part I knew what I was getting into.  However,  if anyone is considering Moto G, take a look at Moto G Power.  It seems to have a better display (at least on paper) and maybe a better overall product/value for a few more dollars (at the time of this review).",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Celular",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Buen teléfono precio calidad",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is HORRIBLE!",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I bought this cuz it's hard to find a phone that works with US Cell's stupid CDMA proprietary network, uggg.The phone is okay, although there are a few things I don't like, like scrolling up at break neck speed if you touch it anywhere on the lower half of the screen. Also I can't figure out how or if I can get a notification when text messages are sent...I get a tiny dot on the App only.The poor quality battery is a deal breaker: It doesn't even last a day so I'm always plugged in at home.I will not buy this brand again and by the time I want a new phone, I won't be using US Cell either."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Works well good for the price dropped it a couple times no damage"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WOULD BUY AGAIN",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "VERY GOOD QUALITY AND EASY TO SET UP"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First touch wasn't responding/fix",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "Maybe it was just my phone, but when I first touched the screen, the phone wouldn't respond until I touched it a second time. And if I waited to long it would do it again. And then when scrolling it was buffering way to long.  After searching for solutions, I finally found it.  Settings/Display/Display refresh rate/60HZ and problem seems to be fixed. I may switch to 120HZ to go faster",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value,multi year service,have purchased-over the years 7  moto g type cellphone s",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Like that camera lenses have been improved each year…good strong batteries,,,,last two purchases have added POETIC SHELL CASES….I COULD PAY MORE FOR A CELLPHONE..ALWAYS BUY WHEN ON SALE …. I LIKE THE OPERATING SYSTEM…PLENTY OF RAM..IMPRESSIVE PROCESSING SPEED"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pay attention to description",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "I got exactly what I ordered and I am pleased with it. Two important notes:1) The actual product changes when you change color, not just the color. The blue and green are the \"Moto G.\" The purple and lilac are the \"Moto G Power.\" Those are different models, not just different colors.2) I always worry if it is really \"unlocked.\" It is. I'm successfully using it with Verizon.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    PHONE IS GREAT",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Phone is good , fine , unlocked , worked with metro ,  transfered over . One thing Is the charger it came with broke in the strangest way ( see photo) . I never seen a charger break like that and was stuck in the phone for a second. Kinda strange but the phone is GREAT .  The charger it comes with,  NOT GOOD  and comes with no outlet / BLOCK to plug it in / just cord , broken one at that ...",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So Far, So Good",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I have had this phone for a few months now and it seems to be great. It has many more features than my previous LG phone. I like it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy with this phone!",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Upgrade from Moto E 2020, and I couldn't be happier (I only hope it's not reading this over my shoulder:)",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Ok so far"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone for the money!",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Nice phone for the money! Screen color and size are great! Battery life is good! Good audio sound!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Surprisingly pleased. At first I thought this doesn't have thumb print, but does.",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "Solid phone, camera is decent. The only time I've noticed the 1600x720p screen having a issue is when I'm watching youtube videos. If you go on Netflix or another streaming app it look absolutely fine. I recently had a big issue with the company I was with changing prices. So I started doing some research, and started looking into unlocked phones. They seem to be somewhat older cellphones and pricier than usual. This Motorola is somewhat of a downgrade from the phone I had. Biggest difference being previous phone had a 1080p screen, gorilla glass, and crazy stupid fast charging. But, I couldn't change to a different cell company due to the android I had was not unlocked. That's what brought me here. I've had this phone for about a week, and I'm happy with it. I had a Motorola cell like 5-6 years ago, and one of my favorite features is the karate chop flashlight feature. Twist camera feature is handy too. It's nice to have that back again. I took some pictures of plants. The 48MP camera pics looked really good to me. I grew up on tube TV's, and VHS tapes, so the barley noticeable lower resolution screen doesn't bother me at all. If your a cell phone connoisseur this might not be the best phone for you. For the price though and the freedom to pretty much chose any company you want, I think this phone is a great deal. Oh, and the new cell phone company was able to activate this phone right away zero issues. I paid full price for a new one, but at the time I'm typing this there's a used one on here for $100. I wish I would've snatched that. Do your homework and check all the specs.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works but small issue",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "I like the phone and it works good. But for some reason it keeps not recognizing sdcard. Even though I bought a brand new one that said \"amazon approved\". So if there was anything stored on it, it gets errased because I have to reformat to have the phone see it again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy with my phone.",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "I'm good with it. But, I also don't utilize my phone like so many people do these days. It works for me !!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Real Phone and Not A Scam",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "It's a real phone delivered to my door within 24 hours and not a scam. I popped in my SIM card and it worked. Pretty good deal for $150. As for the phone itself, compared to my 7 year old midrange phone that just went kaput on me, it's pretty decent. The only thing I don't like about it is it is an ad machine full of ads galore. Another thing I don't like is it comes loaded with bloatware and apps I will never ever use. It's going to take a couple of weeks (tinkering with it sporadically) to get it set up the way I want it. But like I said, $150 is good deal. My wireless provider charges nearly 4 times price for the same phone. Let's see if I can get 7 years of use out of this one.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    i expected better performance",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I do understand this is a cheap phone, i am i not comparing it with a 800+ device. My previous 2 phones were pixels... 5a, 6a, so not very new either.My opinion after about 2 weeks: it's just \"ok-ish\", and that's only because it was on sale for 180.It is full of bloatware and it always wants to update update update... i feel like that's all it did for the first 3 days non-stop. Updating, restarting, updating, restarting.The side fingerprint sensor is awkward for me.The device feels slow to me, probably because of all the extra apps is has running all the time.Camera is pitiful.It freezes sometimes. Can't really tell if its the device or some app thou.The best thing about it (and most motorola phones) is how you can turn on and off the flashlight.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    An amazing budget phone.",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "128 GB ROM, 8+8 GB RAM. Very quick. Camera has been improved over earlier versions, has software similar to steady cam, hard to take a bad picture with it. Can insert a 1 TB SD card."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Motorola Android is the best on the market",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Winner, Winner so glad to have this Motorola after trying the Google Pixel dud!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wifi calling not working",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "I chatted with Motorola agent who insisted it's a carrier issue so I went to Mint Mobile website and make sure that wifi calling is enabled there and got a confirmation text which tells me the next step it to enable wifi calling on my device.  I can;t figure out how to do that on my device so I went back to the same Motorola agent, who told me to search for \"wifi calling\" under settings.  I told her there was no result.  She said that means my carrier didn't enable it.  I said I am pretty sure Mint has done whatever they could to becuz the Mint agent stayed with me for about an hour and went through all the possible steps (checked IMEI numbers, reset mobile networks, turn airplane mode on and off, etc ) with me, so the problems is with the device.  But the motorola agent just repeated the same thing AGAIN AND AGAIN AND AGAIN:  GO TO YOUR CARRIER.  So the problem is still there.  very frustrating.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a twin sim phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I bought this to replace my older Motorola phone and I need a twin sim phone so I don't have to carry two phones, I have a foreign number to. This is not a twin sim phone, there is only one position for a sim and the second one is an e-sim??The phone would have been a good phone for me had it been a twin sim phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phantastic Phone",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "What a great phone.  Not the first moto in the family, they don't disappoint.  I don't really see how a $600 phone would be any better, except for a bell or whistle I would rarely, if ever, use. It does what I need it to do, anyways, and then some. Great feel. Fantastic color and resolution, fantastic photos. Much less blurry than on other phones, I would say top notch. Everything else in the phone is smooth and works great.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I didn't receive the power adapter USB cord or SIM tool but...",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "It hooked up to my car in about 5 seconds so I can hear my playlists again. What can I say, all cell phones are basically the same anymore. This one has all the features I need and let me uninstall or disable the ones I don't. It even has a jack for wired headphones that I can use when I forget to charge the others.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its good",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Its a good phone .battery life long.screen size is fine.sound is good color is average.overall its a good package in this money."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's okay, a little bit glitchy",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "I got this phone to replace a TCL 10L that was 3 years old and no longer receiving security updates. I have to say that this is the first time that I have purchased a new phone and not been thrilled with it. The phone just seems glitchy; for instance when I open my gmail even though I am holding the phone in portrait position in my hand, it opens in landscape. Not the end of the world, but when you start adding up little things like this it starts to get annoying.The Moto G Power 5G does have some things that I like. The fast charging is a plus, if it had battery life to go with it it would be great but the battery lasts a day at best.The screen is very bright and the adjustment is all or nothing, just a really bright screen that doesn't dim very well.The phone is big and clunky feeling in my hand - kind of uncomfortable to hold. You'd think they would have tried to make the design a bit more ergonomic.The fingerprint sensor on the power button is annoying, I had to use my ring finger so that I wasn't turning on the phone Everytime I picked it up.I'm not really thrilled with this phone. Seeing how it is only going to get one system upgrade I will probably get something else by the end of the year.It does get a 5g signal - it does that good, but the rest of the phone doesn't warrant paying what they are asking. Had to go with three stars ....",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT compatible with Xfinity Mobile",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "100% confirmed as I just tried to add the device to my mobile plan with Xfinity. I gave the product a 4 star review as the phone is great, especially for teen/pre-teen users."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cant beat this deal for $179.00..",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "For the price & functionality you'd be hard pressed to find a better deal! I've had mine for just over a year now!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the price!",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I bought this for my mom. She uses only a few apps and basic features, but she is physically hard on phones and ends up needing a new one every couple of years, regardless of the brand. Given that we'll likely be replacing it in a couple of years anyway, I think it's perfectly fine that this phone will get just one Android update.I've set it up for her and gone through all the features and settings. What can I say -- it's a modern Android phone with everything she needs and more, and I feel better knowing that I didn't spend have to spend a ton. It may not have the brightest and sharpest screen, AI tools, or other flagship bells and whistles, but she doesn't need any of that.I also considered getting her the Galaxy A35, but I decided on this Motorola because of the rubbery back material, which will be better for her than glass.The pale lilac is more a pale pink than lilac. It looks nice with a floral case (pictured).",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First phone was a dud. Replacement ok so far",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "The first phone I received was a dud straight out of the box. Issues with the speakers and moto gestures not working properly, intermittently, or not at all. I spent a few hours with Motorola troubleshooting and they offered me a repair if I sent in the phone. Motorola offered no replacement because I bought the phone from Amazon (even though it was the Motorola store on Amazon). After hearing the story I just typed out for you, Amazon eventually sent me a replacement. And, so far, this phone is great! I'm giving 3 stars for the hassles. However, it would've been 5 stars without the hassles."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Smart Phone!",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "For the price it's not a bad phone. Maybe a little too much blote but I guess if you like all that it's okay.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, but ...",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "I read several great reviews for this phone. My old Moto G7 had started shutting off and I had never liked the tinny sounding audio it had, so after 4 years decided on this Moto G 5G 2023. The box had previously been unsealed and opened which I expected since it was advertised as ' used like new '.I ordered the 'Ink Blue' color.The phone I received is a  very very dark gray or black with subtle sparkle or metallic appearance. It seems to be the Black Mineral color, although the box it came in is labeled as 'Ink Blue'. The invoice states it is ' Ink Blue '.The charger that is advertised as in the box is missing. The charge cord did come in the box.This phone gets hot! I played a couple YouTube music vids on it and the phone actually got hot and vibrated from the music.I guess I misunderstood what they meant by ' used like new '.Even though I ordered the Ink Blue phone and received a Black phone, I probably could have kept it even though the adapter was missing, but I am afraid to use this phone as it gets hot so I sent it back.I've ordered several phones from Amazon in the past and only ever had one problem. They've always resolved any issues with any orders.I'm looking now at some other versions of Moto, Nokia and Samsung phones.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Motorola exelente marca",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Producto de muy buena calidad ya que es pionero en telefonía celular lo recomiendo 100%"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't beat these phones!",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I been using motorola phones for 15 years now. I have owned every phone this is the best bang for the money at a quarter of the price. I use my phone on all media apps and for work I never had a problem ! No Doubt!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like this phone",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "I like this phone better than my iphone. I got this one just in  case of emergency but I use it more than my other phone. Very responsive. No lag and haven't had any issues with apps freezing or closing. I like the security features. I like the space the size and wish I would have got another color but thats not important besides phone case will cover it. Battery life is great I was playing a game on it for few hours without needing a charge. The screen is bright turning the brightness down didn't really work. Camera is great I haven't learn all the features but it has a guide. The touchscreen is very responsive and smooth to touch.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life seems short.",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "Old moto worked fine but only had 64 GB, and I was using most of it.  But it seemed at first, old moto battery lasted forever.  This seems to drain quicker.  No change in my usage.  Not watching streaming.  I thought brand new batteries would last several days at least.  My old moto was several years old, and battery last over a day.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Great phone for the price. So far it's working flawlessly and no issues. I like that I can use it with any carrier."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't include a charger.",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "It would be nice if a charger were included (it isn't), especially since the instructions specifically caution against using third party chargers. The description says, \"charger MAY NOT be included in some areas\". No charger offered in the 'buy it with' list. Have not yet discovered if Amazon can even supply the correct charger. As to the phone itself, too soon to tell, but it is a Motorola and the reason I bought it is that I liked the previous Motorola phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!!!",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Phone works great!  Zero issues.  Functions just like any other android phones out there only fraction of the price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent 5G phone for the price",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "I've only had the phone for a day, but so far I'm quite happy with it.  And it's a huge upgrade from my old Moto G5 Plus, whose battery was wearing out and which seemed to take forever to load web sites or even to display texts.  It's also huge in another respect -- about 3/4 inch longer than the old phone, whose size I really liked.  But I can still fit it in my pants pocket, and I'll trade the less-than-perfect size for the much improved battery life.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone. Wish flagship phones are like this",
      "date": "Reviewed in the United States on October 27, 2024",
      "body": "Highlights:- Real flicker free at all brightness levels (measured with oscilloscope)- Convenient side fingerprint- Decent photo quality with sufficient lighting- 3.5mm headphone jackGave up on flagship phones because all of them use low frequency+deep modulation PWM displays. This LCD phone is really easy on my eyes.This cheap phone is surprisingly smooth and responsive for daily use; However it does get a bit laggy in Google Maps and after fresh reboots.Side fingerprint sensor is magnitudes more convenient to those in-display fingerprint sensors. With it you can easily unlock your phone before it leaves your pocket.Photo quality is also surprisingly good when there's sufficient lighting. Scans document fine. ofc photo is crappy at backlight and night - This is expected for phones at this priceBattery lasts reasonably long.It does cheap out on lots of subtle points, like 1x1 WiFi antenna, usb2.0, but overall still great phone.I wish flagship phones are simply premium versions of this phone, instead of painful flagships with eyeball-killing screens, sluggish in-display fingerprint sensors, and deliberately removed headphone jacks.",
      "helpfulVotes": 52
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Motorola phone I've had so far",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I've tried Motorola power series phones in the past when I was on a budget, and while they were good at first especially with the ridiculous battery life, the performance, screen, and camera quality fell short and overtime the performance degraded more as the phone aged. This phone however, with its 8gb ram and upgraded processor has been great to say the least. Battery isn't as good as the old ones but that's to be expected when running better hardware, and it still lasts me all day easily. Camera isn't great but I don't mind, I expected that and it's still an improvement over previous generations. I switched to this after my galaxy Z flip 4 broke, and I can say it wasn't a huge downgrade at all. I am very happy with the bang for buck this phone offers, and I would recommend it.",
      "helpfulVotes": 3
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is very subpar",
      "date": "Reviewed in the United States on August 15, 2024",
      "body": "I got this phone to replace my old 4g TCL 30 phone, and I'm pretty meh about the whole affair.The good:It's a reasonably priced unlocked android phone, it works with Mint Mobile (and therefore would work with T-Mobile and Metro, ymmv) and is lightweight and slim. It receives and makes calls and takes pretty good pictures, though I'm not a big picture taking person, so others may have issues, don't know. The 5G service is quite nice and allows for a better connection when we are out in the country than my old TCL 30 4g. The screen is vivid and the look of video/pics/etc is pretty good.The bad:Everything is Google, there is no native barebones alternatives like my old TCL 30. It's annoying being asked to set up all the different google apps every time I need to open one... If I wanted to use all the features of each one, I would. Ex: I just want to see the pictures I've taken, I don't want to be reminded to set up the app to save my pics to the cloud every damned time I open it. I use it to take pics of electrical schematics so I can complete my work without returning to the stand book to verify different connections etc ... It's almost like Google saying \"are you suuuuuure you don't want to\" every time like I'm a child or something.... It's very annoying and slows me down.The UglyBattery life is absolutely horrible. My old phone, with the same battery size, could stream Spotify to my earbuds through an entire shift and not be less than 60% battery, even after 2 years of doing this every Mon-Fri for 9-10 hours a day. The first day I used this Motorola the same way, my battery was down to 30% when I punched out to go home. That's absolutely pathetic. If it wasn't for the fact that this was a sub-$200 phone, I would have returned it and gotten another TCL phone. This is the main reason I gave this a 3 star rating. If you don't stream music all day like I do, or use it all day like a younger person then it would probably last longer. As with most things, your milage may vary....Another serious negative is the button arrangement and shared capabilities, I'll explain.The phone has the typical up/down volume button above the power button on the right side of the screen. The issue comes when the power button is also the fingerprint sensor. It's nice to just brush it to open the phone, but it's absolutely annoying when taking a screenshot or trying to restart the phone. It seems to just spaz out when hitting up volume + power button for a screenshot to restart, or any of the other button combos the phone is capable of.Overall, for someone who doesn't stream music it's a decent unlocked phone, but for someone who actually does it's a no go because of battery life. That and the 'Bad' section above is why this is a 3 star phone at best. I honestly feel Im being generous giving it 3 stars as this is gonna be a $180 paperweight when unlocked TCL 50s hit Amazon....",
      "helpfulVotes": 84
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I expected better from a phone in this price range.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Pros: Fast, 8GB RAM, great battery life, easy to use like any other smartphone out there, 50MP rear camera, good buttons, good feel.Cons: IPS screen is pretty bad in the sunlight, not water resistant AT ALL, no notification LED(this irritates me a lot), lack of future updates(has Android 15 now, but probably no more major android updates, disappointing). Compass is a little iffy even after calibration(the silly figure 8 or 3-axis dance). I did manage to make it accurate once(pointing exactly north) then wiggled it a little and it decided to point 62° NE. Little to say, I hate the compass on this thing. I'd expect a compass to be crap on a sub-$100 phone, but not $180.Knocking 2 stars off just for the craptastic compass, the lack of a notification LED, and the lack of future updates.If Motorola decides to update the phone more, I'll update and give another star. If I manage to get the compass working correctly, I'll update and give yet another star. But I wouldn't hold my breath. This might be the first and last Motorola phone I purchase."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    * DO  NOT ORDER ANYTHING FROM MOTOROLA WEBSITE *",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "* Be careful when ordering from the Motorola website.*  On 1/3/25 I ordered the Moto G Power 2024. A couple hours later I noticed in a confirmation E-mail that I was being sent the Moto G Play 2024. I immediately sent them an email of the issue and called their \" Customer Service\". I was told it was too late to cancel and it was being shipped. I called back on  Monday- 1/6/25 and was told not to accept delivery so the return can be processed quicker. I was then informed to order the Moto G Power 2024 on Amazon for faster delivery. That makes $380 tied up on 2 phones. I even explained to them that as a senior citizen on a fixed income that this is a hardship to me. It is now 1/18 /25 and the returned phone has not been credited to my Debit card. In the meantime I have been given  a complete run around by Customer Service. \"Don't accept delivery of wrong phone\", then - \"You should have accepted then returned\",  \" I assure you I'm following this case closely\",  \" It's your bank holding up the return\"  ( wait, it gets better)  , \"3-5 days after return is initiated\", and even was hung up on a couple of times.Now my checking account has a negative balance with an additional $35 overdraft fee. The final blow is when I asked if they could compensate me in any way for #1, Sending the wrong phone, and #2, the misinformation I was told and now the long delay in return credit. There answer- \" We can give you 10% off your next purchase.\" 😡",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functional phone for the money but the pictures are not good.",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "For the money this is a decent phone. The sound is nice - it plays back loud and in stereo - that's a plus. On the downside, there is a noticeable lag when opening aps, surfing the web, using social media - something I don't ever notice when I'm using a more-expensive android or apple phone. Also - the camera is not good. Images often come out blurred, focus is not great, overall image quality is \"bright\" and not pleasing to the eye. For this reason alone I regret buying this phone. I'm going to see if I can get through 1 year with it so as not to waste a functional product, but if picture quality for sharing on social media is important to you - do not buy!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I bought this at the end of 2024 as a Christmas gift for my older brother who is on the autism spectrum. He loved the phone at first and found it easy to use. However, after just ten weeks of responsibile use, it is permanently frozen on the Hello Moto startup screen. Rebooting didn't work. Couldn't do a factory reset. Can't take out this battery. This was a disappointment.Update: after a lengthy phone call to Motorola customer service, where my call got escalated to an upper level technician, I was able to successfully perform a factory reset and the phone seems to be working again. Fingers crossed..."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is pretty good but it is NOT UNLOCKED. It does work with Verizon.",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Had to return the phone because I was unable to successfully transfer my phone data between my old samsung and the new motorola. The motorola offered no solution to transfer data. The samsund had Samsung Switch as the only option, but refused to work with the Motorola. It would not allow the transfer to begin. Worked on it for a week. No transfer possible via wifi, sd card, usb c data transfer cable, nothing worked. So I returned it. Got a Samsung A15. Motorola was a better phone in my opinion with far less junk installed that cannot be removed. The A15 however, had a case available with a sliding camera cover. That was a slam dunk as I had just been wondering why nobody was making cases with sliding lens covers, so when I saw exactly what I imagined for a sturdy protective case I replaced both of our phones with A15's, specifically because of the protective case with camera cover, not due to the phone itself. I spent a lot of time going through the app permissions and uninstalling everything I could and the motorola has way more going for it than the samsung in my opinion.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware no charger included but a good phone otherwise",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Bought this phone to replace my 8 year old Samsung. Though it may be a small matter but I expected the charger as indicated the product description and what’s in the box. It was part of my decision to buy this phone. Get no satisfaction from the seller. My friend went to consumer cellular and bought the same 2024 version for$100, the difference pays for a charger.  Live and learn.After back and forth I received a refund to put towards the missing charger. As far as the unlocked phone:It worked when I went to T-Mobile I ultimately went back to AT&T for  my original service to preserve my discount.The phone needs to be charged every day and with my old charger block won’t even get it to100%. I hope when I get an updated charger block this will resolve the charging issue, even with battery saver on.At first thought it was too large compared to my old Samsung but my camera app is 100 times better with interactive thumbnails. Totally appreciate how fast it is again compared to my old version7 android.Like all new phones I had to delete nuisance apps as I just use the phone for talk, text , photos, email and  my household apps, not someone who uses it for games, shopping or banking.Haven’t taken any photos yet to speak about quality.Last update my family member needed a continuous glucose monitor and as new as this device is does not have RFID to read the sensor for glucose reading.  Seems you can’t download it either.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Moto G - WiFi performance issues",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "*Feb 20, 2025 Update*Honeymoon period is over - two-month update:  After about a month and a half after purchase, the phone started having issues with WiFi connection.  It loses WiFi connectivity almost daily and sometimes multiple times a day.  Other devices on the same network are not experiencing any connectivity issues.  Only Moto G 5G loses network connection for 1-4 minutes at a time.  A quick Google search shows that it may not be an uncommon issue.  I will try to do some more troubleshooting to determine if it is related to WiFi frequency (2.4 vs 5GHz).  Either way, rather disappointing.  Changing overall rating from 3.5 to 2 stars. Overall, the phone is a good value.  Realistically, I think it is 3.5 stars and since I have to go with a whole star rating scale, I am giving it a \"4\".It seems to be a good budget phone.  I had to upgrade due to an ancient version of Android on my old phone and very limited memory.  The days of having an option to move apps to an SD card are long gone and 32GB of memory just doesn't work when OS takes up almost 15GB.Let's move on to the things that matter:- The Good  - Battery seems to last for a long time with an average usage pattern (easily 2-3 days).  Yes, the phone is being used primarily as a communication device (voice calls, SMS and email messaging).  Occasional video playback around 30% of the time.  - It is responsive and very fast on WiFi and 5G (big red) network.- The \"Different\"  - It is big and bulky.  I have upgraded from 5.2\" to 6.6\" screen.  The screen is significantly larger, but the phone itself is thicker, too.  One hand operation is no longer an option and definitely not practical.  - The display is brighter but for some reason seems blurry.  I cannot find a comfortable balance between screen sharpness and brightness.  I tried different display settings but I am still searching for the perfect (or even acceptable) balance.- The camera  - Image quality is good for occasional use.  I am not a professional content creator and find it good enough.The phone was on sale and my impulse buying urge took the better of me.  Am I disappointed?  No, not really.  I read the specs and for the most part I knew what I was getting into.  However,  if anyone is considering Moto G, take a look at Moto G Power.  It seems to have a better display (at least on paper) and maybe a better overall product/value for a few more dollars (at the time of this review).",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is HORRIBLE!",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I bought this cuz it's hard to find a phone that works with US Cell's stupid CDMA proprietary network, uggg.The phone is okay, although there are a few things I don't like, like scrolling up at break neck speed if you touch it anywhere on the lower half of the screen. Also I can't figure out how or if I can get a notification when text messages are sent...I get a tiny dot on the App only.The poor quality battery is a deal breaker: It doesn't even last a day so I'm always plugged in at home.I will not buy this brand again and by the time I want a new phone, I won't be using US Cell either."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    i expected better performance",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I do understand this is a cheap phone, i am i not comparing it with a 800+ device. My previous 2 phones were pixels... 5a, 6a, so not very new either.My opinion after about 2 weeks: it's just \"ok-ish\", and that's only because it was on sale for 180.It is full of bloatware and it always wants to update update update... i feel like that's all it did for the first 3 days non-stop. Updating, restarting, updating, restarting.The side fingerprint sensor is awkward for me.The device feels slow to me, probably because of all the extra apps is has running all the time.Camera is pitiful.It freezes sometimes. Can't really tell if its the device or some app thou.The best thing about it (and most motorola phones) is how you can turn on and off the flashlight.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wifi calling not working",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "I chatted with Motorola agent who insisted it's a carrier issue so I went to Mint Mobile website and make sure that wifi calling is enabled there and got a confirmation text which tells me the next step it to enable wifi calling on my device.  I can;t figure out how to do that on my device so I went back to the same Motorola agent, who told me to search for \"wifi calling\" under settings.  I told her there was no result.  She said that means my carrier didn't enable it.  I said I am pretty sure Mint has done whatever they could to becuz the Mint agent stayed with me for about an hour and went through all the possible steps (checked IMEI numbers, reset mobile networks, turn airplane mode on and off, etc ) with me, so the problems is with the device.  But the motorola agent just repeated the same thing AGAIN AND AGAIN AND AGAIN:  GO TO YOUR CARRIER.  So the problem is still there.  very frustrating.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a twin sim phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "I bought this to replace my older Motorola phone and I need a twin sim phone so I don't have to carry two phones, I have a foreign number to. This is not a twin sim phone, there is only one position for a sim and the second one is an e-sim??The phone would have been a good phone for me had it been a twin sim phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's okay, a little bit glitchy",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "I got this phone to replace a TCL 10L that was 3 years old and no longer receiving security updates. I have to say that this is the first time that I have purchased a new phone and not been thrilled with it. The phone just seems glitchy; for instance when I open my gmail even though I am holding the phone in portrait position in my hand, it opens in landscape. Not the end of the world, but when you start adding up little things like this it starts to get annoying.The Moto G Power 5G does have some things that I like. The fast charging is a plus, if it had battery life to go with it it would be great but the battery lasts a day at best.The screen is very bright and the adjustment is all or nothing, just a really bright screen that doesn't dim very well.The phone is big and clunky feeling in my hand - kind of uncomfortable to hold. You'd think they would have tried to make the design a bit more ergonomic.The fingerprint sensor on the power button is annoying, I had to use my ring finger so that I wasn't turning on the phone Everytime I picked it up.I'm not really thrilled with this phone. Seeing how it is only going to get one system upgrade I will probably get something else by the end of the year.It does get a 5g signal - it does that good, but the rest of the phone doesn't warrant paying what they are asking. Had to go with three stars ....",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First phone was a dud. Replacement ok so far",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "The first phone I received was a dud straight out of the box. Issues with the speakers and moto gestures not working properly, intermittently, or not at all. I spent a few hours with Motorola troubleshooting and they offered me a repair if I sent in the phone. Motorola offered no replacement because I bought the phone from Amazon (even though it was the Motorola store on Amazon). After hearing the story I just typed out for you, Amazon eventually sent me a replacement. And, so far, this phone is great! I'm giving 3 stars for the hassles. However, it would've been 5 stars without the hassles."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, but ...",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "I read several great reviews for this phone. My old Moto G7 had started shutting off and I had never liked the tinny sounding audio it had, so after 4 years decided on this Moto G 5G 2023. The box had previously been unsealed and opened which I expected since it was advertised as ' used like new '.I ordered the 'Ink Blue' color.The phone I received is a  very very dark gray or black with subtle sparkle or metallic appearance. It seems to be the Black Mineral color, although the box it came in is labeled as 'Ink Blue'. The invoice states it is ' Ink Blue '.The charger that is advertised as in the box is missing. The charge cord did come in the box.This phone gets hot! I played a couple YouTube music vids on it and the phone actually got hot and vibrated from the music.I guess I misunderstood what they meant by ' used like new '.Even though I ordered the Ink Blue phone and received a Black phone, I probably could have kept it even though the adapter was missing, but I am afraid to use this phone as it gets hot so I sent it back.I've ordered several phones from Amazon in the past and only ever had one problem. They've always resolved any issues with any orders.I'm looking now at some other versions of Moto, Nokia and Samsung phones.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't include a charger.",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "It would be nice if a charger were included (it isn't), especially since the instructions specifically caution against using third party chargers. The description says, \"charger MAY NOT be included in some areas\". No charger offered in the 'buy it with' list. Have not yet discovered if Amazon can even supply the correct charger. As to the phone itself, too soon to tell, but it is a Motorola and the reason I bought it is that I liked the previous Motorola phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera software needs to be fixed",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Had for about a year now, switched from a Samsung S9 due to screen crack interference with touchscreen.  Not very impressed.  Camera has poor software, takes a full 1-2 seconds after hitting record to actually start recording, same with taking pictures, tap, move phone and now it takes pic an you end up with a blurry photo, and the autofocus is awful.  As soon as this gets too damaged, switching back to Samsung.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery life compared to my prior Moto",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "I have loved my Motorola phones, but this one....not so much.  The set up was easy, but it has so much bloatware, is slow, and the battery drains quickly.  Not a fan."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    wireless charge, bloatware, etc.",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "Using this phone for 4 months. Wireless charging is great. Cell tower connection is great even in rural areas. Battery life drops like a rock even though almost all bloatware is uninstalled and or disabled and blocked. To much Moto software installed which drains battery considerably. Charging fails from time to time so the phone has to be restarted to get it to charge again. Out of the box the phone is bloated with bloatware and spam apps on top of all the unnecessary Moto and Google virus apps. Slim design feels smooth in your hand with crisp screen display. Speakers are moderate to clear. Camera takes decent pictures. Price wise at the time of buying it was a good deal compared to other over priced, Google virus, Samsung virus and Apple virus infested phones. All in all unless you know how to completely take over the software to control everything in the phone, not recommended.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't work with Android Auto",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "This phone and my previous Motorola phones won't connect to my Mazda android auto, other than that no complaints",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Average",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I just wanted to get a new phone because my 2021 Moto Edge hadn't gotten a security update in 6 months. So it was between the 2024 stylus and 2024 G Power then I thought about the One Plus N30. Clearly I picked the wrong one. Not impressed with this phone at all. Deal breaker for me is the sound, which lacks volume and my Bowers and Wilkins headphones have never sounded so weak. Screen is ok I guess. Performance ok I guess. I recommend spend your money on something else. I wish I would have. Glad I got my tablet.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent for the price but returned it",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "For the price, it's fine. I bought this to replace a 5+ year old Samsung S10 plus. It struggled with playing some games, camera was slow to open, not enough memory so if you leave an app and go right back it \"forgot\" its place and restarts the app so you lose your place where you were scrolling etc. The phone was just a bit slow and laggy at times in general, definitely does not have the processing power of a more expensive phone. I ended up returning it and got an iPhone instead."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No wireless charge",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Decent  phone with good storage capacity, nice pics and good shape, i buy it thinking have wireles charge option  but it does'nt"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The worst Motorola phone that I've ever owned",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "On quite a few Motorola phones over the last 6 years but this one is an absolute piece of junk. And the reason it's a piece of junk is because Motorola has messed with the basic Android that Google supplies and calls it Motorola Android and Motorola has no competent programmers to be messing on anything that Google puts out for programming on phones. These people were not even smart enough to put in a selection to look at all the apps that are installed. They only put in a selection to look at the most recent apps in the default apps. The standard Google Android has both. I'm trying to save you from wasting five or six hours of your life trying to set up with this thing so that it'll actually work and has the stuff that was on your old phone to use. I'm going to add to this that the notifications have stopped working properly. You spend more time trying to administer this phone instead of being able to actually use it to get any work done. And I would never ever consider doing any online banking with a piece of crap phone like thisUpdate when I got this phone somebody had set the gestures attached to the power button to turn on Google Assistant instead of restarting the phone. It's taken me numerous hours to finally figure out how to fix this issue. In my opinion this was not a new phone but it was advertised as new.Update 9/4/24 This phone is like all the other g series I have owned since 2022 which is 3 of them.  All of them have this uncontrolled scolling problem where the screen will all of a sudden scroll at speed up or down. This has been a problem with the last 4 Motorola phones I have had.  I have turned it in to Motorola twice now and they have done nothing to fix the issue which is about par for Motorola customer service.  BE AWARE IF YOU PURCHASE A MOTOROLA PHONE THAT YOU WILL NOT GET QUALITY CUSTOMER SERVICE.Update 10/28/24 the previous part of this review relates to the Moto G5 g that I had. This current part relates to the brand new one that is less than 30 days old and has a absolutely horrible screen on it. It is washed out text especially the small text and I frankly just don't have the energy to go through another replacement process. This is just a poorly designed phone. I've owned at least seven or eight Motorola phones over the last 6 or 7 years and this is absolutely the worst piece of junk of all the phones that I've owned from Motorola",
      "helpfulVotes": 86
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Open phone.",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Could not get to work with and carriers/"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Optical Image Stabilization is not working",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Only one big problem for me, Optical Image Stabilization is not working."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's working good thank you very much",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "It's ok thank you so much 👍😺",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent for a week, then it slows down",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "I got this phone as a temporary phone because my z flip 3 quit working and I needed a cheap place holder until I could order a fold 6. Anyway, for about a week it was actually surprisingly snappy. It initially exceeded my expectations, because I was expecting a sluggy phone right out of the box because I mean, cheap phones like this, you get what you pay for, right? Right. After a week of having this phone, it's gotten sluggish. I don't even have all of my usual apps on it because it was just meant to be a placeholder phone. There is noticable lag typing on the screen or when I tap something, sometimes it takes it several seconds to acknowledge the tap. As far as the camera goes, forget it. Colors are washed out, dim lit pics and vids have tons of noise on them. The post processing of the pictures also adds a touch of blur to pics and it is a touch too much. The one thing going for this phone is the battery life. I'm a very heavy user and I can go around 2 days on a single charge. If you can afford to pay more for a phone, do it. Unless you want a sluggy phone and poor picture and video quality.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Feels like a brick, only gets one major Android update",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "The phone is quite thick and heavy (210g), and will only be updated from Android 13 to 14 . So within 2 years, it will be out of date. It's too bad, because for the price, the performance is slick and smooth..."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "I've had this Moto G Power 5g for a few months and I can say it's not a great phone. I had an original Moto G Power for 4 years and loved the phone. It worked well and had a good camera. I thought this 5g would be a step up. But it runs slow even on a high speed wifi network. I has to be charged at least once a day. Annoying notifications which apparently cannot be silenced. And photo and video quality is poor compared to the old phone. It recently upgraded to Android 15 and got even slower. It's been a disappointment and will be my last motorola device.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow and struggles with having more than one app open at a time",
      "date": "Reviewed in the United States on October 16, 2024",
      "body": "I got this phone because I needed a comparatively inexpensive one pretty quickly after my previous phone died, but I would not recommend it to anyone else. Within 6 months it's become very slow (and I have plenty of space on it), the battery life has significantly decreased, and it struggles to keep playing audio from one app if I open another. For example, if I'm listening to a podcast or music on Spotify and I open any other app, the audio will often stutter and pause and then stop entirely. It takes a while for apps to open, especially the camera app, and it takes several seconds to actually take a picture - sometimes 5-10 seconds, by which time it's often sort of useless. It's slow to switch between apps and then the apps are slow to use. It also does not show some of my sent texts. I send them and they just disappear on my phone. I had no issues with the seller or delivery, and the phone worked ok for the first few months, which is why I'm giving two stars. However the issues it's having within only 6 months of buying it lead me to recommend against it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wireless charging",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "One of the reasons I bought this phone, is that everything I read said it had wireless charging. The phone I got does not have wireless charging. Very disappointing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Kinda slow",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "It's ok it does seem to have difficulty at times keeping up with even small work loads but it's a good value."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My Moto G Stylus 2021 4K video NOT HERE",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I just bought this after a 3 year stint w my previous phone. Except for BLAND DULL video and pics it is a Fast responsive phone when the 120 refresh rate selected. Do not use Auto refresh rate.No other complaints, in short if you don't need a camera, get it, if not STAY AWAY",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cracked screen",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "The phone was listed as having wear and tear and some scratches, but the screen is actually cracked."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    moto power",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "I have always liked the Moto Power phones, still have a couple.This new 5g always keeps stopping.Maybe I got a bad one.My Moto 7 still works great and it's old.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective battery :(",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "A good phone but bad battery, it's swelling might be best to avoid might be - fire hazard - , when i fire got phone i felt the back of phone and i was pushing in the back a little and it made tap on the battery,and now when i push on the phone back cover i fell a bulge or like a firm-ness, like a rock in the middle,good phone battery :)  -  :("
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh, could be better",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "If it had NFC, never got it to work for Google pay.  After a year it seemed to develop problems like freezing or locking up.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product good, Amazon, not so much",
      "date": "Reviewed in the United States on August 24, 2024",
      "body": "I waited a month for a pair of these phones. Amazon kept moving the shipping date out over and over. When I'd call, I'd get the usual lip service to get me off the phone. They kept asking if I wanted to cancel the order. The cost went up just shy of $100 per unit after I order them, so I think they were trying to get me to cancel.As far as the phone. They connected to Verizon flawlessly and have been great. These are a good phone without a ton of the new bloatware. They also have a crazy amount of internal storage.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unresponsive screen",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "I have to say that I'm not impressed.I can't return it because I sold my old TCL phone already. The TCL had a much better camera and the screen was responsive, unlike this heavy phone.I thought Motorola was a good choice but I won't make it again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the money",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Great phone for the money."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not genuinely advertised",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "This product is advertised as \"Moto 5G power 2024\". So far so good.When you try to select a different color, surprisingly, it switches to \"Moto 5G 2023\". Yes both power and 2024 delicately disappeared...This is dishonest. I have been trying to cancel the order unsuccessfully. I am thinking to return it, although I have other things to do.I recommend the reader to look for the same in another store.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't waste your time or money purchasing this phone. It is a GIANT Headache!",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "This phone being a complete disappointment since day 1 is an understatement. If you are looking for a headache that has a constant and continuous myriad of issues then go ahead and purchase this phone but dont say I didn't warn you. Every time I use this phone whether to take a photo, play a game, make a video call, the apps I am using and those operating in the background (system apps and others) crash. Don't take this on a once in a lifetime trip like I did. I tried to take in the moment photos and the camera app would freeze then crash missing the object I wanted to capture. Some app crashes Every. Single. Time. I use the camera. Without fail. Every time! Other apps like PoGo won't even open on the phone without wifi and then it will just crash. There are pre-loaded apps like entertainment and shopping that also crash so I finally deleted them but they were replaced by other system apps crashing. Please look elsewhere if you are looking for something that actually works and wont be a giant headache. If I could give it negative stars I would. What a bad decision I made, hopefully you will take this public service announcement and look elsewhere. Oh, I also forgot to mention Motorola's service is a joke. You contact them via facebook messenger and you chat with a virtual ai assistant. It just throws meaningless articles at you that contains advice that doesn't work. Please don't walk RUN as far away from Motorola as you can!",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charge Block NOT Included",
      "date": "Reviewed in the United States on June 14, 2024",
      "body": "At first this phone might seem like a good deal but then you have to go buy Motorola's 30w Block. Using a different brand block results in inconsistent charge speeds.I do wish the size of the phone was under 6.5inches. It is a bit big for my liking.The texture of the backing is cool but will wear out faster than most.The camera is just ok, nothing crazy special.I miss the under display fingerprint reader. Having the reader on the side makes the phone vibrate anytime something else touches the sensor.The rest of the features found in the Moto G Power 5g 2024 are nice to have. As I explore the device more, I will try to come back and add more details.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's ok",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Had it 5 weeks and the screen is worn where you swipe back",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is not my favorite phone",
      "date": "Reviewed in the United States on September 25, 2024",
      "body": "Sad to say that this is not the best cell phone I've bought.  Hubby and I tried two of rhem and were nor happy.  They seem disorganized and difficult to use because it's hard to locate the features when you want ro use them.  We ended up getting iPhones.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The charging power cord doesn't work. Also, no plug was included with it.",
      "date": "Reviewed in the United States on February 1, 2024",
      "body": "I bought this for my husband as a gift. I just remembered to give this review, as I had to review the Motorola screen protector also. The charging power cord that was included, doesn't work. It also didn't come with a plug either. He had to use a different USB-C cord that he uses for another device, to charge it up. I would just like to have the cord replaced with a better one. It would be nice to get a fast charging plug with it too.The only thing that he reported about the phone so far ( besides the power cord ), was that when he swipes to the 2nd screen, it makes a weird streak on the screen, which disappears. He is also disappointed in the lack of accessibility features, such as making the light flash when there's a text message, or phone call, there are other accessibility features that he said are missing, or not very easy to navigate.He's a bit disappointed in the fact that there's no dedicated e-mail app, except for Gmail.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap phone, cheap quality",
      "date": "Reviewed in the United States on February 2, 2024",
      "body": "I bought this phone to replace a 3 year old Pixel 6 with screen issues. I figured that a newer phone might nearly match my old phone, but boy I was wrong. Here's my assessment:Pros:Inexpensive when bought on saleLarge screenGood battery lifeAttractive iridescent backQuick fingerprint readerCons:Multiple installed apps that are advertisement supported. Many can't be removedSlow boot up120 Hz screen is noticably laggyNot enough RAM to use more than 1 app at onceDead zones in corners of screenCan't play HD videoMy biggest issue is the installed advertisements. Swipe right on your home screen, ads. Check the weather, ads. Multiple \"folders\" preplaced on home screen are ads. There are many better options without ads at this price point. I do not recommend this phone. Buy an inexpensive Samsung or a refurbished Pixel, steer clear of this Motorola. You'll be happier in the long run.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Misleading information on the details page and expensive return option",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "I searched for “Motorola cell phone with NFC support”. The results offered “Moto G 5G | 2024 | Unlocked | Made for US 4/128GB | 50MP Camera | Sage Green” (ASIN B0CWHXVLXG), with a cost of $169.09. However, there’s the same phone with a different color $20 cheaper: Motorola Moto G 5G | 2023 | Unlocked | Made for US 4/128GB | 48 MPCamera | Ink Blue, 163.94x74.98x8.39 (ASIN B0C2SWQBMB). So, I purchased two units of that one. When I received the phones today, I discovered that they don’t support NFC! I came back to the product’s detail pages, as I remember asking Rufus specifically about NFC support, and this was its answer for ASIN B0CWHXVLXG:The product information shows this device has NFC connectivity.\"Connectivity Technology : Bluetooth, Wi-Fi, USB, NFC\"\"Connectivity technologies : Bluetooth, Wi-Fi, USB, NFC\"Today, I discovered that, if I ask the same question for ASIN B0C2SWQBMB, this is the answer:The product information does not specify whether this device has NFC capability. Motorola's website also does not list NFC as a feature for this model. However, I would recommend checking reviews from other customers who have purchased this product to see if they have commented on the NFC functionality.This is misleading and confusing. Why a cell phone would have NFC if it’s color Sage Green, but won’t have NFC if it’s Ink Blue? I want to return both phones, but Amazon asks me to pay for the return myself and I'll get a refund of up to $20 from the return costs. However, sending the phones back from Costa Rica costs $160 per phone, approximately. So, I'll be paying more for returning the products than what I paid for them. It doesn't make sense.",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sorry I \"upgraded\"",
      "date": "Reviewed in the United States on April 11, 2024",
      "body": "I wish I had just gotten a new battery installed in my old Moto.  :(Cons:1) SO MUCH BLOATWARE!  Out of the box with 100 apps!  You can not uninstall most of them2) A lot (but certainly not all) of that bloatware is from Motorola services. They spam you TO DEATH to sign up so they too can track your every move and sell your data.  Endless notifications to set up your Motorola account and activate all the crap that you can not uninstall but desperately want too!3) I cannot get facial recognition to work.4) Transfer did not work right:a) A new phone has always been painless. This time, many of the apps I do want and use had to be set up and configured again.  4 days later I am still finding things that did not transfer and still don't work right.b) Days later and I still have my old phone on my desk because I can't get some stuff to work on the new phone.c) Ring tones/notification sounds! I have had Moto phones since they did their first smartphone.  I have used the same sounds for things for YEARS -- that should have transferred too but those sounds are not even on this phone. So now I have to learn all new sounds - is that work e-mail or personal? Is that a work text or personal? Not a huge deal perhaps but VERY annoying when stacked up with all the other issues.PROsGood battery life",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WTF",
      "date": "Reviewed in the United States on May 25, 2024",
      "body": "I have had Motorola phones for as long as I can remember. Awesome cameras kick ass battery life. I had the previous model power 5G and for some reason it has been a turd the battery never holds a charge the camera is awful nothing like the previous models that I've had. Bought this one and it doesn't even come with a charger what the hell? Hopefully the battery doesn't go tits up and the camera will take a picture more than 5 ft away if not this will be the last Motorola I ever buy.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Okayish",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "It's alright for $180 but a long way from the normal $500 phones I buy. Good kid phone as someone else said which I'll probably do. Screen brightness is terrible outside. The interactive dark screen capabilities, (answering texts, notification viewing without actually lighting up display) which is why I used to buy motos are only useable when an actual screen lock is utilized which I will not do. Typical clean fingernail corporate ignorance in this day and age...",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought used, works fine but no charger was delievered, only a charging cable.",
      "date": "Reviewed in the United States on October 17, 2024",
      "body": "So far no other problems, just have to charge it without its original charger so it is probably slower."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Weak Battery",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "2023 Moto G 5G - Ink Blue. This thing can't hold a charge. Brand new out the box and bleeds 1% every minute. Battery Saver helps, but still bleeds 1% every few minutes. Not watching videos or anything major."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh...",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "The battery is not as good as the 2023. This battery, on a full charge, barely lasts 10-12 hours with casual use. Less than that with games and YouTube.The 2023 stayed charged for at least 2 days before needing a charge with moderate to heavy use. I was spoiled by the older model."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No charging plug",
      "date": "Reviewed in the United States on April 22, 2024",
      "body": "How can you use a phone you can't charge?  An update started automatically at 60 per cent (factory charge), battery ran very low, but since I couldn't get it to charge further, the update paused and couldn't be stopped. The the phone is now unusable.  Being disabled I am not sure if I will need to go to a store for more equipment.  Now I have no phone at all since I have already switched the SIM card.The last phone (same Moto) at least had everything you needed.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So...so",
      "date": "Reviewed in the United States on April 2, 2024",
      "body": "I ordered 2 of these phones for 2 different numbers. They are good phones for the money, however the battery in one lasts forever, even using GPS, Wifi, listening to radio all night but the other, just sitting on standby runs down in less than 24 hours. Poor consistency seemingly.Downsides; The clock display is totally goofy - double line, which cannot be changed or analog without numbers.Constant pestering from Motorola about trying one function or another or updating.No note taking app - very strangeMany of my favorite apps are not compatible with this device and replacements include adsGmail email app does not handle outlook very well.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy it!",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Don't buy this! Not worth the savings. Had the phone 7 months and then the screen just went black. Attempted screen replacement at reputable repair shop. They tried 2 different replacements. The phone is broken! Can't pull stuff off phone with no display. Anything not backed up to a cloud or external storage is gone. Very disappointed for a 7 month old phone! Screen isn't cracked or damaged, it's internal issue. Now have to buy a new phone. Would have been better off spending a little more for different phone then the wasted money on this one. This was the second moto we bought. The first one had issues after 2 years with admittedly some drops and cracked screen (teen use). Daughter loved the phone, so we bought her the newer version. We were happy with the price point so we went ahead and got her the moto g. Terrible! So disappointed. Won't buy Moto again!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't EVER buy a cell phone PERIOD from AMAZON",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "This phone is garbage. I don't know if it is the phone or if it is because it's an Amazon bot phone but I will say that Motorola phones have really gone downhill over the years. I bought a moto X4 in like 2014 and it still is working well today. This phone is garbage compared to that phone but they were the same price. This is my second 2024 Motorola G G5 and they are both glitchy and do things on their own and quality just sucks. I have also purchased four or five Google pixels 6 and 7 pros from Amazon and they all bit the dust after a year with the same exact issues. Battery wouldn't take a charge and the cord wouldn't respond while trying to charge. I've never had this kind of bad luck with a cell phone ever which leads me to believe it's because they are Amazon phones, bought from the corporations fixed or defective refurbished.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Am I keeping it? 🤔",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "I like the phone. It replaced a Motorola G04 that stopped connecting away from home due to being incompatible with Mint. The strangest issues are having to go back to a home screen before being able to pull down notifications (what is THAT about?) and keyboard unresponsiveness. Have to practically punch screen icons to open apps. The green is almost black. At this point, just don't know if I'm keeping it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DOESNT HAVE NFC",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "WARNING, this phone, despite being produced in 2023, beyond the era that all phones have NFC...it does NOT have NFC. I got rid of my old samsung 7 which has no trade-in value (thats how old it is) and THAT one had NFC. and this brand new phone does not. wild.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone feels like it's at least 5 years old. My 3 year old Moto G 5g works so much better",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "I got this phone last week and have been sorely dissatisfied. I only replaced my 3 year old moto because I broke the camera lens, and I wish I hadn't gotten this one. Everything is slow. If I switch to another app and switch back, no matter how quickly, the app refreshes itself. The camera will make a noise and show a preview like it's taking a picture, but when I go to the photos, it didn't actually save the picture. The camera also takes a couple seconds to take a picture on the standard camera mode. Taking screenshots is a gamble. Sometimes just opening the recent apps makes the app your trying to screenshot just refresh so you lose what you're looking at. Other times, it just freezes for a few seconds and says \"Screenshot Failed\". The finger print scanner is also unreliable. I had to put in 5 sets of prints for the same finger just to get it to work most of the time. The \"Multi Volume\" also doesn't work like it used to. I know it's turned on, but I'm not sure if it's actually doing anything. I click on the volume for the app I'm in and it the slider controls both the app and the overall phone, so it's not very \"Multi\" in my opinion. The volume buttons are also not very responsive. They only work about 70% of the time. I will definitely be returning it.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's ok...",
      "date": "Reviewed in the United States on April 7, 2024",
      "body": "I have yet to experience the 3 day battery. The set up is overly easy. Like it's made for a dumb blonde who can't do things. I honestly hate that when I try to opt out of things it feels like the AI of the phone won't let it happen and will opt back in without my approval. If that's a bug the it really needs fixed. Definitely not a Samsung, and Definitely not helpful.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Won't stay connect to the bluetooth in the car",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "The phone is ok for the price"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery life",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "The battery doesn't last the whole day no matter how long you charge it. And the touch screen was delayed a couple times. other than that it was a nice phone"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't work with T-Mobile.",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Great phone except it's reception is really poor. I don't know why, but about half the areas where my old phones have worked, this one doesn't get service. Avoid"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Motorola cell phone 23",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Too many pop-up ads on the cell phone tried everything to get rid of them but no success. Try to answer phone pop-up ad gets in the way."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Constsnt Wifi connection problem",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "This phone doesn't work well with wifi. Poor connectivity. I don't recommend.. for the price of $169 should at least be decent."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sooo fragile!",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "I've never had a phone that fractured so quickly and easily with normal use (no drops)."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My previous Moto had no issues",
      "date": "Reviewed in the United States on September 29, 2023",
      "body": "My previous Moto had no issues but didn't have the storage I needed; it only had 64gb. I decided to get this one because it has more storage, and a payment plan was offered. Aside from having more storage, the notifications are questionable. I usually keep my phone face down (preference) and notice that notifications don't come through. The phone needs to be face up to get them. However, that's not always the case because sometimes when it's face down, and I mean \"sometimes\" at a most minimal, I'll receive a random notification. I've gone to settings to see if there are options and there are none. The volume of the notifications varies as well; the volume isn't consistent. Some are quiet, some are at the volume that can be set by you, and some are louder than the volume it's set at.If you have regular, non-wireless ear buds, it connects from the bottom of the phone. To me, it's more convenient to connect from the top of the phone. Especially if you have a phone case that you can clip to your belt or pants, which I did purchase. Again, that's just me.Battery life is decent.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stay Away From This One",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "We have used Motorola phones for 20 years with no complaints until this phone. I needed a quick replacement and at the time this was the best choice on paper. The phone was great when I first got it but within a month I was starting to see a lot of glitches. It lags horribly and sometimes does its own thing. I just can't in good conscious recommend this particular phone. My One 5G Ace was much more superior and at two years old when I dropped it in water, it still worked better than this one did straight out of the box.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unflashable",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "If you are buying this phone for any kind of rom modification I would look elsewhere.  These are not the same as the factory unlocked models on motos website.  Motorola will not issue a bootloader unlock for this device even though it's unlocked. And when hooked to comp I seen why.  In the boot log or variable under carrier it says something weird I forget exactly but I think was rufis.  Anyway talked to moto tech guy and he immediately asked did you but this thru Amazon. I feel like that should be in atheist the fine print on website.  The phone would have been cool tho if not for that",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware:  Locked Verizon Phone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Beware.  This is not an unlocked phone.  Received locked Verizon Pre-Paid phone 2 time - original and the replacement.  You will need to activate for Verizon service.  Going to my local Best Buy for the unlock phone - same price.Got a new unlocked phone directly from Motorola instead of Best Buy (has restocking fee of $50 if you return the phone).  The unlocked phone is in a Motorola box.  The display is clear and crisp.  Camera okay too.  Easy to setup new phone transferring data from old to new.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just mostly (not complete) trash",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "The phone isn't complete trash.However, charging is persnickety and slow on most ports that have worked fine on my previous Motorola Android devices.But more troubling is it acts like a weak dual core device.  If I am streaming video on picture in picture and I open the camera, it often crashes the video player.  And if steaming music and stop the player and reduce it but leave it up in the background, when I return the player is either dormant and requires a restart or just spontaneously restarts on its own which resets the playlist and the shuffle.I've been running Android on Motorola devices since at least 2006 and this is the worst performing device compared to current technology that I've experienced.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    glitches, is slow and locks up constantly",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "90 day refreshed returns ENDED????? So I ordered a phone and I ordered a case and I use the exact model number on both, the phone doesn't fit the case and I don't know which is the problem but there's a year after the model of the phone so apparently every year this model phone changes go figure, the phone locks up it won't connect to Wi-Fi without an update but it won't update without being able to get on the Wi-Fi so I'm kind of stuck here and did I mention the phone it's just pure crap? I mean I know we're trying to refresh phones and save money and buy not new $1,000 phones but I mean this is just ridiculous I guess since I can't return it I'll just donate it...Update: I have literally had to go back to my pre-covid awesome but old phone that I have tried to replace with refreshed phones from Amazon four times, and none of these phones last three four even five months I will be very wary of buying something like this again!!!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sound problem",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "The phone seems to work pretty good until I hook it up to my car. The sound comes out very bad. A lot of interference. And then when another call comes in it's a screeching sound that can't be tolerated. I'll have to return it. I ordered one for my wife also. I just tested it on my car and it works good. So I'll be returning this one and ordering a new one for me. Otherwise the phone seems fine.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Six Months of Agony Then Finally Died - TWO of Them!",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I bought two of these.  Both stopped working after about six months.  Months before they died, both would turn off while I was actively using the phone online, just shut down with no warning.  When I got it up and running again, it didn't open where I had been a minute ago.  It was as though the phone had never been there, that the memory was vacant; I had to start everything over again.  About a month ago, it would shut down, and take forever to get up and running again, just to have it shut down with no warning about 30 minutes later.  Lastly, before it died, it shut down repeatedly many times an hour.  Junk!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen is cracks easy, phone battery sucks power.",
      "date": "Reviewed in the United States on November 6, 2024",
      "body": "Battery sucks and screen crack the 1st time I dropped it even with protected casing! More cracks since then but the screen saver has kept it from getting worse. Not buying another Motorola. Bought a battery pack to keep phone charged when I don't have a 110 outlet."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera is really holding it back",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "I got this phone because I bricked my s23 at the water park and needed a budget replacement. I've had a few Motorola's in the past and they've never had the best cameras but this phone made me feel like moto had just given up on the camera. I went back and found pictures I had taken on my original moto x from 2014 and they've taken steps backwards. I couldn't live with the camera and returned this phone. Its too bad because all other aspects of the phone are great for the price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    HUGE. Awkward to hold. Not ergonomic. Relatively poor battery.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Form factor is AWFUL. Not ergonomically designed in the least. Thin body with hard, squared edges. It's awkward to hold and too HUGE to use with one hand.Camera protrudes, so you end up scraping the camera lens on everything when you set it down, put it in your pocket, etc.Battery life is underwhelming. Not the worst, but much less than it should be. Battery drained 3-5% with maybe 1-2min of use (just turning on and getting to home screen).Stock Android is nice."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The worse and worse it gets",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "Updating my review x2. It was a 3 star then 2 and now 1 it just keeps disappointing and underperforming!! The phone's touchscreen is finicky and unresponsive at times, especially it's keyboard which makes responding to texts, writing reviews, and quick notes a hassle. The multi functioning is laggy. A LOT of stupid glitches from not opening ads on Instagram that I want to check out, so slow to open webpages they become unresponsive, and screen cut out issues (see above). The gestures Motorola put on are really dumb, randomly opening the camera and not knowing how I did it. The calibration is so off so picking an address to copy selects text two lines down!? Previous review said it was a great price but for how terrible it's been it really isn't. DEFINITELY returning and letting people know not to bother. A prime example of why Motorola is not up to snuff with high quality phone manufacturers.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crashes and freezes",
      "date": "Reviewed in the United States on August 19, 2024",
      "body": "Had issues with phone crashing and freezing"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible green screen horrible battery life",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "My old Motorola is on the left this new Motorola g 2024 is on the rightLook at the screens why is the new phones screen tinted green. I've tried to fix it in the settings I've asked a friend to look at it it's ridiculous it's just this way and it hurts my eyes don't buy this crappy phone.What happened to Motorola this is a the second Motorola g 2024 that I bought in the past month I thought something was wrong with the first one cuz the screen was green and the battery drained fast. But no I read reviews on the razor too all the new Motorola is a terrible green screens what are you thinking Motorola. terrible phone I've always gotten Motorola's since the X came out approximately 2010This Motorola g 2024 has a horrible green screen and the battery life is super bad",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Life is horrible",
      "date": "Reviewed in the United States on January 5, 2024",
      "body": "I had to get a relatively inexpensive cell phone this past year. I had had a previous Motorola and like the phone wasn't crazy about the battery life. I was hoping this one being a few years newer in model would be better. It isn't. If you need a cheap 5G smartphone with a decent camera and good features this is fine. But if you use it a lot you'll be frustrated with the battery life. I probably will not get another Motorola when it's time to upgrade in the future.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "Poor quality the screen I already cracked Two places."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is not unlocked",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Arrived in Verizon labeled packaging saying \"unlocked\" and would not accept SIM from another carrier.  Buyer beware."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT UNLOCKED",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "This phone was only unlocked for Tmobile & Verizon. We don't use either one. Took our carrier FOUR HOURS to actually unlock & activate this phone! Buyer Beware alot of trouble for a so so phone"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Only one OS update",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "I really liked the specs and the option of having an audio jack, but alas the deal breaker for this particular model - no OS updates past Android 15 (although security updates will be updated for 2 years). Too bad. I was looking forward to using this phone as my main driver.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "I absolutely loved my 2021 model. Recently it started to break down. So I decided to trade up to a newer model. I did read the reviews and it was mostly positive. I don't understand how anybody could give this phone a positive review. This has to be the worst phone I ever bought! Everything about it is horrible. I actually found my 2021 model that I bought again."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone signal seems unreliable",
      "date": "Reviewed in the United States on May 27, 2024",
      "body": "I live in a rural area. My previous phones have been able to pick up a signal but this one seems to lose the signal more often.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera is terrible",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "It says 50 MP camera, but honestly the camera is just worse. Your happiness of buying something new will disappear from your face once you see its camera performance. Please note it. Thanks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon Lied to me!  BEWARE!!!",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I bought this phone to replace my old Moto G5, which was only 32GB. I have had the old one for almost 5 years. It's proven to be a good phone. This new one has so much more storage. The camera takes great pictures. I am really happy with this phone!HOWEVER, after three weeks the battery stopped charging!  Now it is $100 dollars more for the same phone.  An Amazon 'specialist' told me I could have a $100 dollar credit after receiving the replacement.  Now they tell me it was not approved.  So, even though I had the phone for three weeks, I cannot even exchange it without paying more!!BEWARE!!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone, with cameras so bad it ruins the whole experience",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "I have used budget phones before. But somehow, they managed to sneak horrifically bad cameras into this thing. Could be worse than any other smartphone I've ever had going back to 2010"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Atrocious reception ability, excessive start-up time",
      "date": "Reviewed in the United States on March 9, 2024",
      "body": "I replaced a lost 2021 Motorola 5g UW with this device. I've always had poor reception with Verizon at my place of work, but my previous few devices have been able to connect to the network. This phone has no service 90% of my time at work, constantly unable to load websites or apps. I have essentially given up browsing on my phone while on lunch break, only able to use downloaded content. In addition, the restart and power up can sometimes stall for 15-20 minutes. The battery life is mediocre at best. The screen is nice and the sound from the single speaker is better than one would expect. It actually has a hard line microphone port which I very much appreciate. That being said, unless you're using this on wifi all the time, expect to be VERY disappointed with the device.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone keeps turning on to promote various news stories.",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "I got this phone this week and it it's okay. It's very big. It constantly turns on to promote news stories and if I'm working it'll make me touch it in my pants accidentally and screw up what I'm listening to. Very annoying. Bluetooth doesn't stay connected either."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Misleading description- Phone is not unlocked.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Misleading description as I was searching for a completely unlocked phone that can be used with any carrier. I went activate my phone through T-Mobile and they told me that it was locked to Verizon or another carrier and could not be used. They showed me on the screen as I could not believe how a brand new phone could already be locked. Buyer beware..",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with Total by Verizon",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "The product description says that it's locked on both CDMA and GSM 5G networks. However when attempting to activate this device on total by Verizon it was a complete fail."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not great",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "Not great even for cheap phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Keeps locking.",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "3 times this phone has frozen and had to be hard restarted. Very annoying."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery, poor notification volume.",
      "date": "Reviewed in the United States on September 3, 2023",
      "body": "I bought this phone to upgrade from a moto play.  This phone boasts a long battery life, but that simply isn't true.  It last just as long, or short that is, as any other phone.  So don't buy this phone if you think the battery is going to last two days, because it doesn't.  With basic usage, sending text messages, talking on the phone, the average amount of web surfing, you'll find yourself plugging this phone in for a charge around 2PM.  But what I REALLY don't like about thos phone is the volume.  As far as phone's ringer and conversation volume, this phone has excellent volume.  The volume for music too is good.  But the volume for your notifications such as email, text messages, etc are EXTREMELY low.  Even with the notifications tab turned up as high as it goes it's extremely soft.  With my phone in my pocket I can't hear when I get a message.  This is super annoying and have no idea why it's so low.  I'm going to call Motorola to see what the deal is with this issue as none of my other moto phones has had this issue.  If they tell me that's just how it is on the moto g 5g, I'll just have to send this phone back as it's a deal breaker for sure.",
      "helpfulVotes": 34
    }
  ],
  "productDetails": {
    "productTitle": "Moto G 5G | 2024 | Unlocked | Made for US 4/128GB | 50MP Camera | Sage Green",
    "asin": "B0CWHXVLXG",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Immersive 120Hz display* and Dolby Atmos: Watch movies and play games on a fast, fluid 6.6\" display backed by multidimensional stereo sound.",
      "50MP Quad Pixel camera system*: Capture sharper photos day or night with 4x the light sensitivity—and explore up close using the Macro Vision lens.",
      "Superfast 5G performance*: Unleash your entertainment at 5G speed with the Snapdragon 4 Gen 1 octa-core processor.",
      "Massive battery and speedy charging: Work and play nonstop with a long-lasting 5000mAh battery, then fuel up fast with TurboPower.*",
      "Premium design within reach: Stand out with a stunning look and comfortable feel, including a vegan leather back cover that’s soft to the touch and fingerprint resistant.",
      "Tons of built-in ultrafast storage: Get plenty of room for photos, movies, songs, and apps—and add up to 1TB with a microSD card*",
      "*A minimum device refresh rate of 60Hz and a maximum refresh rate of 120Hz; actual refresh rate may be less and will vary based on app/content limitations and requirements, device mode settings, and other factors.",
      "*The 50MP sensor combines 4 pixels into 1, for an effective photo resolution of 12.5MP.",
      "*5G service available with 5G plan. 5G network coverage required; available only in select areas; device not compatible with all 5G networks. Contact your service provider for details. Qualcomm Snapdragon is a product of Qualcomm Technologies, Inc. and/or its subsidiaries. Qualcomm and Snapdragon are trademarks of Qualcomm Incorporated, registered in the United States and other countries.",
      "*Charger may be sold separately. Maximum 18W TurboPower charging speed on device. In-box charger varies by market. Check with your carrier or retailer for availability. *Supports up to 1T microSD card, microSD cards sold separately. Content with DRM restrictions may not be able to be moved to the card."
    ],
    "boughtCount": "3K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Motorola",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$149.99$149.99$149.99",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$102.81$149.99$149.99",
    "buyUsedAvailability": "Only 16 left in stock - order soon.",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "Techrific Deals",
    "soldByUsed": "Techrific Deals",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 10,
    "startingPrice": "$102.81",
    "url": "/gp/offer-listing/B0CWHXVLXG/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": "Product information",
      "item_details": {
        "section_1_row_1_brand": "Motorola",
        "section_1_row_2_model_number": "PB0L0002US",
        "section_1_row_3_model_name": "Moto G 5G 2024",
        "section_1_row_4_model_year": "2024",
        "section_1_row_5_builtin_media": "SIM Tray Ejector, Guides, USB Cable",
        "section_1_row_6_manufacturer": "Motorola",
        "section_1_row_7_specific_uses_for_product": "Gaming",
        "section_1_row_8_upc": "840023254604",
        "section_1_row_11_asin": "B0CWHXVLXG"
      },
      "battery": {
        "section_2_row_1_battery_capacity": "5000",
        "section_2_row_2_battery_type": "Lithium-Ion",
        "section_2_row_3_battery_power": "5000"
      },
      "measurements": {
        "section_3_row_1_item_weight": "194 Grams",
        "section_3_row_2_item_dimensions": "2.95 x 0.32 x 6.47 inches"
      },
      "video": {
        "section_4_row_1_video_capture_resolution": "720p"
      },
      "additional_details": {
        "section_5_row_1_operating_system": "Android 14",
        "section_5_row_2_ram_memory_installed": "4 GB",
        "section_5_row_3_memory_storage_capacity": "128 GB",
        "section_5_row_4_color": "Sage Green",
        "section_5_row_5_sim_card_slot_count": "Dual SIM",
        "section_5_row_6_connector_type_used_on_cable": "USB Type C",
        "section_5_row_7_form_factor": "Slate",
        "section_5_row_8_biometric_security_feature": "Fingerprint Recognition",
        "section_5_row_9_humaninterface_input": "Touchscreen",
        "section_5_row_10_sim_card_size": "Nano",
        "section_5_row_11_water_resistance_level": "Water Repellent",
        "section_5_row_12_headphone_jack": "3.5 mm",
        "section_5_row_13_additional_features": "Stereo Speakers, Dual SIM, Expandable Memory, Always On Display, Built-In GPS, Mobile Hotspot Capability, Water Resistant"
      },
      "display": {
        "section_6_row_1_screen_size": "6.6 Inches",
        "section_6_row_2_resolution": "1612x720",
        "section_6_row_3_refresh_rate": "120 Hz",
        "section_6_row_4_display_type": "LCD",
        "section_6_row_5_display_resolution_maximum": "1612x720 Pixels"
      },
      "connectivity": {
        "section_7_row_1_wireless_provider": "Unlocked",
        "section_7_row_2_cellular_technology": "5G",
        "section_7_row_3_connectivity_technology": "Bluetooth, Wi-Fi, USB, NFC",
        "section_7_row_4_wireless_network_technology": "GSM, CDMA, LTE"
      },
      "camera": {
        "section_8_row_1_front_photo_sensor_resolution": "50 MP",
        "section_8_row_2_rear_facing_camera_photo_sensor_resolution": "50 MP",
        "section_8_row_3_camera_description": "Rear, Front",
        "section_8_row_4_camera_flash": "LED",
        "section_8_row_5_shooting_modes": "Macro",
        "section_8_row_6_optical_sensor_resolution": "50 MP",
        "section_8_row_7_number_of_rear_facing_cameras": "2",
        "section_8_row_8_digital_zoom": "8 x",
        "section_8_row_9_number_of_front_cameras": "1"
      },
      "navigation": {
        "section_9_row_1_gps_geotagging_functionality": "True"
      },
      "warranty": {
        "heading": "Warranty & Support",
        "text": "Manufacturer’s warranty can be requested from customer service. Click here to make a request to customer service."
      }
    },
    "overviewAsin": "B0CWHXVLXG",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "USB Cable",
        "SIM Tray Ejector",
        "Guides"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$149.99",
    "listPrice": "$185.30$185.30",
    "savingsPercentage": "-19%",
    "standardDeliveryDate": "N/A",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}