{
  "asin": "B08VLMQ3KS",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent so far",
      "date": "Reviewed in the United States on October 13, 2022",
      "body": "I ordered it on Sept 20th at $339 plus shipping of ~$34 and Morocco VAT of ~$80, so totally I paid $449.Delivery was very good. I saw it was shipped on the 25th. On the 30th, I received an SMS from DHL saying they planned delivery on Oct. 3rd, but on the same day I got an email asking for copy of national ID and content description for clearing customs. I am not a Morocco residents nor citizen, so I sent my foreign passport instead. On the 3rd, Amazon tracking info said clearing custom was delayed as additional documents were needed. So I called DHL, and the rep said it would be delivered on the 4th instead. On the 4th, I saw a newly posted message about delay on Amazon tracking. I called DHL various times but couldn't get to anyone. I then sent an inquiry by email and get a response shortly saying it was being taking care of. Then late afternoon, I got the package.Upon arriving, the seal of the packing had an opening large enough to put in a hand but not for getting the phone out, so I didn't complain.Unpacked, the inner packing of the phone was in excellent condition, very much like the original packing but had no Samsung marking, rather, it had a marking of \"amazonrenewed\". There was a film covering the screen, like on a new phone. The phone appeared in excellent condition, only had a small scratch at the back when I looked in detail, and a hair of scratch on the screen that is only visible under bright light and in a particular angle. I tried but couldn't turn on the phone - there was no response. The box also included a USB-C cable and a cheap non-Samsung charger made in China. I used my own Samsung Charger to charge the phone. After plugged in, it showed the battery was at 0. So I let it charge to full.After started, it turned out fully unlocked. My Morocco sim card works with 4G. The phone's software looked already reset, but I reset it myself anyhow. Then updated to the latest system with Android 12, and loaded many apps I need. During about the first week, the battery appeared quite poor. With medium usage it lasted about a day. I tried all necessary settings to conserve battery, but it didn't seem to help much. These couple days, it becomes much better, lasting about 45 hours. I read it was likely due to some AI processes either from Android 12 or Samsung doing the learning work at first.  But it's pretty bad the phone doesn't show any info.I would say I am very happy with the phone. And this is after having a terrible experience in the past with Samsung.The last Samsung phone I had was S7 Edge bought in Thailand (I am a traveler), new at a Samsung store for perhaps ~$800. I actually wanted the normal S7 (without the \"edge\"), but it was out of stock then. I never liked the \"edge\", it was a silly design in my mind. The phone worked well initially, but in the coming couple of years I had a terrible experience. About 5 months later when I was in Vietnam, the screen started to show shaded bands across. As I was wondering how or if I should return to Thailand to get the phone serviced, the bands disappeared after a month. Then about another 7 months later when I was in Azerbaijan, the phone couldn't start after I did a system update. So I couldn't use the phone for a couple weeks until I reached Tbilisi in Georgia  when I had someone flashed it.  About a year later, it died on me again when I was in Morocco. I had someone re-flashed it, but it was not successful.  About 1 month later I reached the city of Fes where there is a Samsung service center.  After checking, they said there was something wrong with the motherboard. Very shocking!  I've never had such problem in my life with all the phones and computers, cheap or dear, and this was a flagship!  So eventually, I sold it to a local repair shop for $200, for which they said they only needed the screen. That was end of 2017.So I never bought a Samsung again, and would definitely not buy one at the full price. I admit the S series is not worthless.  At least, I like the camera.  But I never had a chance to buy one at a largely reduced price (I won't buy from just any second-hand sellers).So now, the Amazon reviewed phone with some warranty got me interested. Yes, I have some risk, but to me with the past experience, the risk is not much higher than getting a new phone from Samsung, plus, I am putting in a much lower bet now.",
      "helpfulVotes": 118
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good fone for the money",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "Bought this fone cuz my Samsung Galaxy S20 ultra stopped sending texts and no one could figure it out. I even factory reset the fone twice Verizon went all though the setting nothing. So I was looking for fone in the $200 range and saw this. It's smaller but I dont need a mega sized screen anymore. So far had the fone around 4 months and it's been great it's light weight and fits in my hand and pocket good.  I Was able to transferred all my apps, music and contacts over with Samsung smart switch in 10 mins. The glass on here isn't very strong not like the S20 ultra witch I dropped a good amount of times no screen cracks or scratches. This S21 didn't hold up to that I was on my couch half a sleep dropped the fone under 2 feet and it sent 3 cracks across the whole screen. I didn't know it was cracked instill a few days later when the sun hit it at the right angle. I still have on the shipping screen protector not sure if that's holding it together not gonna peel it off to find out. It's been cracked for over a month now no issues with digitizer or screen tracking. It's a Octa core processor and 8 gigs of RAM it's a fast fone for all my needs even with multiple windows open in internet browser and other apps running in the background. I run my fone even on battery saver you wouldn't even know its saving energy wakes up fast no studering flips though screens fast. Fone did come like described in excellent condition. Just buy a case for it and the glass prob would have survived. Get this fone to save on your fone plan not buying there flag ship fones for high prices.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First and LAST time i will ever buy a refurbished device",
      "date": "Reviewed in the United States on October 29, 2023",
      "body": "I was very apprehensive about buying a refurbished phone but after reading so many 5 star reviews i pulled the trigger. The first one i got looked brand new cosmetically but any time i would go to charge it it said there was \"Water in the charging port\" and wouldn't let me charge the phone (there was no water anywhere near the phone, let alone in the charging port). That kept happening until i returned it for another one. This one (got it in March of 2023) looked great too cosmetically but functionality is the big issue. First it wouldn't give me any notifications of emails - I went through all the prompts and settings, changed everything I could...still no notifications of emails. The only time it will notify me is if I actually open up Gmail - then it will pop up saying you have x amount of unread messages but if I'm already opening the program it's completely useless! Then I started having people tell me \"I was calling you but it went straight to voicemail\" I thought it was odd but maybe it was service related. I went to my wireless provider and they said there is nothing wrong with the service it's probably the device. My wife has the same exact service with a different phone and has service throughout the house. Now not only can i not make or receive calls in my house I can't send text messages! The phone will say I have full service (5 bars) plus I'm connected to Wifi 6 with a 1 gig fiber connection. When I go to send a message it will just keep spinning and spinning until the message times out after a long time. The only way I've figured out how to trick the phone into sending messages is send the message, turn the phone on airplane mode and then switch airplane mode off again and the message will send. To add insult to injury last month I noticed a small artifact on the screen that does not go away. I've had this phone for less than a year and I have a permanent line on the screen that shows even when it's on the charging screen. I purchased this from the seller \"TheGadgetDeals\" because they had 100% positive reviews - not sure how that's possible if these are the kind of phones they are selling. So with no email notifications, no ability to make or receive calls or send text messages in my house (and a lot of times other places) I effectively have a $450 paper weight masquerading as a phone. If you're ok with spending nearly $500 on a phone that will be essentially unusable within 7 months of purchasing I say go for it, otherwise I'd look elsewhere!1/10 WOULD NOT RECOMMENDPS. After owning the phone for a month or so i purchased another one for my wife (also from TheGadgetDeals) her phone came in excellent cosmetic condition but every time she would make or receive a call the person on the other end would hear an echo of everything they said so that phone had to returned",
      "helpfulVotes": 46
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Premium Experience That Comes at a Premium Price",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "The Samsung Galaxy S21 5G stands proud as one of the flagship offerings of the samsung, delivering cutting-edge technology and a sleek design that is sure to turn heads. However, with a price tag that might make even the most devoted tech enthusiasts do a double-take, this smartphone raises the age-old question: is it worth the investment? Here’s my take on this splendid yet pricey marvel.Design and Display: A Visual FeastFrom the moment you lay eyes on the Galaxy S21, it’s evident that Samsung has crafted a device meant for the high-end market. The sleek contours and premium materials give it an unmistakable aura of luxury. The 6.2-inch Dynamic AMOLED display is nothing short of breathtaking, offering vibrant colors, deep blacks, and impressive brightness levels. Whether you are streaming your favorite series or scrolling through social media, every experience is elevated by this stunning showcase of visual brilliance.Performance: Power UnleashedUnderneath the hood, the Galaxy S21 5G is powered by the latest Exynos or Snapdragon chipset (depending on your region), ensuring lightning-fast performance for multitasking and gaming alike. The device handles everything with remarkable ease, and the inclusion of 5G capabilities means you can harness incredibly fast download and upload speeds. With options for up to 256GB of storage and 8GB of RAM, you won't find yourself wanting for space or speed.Camera: Capture Life’s MomentsSamsung’s camera system is one of the standout features of the S21. The triple-lens setup, including a 12MP ultra-wide, a 12MP wide, and a 64MP telephoto lens, allows users to capture stunning images in various conditions. The Night Mode is particularly impressive, ensuring that low-light photos are as crisp as those taken in bright daylight. The addition of advanced video features, including 8K recording, cements the Galaxy S21’s status as a powerhouse for mobile photography enthusiasts.Battery Life: Mixed ResultsWhile the battery life is generally sufficient to get through a full day with moderate use, heavy users may find themselves reaching for a charger by late afternoon. The 4000mAh battery powers some serious capabilities, but if you plan on extensively utilizing 5G and the phone's camera, be prepared for a potential drop in endurance. Fast charging and wireless charging options are a plus, but the slightly underwhelming battery performance keeps the S21 from achieving a perfect score.Value for Money:Herein lies the crux of the matter—while the Samsung Galaxy S21 5G dazzles with features, performance, and design, it comes at a steep price. For many, this puts it out of reach, especially considering the current market of other high-quality smartphones that offer comparable features at a lower cost. The premium branding does lend a certain prestige, but that may not be enough to sway budget-conscious consumers.Final Thoughts: A Worthy Investment for SomeIn conclusion, the Samsung Galaxy S21 5G is undeniably a fantastic smartphone that checks nearly all the boxes for performance, photography, and design. It’s perfect for tech enthusiasts who want the best of the best and are willing to pay for it. However, for those looking for value without compromise, exploring other options within the same price range might be a wise choice. With that said, I award the Galaxy S21 a solid 4 stars—it's good, but the expense is certainly something to consider.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Happy with My Renewed Samsung Galaxy S21 Phone! :)",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I am really, really happy with this renewed Samsung Galaxy S21 pnone! It arrived in such clean condition (even had protective plastic coverings on the screen and on the back of phone like new phones. If I didn't know it was renewed, I would have easily thought it was brand new. No scratches or filth anywhere that I could see (I checked with a magnifying glass). My only complaint was how long it took to arrive. It advertized as in stock yet took over a month I think to get shipped (I think it was overlooked and they were alerted by Amazon when I tried to cancel the order the day before it was expected to arrive) The seller had to ship it overnight and it arrived the next morning. So that was really good. So far the phone operates perfectly--like new! So I'm very happy, especially for the lower price I paid.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Great Price",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Phone is in excellent condition. Works properly. Arrived early. Charges fast. Looks like new.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast shipping. Received in 1 day. Big performance phone for productivity (Samsung Dex)",
      "date": "Reviewed in the United States on July 15, 2021",
      "body": "So far this phone performs great. It is fast and very responsive. 16GB of RAM! I could open a lot of apps in the background and it is still running without sluggish. It is new and never been used (I think) since the imei is still good and not being registered. This phone with 512GB storage is sold out pretty much everywhere and you cannot even get them from Samsung website. Don't buy 128GB. It is useless since the storage is so small. Add $50 and you could get 256GB. However, I recommend 512GB.What is great is the camera. It works a lot better than S20 Ultra 512GB. That one was a let down and I returned it. I stuck with S8 Plus for 4 years but I love that phone. The autofocus and nightime mode improved significantly at least for me. The S20 Ultra autofocus is horrible. It seems the multitasking works a lot better to. App can easily works as popup instead of of multiple presses in s8 plus.  Speaker sounds is a bit louder and has more bass sound. Wi-Fi 6 and 5G are definitely the best features. With 5G, I am no longer having blackout in certain area around my house area. When there is no 4G LTE, 5G will take over and when there is no 5G, 4G LTE is taking over. In the past, I only have 4G LTE and 3/2G. You have three different customization on how to switch to different apps (multitasking). I haven't really go out and use the camera yet although it is the main reason why I am buying this phone. Another plus side is this is a t-mobile version.The only downside is no micro sdcard, 100X space zoom (a feature JOKE from Samsung Marketing department), 3 buttons instead of 4 and finger print from the front display. For finger print, I love the rear touch since it is more convenient to use with one hand. Finger print is a bit troublesome to detect unlike the old one. (Update: You have to press a bit harder on the display to get your fingerprint detected. So far it is working better than I first initialed test).  I am hoping Samsung will bring the sd card back in the future. Seriously 108MB, 8k (never use this feature ever), 4k size of photos and videos and you do not provide sd card? Even my Sony A7RIII works great with micro sd card in sd card adapter. There is no excuse of not giving customer sd card option. The excuse of sd card is slowing down phone performance is an old myth provided by none techies or those people who never used sd card. Not sure why the hate on sd card.  If you don't want to don't use it. Recently so many big companies either getting hacked, attacked with ramsomware or services shutting down cloud drives becoming a joke. Samsung shutting down their own cloud for photos/videos services and Google their unlimited photos. With all the security issues and possible shutdown, it is not a safe approach for storing your photos/videos for backup.To work around it, you can use- USB OTG C to female USB A/C port for USB flash drives- USB OTG sd card hub/ports with sd card readers and USB A/C ports.- 4/5 TB hdd drives are still having reasonable pricing with only small increased in pricing. I am lucky to keep up with the news to buy 8TB to 16TB drives before scalpers took over the market. S21 ultra has the ability to read exFat/fat32 by default and ntfs for small usb flash drives. For large drives like 2/4/5 TB or larger in NTFS format you need other special software to read the NTFS. NTFS format has better storage efficient and security than exFAT and fat32. I am using paragon software to read the ntfs ($9.99) and total commander.  For the usb hub station I am using, without a pd power delivery I could not read/write to ntfs hdd drives. I haven't try it on smaller OTG (USB 2.0/3.0) to see if it is working on hdd drives. Will update on that later.- Buy UHS-II readers to get faster reading/writing speed even if you are not using UHS-II sd cards.Buy one of the USB 3.1 gen 2 cable or gen 2x2 USB C to USB C to reap the 10/20 Gbps (theoretical) speed.  I will update more once in the future especially the camera part.Update:I bought a hub station with 5 USB ports (2 x 2.0, 2 x 3.0, 1 x C 3.0) 2 x hdmi, 1 x dp port, ethernet, USB c powered port (100w), UHS II regular sd and micro card reader. This thing has one usb c cable attached which you can connect to your phone. This thing is simply awesome. It is better than my old Samsung Dex which doesn't come with extra USB ports , extra display ports and sd card readers. With 100w to power this hub station, I can connect to several usb devices without the worry of connection loss issue. Since I am doing a lot of reading I don't have to use my desktops or laptops. I probably will buy a small battery powered monitor to turn this thing into a \"laptop\".Using my hub station, my wireless speed is~478.82  to ~480 Mbps  Download from Ookla. Upload is not provided but I assume it is above ~22 Mbps~380 to ~438 Mbps  Download from Google. Upload is ~23 MbpsHowever, this is my router and ISP dependable and not the phone. I should have test the phone using the 5g speed on clear and country side. Will update later on that.Next month or so I am going to use a lot of the photography so I could evaluate the camera performance. I know that from few shots, the default auto camera is a lot better than S20 Ultra (which I used only for few days). The autofocus is fast and photo taken is not blurry. The HDR processing makes the photo looks better too. I could see the clouds contour enhancement and colors look a lot better too. What I wanted to know now is the nightime shooting. I did take few snapshot in a darkroom and so far it seems to run perform better than S20 Ultra (which takes 5 to 10 seconds) or something not even getting anything during the autofocus.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life could be better",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I've had this phone for a couple weeks. I normally buy the \"A' series when it comes to Samsung but everyone kept telling me that the \"S\" series was better. After the couple of weeks I've had this phone, I would say I like the \"A\" series better. I'm glad I did not pay full price by buying a brand new phone. The thing that I mainly do not care for this phone is the battery life. On my old Samsung I would have about 80% battery by the time I got home from work. With this phone I have about 50% battery when I get home from work. I don't use my phone a lot while I'm at work. The Phone does charge fast if you are using the proper cord but I would prefer a phone with a lasting battery, not a phone I have to constantly plug in.  With that said it makes calls, texts fine, and the app usage is ok. I normally try to keep a phone for a few years but I don't foresee that happening with this only due to the battery life."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    One of the Best but Still Falling Short",
      "date": "Reviewed in the United States on April 7, 2021",
      "body": "I’ve spent the last number of years using a slew of different phones from OnePlus, LG, Motorola, Huawei, Sony, and the last HTC.  I haven’t used a Samsung since the S7.  I’ve avoided them because while they were well built, they had software that was so bloated, it drove me nuts.So, what is it like going to Samsung after so long?HARDWAREBack in the day, only Apple rivaled Samsung when it came to the best hardware.  Samsung can no longer make that claim.  Granted, this phone is excellent, but OnePlus, LG, and Apple are all on the same level in terms of quality build.This phone feels heavy in your hand.  I personally like that, but someone coming from an Apple might be very disappointed.  Going light weight was not a big consideration here.  It seems like they were more focused on packing as much as possible into this phone.  That leads to a big issue.Samsung has been cowed into trying to be like Apple and removed both the headphones jack and sd card slot.  I see no real reason for this beyond saving money.  Apple and Samsung claim that they can’t fit it in, or that no one uses them anymore.  Both of those are nothing but lame excuse.  Both LG and Sony put both items into their last flagships.  LG in fact released HD audio to go with the headphones jack.  After using both phones, I REALLY miss both those items.  They added a huge amount of functionality and made doing certain things so much easier.They did add the latest and greatest 5G and Wifi connectivity to this phone.  That sounds great, but I haven’t noticed it all.  I even live in an area where 5G is everywhere.  There might be more speed, but everything in my area was already fast.  It’s hard to really notice a difference unless you are running a speed test.So, this phone is S-Pen compatible.  Great.  It would be really good if it actually came with an S-Pen, but you’ll have to pay more for that.  By more I mean $40 for an s-pen designed for the Ultra, that is missing some functionality.  That’s right, you can’t do gestures.  If that’s important to you, you need to wait for the S-Pen Pro to be released “later” in 2021.  That one will have a BT connection.That really seems like a fumble on Samsung’s part.  I can understand making the s-pen optional and not having a silo for it, like on the Note, but not having the full-blown version available at launch feels like they are missing an opportunity.  If people get the regular s-pen, decide they don’t use it, what’s to motivate them into getting the pro version?The S-pen can be handy, but it only makes sense if you get a case that can hold.  Thankfully Spigen makes one that is cheap and works well.On the plus side, this phone has the fastest, most accurate fingerprint reader I’ve ever used.  It’s easily twice as fast as the one LG was using.  The ultrasonic format really makes a difference.CAMERAWhen I first used the Huawei P20 Pro, I was blown away by how good that camera was.  The things it did were unprecedented in a camera phone.  I used a number of phones after that one, and none of them ever matched what Huawei could pull off.Samsung crushed it with this camera setup.  The flexibility it offers is unmatched.  From wide angle to super zoom, it’s all there.  Some of the tricks they pull off with this camera are truly impressive.  From how it combines photos for optimal exposure to the foolish 100x superzoom, the things you can do with this camera are insane.The 100x is nothing you’ll want to use a lot.  It’s usable, but not overly clear.  Still, the mere fact that you can take a usable 100x photo with this phone is mind blowing.When I say “usable” I mean a photo that is identifiable.  It’s nothing I’m going to want to hang on a wall, but it might help trying to identify something.If there is one thing camera doesn’t do great, it’s exposure.  It tends to over expose, but that’s it.  That’s the only real issue I can find and it’s minor.You might see the 108MP sensor and think you can take some insane RAW photos with that.  To a degree, that’s true, but with a sensor like that, you’d need a HUGE amount of light to be able to get good results.  There is a reason why Samsung does pixel binning to get its incredible results.  On its own 108MP in a sensor that size is not really usable, except in ideal conditions.I love a good wide-angle camera.  LG was always a proponent of the wide-angle, and over the years, it’s really come in handy.  It’s not something you use a lot, but when you need it, nothing beats it.You get two tele-photo lenses here.  The 3X is great for framing your photos, and the 10x allows you to do things that no over phone I’ve ever used has allowed.  The 10x really comes in handy for sunsets and times when you can’t get close to your subject.CHARGINGI usually don’t do a write up on charging, but in this case, I think it’s needed.  You have wired 25W or wireless 10W.  I love that flexibility.  It’s not all good though.  You know what really stinks?  Paying through the nose for a phone, opening the box, and not getting a charger.  That’s right.  No charger in the box.  If you want one, you’ll be paying for it.  It’s hard to wrap your head around the fact that they charge you over $1,000, but couldn’t give you a charger.  I can’t remember the last time I got a phone with no charger.SCREENTill now, OnePlus had the best screen I’d seen in a phone.  It makes sense that Samsung would beat them, considering OnePlus got their screens from Samsung.  This screen is amazing.  It’s not just it’s looks either.  They did some impressive trickery here too.  The adaptive refresh is amazing.  The big issue with a 120 refresh rate is the battery it burns through.  With adaptive turned on, it adjusts.  Reading a book or something similar – it drops as low as 10.  This saves a huge amount of battery life.BATTERY LIFEIt’s good.  It’s not LG V60 good, but it’s good.  There have been times when the LG V60 lasted me for two days with normal use.  This one has the same battery, but doesn’t last that long.  It will easily make it through the day and night though.SOFTWAREWelcome to the worst part about this phone.  I know why Samsung doesn’t fix it too.  To be honest, I hate the Samsung apps, I hate the excessive bloatware, and Bixby is the worst virtual assistant I’ve ever used.The UI is the more frustrating of the issues here.  The main reason is tied to the fact that this is an Android phone.  Why do you want to be so different from stock when it’s actually hindering the experience instead of improving it?I understand what Samsung is trying to do.  They want to be Apple.  They want their own ecosystem, they control, and reap large profits off of.  That’s why they have their own assistant, apps, and UI.  I’d applaud them for that, if they grow a pair and divorce Android.  The only way all the apps, bloatware, assistant, and UI make sense if they are on their own.  Just do it already.  Become the third option, because as it stands now, your software is awful.  It’s trying to sit on a fence, which means it’s not as good as it could be on its own, and it’s NO WHERE as good as stock Android.Now, if you are a handy when it comes to Android, you can remove a lot of the junk off this phone, via ADB.  But, stop and think about that for a moment.  You just paid top dollar for a phone, and now, you have to waste a solid hour of your time stripping off all the garbage they piled on there.  How is that acceptable?If this phone was running software close to stock and didn’t have the bloatware issue, we’d be talking about a legendary phone.  One of the best phones ever made.  Instead, we have some of the best hardware ever combined in a phone, with steaming pile of dung laid on top of it.Again, if Samsung finally broke free of Android, I think things would be very different.  They might also be watching Huawei very closely to see how everything pans out for them.  Huawei was forced off Android and now runs its own OS and ecosystem.  If it goes well for Huawei, I would not be surprised to see Samsung finally pull the trigger.  They already have the OS.  It’s been in their Smart appliances for years.I know I’ve bashed Samsung a lot here, but there are some things that do that are excellent.  The first one I’ll mention is something that falls into the useful category.  It’s their side tabs.  The default is your recent apps or apps you’ve pinned.  This comes in handy since I don’t like either of Samsung’s default launcher options.  You can also add more tabs like weather and select contacts.  I first used this with the S6 Edge and I’m glad it’s still around.Now for the thing that Samsung does best, and by best, I mean no one is even close.  A deep dive into the sound settings will take you to an EQ setting.  This is not impressive on its own, since most other makers offer this.  What Samsung does that no one else does, is it gives you a hearing test and creates a custom sound profile for you.  As someone who has hearing loss, the impact this has is incredible.  The only thing I don’t understand is why it’s so buried.  I mean you need to dig to find this thing.I find it rather ironic that Samsung is more on board with Windows integration than any other maker I’ve used.  Samsung imbedded the features needed and allows you to use apps in Windows.  The others I’ve used require you to download an app and you cannot use apps in Windows.  This is a handy feature to have for anyone using an Windows PC.  They also support the cut and paste feature.  Copy on your phone – paste on your PC and vice versa.I have to relate one final frustrating issue with Samsung’s software.  The last three phones I used all were on board with Google’s autofill for apps.  That made signing into a new phone an easy experience.  Samsung has its own thing.  I spent quite a while hunting down passwords that I hadn’t used in nearly two years.WILDCARDThere is a factor to consider, if you’ve only used Apple or Samsung products.  You’ve been spoiled.  By buying the most popular phones, you’ve always had a massive selection of cases and accessories.  As someone who’s been using the fringe players for years, I’ve been stuck with only a few choices when it comes to cases.  Sometimes it was very difficult to find cases, or I had to pay more than I would have liked.Having a massive selection does add to the value, since you end up paying less for cases as everyone tries to undercut each other.  On top of that, you can find the crazy cases that include extra battery, wallets, and added functionality.  If you’re using a Sony or OnePlus, you can only dream about such a thing.This becomes even more of a value I you are one of the people in a program like Amazon Vine.  I was able to get three cases for this phone, through Vine.  Before this, only once was I able to find a case for my phone.Another factor is that there are also apps on the Play Store that are dedicated to tweaking the Samsung experience.  Some of them are quite useful.  This is something you don’t find when using the minor players.VALUEIs this phone a good value?  No.  I’m sorry at its retail price, it’s not.  The LG V60 might have a weaker camera and older processor, but it’s a far better value.  The OnePlus 9 Pro, is a slightly better value, if we are talking about a full priced phone.  If you want this phone to be a value, you need to land this phone for $900 or less.  Anything higher just isn’t worth it.  If you’re going to pay full price for this phone, you might want to look at the iPhone.  I do not like iOS, but they have an excellent build, great camera, no bloatware, and fast updates.SHOULD YOU BUY THIS PHONEIf money is not an issue and you love Samsung – yes.If money is no issue and you want the best camera – yes.If money is no issue and you want the best Android phone – maybe.If money is an issue and you want a great Android phone – buy the LG V60.If you want a clean Android experience – buy the Pixel 5 or OnePlus 9 Pro.If money isn’t an issue and you want the best phone – buy the iPhone 12 Pro Max.If you need to have a sd card and headphones jack – buy the LG V60.If you need to have a sd card and headphones jack, but hate LGs software – buy the Sony Xperia 1 II.",
      "helpfulVotes": 79
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's still the best phone you can get IMO",
      "date": "Reviewed in the United States on September 22, 2023",
      "body": "This phone is kinda like a jack of all trades. Maybe when the S24 or 25 comes out, I'll get the Exynos variant, just because they spent more time developing the newest chip, it's actually made by Samsung and I heard they're easier to root. It used to be easy to root Samsung phones but now it's next to impossible and temporary if you do, before they update it.This phone is one of like 3 phones that has stylus support, a curved screen and 120hz. I wish the thing had a 1TB option or Micro SD Card support but everyone loves to copy Apple for some reason, even after making fun of them/boasting about features their phones still have. Just like with the headphone jack.I'm personally into buying or building products/devices with the least amount of brands/manufacturers, so the fact that this phone is pretty much entirely made by Samsung this year, even the Qualcomm chips, is pretty cool. I feel like GoodLock is getting more and more stuff added, for personal customization, though I wish they'd stop changing the way you can screenshot, so I don't have to keep finding workarounds. Even though there are some things they tried to take away, this phone still allows more customization than any other phone, maybe except Xiaomi. Xiaomi allows you to customize the boot logo/animation without root!eSIM WILL NOT work for Verizon or any of Verizon's MVNOs which is absolutely ridiculous. It's sucks enough that you can only store 2, only 1 can be used in junction with the regular SIM and that's fine but why does any eSIMs beyond 2 get deleted? Who knows...These speakers are loud and the Snapdragon 888 is still a great option for emulation or Android games. It doesn't get too hot and the battery can last you quite a while, even for a heavy user like Me, who downloads a million apps and keeps quite a few things in the background. It's still snappy and works as it should. The cameras are decent, probably not as good as My Pixel 5, but it's close.The charging speed, I'm used to it now but 25w? Come on... even older phones had at least 45w, but I guess Sammy was afraid more phones would go boom boom. At it's fastest rate, it will charge from around 5-10% to 100% in a little over an hour. I do love that there are so many options for accessories, since Samsung's phones are such a global phenomenon.I didn't pay much to get this phone refurbed and I just don't personally think it can be beat. The sides had a bunch of micro scratches that I just covered with a clear case, which had a Black frame, that I put on top of a skin. For the money I paid, it's nice to have a curved 120Hz 1440p LTPO screen with a ultrasonic fingerprint reader (even though it's a bit slower than it should be) and stylus support, 512GB of storage, 16GB of RAM, a Snapdragon 888, DeX/HDMI Out, a 5000mAh battery, wireless charging, reverse wireless charging (even though it's super slow), a front facing camera in the middle of the screen at the top (though it'd be nice if this was under the display or just didn't exist), IP67 or 8 water resistance, extremely loud speakers, eSIM, the latest One UI + Android Security Patches until 2024 I believe, etc.I have a lot to say about this phone but overall, if you can find it for $700 or less, its a great phone and probably the last one that will be this curvy and feature packed.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Next Check Scene Size",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Needed a phone but didn't think it was the size of my hand. It fits well in my purse,  still need a larger scene ."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I really like this phone.",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Even though this phone is older than some of the recent ones, it is still a good phone.  Some of them are brand new and have never been used.  I think they call them refurbished phones.  Mine is great!!! Please read the directions because it has features that you don't even know about."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No SIM card slot",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "The phone was missing a sim card slot.  We ended up having to activate it with the carrier with an eSim."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Nice",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Buen telefono. nada malo que decir"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new, only a LOT cheaper!",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Arrived in great condition.  Was able to install mt SIM card from my older S10 and use the Smart Switch a[[ to transfer everything over to the new phone.  I use to go to a local cell phone dealer to have them do what seemed a mysterious process when getting a new phone.  But this was extremely easy and I was up and running in less than 15 minutes.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I got an s21 for less than $200 in unimaginable quality, Obviously there were some aesthetic details in the frames but nothing more, the screen is of perfect quality, and no notable changes are seen in the materials, honestly a purchase that was completely worth it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very pleased! Hard to tell it's not a brand-new phone.",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Where it comes to \"refurbished\" or \"renewed\" versions of previously owned devices, no two Galaxy S21 phones may be alike. In my case, I paid a little extra in selecting a phone that was in \"Excellent\" condition, as opposed to \"Acceptable,\" and I'm sure it made a big difference. Another factor to consider is the quality of work put into \"renewing\" the device. My experience was with the seller, Synergy, and they exceeded all of my expectations. The phone looks and operates like it was brand new, and I am very happy with the purchase. When they shipped the item, they also included a support number, in case I hit a snag. (I didn't.) It is very nice to see someone go the extra mile in making sure the buyer is well served.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall, great",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "The phone is in excellent condition. Minor scratches are not even visible. Battery is moderate. Everything else is working perfectly. The only downside is that it's Verizon app manager is installing dumb apps on its own."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "I always have galaxy Samsung this is my newest I was trying to get the 20 but for only 20 dolls get the 21..and I like it a lot"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Physically in superb condition, but expect to spend 5 hours getting it to work...",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Because the phone has been fully reset to factory defaults, it has lost ALL operating system updates.  The cycle to bring the phone to the current level takes HOURS, and a LOT of work - there are 20+ updates that need to be installed, one at a time, before you can do anything else."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love this choice.",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "My wife loves the size,features, and feel. This phone is her personal devices and prefers it over her business phone. Very satisfied."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid phone, but can run very hot. - beware if the seller is \"deals always\"",
      "date": "Reviewed in the United States on July 27, 2024",
      "body": "As for the phone itself, it arrived in good condition with everything working. I do not play games on my phone but I needed a phone that could run multiple non gaming apps smoothly as I use my phone for work and this phone does that well.However, if you are outside and the temp is above 75 80 and are using this phone, its going to start running hot very quickly and either throttling performance or not allowing you to charge the battery until it cools down even at half or less brightness. It's definitely the hottest running phone I've ever had. I've not had it overheat and actually shut down though so it's still usable. If you are gaming on it in these temps, you will probably have a much worse time so be aware of that.As for the seller, \"deals always\", they shipped my phone with firmware, while it was unlocked, would not allow it to receive any OTA updates. I've had this phone since March and was wondering why it wasn't updated past December and why I wasn't getting the OneUI 6.1 update even after manually checking and after connecting to Smart Switch. Since I am tech savvy, I flashed the firmware over to stock Samsung firmware for unlocked phones, and BAM probably did four or five updates in a row, now at OneUI 6.1 and security update at July 1. Since flashing firmware is only for advanced users, I would be weary of this seller if you ever want your phone to update.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone pretty impressed with Build",
      "date": "Reviewed in the United States on June 20, 2023",
      "body": "Ok, so I like the phone overall. The phone functioned as it should. There were some minor issues, not that they impacted function overall. There were some signs the phone was taken apart and repairs done. Upon initial start up the phone became instantly hot, like immediately. Slowly cooled down and didn't seem to get hot again. Second issue was a white substance where screen and body meet at the bottom near mouthpiece, thought it was white powder, but could not wipe away no matter what I did, even a small razor could not get rid of it. Not sure what it was, not easy to see, but it was there. Third the screen had a burn in, that was really hard to see, but when a gray background was applied there was a rectangle burn in. could not see with normal backgrounds, but it was there. Very evident, 4th issue extremely minor and again hard to see but when viewed at an angle the back showed signs of something stuck to the back. They tried to clean, but it still showed when viewed at an angle, again did not impact function. Not an issue, but it seems like some type of sticker was applied at some point. Lastly, the camera created a blue hue to all my shots. It only showed when using the camera light. Normal shots looked fine with no flash, but flashed shots always showed a blue hue no matter my settings. Overall screen looked fine and phone did function as described, no noticeable blemishes as advertised. Screen was blemish free, phone went through about 2–3 hours of updates. And installs, plus my files. So about 4–5 hrs in total get it up and running properly. But once the updates were applied, everything preformed as it should. The phone was extremely fast and transferred my number with no issues. 5g was working flawlessly and extremely fast compared to my last phone. Size is nice coming from a 6.7 in phone, but the screen on this phone was just fine. the gray color on the back is done extremely well, not cheap looking gray, but something very clean and refined. Impressed overall. Not sure if this was a company issue or Samsung issue. So not sure how to rate the company overall good experience, but examine your phone carefully. I returned mine, but you never know what you're going to get, from any of these companies, I'm sure they deal with all types of problems with phones coming in. I can just imagine. Its a crap shoot overall.",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Powerful Phone",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "This is a good phone, it has a great battery life, an awesome camera, and the processor is very fast. The display is just great for video and movie playback. For anyone who is on a budget for a phone and looking for a little specs, this is a great buy."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty Good",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "Just bought two of excellent condition, one for myself and one for my dad, and both of them seemed pretty good. I was expecting some minor scratches, but surprisingly, there wasn't any, as you can see in the photos. I ran a quick check using the diagnose in the Samsung Member app on both of them, everything seems okay including the battery, and as far as I can tell, both of them are unlocked.There are two things I do want to point out. First, I believe starting from s20, there is no more 3.5mm earphone jack, so remember to get a new earphone or an adaptor. Second, for this model particular and maybe all s21, there is no SD card slot, so you only have 128gb fixed.The one star off was for the charger that came with it. You can tell it's one of those cheap ones the moment you touch it. You can also see that the port is not aligned in the photo. What's super funny about it is that, the brick works with other cables, the cable works with other bricks, but when you put this brick and this cable together, they don't work. If you guys are buying chargers like this, I will just suggest not to include a charger so you guys can reduce some cost.With that said, this is definitely an awesome deal. After all, the price is about 1/4 of the price of the newest models, so it's worth trying.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Short Battery Life",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Battery doesn't hold the charge.  I have to charge at least once a day.  It goes down really fast.  I previously used a Samsung Galaxy different model and only had to charge every 2-3 days.  I may contact seller for resolution.  This doesn't seem right."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Item came in wonderful packaging 0 issues with shipping and setup was super easy. For a flagship phone the price was a surprise. 100% Would Recommend."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to transfer",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "It was nice to find a phone that was unlocked and ready to put to good use. My husband used \"smart switch\" to transfer things from his old phone. Be careful if you do that because it told him all his memory was used up. We had to go remove a lot of things, but after that, he seems to like the phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone in great condition",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "I was a bit skeptical buying a \"renewed\" product, but amazon renew has delivered a near flawless phone to me. There was a few scuff marks on the outer metal band, but other than that no scratches or breaks in any of the glass. The battery life lasts about a day with a lot of use. I would recommend this over buying a bran new one. Also you can not beat the return policy if you decide you don't like it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Outstanding phone",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "This phone is amazing! Everything I dreamed it could be! Yes, it is an older phone, but when you had a dinosaur. It is way superior to anything else I have used. Thank you!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition was excellent",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "So far so good it came in awesome condition and was just 1 day late so it's ok. But ya as of now I'm happy with this phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked! Registered to someone else.",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "I need to edit my review (original one star review below) because the seller did unlock the phone for me, which I noticed the next day, after I already purchased another phone from someplace else.  But they did not ever get back to me and tell me that they were going to take care of the problem or that they had done so.After that, other than being full of Verizon bloatware, it was fine.  I ended up only using the mother board because I dropped it about a month later. I'd dropped my old phone a bunch of times with no damage but this one was so damaged it was unusable, so I just took it to the repair place and had them remove the motherboard and pop it into my old phone. Voila!  A sturdy phone (my old one) with a working mother board (this one.)My Original Review:This phone was not 'unlocked' and is only usable on the Verizon network.  Verizon could not unlock it because it is registered to another user!  Doesn't the seller check the phones before they polish them up and resell them?  Seller initially responded to my inquiry with a request for some information off the phone which required me to go through the whole setup process.  But after I provided the info, they ghosted me.  So frustrating.  I've spent the rest of my day trying to buy a phone somewhere else since I don't know if or when they will get back to me."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The price to performance on this phone is absurdly good",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Got an excellent refurbished Galaxy S21 and let me tell you, it's probably the best 200 bucks you will ever spend. If your sick of overpriced new phones, the S21 offers basically the same performance and a really well aged camera. Even though this phone is almost 4 years old at the time of writing this review, it still kicks crazy good. I would definitely recommend to someone who isn't trying to spend $250+ on a phone. When I unboxed the phone I was extremely surprised to find that were close to no scratches on my S21. I also love the sleek design of the phone itself, I really miss when phones looked like this. screen size is perfect. I assume the durability on it is pretty decent but I am not dropping it as a test, because I don't even have a case or screen protector for it yet. Thank you so much to the seller for making an affordable that's in excellent condition and selling a top tier phone.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You'll be happy you got it",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I love this case, very strong and gives the phone a sturdy feel in addition to great protection."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works with my new hearing aids!",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "After trying six different phones it was great to find that this Samsung delivers the sound directly to my hearing aids. I'm now able to hear on the phone like I did forty years ago. No, even BETTER than then.This refurbished phone in no different than a brand new one, except for being one fifth of the price."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Performance with Minor Cosmetic and Battery Issues",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "I recently purchased the Samsung Galaxy S21 5G (Renewed) in Phantom Gray, and overall, I'm quite pleased with my purchase. The phone offers excellent performance, and the unlocked version provides great flexibility with carriers.The Galaxy S21 5G is fast and responsive, handling all my apps and multitasking with ease. The camera quality is outstanding, capturing sharp and vibrant photos in various lighting conditions. The display is crisp and clear, making it a joy to use for streaming videos and browsing.However, as with many renewed products, there are a few minor drawbacks. Upon receiving the phone, I noticed a few scratches on the back and sides. While these are purely cosmetic and do not affect the phone's functionality, it was a bit disappointing to see them.Additionally, the battery life isn't quite as robust as I had hoped. It generally gets me through the day, but I've noticed it drains a bit faster than expected, especially with heavy use. This isn't a deal-breaker, but it's something to be aware of if you're a power user.Overall, the Samsung Galaxy S21 5G (Renewed) is a fantastic phone that delivers high performance and flexibility. Despite a few scratches and some battery issues, I'm satisfied with my purchase and would recommend it to others looking for a great smartphone at a lower price.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Takes Amazing Pics",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "It's sleek and small with an amazing camera."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Acceptable conditions phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I am surprised of how amazing my deal was !!!I ended up getting a very good looking acceptable phone for a great price 👍100% recommended 👌Thanks Amazon",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value.",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Good product, good price and fast shipping!  I was not thrilled about delivery dates of Feb. 20-24 for delivery but it came today the 19th! Can't go wrong with this seller. Free returns."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Advanced Phone!",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Phone is in great quality and is very fast"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A+",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Giving an A+ on this order! And very happy with this phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy bonito el color",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Exactamente lo que pedí me encantó funciona excelente"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The seller was very quick to ship and the package was exactly what it was meant to be",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "He loves his phone it come quickly and was ready for him to transition into"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Here's my experience with it after 15 months of usage",
      "date": "Reviewed in the United States on December 18, 2022",
      "body": "I've been using this for 15 months, and the device work flawlessly, as it is supposed to. I paid ~$520 for it in Sep/21, today at the time of this review it cost about half of what I paid for.Pros:- Already on Android 13;- Very good display with decent size;- CPU/RAM are as fast as it gets;- Radios (5G/WiFi/Bluetooth/NFC) are really really Fast;- Camera is top notch, on par with (or even better than) the latest iPhone, Pixel or Xiaomi;- Samsung software is stable and well rounded off;- Samsung DeX works better than I expected to;- Very Fast USB-C 3.2 transfer speeds;Neutral:- Charging speeds could be better;- No IR Blaster, what a shame, would be really useful;- This one is Locked to T-Mobile (but can be used by it's subcarriers like MetroPCS aswell)Cons:- If you plan to unlock this device for anything other than T-Mobile, oh boy, you are in for a Ride. After 15 months using this phone, it's still jailed to them. Went thru many support agents, took it to T-Mobile stores, and they couldn't figure out how to unlock it. Had to pay $110 on those unlocking stores.- On-screen fingerprint sensor SUCKS, even more if you use a screen protector. The back or the side are the correct place for fingerprint sensors.- Battery is Ok-ish and can give you a full day (~10h) of battery, but you need to put almost everything to sleep, constantly close apps and have battery savings turned on 24/7. If you don't watch your usage, battery goes of in half a day (~5h) or less;- No microSD slot, I have to delete or offload stuff about twice a month;- No 3.5mm Jack, only take Bluetooth headphones;- Samsung Pay dropped it most useful Magnetic Strip feature on this phone, which was being able to do Payments on Card machines that don't take NFC, and I bought this phone looking for this feature;With that being said, if you need a good all-rounder, at current price, this is the way to go.",
      "helpfulVotes": 35
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product description",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "It was correctly described to what I received. It matched everything I needed and asked for. It was shipped in a timely manner. All and all I had a great experience with the seller."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I recommend them",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "This phone came in great condition and even a charger and the box. I highly recommend this seller"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The best camera ever ! Better than any iphones",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "The camera on this phone is awsome  I bough it because it has a great quality camera and I need that to take pictures of the jobs I do, so I can show people and they can  see the details clearly. This cam has 108 megapixels and I can zoom the photos so close , and see details that are impossible to see with the eyes only. The video quality is great, is like a professional camera recording. It has 4k video. The only problem is that it uses a lot of processor power to record in 4k so its only good to record short videos like 20 minutes, because the phone gets hot, and stops the video and saves it if it gets hot. so I keep the video on lower quality and its still great quality. The front camera is very good too.  And the phone works pretty smoothy, doesn't usually freeze or crashes like some older phones I had.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone, Poor Battery",
      "date": "Reviewed in the United States on May 17, 2024",
      "body": "This phone is wonderful. It's extremely fast, loads everything pretty much immediately, has a good, loud speaker and has done everything I have needed it to do perfectly. The only issue, and unfortunately is a very big one, is the poor battery life that it has.The SECOND I take my phone off the charger it IMMEDIATELY starts to drain even when I'm not using it or have nothing open.I'll take it off charge in the morning, look at the time and set it on my night stand on the lock screen while I get ready for work which only takes me a few minutes as I shower the night before. So simply getting out of bed, putting my clothes on and brushing my teeth is all I do and by the time I get back to my room my phone has already dropped around 5 or 6%.I work 8 hours. By the time I get to work my phone is usually in the 80s percentage wise and at the end of my work day it's fully dead.All of my older phones: Samsung Galaxy A50, LG V20, etc all had very long lasting batteries even though they were much cheaper phones than this and they would literally last me from the minute I woke up, until the minute I went to bed and that's WITH continuous usage including playing Spotify all day at work.This phone dies so quickly and if I'm using it continuously or using it to listen to Spotify at work it will die within a matter of two hours and that may be generous.I'm not sure why the battery is so bad, I know it's likely because it's refurbished because I'm sure a brand new model wouldn't be like this, but with this refurbished phone the battery life is horrendous.Other than that though this is a wonderful phone and if you get one that has a good battery I am 100% guaranteed that you will be MORE than satisfied!",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Llegó en muy buenas condiciones"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal on refurbished phone, only a few problems that were resolved",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "The first phone I received looked like NEW and worked well I thought until I received a call. The person said my voice was cutting in & out like a CB radio. after much testing I realized it was not the mic, as videos recorded audio perfectly but phone calls or messenger calls had my voice cutting out constantly!I exchanged the first phone for another, It came quickly and after 1 month it has worked flawlessly. The second phone was also like new with zero physical or functional flaws however, the NONSsamsung USB charging block soon overheated and spewed a burnt electronics smell. Not a real concern since I already have several Samsung & other chargers.Overall I am happy with the deal and would do it again, Just make sure to test ALL functionality as soon as you receive it!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "The look is so new, uou can not tell its refurbished. The feel is so sleek and the size is perfect.Does this phone not come with a calculator though?"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "You can definitely see the previous owner didn't use a case but I really don't care what phone looks like as long as it works than that's fine by me. Thank you missed this Camara a ton"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped working after 11 months",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "I bought this phone as a birthday present for my brother-in-law.  I have the Ultra 23 and like it a lot and this has many of the same features for about a 1/3 of the price of a new Ultra 23.  The Ultra 21 looked brand new when it arrived and my brother-in-law loved it. It has worked great until the end of the 11th month.  The first problem was that it stopped being able to make calls or receive calls.  We talked to Verizon customer service and they had us remove the SIM card and then re-activated it via an ESIM download.  The very next day the phone stopped charging via a C-cable.  We tried different cables and made sure the C-port had not debris in it. Nothing helped. Fortunately, the phone would still accept a charge wirelessly.  Unfortunately, it stopped making calls the day after that unless on wi-fi.  - The phone has been protected in a case and shows no sign of physical damage so there appears to be no reason for these problems other than defective components.  These problems could be unrelated to the phone being \"refurbished\" but it does make me wonder."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "So far so good.  Doesn’t look refurbished at allData transferred easily from other phone and connected to T-Mobile network without a problem."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would order again",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Good phones when i order they said it wouldn't come until a week time but mine comes in 3 days ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Malfunction",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "phone did come on time as for quick delivery, but the phone malfunction and also was not fully seal a portion on the top of the phone is not glue in . and the phone stuck on rebooting after i transfer all my personal file and apps. also my crypto wallets, and i can't even returned due to the fact i can get it to stay on to reset it to its original setting."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good, but not excellent condition",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "The phone came nicely packaged in an Amazon renewed box with a usb C cable, non OEM charger and sim removal tool. The screen was flawless, which was protected with a clear plastic wrap. Im taking off a star for the scuffs and scratches on the back and sides. They're weren't bad enough to get replacement/refund. I'll be buying a case anyways. Ive had the phone for a week and it works great, which was the most important thing. It was a true unlocked phone. The battery was stated as 89% in the 'phonecheck' invoice. My only regret might be not getting the 256gb version.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Put photos of actual phone and issues",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Phone glitch when charging back was not stated was replaced in review for phone. Might trade"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beautiful Condition! Easy transfer! BUY IT!",
      "date": "Reviewed in the United States on October 16, 2023",
      "body": "***11/10/23 Update***  Took one star off due to issues with android auto. The cord I received with the phone DOES NOT work with android auto, car screen just says \"reading usb\" and then eventually kicks me off android auto. Tried an old Samsung cord I had from an old phone that works but it does seem very sensitive and loses connection to android auto  - not sure if that's an issue with the port itself? *****I needed a replacement phone quickly due to the screen going out in my trusty old S10 but didn't want to pay $1000 for a new phone so I was looking to get used/refurbished. I was skeptical with some of the negative reviews for the condition of the phones but I am SO happy with my purchase so far. The phone was delivered on time and packaged very securely and with protective stickers. Came with a Samsung charger that looks new. The phone is in EXCELLENT condition, literally looks brand new. There is a hairline little scratch on the screen you can barely see which I'm going to cover with a screen protector anyways. Phone was at 82% when it arrived. Booted up, put sim card in, working like a charm! So far SO GOOD! Less than $250 for a nice like new upgrade from the S10. If you are on the fence - BUY IT! I can't believe I've ever paid so much for new phones from the cellular company. Probably never will again!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone. More like \"excellent\" than \"like new\" condition though.",
      "date": "Reviewed in the United States on February 21, 2022",
      "body": "After spending a day with my \"new used\" S21, I am very happy with it. I live in the Southeast and use C Spire, a smaller carrier, so I was a little apprehensive about this phone's true \"unlocked\" status, but I popped the SIM in, and the device was immediately up and running. No worries there. Between that and the native software to transfer contacts, texts, etc, the transition beteen my old Galaxy and this one was quick and seemless. The phone itself is gorgeous. The deep colors, that awesome refresh rate, video, scrolling, all good stuff and why I'm a Galaxy S dude. I can tell with just a little experimenting that the camera is pretty good too, though I'm not much of a photographer. Having said that, the few unskilled snapshots I've taken look pretty danged nice. The battery life, eh. Not quite as good as my old S9+, at least in the first couple of years of that phone's life, but not as horrible as some reviews make it out to be. After a fair amount of YouTube, browsing, and adding apps, lasting the day wasn't a problem. I think most will be good with it. My only complaint: Amazon says these refurbs are sold in like new condition. And this is the third S I've bought renewed from Amazon, and have had *zero* problems until this little bugaboo. This is one great phone, and overall looks pretty new, but there is what appears to be a little chip in the bezel on the left side. It isn't hugely noticeable, but it certainly is there, and is discolored compared to the metal around it.  I would really describe the phone as more in excellent condition than like new, but by no means would I call this a deal-breaker, but  it does make me feel like I spent a little more on the phone than I should have. But, you know, the horror stories I've seen in other reviews have not been my experience on go-round number three, so all in all it's not the worst thing ever.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not \"Refurbished Excellent\"",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "The product was delivered at the time promised... At no fault of the seller , the package was not placed where it was supposed to be placed According to my delivery instructions. Which could cost the seller myself and the company more money....Back to the phone.. The phone is described as Refurbished Excellent... Overall the phone is in decent working order.. So far it does what it's supposed to do... Except battery life is very short and lots of fine scratches all Over the screen... It was package very poorly.. The USB charge block and type c cord is not a match for the phone And the charge block has Cosmetic scratches... I would not rate this phone as Refurbished Excellent...",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Camera",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I bought in September 2024.  Today camera is so bad that I cannot take a Pic without it looking like the camera needs cleaning. The pics are very fuzzy. Also I have to reboot the phone often because the screens freeze. Looking  for another phone now"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "Me gusta mucho el celular, funciona super bien, vino desbloqueado y su estado es como la descripción lo indica, bueno, el único detalle sería que decía que venia con cargador el celular pero solo vino con el cable USB cuando decía que tenía hasta el taco y el celular se descarga muy rápido, no sé si eso es lo que conlleva comprar un celular renovado"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good to buy",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "good budget price renewed phone. so far works fine"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality control can be an issue, but when checked well, the renewed S21 is great!",
      "date": "Reviewed in the United States on October 26, 2023",
      "body": "My husband and I both ordered the phantom gray S21 from thegadgetdeals. His came first, and it was perfect, so I was really excited about mine. However, when mine came, it was so scratched up and bumpy on the back that I did not feel it met the excellent condition it was described as. I returned the phone and ordered a replacement. (One thing I will say about thegadgetdeals is that I never had any issues with their customer service, and they always worked with me.)My replacement came and everything looked good until I turned it on. The bottom right of the screen had dead pixels that wouldn't light up no matter how I tried to troubleshoot. I had to request a refund and then order again (couldn't get a replacement for an already replaced one).The third one came, and everything seemed perfect. I had already started getting the phone set up when I realized that the bottom speaker was not working at all no matter what I tried. So I returned again and was about to give up and try to find a new one to purchase.I decided to give it one more go, and my FOURTH one came earlier this week. This one has been perfect so far, and I don't have any complaints with it. Renewed can be awesome, but be careful about the seller. Quality control seems to be the biggest issue.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING CONDITION! LOVE MY S21",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Was very weary of buying a refurbished phone. But was very very happy. Bought in excellent condition and IT WAS EXCELLENT. not 1 scratch or scrap. Battery seems fine. Very happy with my purchase. Will be buying my wife's phone from this seller as well"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed Samaung galaxy S21",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "While the phone works great there were 2 issues with the phone. First off the c plug  on the phone was crooked and I needed to buy a charging pad so as to not completely damage the plug on so I could still plug it in while in my car. Second and most important..if the user before you had a Samsung account( and why wouldn't they) there is an incompatibility and you cannot have your own Samsung account on your phone...which means no connection to Samsung health or a Samsung watch nor other Samsung apps which require a log in..which you cannot do due to the previous account not allowing a new account be added.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great refurb choice!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Very satisfied with the phone. Setup was simple when connecting to Consumer Cellular network. Battery charge settings needed adjustment.  Phone expects to find Verizon SIM on reboot. Just delete message.  Works great. Much better than my Motorola."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect phone!",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Phone arrived in mint condition and works like new. Super fast, crisp color, great sound....typical Samsung:)"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone for price",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "Charger that came with the phone is junk,  charges to 50 percent and almost burnt my hand unplugging from the wall. Phone had minor scratches as expected, but nothing seriously wrong with appearance."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    S-21 is fine, but I should have read about the differences from the S-10 before ordering.",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "There are still things I'm having difficulty with: 1) It is much more difficult to turn this phone off using the 2 buttons on the right side of the phone.  It generally takes me several tries to \"reboot\" the phone.  2) I didn't realize that the S-21 not longer had an SD slot where I stored my photos.  Thank goodness, they are still on the Cloud!  3) I'm still trying to set up WhatsApp on the S-21 and transfer all the information from the S-10 before I return it to the vendor for the Trade-in reimbursement before it expires.  4) Battery life of the S-21 isn't much better than the S-10."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything fine just 1 thing",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "Everything is fine a nice renewed phone almost without scratches but the speakers doesnt work at all."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone but the charger is a fire risk!",
      "date": "Reviewed in the United States on February 13, 2023",
      "body": "The phone is great, I love it! I want a new phone that has a great camera, more storage then my old iPhone SE 2020 (my iPhone had 64 GB), and good memory. I have Consumer Cellar and it supports with my phone plan. When I was video calling with my boyfriend, my camera was sharper and more clearer then his iPhone 13.  It runs very fast and the call quality it great! Every one of my friends and family said my voice was very clear and loud! Also, I don't have a hard time hearing people from the other side of the call.  It runs very fast and it doesn't glitch on any of the apps I downloaded on it. Also I use my phone a lot and I can go for a whole day without charging my phone.I do have a problem with the brick and charger cord that came with it. The charger cord was rusted on the one end of it and my Samsung didn't support the cord. The brick is a huge fire risk! I was charging my phone with a different cord and I started to smell this burning electrical smell. I realize it was coming from the brick and when I unplug it, it was very hot. So I threw both the charger cord and brick away. So I recommend that if you get this phone you should really order a different charger and brick for it to replace the one that comes with the purchase of this phone.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for what it is.",
      "date": "Reviewed in the United States on July 8, 2024",
      "body": "Overall the phone works well for what it is, a used phone. Battery holds a charge, screen has no damage and the phone operates the way it should.My only complaint is that the seller has a low bar for what \"Excellent\" condition means. Phone does have normal wear and tear (scratches and dings) around the sides and charging port. All things I would expect for a used phone. But it's a LONG way from being \"Excellent.\"I'd recommend either not spending more money for the \"better\" condition phone, or have a realistic expectation of what you'll get.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone accidental buy!",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "This product was not unlocked for my carrier. I had a different carrier,and product was returned. Company shipped phone quickly. I purchased accidently."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a cellular phone, more like android ipod",
      "date": "Reviewed in the United States on October 22, 2023",
      "body": "So after purchasing this phone it took a few days for it to deliver and it got delayed a day from its original delivery date. Not a big deal. The moment I received and opened the phone it looks great! The screen looks awesome. As an iPhone user I can see clear upgrades from my iPhone 11. Oled screen, 120 hz, bigger screen size, hole punch camera, only got it for $240 or so. The issue I have with this phone is I noticed the volume button doesn't work as well and likes to get stuck which is annoying. Also, the worst part about it is the sim card slot is like welded to the phone. How am I going to use this phone?? I have to stick to my iPhone because I can't use cellular data unless I get a esim card but I don't want to do that. I am honestly going to return this phone because it's pretty much a android iPod that I can only use at home. I recommend just buying a new samsung galaxy s23 and get on a payment plan or save up and buy the phone in full. The other scenario is if you happen to fall in this situation you could return the phone and get another one and bank on the fact it doesn't have the same issue or a new issue with it. For myself though I am just going to return it and save up for an iPhone 15 pro.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Replacement",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "Said it was compatible with Cricket it was not I had to return it and get another one.  They were very good with their customer service stuff so I did end up ordering from them again in the second phone it was great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy your re-furbished phone from Re-Cell and no one else.",
      "date": "Reviewed in the United States on April 9, 2022",
      "body": "If you are going to buy a re-burbished phone, make sure the seller is Re-Cell. Because of the 5g switch with AT&T my phone would not make phone calls. However, I did not know this was the issue and no one could help me get my phone working. For 2 weeks I didn't have a phone. However, within 1/2 hour of contacting Re-Cell, they provided the information I needed, and I now have a perfect phone.Re-Cell provides excellent customer service, willingness to help, information, fast response and the offer to replace my phone even though it was not their issue. I was extremely nervous buying a refurbished phone for the first time and had it not been the AT&T 5g issue, I would have been immediately happy with my purchase. I made sure I purchased through Re-Cell based on previous reviews and am so thankful that I did.READ FURTHER IF YOU ARE HAVING ISSUES WITH YOUR NEW 5G PHONE. Go to AT&T's website. (I had not done this because I never thought of it because I was working with Consumer Cellular-who should have known all this). According to AT&T's website, the phone I had should still work.; Galaxy S21 5G (G991U*, G991U1, G991W, G991B, G991B/DS). My phone is G991u1. However, if you go further, the website also indicates that a software update may be needed. My last software update had been on March 23, 2022 and my phone was set to automatic updates so I figured I was all updated. Regardless, I manually clicked on updates and found out that there was indeed an update. After 3 hours to download and install, my phone now makes calls and works perfectly.So, here are things you may want to try if your phone won't make calls:  1. Check your phone on AT&T's website (not just your provider). Check to see if your phone should still work on AT&T's 5g. (According to AT&T, Galaxy S21 5G (G991U*, G991U1, G991W, G991B, G991B/DS) should work. My phone is G991u1. However, go further to see if a software update may be needed.  2. Do not rely on automatic updates on your phone but manually check for updates. Install the update if available.I am a happy customer thanks to Re-Cell. Make sure you buy from them.",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone came in good working condition",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "Everything is as you'd expect it to be. Everything works fine. Only thing I don't like about it is that it shuts itself off ever few days at random times. I have went into the settings and turned off that feature and it still does it. Would be awful to happen if there was an emergency and I needed to call for help but otherwise phone is great. And for the price you can't beat it. I would buy again",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bloqueado y faltan piezas",
      "date": "Reviewed in the United States on August 29, 2023",
      "body": "Compre este dispositivo por que en la publicación decía que el dispositivo estaba desbloqueado y una estética 10/10 este teléfono lo compre para exportarlo hacia el salvador, entonces cuando lo resibi y miro que le hace falta la bandeja sim (el paquete nunca fue abierto en el trasporte hacia mi pais) entonces me pongo en contacto con el vendedor y quedamos en un acuerdo que me iba a devolver el valor de la bandeja sim, cuando compro la bandeja sim me doy cuenta el que teléfono estana bloqueado con at&t, yo ya no podía devolver el teléfono por que estaba en otro país y me salia muy caro en mandar el teléfono hacia los Estados Unidos entonces estuvimos discutiendo con el vendedor para que me devolvieran el valor de la liberación o que me proporcionará el código de desbloqueo, entonces ya después de estar discutiendo por 3 días el vendedor acepto darme el código de desbloqueo, espere 3 días el código hoy llego y pude desbloquear mi teléfono, tuve ese problema con el teléfono pero el vendedor me soluciono todo el problema, el teléfono tiene una estética 8.5/10 la verdad tiene varios rayones en la pantalla y en el puerto de carga de ahí todo bien buena pantalla, le dura bastante la batería pero la verdad calificare al vendedor con 3.5 estrellas por que el producto no viene desbloqueado y le faltaron piezas pero el vendedor siempre se comunico con migo por eso la calificación no es tan baja",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Expected more from 5000mAh battery",
      "date": "Reviewed in the United States on February 19, 2023",
      "body": "Thought I'd get a few days between charges but the 888 isn't very efficient even with the processor set to max frequency of 70%, screen to 1080p, and refresh rate locked at 60.  Even at 30x the camera zoom is still more of a novelty than useful. I reverse charged my Galaxy watch once and it took forever. The extra centimeter of height is appreciated when reading long articles and hasn't interfered with any pockets, though the added weight compared to my old phone is noticeable while wearing looser pants.  Being abandoned by LG, I miss many of their software additions, but I've made due returning to Samsung after so many years.The finger print reader is slow and inaccurate especially compared to the instant nature of the physical one on my LG, and the face recognition doesn't recognize me wearing glasses. Luckily my watch unlocks the phone just fine. I've had no problems with the very minimally curved screen, and love listening to music in stereo thanks to the ear piece working with the main speaker.As for the seller, the phone arrived in its original box and wrapped completely in its six sided protection plastic.My next phone may only be the Plus instead of the Ultra, but I didn't mind paying a Plus price for this Ultra.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth The Price And Like New",
      "date": "Reviewed in the United States on October 8, 2022",
      "body": "had i not been told that this product was refurbished, i would not have known. the product is completely cleaned of any grease/dirt/scratches and came with a charger and a little manual.i do not know how long the battery life is compared to a new phone because this is my first android (i had a 1TB iphone pro max 13 but felt it was high-time to switch to an open source linux-based OS even if it meant a cheaper yesteryear phone). i'm really hoping that the korean refurbishers swapped in a new battery just because that is the first thing that ages in smartphones. if i like the customizability on tjis older phone then i'll definitely upgrade to a fancier new samsung in a year or two.my only complaint so far is that the phone came with a completely empty battery. i know that electricity is expensive when you are shipping out old discount phones but i'm going to have to wait all night for a full charge. new iphones tend to come at 60% or so and i was a little worried that the android wasn't turning on until plugged in. it's currently at 8% but not charged up enough for me to open it yet.on a side note, i really appreciate that this product came from a clean capitalist country like korea. i am morally opposed to buying from china and india out of ecological and geopolitical concerns, and amazon heavily favors chinese exports in general.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone - Poor Battery!",
      "date": "Reviewed in the United States on October 6, 2023",
      "body": "This phone arrived (was picked up, rather) in excellent condition - visibly. It is clean, light weight, fast, functions well.  It flows apps like Netflix and security cameras very well with fantastic clarity.  Overall, it is a really nice phone.The drawbacks: - the battery life is miserable, requiring charging at least twice a day or more, and I rarely have Mobile Data  or other power draw apps running - the Hotspot icon is missing from the dropdown menu, and I found no means of adding it - the Messages apps has the annoying \"<Subject: No Subject>\" error, and I have found no way to clear it. I have owned Samsung S3, S6, and S8, and never experienced this error beforeMy biggest problem is the vendor shipped the phone via FedEx who, for some reason, has NEVER DELIVERED A PACKAGE TO MY HOME CORRECTLY!  I had to go the them to pick it up after two failed delivery attempts; however, I can't hold that against the vendor.  Other than that, great phone!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone for great price",
      "date": "Reviewed in the United States on April 15, 2024",
      "body": "I always wanted a flagship phone but couldn't afford the new ones but this one is just right for my budget. I love the camera quality, it can record 4k 60fps which is incredible. The sound and display are pretty good and overall its fast. However, it came with a few minor scratches on the edges and paint peeled off at the charging port. but if you are going to use a phone cover, that shouldn't be a problem. The battery is not that great especially if you are a heavy user. But a light user like me can go almost a whole day on a full charge. I also noticed the phone heats up when video recording and when playing games"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Factory Unlocked",
      "date": "Reviewed in the United States on October 8, 2023",
      "body": "Id like to start off by saying, it wouldn't be a huge issue if you are using a physical sim, however if you plan on using an eSim, just keep in mind the will have a persistent notification of no sim card installed. Also, important to note that Verizon doesn't have RCS texting, so if the alarm SIM card was from Verizon, you won't be able to use that feature. luckily I had one from a carrier that supported it, so was able to pop it in and unlock that feature. The screen did have some light scratches on it, but barely noticeable during use.Next thing is to make sure you complete system updates, create or login in to your Samsung Account and get app updates. Phone works great and no major issues other than above. Phone works as described and came with accessories, though I didn't test the cable and brick (third party) as I already had one. Overall good experience. Would buy again, however, id make sure it was Factory Unlocked next time to avoid the Sim issues.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very very good phone, except came with cheap SLOW charger",
      "date": "Reviewed in the United States on April 27, 2024",
      "body": "Very very good condition for a used phone, except came with (brand new) cheap SLOW charger.  As expected per many reviews,this Samsung model phone is indeed rather heavy leading to hand-cramps for long calls / long use periods, but that's not Seller's fault.  Based on a few comparisons I saw on-line, the phone that arrived was NOT a counterfeit, which is good -- it was my biggest worry.  There are counterfeits out there are VERY hard to discern from the real bonafide Samsungs (so do homework before buying) and beware of sketchy sellers too.  Bottom line: I am satisfied with my renewed phone from GENIUS GOODZ."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They don't pay attention",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "They sent me a pink phone and were supposed to refund me some money for it. Never got the refund and the phone is slow as hell for a s21 . Still better than a Google pixel"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Samsung s21",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "El móvil está en n excelente condiciones, lo recomiendo"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like brand new, except for...",
      "date": "Reviewed in the United States on May 29, 2023",
      "body": "I was pleasantly surprised at how the phone looked like brand new.  I chose the color white, and it's flawless...except for the screen, which I discovered a few days into using it.  I'm not sure what the reason could be, but my fingerprints on the screen look as if I had grease on my hands, and very smudgy!  I had the Samsung S9 for five years prior to this phone, and I kept the screen clean with alcohol wipes, but when I try it with this phone, it just smears more, never gets clean/clear, and the screen just seems like a different kind of glass than what is normally on phones.  Also, I can see a two inch long horizontal line of what looks like a streak of water under the screen about an inch from the top, and it's visible all the time, so for that reason, and the issue with the screen, I'm not sure yet if I will keep this phone.  I believe I have 90 days, or at least I hope that is the case.  Other than that, it works well and no issues so far.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty sweet deal for such an amazing phone!",
      "date": "Reviewed in the United States on May 24, 2024",
      "body": "I was hesitating if buying a renewed phone would be a good idea since I've had mixed results in the past buying refurbished/renewed products on Amazon. However, this particular purchase went incredibly well! And I'm beyond happy and satisfied with my decision to not buy brand-new. The Samsung Galaxy S21 is seriously underrated compared to newer models. This phone's got it all! Superb cameras, a gorgeous 120Hz display and a super fast processor (even for today's standards). I can't really comment on the battery life since I just got my phone today, and it came with only 1% charge left.The phone seems to heat up quite a bit while downloading, updating and installing apps, which is to be expected. However, there are plenty configuration options to help tackle this and more issues. For instance, you can adjust the CPU Processing Speed, helping cope with larger processing loads or help extend battery life.There are certain, minimal comestic dents here and there throughout the phone's body and screen, but, as adevertised, they aren't really visible at a glance.I would definitely recommend buying this phone from this seller if you're looking for a renewed top-notch phone!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy once you figure it out",
      "date": "Reviewed in the United States on April 18, 2022",
      "body": "Edit: I had never had issues with an unlocked phone until now so it took some figuring out. I ended up leaving Xfinity and after 5 days of on/off customer service where they goofed up constantly trying to activate this phone. Verizon was no help either. I ended up going with Tello because in the settings it shows this phone was Sprint brand and Tello is part of Sprint/uses their networks, anyway just 5 minutes with their chat agent and I was good to go. The seller was also easy to talk to, fast at responding and offered to send a replacement or refund if I returned the phone. I wouldn’t hesitate buying from them again! Apparently, s21 in general has trouble with different carriers so triple check.---------------After several days and nights on the phone or in the chats with various carriers trying to activate this phone, I had a gut feeling and went to Sprint to ask them if the IMEI is locked. Lo and behold, it is a locked phone not unlocked and they need the account owner's details to unlock it. So now I have a useless locked phone for about $500 + the phone case + the screen shield + the money wasted on sim cards from different carriers + the time and sleepless nights trying to troubleshoot this + my old phone is now deactivated and having trouble reactivating after the carrier tried so many workarounds for this phone. It's a nightmare and a half. I've never had trouble with a renewed phone before and I even paid extra for the certified like new version. I contacted the seller to see what can be done. I'd rather be able to unlock this one but I don't think that's an option and I'll have to waste time back and forth. In the meantime I can't make calls or texts...",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was is great condition",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "Ordered this phone from Amazon around 5pm on Friday, and arrived at 8:00am the following day.  So, great experience on the fast delivery.  The phone is in very good shape, no noticeable scratches on the back or screen.  When I turned on the S21 the very first time, the system automatically asked me if I wanted to transfer data from another Galaxy phone, so the process of transferring data from my old S10 to this new S21 was very easy.  I haven't actually used the phone yet, but just wanted to say the phone arrived in great condition, and everything seems to be working.  The phone arrived with a plastic wrap around the screen to help prevent damage during shipping.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone with one big issue.",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "This amazon 3rd party seller is good, the package arrived on time and the phone was in perfect condition. 5/5 for the seller. The Samsung s21 however does not get as good of a rating. First of all it has a weird cell service issue where I get poor and inconsistent reception, after looking into online I found out this has been a known issue for a while with people complaining about it on different websites. Very annoying! Also it gives you notifications from the Samsung galaxy store for weird games and apps AND YOU CANNOT TURN OFF THE NOTIFICATIONS FROM IT. While its only a minor annoyance it is the principle of the matter that bothers me. The phone runs smoothly and its a pretty good overall but between the cell service and the ridiculous Samsung ad notifications I choose to switch to a Oneplus phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Bad for a Renewed Phone",
      "date": "Reviewed in the United States on June 12, 2024",
      "body": "I love the features and zippiness of the phone. It came promptly, and is pretty good condition,  all things considered. The back, however, seems to have been glued on with a not-so-good adhesive,  but I can't tell if that's from the renewal or Samsung. Still, not bad at all, and the battery life is great. All in all, it's a good buy. Just remember that it's CARRIER unlocked, not BOOTLOADER unlocked. This phone cannot have the bootloader unlocked, and is not rootable or modifiable."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I received the phone yesterday, and it was exactly as described by the seller. I had previously bought a phone from this seller and was satisfied, which is why I decided to buy from them again. I also recommend this seller to my friends and family."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exceptional Phone & Price",
      "date": "Reviewed in the United States on June 3, 2023",
      "body": "I am more than pleased with my Galaxy S21 5G (Excellent condition) phone!Like other reviews I had read of being skeptical and hesitant about buying a refurbished phone and what condition it would actually be in, I was happy to receive exactly what I wanted.My phone arrived 3 days earlier than expected, securely packaged and appeared in \"new condition\".I had no problems with activation and transfer of my data to my new phone, which honestly is the main thing I dread with getting new phones. After completing the transfer, my new phone has performed perfectly. I closely inspected it and didn't find any imperfections at all.However, I did notice the back cover of my new phone has been replaced with a plastic aftermarket type cover that doesn't have the Samsung name on it. But, that was not a deal breaker for me because it keep it in a protective case anyways and the function of the phone was more important to me.Included in the shipping box with my new phone was a new charging cord, charging cube, Sim card slot key and also seller contact information with warranty and return information also.Overall I am very happy with my new purchase experience and my new phone.I highly recommend this seller in buying a refurbished phone in hopes of settling any doubts you may have as I did initially.I will be purchasing another phone for my son next week from this seller after having such a good experience!",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I haven't been disappointed",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I'm heading into my third year with this phone and I have no complaints, none."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My brother loves this phone",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Best buy. Worth every penny"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just got my refurbished s21 5G in",
      "date": "Reviewed in the United States on May 3, 2023",
      "body": "Condition: A bit roughed up. a few scratches on the corner edges and charger area. 2 very small dents on the back cover.The screen is perfect. brightness works perfectly. Basically looks like new from the front.Transfer of data: I am on Mint Mobile. I was looking for either a fully unlocked or tmobile unlocked phone. Simply plugged in the sim card, ask to transfer data, put the phones on top of each other, and the phones took care of the rest. Very simple.Value: I hate spending money on technology. I cannot justify spending $1000+ on a device I can quickly runover. (Why I'm replacing my current s8+). For a phone that will still receive a couple more years of updates, has technology that is still very usable, and looks impressive, I cannot be happier. This is a refurbished phone, so I can't expect a perfect phone. It's the luck of the draw. But, everything else given, I am really satisfied I now have a phone that feels premium for a fraction of a new phone price. Incredible bang for the buck.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean used unit, poor battery life",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "I bought a Samsung as I had poor luck with a Motorola Purchase and returned the Motorola.  I also was very unhappy with a Pixel 6a due to overhearing and poor battery life.  Having had good luck with Samsung over the years I found this refurbished one here on Amazon.The touch screen was pristine and very good sensitivity.  The unit itself was very clean as well and works greatThe one flaw I have noticed is the very poor battery life, but it is a 2021 model phone.Other than the battery life, it appears to be a good value in a used phone",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First and LAST time i will ever buy a refurbished device",
      "date": "Reviewed in the United States on October 29, 2023",
      "body": "I was very apprehensive about buying a refurbished phone but after reading so many 5 star reviews i pulled the trigger. The first one i got looked brand new cosmetically but any time i would go to charge it it said there was \"Water in the charging port\" and wouldn't let me charge the phone (there was no water anywhere near the phone, let alone in the charging port). That kept happening until i returned it for another one. This one (got it in March of 2023) looked great too cosmetically but functionality is the big issue. First it wouldn't give me any notifications of emails - I went through all the prompts and settings, changed everything I could...still no notifications of emails. The only time it will notify me is if I actually open up Gmail - then it will pop up saying you have x amount of unread messages but if I'm already opening the program it's completely useless! Then I started having people tell me \"I was calling you but it went straight to voicemail\" I thought it was odd but maybe it was service related. I went to my wireless provider and they said there is nothing wrong with the service it's probably the device. My wife has the same exact service with a different phone and has service throughout the house. Now not only can i not make or receive calls in my house I can't send text messages! The phone will say I have full service (5 bars) plus I'm connected to Wifi 6 with a 1 gig fiber connection. When I go to send a message it will just keep spinning and spinning until the message times out after a long time. The only way I've figured out how to trick the phone into sending messages is send the message, turn the phone on airplane mode and then switch airplane mode off again and the message will send. To add insult to injury last month I noticed a small artifact on the screen that does not go away. I've had this phone for less than a year and I have a permanent line on the screen that shows even when it's on the charging screen. I purchased this from the seller \"TheGadgetDeals\" because they had 100% positive reviews - not sure how that's possible if these are the kind of phones they are selling. So with no email notifications, no ability to make or receive calls or send text messages in my house (and a lot of times other places) I effectively have a $450 paper weight masquerading as a phone. If you're ok with spending nearly $500 on a phone that will be essentially unusable within 7 months of purchasing I say go for it, otherwise I'd look elsewhere!1/10 WOULD NOT RECOMMENDPS. After owning the phone for a month or so i purchased another one for my wife (also from TheGadgetDeals) her phone came in excellent cosmetic condition but every time she would make or receive a call the person on the other end would hear an echo of everything they said so that phone had to returned",
      "helpfulVotes": 46
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life could be better",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I've had this phone for a couple weeks. I normally buy the \"A' series when it comes to Samsung but everyone kept telling me that the \"S\" series was better. After the couple of weeks I've had this phone, I would say I like the \"A\" series better. I'm glad I did not pay full price by buying a brand new phone. The thing that I mainly do not care for this phone is the battery life. On my old Samsung I would have about 80% battery by the time I got home from work. With this phone I have about 50% battery when I get home from work. I don't use my phone a lot while I'm at work. The Phone does charge fast if you are using the proper cord but I would prefer a phone with a lasting battery, not a phone I have to constantly plug in.  With that said it makes calls, texts fine, and the app usage is ok. I normally try to keep a phone for a few years but I don't foresee that happening with this only due to the battery life."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked! Registered to someone else.",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "I need to edit my review (original one star review below) because the seller did unlock the phone for me, which I noticed the next day, after I already purchased another phone from someplace else.  But they did not ever get back to me and tell me that they were going to take care of the problem or that they had done so.After that, other than being full of Verizon bloatware, it was fine.  I ended up only using the mother board because I dropped it about a month later. I'd dropped my old phone a bunch of times with no damage but this one was so damaged it was unusable, so I just took it to the repair place and had them remove the motherboard and pop it into my old phone. Voila!  A sturdy phone (my old one) with a working mother board (this one.)My Original Review:This phone was not 'unlocked' and is only usable on the Verizon network.  Verizon could not unlock it because it is registered to another user!  Doesn't the seller check the phones before they polish them up and resell them?  Seller initially responded to my inquiry with a request for some information off the phone which required me to go through the whole setup process.  But after I provided the info, they ghosted me.  So frustrating.  I've spent the rest of my day trying to buy a phone somewhere else since I don't know if or when they will get back to me."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped working after 11 months",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "I bought this phone as a birthday present for my brother-in-law.  I have the Ultra 23 and like it a lot and this has many of the same features for about a 1/3 of the price of a new Ultra 23.  The Ultra 21 looked brand new when it arrived and my brother-in-law loved it. It has worked great until the end of the 11th month.  The first problem was that it stopped being able to make calls or receive calls.  We talked to Verizon customer service and they had us remove the SIM card and then re-activated it via an ESIM download.  The very next day the phone stopped charging via a C-cable.  We tried different cables and made sure the C-port had not debris in it. Nothing helped. Fortunately, the phone would still accept a charge wirelessly.  Unfortunately, it stopped making calls the day after that unless on wi-fi.  - The phone has been protected in a case and shows no sign of physical damage so there appears to be no reason for these problems other than defective components.  These problems could be unrelated to the phone being \"refurbished\" but it does make me wonder."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Malfunction",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "phone did come on time as for quick delivery, but the phone malfunction and also was not fully seal a portion on the top of the phone is not glue in . and the phone stuck on rebooting after i transfer all my personal file and apps. also my crypto wallets, and i can't even returned due to the fact i can get it to stay on to reset it to its original setting."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Put photos of actual phone and issues",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Phone glitch when charging back was not stated was replaced in review for phone. Might trade"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not \"Refurbished Excellent\"",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "The product was delivered at the time promised... At no fault of the seller , the package was not placed where it was supposed to be placed According to my delivery instructions. Which could cost the seller myself and the company more money....Back to the phone.. The phone is described as Refurbished Excellent... Overall the phone is in decent working order.. So far it does what it's supposed to do... Except battery life is very short and lots of fine scratches all Over the screen... It was package very poorly.. The USB charge block and type c cord is not a match for the phone And the charge block has Cosmetic scratches... I would not rate this phone as Refurbished Excellent...",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Camera",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I bought in September 2024.  Today camera is so bad that I cannot take a Pic without it looking like the camera needs cleaning. The pics are very fuzzy. Also I have to reboot the phone often because the screens freeze. Looking  for another phone now"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone accidental buy!",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "This product was not unlocked for my carrier. I had a different carrier,and product was returned. Company shipped phone quickly. I purchased accidently."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a cellular phone, more like android ipod",
      "date": "Reviewed in the United States on October 22, 2023",
      "body": "So after purchasing this phone it took a few days for it to deliver and it got delayed a day from its original delivery date. Not a big deal. The moment I received and opened the phone it looks great! The screen looks awesome. As an iPhone user I can see clear upgrades from my iPhone 11. Oled screen, 120 hz, bigger screen size, hole punch camera, only got it for $240 or so. The issue I have with this phone is I noticed the volume button doesn't work as well and likes to get stuck which is annoying. Also, the worst part about it is the sim card slot is like welded to the phone. How am I going to use this phone?? I have to stick to my iPhone because I can't use cellular data unless I get a esim card but I don't want to do that. I am honestly going to return this phone because it's pretty much a android iPod that I can only use at home. I recommend just buying a new samsung galaxy s23 and get on a payment plan or save up and buy the phone in full. The other scenario is if you happen to fall in this situation you could return the phone and get another one and bank on the fact it doesn't have the same issue or a new issue with it. For myself though I am just going to return it and save up for an iPhone 15 pro.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Replacement",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "Said it was compatible with Cricket it was not I had to return it and get another one.  They were very good with their customer service stuff so I did end up ordering from them again in the second phone it was great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bloqueado y faltan piezas",
      "date": "Reviewed in the United States on August 29, 2023",
      "body": "Compre este dispositivo por que en la publicación decía que el dispositivo estaba desbloqueado y una estética 10/10 este teléfono lo compre para exportarlo hacia el salvador, entonces cuando lo resibi y miro que le hace falta la bandeja sim (el paquete nunca fue abierto en el trasporte hacia mi pais) entonces me pongo en contacto con el vendedor y quedamos en un acuerdo que me iba a devolver el valor de la bandeja sim, cuando compro la bandeja sim me doy cuenta el que teléfono estana bloqueado con at&t, yo ya no podía devolver el teléfono por que estaba en otro país y me salia muy caro en mandar el teléfono hacia los Estados Unidos entonces estuvimos discutiendo con el vendedor para que me devolvieran el valor de la liberación o que me proporcionará el código de desbloqueo, entonces ya después de estar discutiendo por 3 días el vendedor acepto darme el código de desbloqueo, espere 3 días el código hoy llego y pude desbloquear mi teléfono, tuve ese problema con el teléfono pero el vendedor me soluciono todo el problema, el teléfono tiene una estética 8.5/10 la verdad tiene varios rayones en la pantalla y en el puerto de carga de ahí todo bien buena pantalla, le dura bastante la batería pero la verdad calificare al vendedor con 3.5 estrellas por que el producto no viene desbloqueado y le faltaron piezas pero el vendedor siempre se comunico con migo por eso la calificación no es tan baja",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean used unit, poor battery life",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "I bought a Samsung as I had poor luck with a Motorola Purchase and returned the Motorola.  I also was very unhappy with a Pixel 6a due to overhearing and poor battery life.  Having had good luck with Samsung over the years I found this refurbished one here on Amazon.The touch screen was pristine and very good sensitivity.  The unit itself was very clean as well and works greatThe one flaw I have noticed is the very poor battery life, but it is a 2021 model phone.Other than the battery life, it appears to be a good value in a used phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charger port wore out",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "While the phone appeared in good shape, it was found that the charger connector has issues. Doesn't correctly connect when plugging a cable in.Android 14 locks out many of the older app's that worked well without siphoning off all the data on you as you used them. Add this to the various networks that force you onto their newer platforms by forced obsolescence and the phone industry continues to dump on their customers.I'm ready to ditch all of it.Edit, 8-28-24, it seems the reason the charger connection is wore out is because the battery on this phone does not last even a day. This is with VERY light use."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    worked except one of the microphones did not work, oops",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "In general the phone worked, I use my smartphone to control a life sustaining medical device that I wear and so my phone is very important and the changover from one phone to another is complicated and can take days to do, I did the changeover and all was going fine and it worked phone for my medical device but then I went to record an audio message to attached to a text message and the volume was very low, it also would not record audio on videos or any other types of recordings, phone calls worked fine apparently as they use a different microhone.  I researched a fix then I called Samsung and spent over 2 hours on the phone with them and they said microphone is broken! then i took to a local fix it store and we did a bunch of diagnostics and they said the microphone is broken! so I reached out to Amazon and they had me email ASAJ for a replacement, after a few days and multiple messages ASAJ did not respond, I called Amazon and they processed a refund instead of a replacement and when I asked if they knew why ASAJ never responded they said they're likely very busy and that ASAJ cannot process a replacement only a refund.  If I wasnt using my phone for a life sustaining medical device this wouldnt be so difficult but wow, it's really a pain, also when running Samsung Manager phone tests, the most basic of phone tests, it shows the microphone fails, did ASAJ run the most basic tests before sending this phone out to me?  Very disappointing.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy Phone",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "The battery life is not that good runs a little slow but  Other than that the phone is good work like a  Charm but like I said battery life could be battery"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with broken camera",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Great phone. Unfortunately it arrived with the camera not working. Too much hassle to send back so Im going to take it to be repaired in town. I was so excited for the phone because of the camera and processing speed. Just sad that they didn't fully test it before deeming it working."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen doesn't work and body not in excellent condition",
      "date": "Reviewed in the United States on July 18, 2023",
      "body": "CONDITION:When I opened the box, I could tell that the phone was not in what Amazon describes as excellent condition. The description states \"This product is in Excellent condition. The screen and body show no signs of cosmetic damage visible from 12 inches away.\" I took two photos from 12 inches away. Okay, no big deal. I'm going to put a case on it anyway.I attempt to turn on the phone and nothing happens. Okay, maybe it just needs to be charged. I charge the phone with the included charger and cable. It still won't turn on. Okay, maybe the included adaptor or cable is bad. No problem, I have an Anker GAN charger and cable that I can use. After 30 minutes, it still won't turn on. That's not good. I try charging it on my QI charging pad because maybe the charging port is bad—still nothing. So, I do a few Google searches. Maybe it's got the black screen of death. I try a few methods of restarting it.  It reboots apparently. I only know that because it makes the Samsung sound. Unfortunately, the screen has remained off this entire time. So yeah, it's got a screen issue.SHIPPING:The phone arrived earlier than expected. That's the only positive that I have.The phone was shipped in a small white box inside of a bubble mailer.  The box that the phone arrived in was partitioned, with the small upper section being larger than the phone.  The box had nothing in it to keep the phone from jostling around. More than likely, the screen worked before it was shipped and an internal connector came loose.OVERALL:It's a refurbished phone. I wasn't expecting anything amazing. If it had just been scuffed on the edges, I would have slapped a case and screen protector on it and been happy. However, if it's scuffed and the most important part of it doesn't work (the screen), I'm annoyed. Now I need to wait for the seller to approve my refund, then purchase another phone and wait for it to arrive. Maybe I'm lucky that it had the issue when I first received it instead of 91 days later when it's just out of warranty.I'm sure the seller is fine and most people receive great products.  I do believe the products could benefit from slightly better shipping. So no, don't avoid this seller, but be aware that these things can happen.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's fine - not perfect",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "Didn't come with the original Samsung back cover. Makes me wonder what the back-story is with the phone I received. The camera didn't want to stay in focus, especially when zooming. There weren't any scratches or visible damage. I just don't think it's worth $200 for a phone that you're not 100% badly with when there are other choices. I returned it for a new mid-range Galaxy and I'm happier. If you want to stick with a flagship, though, I'd recommend this phone. You're more than likely to get one with no problems. I've had great luck in the past, but thus one I received just want the one."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To good to be true",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "It took me awhile after i got the phone to take the time to try and set up. Ended up taking it to verizon to get it started to set up. Hot partially set up and now says no sim!!!! Wish i would have had tried within time frame to teturn!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I don't like the drums"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sim card reader",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Everything seemed fine until my Sim card wouldn't read. I brought it to t-mobile and they said the chip reader is broken. I did get my full refund so that's why I gave 3 stars instead of 1"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    At first glance phone was like new but mic did not work properly",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "At first glance phone was like new but once I started using it noticed microphone volume was kind of low, other people complained of not hearing me well, I had to pay to get it fixed, since local service shop told me it was a faulty SUB PBA BOARD, still waiting for a response from the seller. BEWARE!And  returning the phone isn’t an option in this case because I’ve already sent my old phone to Amazon for trade-in."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It arrived with smears and a scratched lens",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I haven't use the camera yet but the top lens has a scratch. Hopefully, it doesn't effect the pictures much."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy s21 5g",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "This issue is partly my responsibility. I did check reviews before making the purchase and noticed several complaints about receiving carrier-locked phones despite them being advertised as unlocked. Amazon did acknowledge these complaints and took ownership of the fault. Prior to ordering, I reached out to the company to confirm that this issue had been resolved and emphasized that it was crucial for the phone to be unlocked.While the phone was delivered promptly and in excellent condition, it turned out to be locked. I was surprised by the lack of assistance from Amazon customer service, as they have typically been very helpful. My attempts to contact the company went unanswered. Although Amazon offered a refund, I had already been without a phone for 3.5 days. Their only alternative was for me to find and pay a third-party service to unlock my phone.Out of options and needing a phone asap I did hire a third-party service, which cost an additional $45. They were the only part of this ordeal that went smoothly. For anyone facing a similar situation, I highly recommend Unlocker Plus; they provided outstanding service!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective Charger",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "The charger sent with the phone was defective and there is apparently no option to swap out the charger without swapping the phone as well.Phone works great so far, just frustrating that there isn't a reasonable solution to solve the seller's error."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very very poor battery life",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "You can tell this phone is pretty capable when you first use it but there is a real big lie being orchestrated here.Even the phone will say you have some 22 hours left of battery and yet a full charge will last maybe half of that. Maybe. From just being on standby too. It holds battery about as well as i can hold a gallon of water with one hand."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This last phone phone locked up at times.",
      "date": "Reviewed in the United States on June 20, 2024",
      "body": "I like the Samsung S21, I have bought 4 of them here, but had to return 2 of them for problems. Both of them were locked to Verizon, and last one kept locking up. You might lose service, or maybe lost audio, maybe waze would stop and quit telling you turns or update the map.Amazon help wanted me to go back to seller, but I have had hard times with that, so I used the amazon return and let them deal with the customer. That's why I buy from Amazon and not Epay."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Excellent per Amazon's guidelines",
      "date": "Reviewed in the United States on April 16, 2024",
      "body": "Per Amazon a phone in excellent condition is described as follows:Screen: No scratchesBody: No signs of cosmetic damage (scratches, dents, and other) are visible when the product is held 12 inches away.Functional Condition: Fully FunctionalBattery: >80% of original battery lifeAccessories: Generic or original equipment manufacturer accessories and packaging provided----the phone I received has pitting along the sides that is visible from over 3 feet away, and I dont have the greatest vision.  the included accessories were Motorola and the cable did not work when plugged in.  my order was lost before it shipped and was eventually sent to me after I contacted Amazon.  outside of the nonoperational accessories and the damage to the sides of the phone, it does work and the screen is clear of scratches",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had spotty bluetooth, then a software update killed the touch screen",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "From the get-go, the bluetooth would occasionally fail to send data. I have two pairs of bluetooth headphones that have never had any problems, but there would be intermittent skips and drop-outs when listening to music on this phone. This was more of an issue when I stayed at an AirBnB that used a bluetooth app to unlock the front door; it would take a few tries to open.Then, on May 23 2024 I ran a software update. The update ran, but when the phone rebooted the touch screen didn't work. Soft resets didn't solve the problem. I took it to a certified repair store and they couldn't figure out what happened, but it would cost $200 to replace the touch screen. I went so far as to do a factory reset (since I had recently backed up my data), but that did nothing. That would've been $200 to repair a phone that cost me $450, three months after I got it.Samsung won't cover it because I bought it off a third party, so the best I can do is use it for a trade-in credit as I buy another phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    one problem for another",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "This was the second attempt with this. the first phone I ordered the calls would go through but I could only use the speaker, the ear speaker wouldn't work. so I returned it and had them replace the phone. this one the speakers work but the screen goes off mid app and I have to put my pin back in to get back in. At this point just keeping the phone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    S21 Not in excellent condition programming wise",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Cosmetically the phone is great. But it continously says there is an update for the exact same update, no difference at all.  It did a system update 10 times before I figured out how to stop it by pausing it. The microphone does not work at all, I have to use my Bluetooth for people to hear me"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beautiful",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "We were excited when phone cane in but disappointed that after activating the phone and setting it up that same afternoon there was a line straight  down tge middle oh screen.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So defeated",
      "date": "Reviewed in the United States on February 18, 2024",
      "body": "I needed a phone badly. I have severe health risk and need a device with my health issues accessible by medical personnel in case I'm unconscious. I couldn't afford a new one.  Heck not even a used one.  But I got it to replace a old iPhone 8 that blew after years. Fresh out the box this overheating. It has now been one day. I tried updatingBut it's just overheating over any use now.  This is so stressful because moving apps is a long process with all the security verifications that are ridiculous. Plus I changed numbers and providers. Now I'll have no phone.  I asked for a replacement and it is even worse! It will not hold a charge. It says \"slow charging use charger that came with device\" which I am. So the offbrand charger and cord they send isn't even compatible! It won't even stay charged 2 hours really. It's embarrassing to have to charge when I'm in public despite charging it in my car. Plus this phone is not  calibrated. Typing is a chore. Swipe doesn't work either.Update: replacement arrived and it wont hold a charge. No way to check battery health on these. I'll have to return it but wait until I can afford another phone so I'm not without a phone. I lost access to decades old accounts because I erased the first phone not knowing they would force me to login from those. It's so ridiculous. I contacted the seller and they said they aren't the seller that quote \"15-20 other people sell\" what does that even mean? Then on top of it, they get to decide my refund which WAS NOT disclosed prior to purchase.Then I have to wait 30 days for processing and up to 7 more business days for a refund . Definitely do not recommend.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mind of its own",
      "date": "Reviewed in the United States on April 26, 2023",
      "body": "I did a hard reset because there were some issues with it. A couple of those were corrected. Sometimes the keyboard disappears. I have to restart it to get it back. At times it freezes up and I can't scroll, type, go to another page, etc. Have to shut it down and start over. My keyboard goes to white/black even though I have it set yellow lettering on black. At times I will be typing and it will flip to a different page. I'll tap on an icon and it does nothing. At times it takes 3 or 4 taps before it actually moves. Sometimes I have to restart it. I contacted the seller twice. The 1st time he was helpful. The 2nd time he told me to contact Samsung. After an hour on the phone, with her taking over my keyboard, it still didn't work. I took it to Cricket, he went into settings, and had it fixed in about 30 seconds. It is a reconditioned phone. I can see why someone traded it in. Also it is originally a T-Mobile phone and I have Cricket. But I get all the T-Mobile nonsense, updates, etc. And at times the brightness setting will automatically turn down to where I can barely see the icons to go into settings to turn it back up. Yesterday it went completely black. I cannot see any icons so I can't get into setting to fix it. Samsung offered me 2 options; Trade it in, which I can'5 afford as I told him. And lastly \"trade it in\", to which I said some choice words and ended the chat.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone connection is not the fastest despite being 5G",
      "date": "Reviewed in the United States on October 26, 2022",
      "body": "I bought this phone to replace my Note10+ which had LTE, and not 4G. This is my first phone I've purchased to have the 5G capacity. However, it does not always produce 5G unfortunately. Even when it does, it's not as \"fast-paced\" as I've expected - honestly it's no different than my Note10+. I'm also unable to find the setting for this & it's the first time that's ever happened to me upon using a cell phone - when I'm on a call, and talk or at least make a sound from my end, the sounds from the other caller will 100% cutoff/be silent. So if they were saying something, and maybe for example I hum or cough...just make any sound, their sound side would suddenly be silent so I could possible miss what the other person had just said. The battery life is not that great even though I've had days where I rarely use it. Don't like how it does not have the \"Fast charger capability\" as my note10+ for lightning cables I've used. Note10+ reads as \"Fast charging\" for any quality lightning cable, does not have to be samsung original. Yet this phone does not read it, therefore charges very slow. The phone gets hot quick as well.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Is Downfall",
      "date": "Reviewed in the United States on September 7, 2023",
      "body": "I'm not quite sure where to start, so I guess I'll just start. I switched over from a samsung galaxy j3 prime and have metro pcs. Switching over my apps and information was easy and simple, but time consuming. I had to sign back in to all of the apps which is understandable (but annoying). The screen is a little bit smaller than I was expecting (smaller than old phone), but the screen itself came with no scratches. The only obvious cosmetic damage to the phone is on the back with with some light scratches around the perimeter, it looks like someone was sliding it back and forth on a table, and it looks like someone was too aggressive trying to get the sim card out last ( i.e scratches all over tab). Now for the bad stuff. The battery is the biggest setback and will be the reason I send the phone back. The phone was plugged in the previous night just before 8 pm., waking up for work at 5:30 am., the phone is only at 99%. Not sure if the ability to charge is because of the rinky dink charger it came with (phone gave a warning about the connectivity to the charger when plugged in). It also got extremely hot when on the charger. Even so, the battery doesn't hold the charge. In the few minutes, it has taken me to write this, the battery percentage has already dropped to 87%. Another thing I noticed last night while it was on the charger, it updated itself and restarted it itself 3-4 times, I noticed it because the screen kept going off. I'm really disappointed this phone wasn't up to par. The activation fee was $27, and for me to send the bad phone back, reactivate my old phone and wait for a replacement, then when the replacement gets here spend another $27 to activate it and have the pain of installing and logging into all the apps again. So I'll be out another $54. Makes me not want a new one at all and just deal with the old one. I'll give the phone a week, and purchase a proper charger and see if that makes a difference. Will update in time.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Eh",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Phone works, but has issues with Bluetooth staying connected and also with wifi staying connected. Factory reset and everything and still won't work correctly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone, mine has a weak battery",
      "date": "Reviewed in the United States on June 9, 2023",
      "body": "The first phone I received would not recognize when a SIM was put into it, after returning it the second phone gave me a scare when it recognized that I wasn't using a Verizon SIM card and said some features would be unavailable, it is actually unlocked and works though. After using the phone for a week the only real gripe I have with the phone is that the battery does not last long at all, several days it has died before the end of the day when it was fully charged when I woke up and it wasn't used heavily, after waiting two weeks because the first phone didn't work I don't feel like waiting longer in the hopes of getting a phone with a better battery. Still probably worth the money over a less powerful and more expensive new phone but I would have likely paid more for an excellent condition phone instead of a good condition one in the hopes of a battery that can last a whole day."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gaps in the seal",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "The phone had a broken seal along the sides. This would lead to moisture to get in and with children around I'm sure it would only be a matter of time for it to break and yes I always have phones in a case. I am returning this product."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't wait to switch to another brand of phone",
      "date": "Reviewed in the United States on May 6, 2023",
      "body": "Had a previous Samsung phone and was considering other brands, but decided to go with the\"safe\" choice. Big mistake. The big problem that causes me to say that is problems charging the phone. My old phone worked ok, but after a while it was near impossible to get it to charge. Tried many new cords and positioning the phone in every way possible, but it was very difficult to get it to charge resulting in a lot of wasted time just trying to get the cord inserted just right to get it to charge even for a little while. Gave up on trying to charge it in my car. This phone is having the exact same problem. Never had this problem with iPhones or other brands that I have used, but it seems to be a common problem with Samsung phones that I have purchased. They start out fine, but it isn't too long before the charging problems start to occur.There are a couple of other issues that I have experienced. It is way too easy to call the emergency number (911) on the phone. Maybe that is a plus for some, but way too many accidential 911 calls. Tried to disable it, but couldn't find a way to totally disable it. Also, powering the phone down could be made much easier.Even though I purchased this phone about six months ago, I'm already shopping for a new one -- and it definitely won't be a Samsung."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    scratches you can see and feel with your finger",
      "date": "Reviewed in the United States on September 25, 2023",
      "body": "It arrived today and I immediately tested it out to see if I need to keep this or return.. it looks like I may have to return because of the scratches first of all but probably even more importantly it gets hot.. I'm going to give this a day or two just to make sure but hot is hot. I cracked my other phone and it overheats which is the reason why I purchased this phone so I'm very worried about that situation. I hope I don't have issues returning this phone. I'll wait 24 hours and see how it goes but I'm pretty sure it's going to be returned and if so I'm going to update the rating to one star. If it somehow works properly and doesn't overheat then I will give it four stars because you have to take stars off for the prominent scratches.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SIM Card Tray Stuck Shut and Will NOT Open...",
      "date": "Reviewed in the United States on June 27, 2023",
      "body": "I purchased this as a refurbished/renewed phone but expected at least to be able to use it. I could NOT get passed the SIM card tray because it would NOT open, no matter what I tried. I carefully wiped down the device in hopes that if there is debris or something preventing the SIM card tray from opening, but the thing would not eject. It's as though there was no \"spring\" to it at all. I ordered the phone on June 20 and received it on the 23rd (except I actually got possession of it on the 24th b/c whomever delivered it did NOT leave the package in front of the doorway entrance to my house - the package was left on the ground in front of the garage. By chance the next morning, on the 24th, I had to retrieve something from my vehicle and happen to notice the package on the ground!) So on the 24th, I opened the package and removed the SIM card from my current device to begin the transfer process over to the \"new\" device but the SIM card tray would NOT open! so I contacted AMAZON (also on the 24th) and was advised that they had reached out to the vendor and that the vendor would contact me with a resolution. Days pass and the vendor NEVER contacted me, so again, I contacted AMAZON and it seemed the only resolution was to return the item and get refunded. On June 27th I received the return label and returned the phone. But I noticed that there was a fine-print note on the return label stating that there may be a restock fee!?! so I asked the AMAZON agent that they NOT charge me a fee - most especially since the vendor did NOT respond to my request for service. I will be tracking and monitoring to ensure that they do NOT charge me a restock fee. I had to rate this a 1 star to simply get this review through the system. I don't know if this was a good functional device only that the SIM card tray would not eject open and therefore I could NOT use the device.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is good- Missing visual voicemail from Verizon",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "The phone was in good condition.  For some reason, visual voicemail from Verizon is not on the phone.  I've been working with Verizon to download it.  As of 2 phone calls totalling about an hour, they have not been able to assist.  They indicated if an unlocked phone, it would not be there. I bought a Verizon specific phone.  All of the Verizon advertising is there."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Makes glitching noises",
      "date": "Reviewed in the United States on June 5, 2023",
      "body": "At beginning of this purchase I thought I got a good phone with good camera quality fast service etc. BUT afterwards almost each night it made A LOUD BUGGING GLITCHING NOISE it did NOT sound like a notification bell. So then I thought of returning the phone a couple Weeks later after I bought the phone because of the noises it kept making. But eversince now it hasn't been making those noises don't know if they will return or not. So I'm gonna debate if I should return this phone or not. MORAL OF THE STORY: invest money into a LONG LASTING PHONE or be skeptical of buying phones from Amazon if you still wanna be cheap make sure you buy (the actual renewed refurbished phone) from the brand website ex: Samsung or Apple. Otherwise than that I can still be able to return the phone even after I threw away the original box it came in so nice customer service right there."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The battery dies half way through the day",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "It is in good shape.  It just doesn't hold battery for long"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sin celular",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": ""
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is my first phone in the $400 range and I think it is only ok.",
      "date": "Reviewed in the United States on July 12, 2023",
      "body": "I have never bought a phone that cost more than $200 before. I was looking to buy the A 54, but some reviewers suggested the much older S 21 ultra as a superior phone. I have had this phone for about a month now. Let's start with battery life, it sucks. You will get 5 hours out of the box. I get 5 h 30 mins now by turning the dark mode on and reducing the resolution. The phone is bright, it can be at 20% and still bright enough. Phone calls are clear, and connectivity to the internet or Bluetooth is outstanding. My old Motorola would drop in Bluetooth connectivity if I were walking in the street and it was in my pocket. But I have not had this issue with S 21 Ultra so far.Overall, it is a good phone but not an outstanding one due to battery life.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got the correct phone, wrong Quality.",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Was a renewed phone that was supposed to be 'excellent' quality but in my opinion, it came to us in 'usable' quality only. It works, but the backplate was not very secure (removing phone case basically ripped it off with ease) charge port is worn out all to hell, and scuffed up on all edges and on the back."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would like to rate better but...",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "My product came quickly and was a great price however,  instead of being in excellent condition it was only good at best. The bottom of the screen was damaged so I had to return it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No está desbloqueado...",
      "date": "Reviewed in the United States on August 3, 2024",
      "body": "El prpducto esta en excelente condición pero no esta desbloqueado, al ver qie no funcionaba la red fui donde mi operador y me dijo que no funcionaba la red por que el teléfono está bloqueado."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Didn't last",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "Looked perfect and worked great. Purchased April 17th 2024. Quit working for phone service on 12/13/2024. Still works on internet makes calls with text now but can't make cellular calls with a sim card. $400 for 8 months of phone. Better off to go to a cell carrier and get a new phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I noticed a defect on the screen about a month later following my purchase",
      "date": "Reviewed in the United States on September 29, 2024",
      "body": "Good price but check the screen carefully. It seems the defects in screen are common."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Paid for excellent not excellent at all",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "Update: It is hard to get a refund back, seller keeps asking for more information to push out the return 7 more days, tried to make me pay for return postage on the lemon he sold me. It can't ship from UPS like all other amazon returns so the label he sent was hard to track. It has been a nightmare. Returned product and he signed for it. Still waiting on my money back and had to buy another phone in the meantime. Don't use this seller. I reported with amazon but they are saying could be days before we get the return. Don't walk, run! I even let the seller know if he made it right I would update review. Still not made right. Instead they put my return through a review process. I sent pictures and emailed him privately along with my public review to show phone was not excellent condition. Battery does not work well as ohine goes from 100 percent to 0 percent in an hour. They really want you to jump through hoops and these purchases arent cheap. Go somewhere else.I paid for excellent and this phone arrived in maybe acceptable condition, very disappointed. Battery came at 57 percent charged out of box which eludes to the fact it may have battery issues. Extremely disappointed! I ordered this because I need it right away. Now I have to send back for refund and wait to get my money back to order new phone, very disappointed.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone,  but.....",
      "date": "Reviewed in the United States on October 8, 2023",
      "body": "Recieved this phone to replace a Motorola my mother had as it was old and the touch capacitor is going out. We recieved the phone in good condition with a charger,  charging block,  and a sim card tray remover. The phone was well packaged,  and operated well. There were no noticeable damage,  scratches,  or chips to the phone.  Everything worked well,  but unfortunately I have to return it as there is no wifi calling enabled on this phone. And due to the remote nature of where we live, it is a must have item.  So, it will be packaged up and sent back this week. Otherwise,  it would have gotten 5 stars and we would be keeping the phone.Pros: Quick shipping,  well packaged,  great shape,  reliable operation.Cons: No wifi calling enabled.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Dual a Dual Sim Device",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Since the majority of Samsung phones are dual Sim devices..  the write-up on the phones should have indicated that its a single physical Sim device."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Renewed\" phone definitely a risky buy",
      "date": "Reviewed in the United States on October 1, 2021",
      "body": "First of all I just want to proclaim that \"(Renewed)\" in the item listing is analogous to refurbished in my finding; which is something I did not know when I purchased this phone and only found out later when I received the item, where I was provided a leaflet from Amazon talking about it.  There is a top q&a I'm seeing which says \"new phone\" in it which I find very misleading, especially considering that the product description doesn't list the item condition.  I actually thought I was getting a new phone and that \"renewed\" implied some kind of service or Samsung model jargon.  Still not a bad purchase price, however it definitely comes with refurbished issues I'm noticing.> Day 1, just had a system crash.  Phone entirely blacked out and was unresponsive until using the volume+power key to force the reboot.> It ships with a 1.8 amp charger box.  This phone has a crazy large battery and is rated for 2.7 amps.  The other leaflet, from the seller, does note that the accessories may be generic but my question is why is it not at least full-power or even last-gen powerful?  My U12+ had a 2.1 amp fast charger OEM.  Also black phone, black charger box, white cable.  ;\\The phone camera is great, as advertised.Fast as f, as advertised.No pre-loaded bloatware, you can pick your own at initialization with this phone where-even the T-mobile app is optional.Naked Android 11 is also decent.  I was formerly accommodated to HTC Sense Android and thought stock was inferior, but it doesn't feel awkward using this version.Overall I *am okay* with the purchase but I'm very inclined to return this if I experience any other issue.  It has tarnished new phone day which is why this is getting 2-stars.  Keep in mind this is a review on the refurbished phone listing and might not overall represent the S21 Ultra.",
      "helpfulVotes": 48
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurb not great",
      "date": "Reviewed in the United States on June 16, 2024",
      "body": "This is the first time we've bought refurbished cell phones.  Unfortunately after just a few weeks it seems the internal antenna is going bad and it can't connect to any cell networks. We ordered a replacement under the 90 day warranty so I'll update this review when the new one comes.  Fingers crossed because the phone was a good deal if it works."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finger print not working",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Order an excellent condition phone but finger print sensor not working. I think the screen is replaced or not original.So disappointed."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Half Repaired",
      "date": "Reviewed in the United States on June 24, 2024",
      "body": "Battery lasts all day, no software issues. Corner of the metal frame scratched quite a bit, like it landed in gravel, with some red stain I was able to rub off. The real annoyance is the plaatic cover to the camera falls loose on one side whenever I put the phone down. I'm afraid it fall off soon."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware - check the refurbished phone carefully",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "Glue was coming loose on the front glass. After having it for 6 months the glass came completely loose along one whole side and across the top and bottom. Seller 2ndphoneclub says it is too late to send back on warranty. Bad quality refurbishment."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone functions like it is used in poor condition.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Phone will not hold a charge for more than 6 hours.  Phone does not fast charge on OEM charger.  not has to be place a certain way to accept wireless charging and then takes several hours to reach 78%.  I have tried to use the screenshot function and it does not work, the proximity sensor that turns off your screen while taking so your face doesn't hang up your call works inadvertently.  I purchased this phone as a backup to my flip 5 while the screen is getting repaired, but for the money spent, this phone has more issues than my blackberry Priv and it runs Android 7.  It I didn't need it I would not keep it, this is not a good refurbished produect."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Damaged",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Purchased phone in place of iphone and after missing my old android. This phone; however, cuts on and off. Thought it was me, but the phone will shut off randomly and the screen will not light up half the time. Bad purchase all the way around"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is great, but the seller was not the greatest",
      "date": "Reviewed in the United States on May 23, 2023",
      "body": "sold by Flip CellsI received the phone, listed as excellent condition, and saw that there was damage on the phone that was not mentioned in the description.  The glass windows on 2 of the 3 cameras was missing.  I contacted the seller.  He did offer a return and refund but being without a phone for 1 or 2 weeks would not be suitable, as I use the phone mostly for business contacts.  It also took me the good part of a day to get it configured as I needed.I suggested a $20 credit as I found the replacement glass on Amazon, which with shipping was around $20.  The seller countered with $10, saying that it was the maximum they could offer !The phone otherwise is great and works as expected, but as usual Buyer Beware",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wouldn't buy again",
      "date": "Reviewed in the United States on October 10, 2023",
      "body": "The phone looks cosmetically very good.  Tiny dings on the edges but they're hidden by a case.  But the battery is really bad.  From 100% charge to 20% in less than 7 hours.  It's now at only 48% after charging for an hour.  If this keeps up, it will practically be a landline since it's constantly tethered .And the WORST:  It is loaded with so much adware, bloatware and Spyware that it's not worth it.  Even my IT guys can't cure it.  I'll try a factory reset, but if that doesn't work, in the trash it goes.  Might return it after a reset and buy a phone not so infected.Edited to add: screen has so much crazing and the adware and bloatware are there no matter what I do.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was suppose to be unlockes",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "The phone says it was unlocked but tge phone is Locked and i can't get it unlocked!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    sim wouldnt read",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "i had to replace the sim dock, one of the connection pieces were broke off. cost $70 to unlock it. it did say verizon but did not specify which. it was locked to verizon USA and i use verizon mobile. for those who dont know, there is also a my verizon. possibly one more."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is risky to buy!",
      "date": "Reviewed in the United States on October 24, 2023",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    ok I'll be honest... Aesthetically it's ugly! The paint is worn, and I bought it in excellent condition!! The battery performs little >:(, I am aware that it does not have much for such a machine as this phone... but speaking about cameras They are very good and record very well, there is no negative point for SD CARD, I am aware of that... It came with a ghost screen, where other applications are marked, it is not notable, but if you see it in detail you will notice it!!! If you are lucky you can receive the phone in good condition aesthetically speaking and speaking on the screen and no stains inside the mobile system",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Visible blemishes, is renewed a new word for \"slightly used\"?",
      "date": "Reviewed in the United States on December 2, 2023",
      "body": "The phone had very visible scratches and tiny spots like if it was poked by a needle like object on its casing.I am disappointed because I still have a renewed galaxy s8 which had zero blemishes which  I purchased back in time from Amazon.This was my second attempt at trying to get a renewed s21 ultra. The first one had even more blemishes.I decided to keep it as I use it in a case. And I do not even complain about a price. This is a great phone for a fraction of a new flagman. But I think the description should mention blemishes. Renewed... Screen and battery maybe, the case not so much. Be fully prepare that your new device looks like the one pictured.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "When I heard that Amazon had refurbished phones, I knew that I could trust that this would be a great product. A year ago, I purchase this same phone from this provider (thegadgetdeals). It said it was a Galaxy S21 5G US Version Unlocked. It worked fine for a year and then my carrier let me know that this phone was not a US Version, it was a global version and would not work with my carrier. The Amazon provider (thegadgetdeals) said they could not do anything after a year, which I understood, so I ordered another Galaxy S21 5G US Version Unlocked (above) hoping this one would work. When I took it to my carrier, they said that it was a US version, but there was something mechanically wrong with the phone. It is now apparent that thegadgetdeals does not check these phones before they go out. They did refund my money this time, but I will not be buying anymore refurbished items on Amazon. I instead ordered the exact same phone from another company (not Amazon) and it worked perfectly the first time.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issues with battery life.",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "The phone itself works great when its not saying low battery. Haven't been able to go a whole day yet without having to charge it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery is _TERRIBLE_",
      "date": "Reviewed in the United States on November 14, 2023",
      "body": "I knew going into this what to expect, but i would have thought considering how much they cost, they would have done something about the battery, as someone who doesn't know the 30-80% rule could easily destroy a decent battery, very quicklyWell ok, here's the secret guys:  keep your battery between 30%-80%, only charge when at 30 and only charge to around 80%.  If you discharge the battery fully, recharge the battery fully, but only that one time and do not charge above 80% for any reason, and you'll very quickly train your battery, not to mention have it last a very long time.Otherwise, the performance is great, but the battery is _terrible_  you'd do well to go ahead and have it replaced for a new one, fyi.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I would not recommend",
      "date": "Reviewed in the United States on June 25, 2024",
      "body": "Great phone ! I really like it's features. However, being that it's refurbished the battery dies extremely fast. I requested a replacement and the one they sent me dies just as fast if not faster. Spend the extra money to get something that will last."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice, but the device constantly reboots itself.  Thinking it is a failed unit",
      "date": "Reviewed in the United States on February 27, 2023",
      "body": "Got the mobile for my wife.  It worked well enough for a while, but after activating it on the Verizon network, the device developed more and more issues.  Updated to latest firmware via OTA and the device started freaking out.  Would randomly reboot itself or freeze at various intervals.Attempted to reload stock firmware via ODIN, still awaiting results.  Will upgrade review if the reload works, but if it does not, then will downgrade the review and categorize as defective/faulty hardware.Update 03.21.23: No better off.  Phone continually freezes, locks up, overheats, despite being reloaded with the latest firmware and updating apps.  Reboots randomly in Safe Mode as well, so it's not a bad downloaded app.Second update 04.03.23 Finally reached out to seller to replace the device.  Seller refuses to replace device because it's \"well past 90 days\" .  Refuses to now answer any questions.  I got screwed over by this seller, definitely would not recommend.  If this is how Premier Cellutions treats customers, then I would say pass this up.  They will take your money and leave you high and dry if it is within their means to do so.Additionally, pass on the Samsung S21.  From my research, I've found that there are extensive lock up issues involved.  The unit overheats.  Changing out the OS, even with ODIN fails.  There is no alternative OS at this time for the build - tried to see if there was a Lineage build, not available.At this point, we're going to trade the device in and go with either LG or Moto.  At this point, I'm so furious with the seller, Amazon, and Samsung devices in general.  I feel like I got royally screwed overall.  Merry Christmas to me, eh?",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery doesn't last all day",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "It's supposed to be refurbished but the battery acts old it didn't last all day after a full charge. Further, It tumbled down my leg and dropped on the floor with minimal impact inside a protective cover I purchased separately but the screen cracked and soon after screen stopped coming on. Barely lasted a month and seller doesn't respond. I guess I will take this L. Never buy referb again."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a phone with a focus issue where the camera module has a hardware failure",
      "date": "Reviewed in the United States on June 19, 2023",
      "body": "Phone looked fine and looked almost new.However on further inspection I found out that it would not focus at the 1x setting.Some google searches and reading up led me to find out that this is a hardware issue with the camera module and that shaking the phone can temporarily fix the problem.So now every time I want to take a picture at 1x I have to shake the phone to fix the focus problem. Has to be done whenever I open the camera app.Bit of a disappointment because the camera is supposed to be a highlight feature for this phone.I also live overseas so returning it and getting a replacement is a huge hassle so just going to have to live with it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condition was great, but not unlocked as stated",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "The phone is in great condition with no real visible issues. My main concern is this was supposed to be carrier unlocked and it was not. Verizon only! Absolutely unusable for me. It did come with a charger....",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall a good phone.",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "Overall this phone is pretty good I haven't had really any issues with it except for the battery, they really should have put a new one in it this one will not hold a charge all day."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Could have been better.",
      "date": "Reviewed in the United States on July 30, 2023",
      "body": "Overall, the phone has been great. Battery capacity is 97% of original capacity, phone is fully operational with zero bugs or defects. However, there were a few things that didn't meet expectations. \"Excellent condition\" was supposed to guarantee no visible damages or wear from 12 inches or less. The paint on the aluminum that surrounds the back cameras came decently worn off. I don't really care about those little cosmetic problems but it guaranteed otherwise.Also, the packaging was terrible. The phone came in a box with zero protective wrapping or stuffing. The phone was just sitting loosely in the box. It definitely didn't get damaged during the shipping, but it could have. How hard or expensive is it to stuff some paper or bubble wrap in the box?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ANOTHER false advertisement?",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "This IS NOT a T-mobile product. When the cellphone is turned on, no pink screen or ANYTHING that indicates that it's a T-mobile cellphone! I SPECIFICALLY made this purchased because it was advertised as a T-mobile cellphone!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone… had issues later",
      "date": "Reviewed in the United States on August 5, 2023",
      "body": "I’m knocking 2 stars off!!! I bought this unlocked a phone 2 years ago LOVED it!!!! I was so happy with it.. poped in my SIM card boom worked!!!! Issue is here we are 2 years later and all of a sudden I’m being told my my current carrier the my IMEI is locked to AT&T!!!!! One how is that possible if I have used it for 2 years on a different carrier??? So called att to unlock it CANT saying there is MONEY a owed on the device!!!!!! So I’m know out a phone after 2 years and having to pay a 3rd party company to unlock even tho when I bought I was “unlocked” I am so saddened by this!!!!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't come with everything you need",
      "date": "Reviewed in the United States on May 15, 2022",
      "body": "Better order a charging cord and a USB cord when you order this, because it doesn't come with either. Be prepared to go in-person into a verizon store to get a SIM card, because that's the only way to transfer your number. No headphones of any kind included, which is fine, since it's renewed, but I'm very upset about getting it and then finding out I have to order a charging cord, a usb cord, and I have to go into a physical store to get the thing to work. I've never had to do that before. It did come with a cord with two phone jacks - I still can't figure out what the point of that is supposed to be. There are also no instructions, so it took me a few hours of trying to transfer the line and trying to order a SIM, before I finally got on with a Verizon agent that told me a physical store was my only option. I've had it for two weeks and I still haven't been able to use it because I keep finding more things I have to order or go get.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really a average phone",
      "date": "Reviewed in the United States on December 10, 2022",
      "body": "So I had to end up returning this because I had to buy another phone, but after using the pixel 7 ( which I had to return because their app is useless!!! ) this is actually better even thou is a older version, but too bad still had to return it, anyway, this is not a bad phone considering the price is good; wayyyy cheaper than the a p p l e which is way over price and keep rippping off their customer, I think soon they will be charging people for being on their waiting list or wants walk into their store; Anyway for the S21 the pic quality’s is actually good, user friendly great apps, the issue I had was the battery life and app issue once in a while, would I buy it again; considering new phone see coming out constantly; the answer is NoFor the S21 but yes for Samsung.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Deffective",
      "date": "Reviewed in the United States on October 19, 2023",
      "body": "Good evening. I advise you to pay a lot of attention with these phones. Don't be naive. Because these phones have problems that have not been really resolved. Even if you buy it and see that everything is working well, be very careful. Because, I bought mine, it was in new condition and everything was quite normal. And after a month I saw that the screen goes out on its own while I use it, I was panicked. I told myself that I will control before returning it, then the screen turned on after 1 hour. I wait for him to do it another time to return it, but he did not do it. It was until September 29, he died on his own, during this period the 3 month warranty had already expired. I want to specify when the screen goes out the phone is still on, you can answer calls if you know your phone well. And he has been going out since September 29, so far, he doesn't want to reallom. I wrote Amazon on the situation, I am told that the warranty expired, I have to contact Samsung to have it repaired. They sell defective phones for sums, on the pretext that they work very well when it is false. Until now the phone has been placed on my table, it walks, but no screen. Small clarification, the phone was never struck or cracked, it has no scratches. So don't think he had fallen or struck. So you have to pay a lot of attention and think a lot before buying these phones.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Previously owned by a company",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "Phone still has programming of administrative functions prohibiting me from using some apps as well as volume that often creaks and raises or lowers by itself. Start screen even indicates the phone is. Owned by Your Organization.Lost 3/4 of my.data transfer from other phone  since it would not allow me to use Smart Switch.Very unhappy."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT IN EXCELLENT CONDITION",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "I was not expecting to have quite a noticeable scratch on the front screen. The scratches on the back are acceptable but not the front ones. It's a bit unsatisfactory.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good enough but still not the best for 'excellent condition'",
      "date": "Reviewed in the United States on May 1, 2024",
      "body": "Phone came with some scratches on the back and edges. I will update this post with the pictures later i cant add them right now. fingerprint scanner isnt as sharp. you just have to make sure you position your finger how you did when registering your print. overall..its just \"good enough\" for someone who isnt looking to do a lot of activity on the phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy from this seller! totally trash",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "I recently purchased a refurbished S21 from this seller, expecting a device that, while not brand new, would at least be in acceptable condition. Unfortunately, what I received was far from satisfactory.Condition:The phone arrived with numerous scratches and scuffs all over the body. The screen had several noticeable scratches that hindered the viewing experience. It was clear that the device had not been properly refurbished or even cleaned.Performance:Within minutes of using the phone, it began to overheat. This overheating issue persisted, making the phone uncomfortable to hold and use for extended periods. It also caused the battery to drain much faster than it should.Cleanliness:The phone was dirty upon arrival. There was grime around the buttons and in the crevices, suggesting that no effort was made to clean the device before reselling it. This lack of cleanliness was off-putting and made the overall experience even worse.Customer Service:I contacted customer service to address these issues, but their response was slow and unhelpful. And when they finally acept my return and send me another, it was worse than the first one.Overall, I am extremely disappointed with this purchase. I understand that refurbished phones are not brand new, but there should be a minimum standard of quality and cleanliness that this device did not meet. I will not be purchasing from [Retailer/Brand Name] again and advise others to be cautious when considering their refurbished products.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrive, but the charge connection didn't work",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "When I got it, everything seemed good, but when I started using it, mean use (traveling and taking many pictures), it just the battery downloaded very fast, and it was hard to charge it back because it seems has an issue with the plug-in connection in the phone. Sometimes I stayed next to the phone to see if was charging. I report it, and they send me the return label. That is very efficient. If the phone doesn't have this issue, that will be a great phone, cause the camera is awesome; but because I was using it for traveling, so imagine myself sitting on the floor somewhere else to be able to plug in the phone, or purchasing food that I didn't need use for charging it, was complicate."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's very BADDDDD",
      "date": "Reviewed in the United States on October 17, 2024",
      "body": "when I first received the phone it looked good however the screen was freezing and glitching a lot . 2 weeks later the screen was not working, I knew for sure the phone never fell and it was well protected  (when I brought it by the repair man he said it was a software issue and I paid a good amount for them to fix it. later, the same problem occurred again and I had to pay the same amount again .  2 months later the screen went bad without it falling or anything, and they told me I had to spend a large amount to buy and replace the screen.  A good Samaritan ( an electronic tech )  told me that even if I replace the screen the same issue will occur again because it's the software. That's quite unfair buying your device and not being able to enjoy it.  The camera was working at first but after it changed ,it wasn't that bad  and that's the only reason I give the rating one-star cause if I have to be really honest ,the phone is trash don't waste your time .",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No unlock for all US carriers",
      "date": "Reviewed in the United States on June 7, 2024",
      "body": "Phone is excellent, no scratches seems to work but I bought it because it says is unlocked in the US but at least this one only works with Verizon and I have T-Mobile.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone Crippled by Hardware or Software Issue",
      "date": "Reviewed in the United States on September 21, 2022",
      "body": "Both my wife and I have this same S21 that we purchased new when they were released. Mine works great - no issues and I'm very happy with it. My wife's started freezing and restarting randomly several months ago. She put up with it for a while, but it got pretty bad. I found several others with similar issues on Samsung's forum. We purchased this replacement, which worked great for a couple weeks, then started doing the exact same thing. We've tried to troubleshoot 3rd party apps, and anything else we could think of, but nothing has worked. I think there is a serious hardware or software issue with this line of phones. Not really sure what to do... gamble on another one, try a different model, or jump ship for an iPhone. Very frustrating. This renewed version also came with a long, fine scratch in the screen. It's barely noticeable, especially after applying a screen protector, but I'm surprised they would ship a phone out with scratches.*******A couple weeks later: Despite our best efforts to troubleshoot, the phone is still having the issue. Some days are worse than others, but we can't seem to figure out why. Send a support ticket to Samsung, but we haven't received any response. We're deciding to switch to another device and not gamble on an S21 again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phones are not renewed",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "Phone has damaged on the device screen and edges.These are not refurbished or \"renewed\"It's not horrible but chips in screen and sides are damaged minor.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow Shipping; Wrong Color",
      "date": "Reviewed in the United States on March 9, 2024",
      "body": "It took several days to arrive.  I have prime but it was not offered.  Shipping details were most vague.  The color I received was not the color I ordered.  The phone works great so far.  I have only had it a few hours now.  Time will tell.Update: Battery life is great but speaker cracks up durring phone conversations.  Id expect this from a phone that was NOT considered to be in excellent condition as this one was...",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing Items",
      "date": "Reviewed in the United States on July 23, 2023",
      "body": "Missing items: SIM card removal tool and instruction manual. This was pretty hard to set up with no QR scanner software either. Checked the EMEAI number and it is compatible with my carrier but I keep getting an error code of \"not registered on network.\" Now I have to go to a mobile shop and see if they can fix it. Also there is a slight bronze line on one side of the screen (only bugs you when the light hits it), kind of looks like the glass was not set in a jig. Once I get it out of the shop, I'll let everyone know how it runs (or if it will) in the next month."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not acceptable refurb - not waterproof",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "I paid $224 for the \"excellent\" condition refurb, but the phone I got is not excellent and not even Acceptable IMO. Out of the box, it had a sticky residue that was easy to clean off, but it also had visible cosmetic damage to the clear coat, which immediately knocked it out of the \"excellent\" category. The charging port had something stuck in it which caused the cable to fall out easily and for the phone not to gain a full charge.I complained to Amazon about these problems and they gave me a $40 refund in Amazon credit because that was the price difference in the \"good\" refurb phone at the time. I was also able to clean out the charging port myself and get it to work.Since then, I've also learned the hard way that this phone is NOT waterproof. The refurb compromised the seal that the S21 should have, and water got into the body and lenses. My phone was dead for days, but I got it to turn back on by letting it dry out in silica gel. Unfortunately, now the phonecall quality is damaged, and I'm often told, \"I can't hear you\" on calls. This has me shopping for a new phone.This phone lasted just under 3 months. Purchased April 3, 2024.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sold a bricked phone (DO NOT BUY THIS PRODUCT)",
      "date": "Reviewed in the United States on June 16, 2024",
      "body": "Bought one of these in April due to my last phone having a cracked screen, and was unable to get it sent/go anywhere to have it fixed. I had planned on making it my primary phone and using the other one (the one with the cracked screen) as a back up. Within two months of having bought and used this phone, it would consistently crash, restart, and is now not working at all as of the time of me writing this review. I tried everything that I could to fix it myself, including doing a complete factory reset on it. When it first arrived, and I transferred my data from the old phone to this one, the first crash happened within 2 hours of data transfer being completed, and updating the software. The phone also has a MASSIVE overheating problem, to the point that I had to place a fan next to it to keep it cool and functional. The other problem is the loose internals on the inside of the phone. Just from slightly shaking it, I could hear something rattling around inside of it from behind where the camera is located.And now, as of 6/16/24 - 4:00 A.M., the phone has crashed so frequently that it no longer turns on anymore.Overall - DO NOT BUY THIS PRODUCT.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Flagged phone",
      "date": "Reviewed in the United States on May 31, 2023",
      "body": "*BUYER BEWARE*I purchased this phone a little of 3 months ago. I was hesitant about purchasing a refurbished phone, but my wife purchased one (from a different seller) and had no issues. I decided to move forward with the purchase because of this reason. At first, everything seemed fine, until about 3.5 months in, my phone was disconnected from the network and would not reconnect. This is a t-mobile locked phone, which means it should work on their network with metro pcs. I contacted metro customer service who tried everything from resetting the network, to using a new esim card. They exhausted all options to no avail, so I took it to my local metro dealer. They worked on it for about an hour, and were able to temporarily reconnect it. But, they stated this is a flagged phone and it will eventually be disconnected again. I am also no longer able to check my voicemails. When dialing in to my voicemail, it now recognizes my password as incorrect. I have used the same password for the last 10 years and have not altered it. Not sure if this is coincidental or if it relates to this situation, but I have never heard of this happening to someone before. I contacted this seller twice, both times they told me that there is nothing they will do since it's right outside of the 90 day return window. You would think there should be some sort of stipulation to this, since they potentially sold me an unpaid/stolen phone. I am now filing a claim with Amazon to hopefully rectify this issue, since the seller is unwilling to correct their mistake.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do Better",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "Two months, and eight days after purchase the charger nearly set my bed on fire. This was a total shock. I'm so glad I was home."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incorrect charger",
      "date": "Reviewed in the United States on May 12, 2024",
      "body": "For the most part the phone is ok. The only thing that I have found is that the charger is not the correct one. Phone does not charge an gives you an error message stating that it's not charging."
    }
  ]
}