{
  "asin": "B0DCLCPN9T",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome phone at a great price",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Purchased this phone in late November of 2024, at a decent price, to replace my 2015 android. Yes, it was time. Bought this phone unlocked, followed the instructions in the Smart Switch app and easily transferred my stuff from the old to new phone pretty seamlessly. Thrilled. A couple of apps were outdated versions, so I had to manually fill  in info but, other than that, that evening I was using my new phone as another computer and really enjoying exploring the phone and all the AI offerings. I called my cell carrier the next day and transferred my number to my new phone. It took approximate 5 minutes. This phone is large  but, like anything else, you get used to it. Functions are seamless, charge lasts almost 2 days for me, camara is decent, charges quickly, screen is clear, and the AI functions are fun. Very happy with this purchase and the whole experience with it.  It is March 8, 2025 and I can confidently recommend this phone.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very nice phone for the price.",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "This Samsung Galaxy S24 FE cell phone is a  very nice looking phone. I am coming into this phone from only using track phones so it will be time before I can say very good or whatever.I will say it charges fast, I bought the Samsung corded fast charger and within an hour of first plugging it in it was fully charged. I used the phone two days before it was down to 40% on the battery then I charged it again.  I bought this phone so I could use a company like straight talk (unlocked) but it would not be accepted by their system. I found another pay as you go company called cricket that I am using now and the phone is working great. I have also used it to learn to text via a friend in AZ. I also purchased a cover for the phone too to help protect it if I should drop the thing.  I will add more later to this if I can after I have used it for a while. I would recommend this phone to anyone looking for a nice phone for a not terrible price. I believe I got my moneys worth.  One more thing to add I purchased the 256Gb storage as well, just to have alot of space for whatever.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is a well-rounded and beautifully crafted phone with excellent overall performance.",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I’m a Samsung fan from China, and because this particular model isn’t available in the Chinese market, I decided to purchase it through Amazon when I saw a great deal. I’ve always preferred Samsung over domestic Chinese brands due to my dissatisfaction with their user experience — ugly UI icons, buggy system settings, and clunky designs. When I received the phone, I carefully powered it on, set it up, and after using it for a bit, I was really impressed. The transition was seamless since I’m so familiar with Samsung’s One UI system. The camera takes stunningly clear photos, and the design is beautiful, sleek, and stylish. Samsung is, and always will be, my number one choice for smartphones.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone overall",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "The Samsung Galaxy S24 FE offers great value for its price. It performs well in most areas, but there are a few things to keep in mind.Pros:Camera and Video: The camera setup delivers impressive photos and videos, especially for the price range. You get vibrant colors and sharp details that are perfect for everyday use.Overall Performance: It handles daily tasks and multitasking smoothly, making it a solid choice for casual users.Battery life: AMAZING.Cons:Heating Issues: With heavy usage, the phone tends to heat up, especially during gaming or extended camera use. It's manageable but worth noting.Build: While the design is sleek, the device feels a bit fragile. I highly recommend buying a durable case and screen protector as soon as you get it.",
      "helpfulVotes": 59
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love my phone!",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "I've only had the phone 2 days but so far it's great. The battery is great. The picture is bright and clear. Everything down loads lightning fast. I haven't really used the camera yet but I'd be willing to bet that it's wonderful too.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Phone I've Owned To Date",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I was a little apprehensive in buying a phone that wasn't connected directly to my phone carrier.  However as my current phone is coming to the end of it's life (swollen battery split the phone open) and there were some good Black Friday/Cyber Monday deals going on I thought I'd take the chance in trying to buy a phone non-traditionally outside of my phone carrier.On the Black Friday/Cyber Monday deals, Amazon had the best deal on this phone I could find.  My carrier had this phone available as a Black Friday deal for $2/month but required being locked down in a 3 year installment plan/contract.  These days I'm not a fan of being locked down in longterm contracts for phone service.  Plus to get this phone for the discount through my carrier they would have pushed me out of my grandfathered unlimited service plan which gives me the MAX app premium service for free into a new unlimited plan which would take that away.  Amazon was also selling this phone for about $175 cheaper compared to what the list price was on my carrier's website for buying this phone without a contract/installment agreement so again the better deal.As far as the phone is concerned, I find it to be truly amazing.  I'm not the kind of guy to get caught up in the pageantry or the gimmicks of a phone.  I'm a basic text, call and play a game here or there kind of phone user.  Maybe a take a pic or two if something catches my eye so I definitely won't use this phone in ways that many will.  This is also the reason why I went for the FE model over the standard and premium versions of this phone because simply I don't need all the extras that comes with the other models.  Still as the least expensive model in the line up, it packs some robust features and many steps ahead of the phone it replaces (S10e).  I've only been using this phone for a couple weeks now and feel like I'm still on a learning curve about the new functions and features but I can say it's the nicest and best phone I've owned to date.I give it an astonishing 5.0/5.0 rating for a perfect 5 stars!!!",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy S24 FE has flagship specs without the flagship pr",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "I upgraded from the Motorola Moto G Power 2020 to the Galaxy S24 FE which is my first Samsung phone. I upgraded to the Galaxy S24 FE because of the 7 years of software and security patch updates. I was tired of every 2 - 3 years of having to get a new phone because the phones I had were no longer being updated. They were slowing down and starting to freeze up after 2 - 3 years. From all the reviews I've watched on YouTube most reviewers say the Galaxy S24 FE is almost like getting the flagship Galaxy S24 Plus for half the price. I like how fast and responsive the S24 FE is plus it has really great cameras that take some really great pictures. The S24 FE also has great features. I got the S24 FE November 25,2024 and I'm still learning new things about the phone. If you want a phone with flagship specs without paying a flagship price I highly recommend you buy the Samsung Galaxy S24 FE.",
      "helpfulVotes": 35
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for right price.",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "This works mostly well. Not as much bloatware as Samsung used to have. Most of the AI stuff is gimmicky and locked behind a Samsung account. And may soon need a subscription to use. There are many “features” that are just redundant. You can have apps on the main screen, have apps in the app drawer and then there is the side panel that you can hide apps but accessing the side panel takes a swipe to the left which also means you can just place the apps on another Home Screen that would take the same amount of time to access, so why? I guess options are good. The bad part is browsing webpages using the installed browsers. Some embedded content on some sites just would not load. Which is strange. The camera is ok. Maybe at half the original price this phone is good but definitely not worth the full asking price.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than my S23 Ultra",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "I have a Samsung S23 ultra(see the reflection of it used to take the pictures)that I bought brand new upon release and I've never hated a phone like the S23 Ultra I have. The screen is too big and very unresponsive at the center of the screen while the edges are extremely responsive at slight touch of the palm of my small hand. It's also lagging compared to my S10+ and the powerful camera is uselessly blurry because it takes too long to AI which is supposed to help-focus. I also find the phone battery to drain faster than my S10+ and the Wifi, Bluetooth connection cut off from time to time. The S23 ultra brightness bar is also badly designed compared to the S10+(you can't slowly increase or decrease the brightness on the S23 Ultra like it is on the S10+. A slight slide of the S23 Ultra brightness bar increases or decrease the brightness too much making you waste time trying to find the right middle. The same goes when you want to move the cursor between characters of a text or sms on S23 Ultra. It jumps from c|haracter1 to chara|cter5 when all you wanted was to move the cursor to cha|racter3).It might be that my S23 Ultra has a screen defect and I should've returned it but I didn't. Now I bought this cheaper S24 FE and transferred all my data to it and I swear to God; I'm loving it❤️.The S24 Fe small size is so good in my average man hands and the screen is very responsive with screen protector. The 90° not-round edges are good because my palm doesn't touch the screen while I'm typing. It also has a better camera focus and the brightness bar is not increasing or decreasing a lot with slight slides like it is with the S23 Ultra.The Wifi and Bluetooth connections are also better on the S24 Fe. I still can't believe I spent more than twice the price of this S24 Fe when I bought the S23 Ultra and the S23 Ultra doesn't even have something special that I like and use except the camera that can zoom 10x but is uselessly blurry 2 times out of 3.In summary, everything on the S24 Fe is to my taste \"better\" than the S23 Ultra except the camera zoom which is 10x zoom on the S23 Ultra and 3x zoom on the S24 Fe.Update(12/09/24): While my S24 Fe battery drains slower than my S23 Ultra, its fast charge is a lot slower than the S23 Ultra. I expected the way around because the S23 Ultra has a bigger battery(it might be because I have too many apps on the S23 Ultra which drains battery faster but it doesn't make any sense to me that the S23 Ultra that drains battery faster is also charging faster).I also dislike that Samsung is forcing us to use the new 6-PIN lock on new phones in order to get the option of unlocking your phone by typing your 6 digit PIN without pressing the OK button. On my S23 Utra, when I type my PIN code 1234(example of pin), it unlocks. On S24 Fe, I have to typing 123456 to unlock it. If you use a pin code like 1234 on S24 Fe, you must also press OK to unlock. A small detail but very annoying if you're using your phone as an Uber/Lyft driver where you need to keep your eyes on a busy road while typing a longer PIN code. I had to remove the PIN because I almost had an accident because I'm not used to 6 digits PIN. I'd rather get this cheap phone and data stolen than dying into an accident.",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It has drawbacks",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I always buy Samsung Galaxy phones. This phone has many useful features. However, there are drawbacks. The 3 camera lenses protrude from the back by 1/8 inch and the extreme smoothness of the glass back reduces friction that would keep the phone in the table. I had more than one instance where my phone slid off the table. I was able to find a very well-designed phone-back case by OtterBox that increased the friction with the table while simultaneously making the back of the phone flat so that the lenses do not protrude from the case. This phone includes \"Circle To Search\" AI which allows you to copy text. However, this AI feature has a drawback. Sometimes the AI doesn't copy the text exactly. I have had instances where it modifies what is there. That makes no sense. This feature, despite the minor drawback, has great utility. I was able to use the magnifier App to copy an activation code from my TV screen.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Flagship Experience",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "The Samsung FE (fan edition) phones are meant to give customers a flagship phone experience at a more reasonable price, making some strategic compromises to make that happen.  I think they succeeded for the most part with the S24 FE.The display and camera are the two key factors in phone quality, in my opinion.  The display here is an FHD+ (basically 1080p) 6.7\" AMOLED, which is the same size as the S24+ with a lower resolution.  The AMOLED gives great response timea and black levels and the lower resolution is not very important to overall image quality.  I am impressed for the price.Photo quality is excellent and similar to the S24+, with particularly impressive 4K60 video quality.  It can also record 8K30 if you want to have some room for cropping.  I normally go with Google phones, and it is a close competition.  I think the Pixels do a better job in low light and have more vivid colors with default settings.  The AI tools are fun to play with, but feel very early.  I don't see a generative function that allows you to type in things to fill selected areas with, but I may be missing it.The chipset is notably slower than the S24+, which is not very relevant in my usage so far.  This is still a capable 2024 exynos and able to handle demanding apps and multitasking.  It may not last as many years without becoming outdated.This is my first Samsung and I was happy to see it was not stuffed with intrusive Samsung apps I may not prefer over other apps.  The Samsung AI for things like translation is cool and the phone also comes with Google AI for things like circle to search.  With that, you can point your camera at anything in the phone app, hold the home button down, then circle something to search for it.  It works remarkably well and better than any AI tool I have used before.  Everyone I've shown it to was blown away.Without a case, the phone feels like an oiled up brick that tries to slip from my hands.  With a case, that is solved and, while a little clunky, is not bad to hold for long periods.Overall, this is an excellent phone that achieves the goal of giving a flagship experience.",
      "helpfulVotes": 46
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Price of a Phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I am enjoying this phone so far, I just do not understand why they have removed the headset jack and to take a picture of a text is so cumbersome when using the volume down and the side button simultaneously. Thank goodness it has the palm swipe feature because this makes capturing text much easier.  Also, finding the recyle bin can be a bit confusing. The phone has a lot of great features but one always wonders does the cost match what the phone can or cannot do. So far I am satisfied with the purchase of the phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functional and so much fun to explore all the features!",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "The phone arrived promptly and was packaged with care. Gorgeous green color feels very trendy! It set up easily and was functional within an hour. Amazing features makes it fun to explore all this phone can do! Display is vibrant. Battery life is excellent so far. Why wait to upgrade your phone when this option is available?"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone does work well",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Has worked well since day one, the person whohelp with setup didn't inform my carrier of the change of new unit, so there has been some problems. Disappointment of the phone, is of not having memory card slot, this hurts to be able to run some programs fully, than save that work to removal card, word, spread sheets, photo files."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It might work for you",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "I couldn't get past the unboxing at 1st, but i decided to give it a chance.  I also ordered a new one and received a used one. Which isn't right because a new one was 50.00 more. So far I do like the phone. It's the same as any other Samsung. The camera is good and that's really all that matters to me."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price, Fast shipping, just what I needed",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Caught this on a deal for $499. Our S20 had just bit the bullet so the timing was perfect. Cannot say enough good thinks about this. Update did not come with a complete charging cable. Just found that my trade in was downgraded because I made a mistake and called it a AT&T phone and it was a Verizon. So, a phone for Verizon of the same type is not worth the same as a AT&T phone. $20 vs $40.  Changed to 4 stars.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Secure Folder and allows you to turn off 2G Mobile Data",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "This was an upgrade from the Oneplus 10T, first the Samsung processor out performs the snapdragon 8 Gen1 and I did not want to pay for the higher end Samsung phones with the Gen 3 processor.  I love the Secure Folder functionality that gives you absolute security, with all security it can be inconvenient at times but I don't care I think it is worth it.  Also I found that you are able to turn off 2G data something that we really don't need in the US and allows for unencrypted communication and easy high jacking if you connect to a fake cell tower.  If none of those things matter at least the price is right when on sale."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone or camera, which is more important",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Im not into all these fancy phones, but i needed a good phone for work. This is great for work. However,  the camera isn't good at all.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone dimensions",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "The Samsung S24 FE is 6.38 x 3.04 x 0.31 inches, not 6.22 as it says in the description. Otherwise working fine in the days I've had it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone once it's setup.",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Excellent product works as advertised. No complaints so far used it for about a week now. I only had problems transferring my data from my old android phone. You will need to order a case and phone charger. For the price it should of came with these items. Great phone once it's setup."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone but not as nice as I had hoped...",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "This phone has some questionable attributes, imho.The screen (under a quality glass protector) is not as reactive as I am used to on previous Galaxy phones.  And the positioning of the icons is either off center or too small to find accurately.Reception is good.  Sound quality is good.  Camera is good. This phone does all that I want and need, for the most part.  My only criticism is in the sensitivity of the touch screen.  Worthy of note.Would I buy this again?  mmmmm  I would likely spend the extra money and buy the Galaxy S24 Plus.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    8 out of 5 stars - thrilled with these phones",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I really dragged my feet for years because our old Samsung Galaxy phones were just horrible.  We paid a lot of money for Samsung's flagship phones and they just kept getting worse and worse, so I resisted, but finally our S9s had to go.  True the features like the screen resolution, isn't as good on the FE phone as it was on our old S9, and it's not a Snapdragon processor, but that hasn't been an issue at all.  In fact, we hadn't even noticed.  Upgrading was a piece of cake and along with a nice Samsung case, these phones have been great.My only regret is I'm told the S25s are coming out in a month and had we held off, we would have had a better deal or been able to purchase a newer model.  None-the-less, we're thrilled with these phones.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Product",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "The Samsung Galaxy S24 FE is an excellent choice for anyone who wants a flagship experience at a more budget-friendly price. It offers strong performance, an excellent display, and a great camera system. It remains one of the best mid-range smartphones available. If you’re looking for a feature-rich phone without breaking the bank, the S24 FE is definitely worth considering!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente producto",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Me enviaron el producto en muy buenas condiciones. Lo único malo fue la demora de entrega del mismo. Por lo demás muy bien."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Everything about this phone is great. Battery life,  capacity, ability to play videos. Superb!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It does what it says, like longer battery life.",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "It gets better coverage than the old phone, and the battery lasts longer."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOVE IT",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Amazing phone. I love galaxy and I love this phone. Great price for what you're getting"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect!",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Love the phone! Works perfectly fine, no bad cmnts what so ever."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome price for new phone",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Nice, new big heavy duty phone with no defects and no issues and awesome price!!!!!!!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Great phone 📱."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Easy to understand apps. Fingerprint reader is awesome.  Battery life could be better.  Camera takes excellent quality pictures",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value.",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Quick delivery, product just as described. Works very well so far, easy to connect to AT&T."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10/10 made the switch from apple and I will never go back",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Great phone and color true to picture"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phone",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "This is a nice phone and takes great pictures. I switched from one android brand to this one and it took a little getting used to. It is bigger and heavier than my last phone which I didn't like. I do appreciate the long battery life and a bigger screen is nice too. I don't like where the fingerprint scanner is but overall the phone works great.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Budget-friendly and nearly on par with 24+",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Excellent phone for $500.Couldn't have asked for better."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "This might be the lower and the Galaxy series but as far as size and features I don't know what else to ask for. I came from a GS21 and it's an improvement the ai features are there every Samsung feature you expect is there in the bigger size and it's pretty fast. Lower end Galaxy phone but I'm very happy with it five stars",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone I've ever owned!",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Definitely will be holding on to this specific model for a longggg time. GREAT JOB, SAMSUNG"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    looks good",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "clean. no scratches. no bugs. no smell... no extras, but I knew that going in. all in all, I'm extremely happy with my perches!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung S24FE",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Great item, packaging is great device is working perfectly"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Money well spent",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Great phone. Works and responds fast for streaming.  Love the size. Not a gamer just need a good signal and this does all I want it to do.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Espertacular",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Espectacular"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Compatibility with Straight talk",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "I am in love with this phone!! I haven't explored everything yet, but so far, I am totally in love with this phone! I use straight talk for service and this phone is indeed compatible with straight talk. There was a review on Amazon and unfortunately that individual was not able to use the phone but I had no issues with the phone. If you are switching from another phone, simply put your existing Sim card into the new phone and it should work. If not, purchase the sim card kit from straight talk. The picture quality is great! Holds a good charge as well. I wish I had more to add but I am not done exploring. I will add more as I explore.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Nice phone like new"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bien",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Lo compre y todo ha ido bien"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I've had this phone for about a month now, and it has been a great upgrade over the S21FE. This phone handles everything I throw at it without issue. I use my phone for GPS for work, and tend to get it to run music or an audiobook, plus maps for for an entire day of work, and still have some battery life when I get home.I was concerned about getting this because of the Exynos CPU, but honestly, this CPU has been great. battery life is way better than the s21 FE ever was. This new phone is a bit bigger in size, but honestly it didn't bother me as much as I was concerned about originally. I really liked the s21fe's size, but this slightly bigger phone has won me over since getting it.Definitely Recommend this phone, it does everything I need it to do and probably more! grab the 256gb version if its what you need storage wise, I'm still doing good with 128gb.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    estoy descubriendo todas sus posibilidades",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Es lo que buscaba"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Does exactly what I need for a phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very secure",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Protects phone as expected"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Less for more money!",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "Overall a decent phone. I didn't realize that Samsung no longer includes a charger with their phones, which is ridiculous for the amount of money that is spent!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Precio/calidad",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Muy buen equipo"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    S24fe Phone",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Basically as pictured and discribed.\"Fan Edition\" of Samsung's flagship phone. You get most of the bells & whistles of 2024's top phone at a more agreeable price level."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Case Hopefully lol",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "If this is a phone case for S24FE It did fit looked ok no complaints. I bought 2 different ones just liked other 1 better. Did fit will work."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    200 dollar black friday brought the cost to a point of affordability",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "AI phone works good priced reasonable so far so good",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    overall pleased, made it work with Spectrum",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I rec'd this new, unlocked Samsung Galaxy S24 FE on Nov. 23,2024 from Amazon & it measures up to my expectations (granted, I don't use all of its functionality).  Heads-up: Spectrum's website said both IMEIs were non-compatible, as did their on-line Chat C/S person even tho Spectrum sells the same phone/model (at a higher price)!!  However, I transferred the Spectrum chip from my old Moto G to the S24 FE;  it worked & continues to work just fine.  Note: The Spectrum C/S person did submit request for 'Phone Number Transfer' & hours later, I rec'd a Spectrum email stating  \"Your request for a new SIM card has been completed and transferred to the phone number xxx-xxx-xxxx\".  Hope this helps the next person.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice, new S24 FE",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Exactly as advertised, perfect condition, much less costly than even on the Samsung website."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Opened sent as \"new\"",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "It's a phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Great!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Cell Phone",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Present for wife.  She loves it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "My last 4-5 phones have been in the Samsung Galaxy universe. The previous phone was my first FE (S20). I went the FE route again and am very happy with the product compared to the price (bought on Cyber Monday). I feel like I have a high-end phone without the higher price tag of the Ultra. I went ahead and turned on all the bells and whistles (AI, Google Assistant) and am having fun learning more about how to use those.  I haven't tried the real time translation feature, but I will at some point. The transfer from my old to new phone was seamless. I did a tech support chat with my provider (Verizon) though to swtitch to an eSIM since the SIM in my old phone was a different size than what is supported on the 24 FE. That text chat went quickly, and my phone was up and running with all my previous apps and data.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great flagship phone for a small price",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Great phone huge upgrade over s10e"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love Galaxy S Phones",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "A great quality phone. My last Galaxy series was almost 6 years old and beginning to show it's age. This phone is working much better and newer features are making using it much simpler."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works perfect",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "This phone was a Christmas gift and I love it very much. Even though I had to do the purchase the process was great",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Perfect for needs great to get it unlocked 👍 👌"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stellar phone",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "I've been obsessed with it since it arrived. The seemless user interface and sleek design is absolutely captivating. From 10 percent, the phone will take 4 hours to charge if you have a regular adapter. It will hold a charge for a great amount of time. Pairs very well with Echo Buds, which I also highly recommend for audiophiles who look for balance between their music and their surroundings. The phone does come alone, without the promo for the $100 gift card, so double check your cart to make sure you chose the correct option.Update on having the phone for two months:This one of the best phones out there! The functionality is superb. However, it can heat up when fast charging and when using a couple of high functioning apps at a time. Fast charge take an hour and a half. The phone does not slow down, but the heat makes the phone a little uncomfortable to hold after, even with a case.",
      "helpfulVotes": 53
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "I purchased this phone as a Christmas gift for my son. At first I was going to just go with the S24 instead of the S24FE but I figured I would save a little money and hope with one would hold up. So far it seems to work very well, plenty of processing power. I purchased a good case and screen protector so hopefully it will last a few years with no damage."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A24 Samsung phone.",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "A quality phone. Easy to set up. Dependable use. Would have liked to have an input hole for an earphone that is not wireless."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Excellent phone for its price"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Samsung never fails to amaze me. I like the battery life, sound quality, and ease of use.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    S24 FE",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Upgraded from my old A21s, the mechanics and transition on this is very fast. Screen display is also a +++.  The speaker is really loud. Can't rate the scratch resistant as you can see I'm not taking any chances on that. 😄Amazon,Thank you!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "I use my phone heavily for more than just communication.. Samsung is the Best",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price for a great phone!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "Hands down my favorite phone owned ever! Battery life is great, the screen quality is awesome, it functions perfect, and isn't super heavy or extremely light!Overall it was well worth the money!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "First new phone in six years. Hoping this one lasts just as long!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use it",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "It is very good deal to get it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect Upgrade",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "I just upgraded from a S20 FE and I am loving this phone. The AI integration is super cool. Battery life is great so far.Speed: way faster than my older phone for sureAppearance: very sleek. It gives iphone but I don't mind.Size: it is much bigger than I am used to but again I don't mind. I got used to it.My husband has an iphone 15 pro max and this phone is actually heavier than his. I was like wow. Overall, it's a good buy. I am not disappointed at all."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Protective, thin",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Good fit"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone at a great price",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "It was past time to replace my old Samsung, and my carrier only had good deals on phones that do more than I need: I'm not a gamer, I don't stream all day long, and I don't record my every move on video or in pictures. I thought this phone would be a good replacement and, so far, it is.I can't speak for others, but mine was unlocked and ready to set up with my carrier. The phone walks you through setup step by step, and is very easy to follow. I couldn't remove the SIM card from my old phone, and figuring out how to make eSIM work was the most challenging part, but that says more about me than the phone. Regardless, it took about 20 minutes to get up and running.The interface is familiar and the phone works as advertised. I'm happy with my purchase, will update after I use it for a while.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not crazy about it",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "I don't like how all of the buttons are on the same side. Difficult to take pics. The talk to text doesn't work right. It ends and begins new sentences when it shouldn't. It doesn't understand when I want to put a question mark or exclamation point. It spells it out instead of just putting the requested punctuation mark.It doesn't offer the full array of emojis in apps, e.g. Tiktoc.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Promptness",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Love the Prompt delivery Service and the items purchase to photograph my Artwork is Amazing."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product and value",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Love this phone and value"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    just what my daughter wanted",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "easy to set up, 10-15 minutes. perfect for a gift and would order again"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    [I would recommend] Black Friday Sale!",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "I got this s24 during the Black friday sale, and I have been loving it so far. Great sound, clear display, and no lag. The battery last for hours for non-stop gaming. The only sad part is that Samsung removed the SD card functionality for the dual sim cards. As for the custom notification sound, you cannot set it within the phone anymore, but you can still edit it by connecting your phone to the pc and putting the custom music in the notification folder."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone at a good price",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Got it for the holidays, learning AI overall love my purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Hermoso celular con excelente cámara",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Excelente producto. La buena calidad de la camara es notoria. Es fluido y su batería tiene una interesante duración. Me gustaría que los celulares Samsung vengan con su cargador como era antes"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked or Not",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I liked the phone and think it was a good buy.I had to return it because I was unable to add it to my phone plan. My catrier stated that the phone was not unlocked that's why they were unable to connect. I purchased the phone because it was supposedly unlocked.I still plan on buying the phone just have to find an unlocked one.The screen quality was very good. It was very easy to transfer my information from previous phone.I didn't have any issue with returning the phone and receiving the refund.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome 😎",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "This phone as been good to me, super happy I was able to get this phone, it was a Xmas gift and it was really easy to set up .Took my old SIM out and put it in this phone and was easy to get everything set up.I definitely recommend this phone!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a great phone and it has seven years of updates!",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Much easier to use than my last phone, which was a Motorola. Have not yet discovered all of it's uses but so far i'm very much impressed!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fun cover",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Great product!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very good cell phone!",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "This upgrade to our cell phone was the best price and and performance for our needs."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Who knew it could do all that?",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "I was pleasantly surprised to find that my new Galaxy S24 FE could transfer all my data and apps (except those that are no longer supported, from my old Galaxy S9 by just pressing a button and waiting the hour or so for all to transfer over. It even transferred many of my preferences in setting up the new phone's home screens. But I believe the transfer can only happen between Samsung cell phones with a certain Samsung app in them.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad but expected more...",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "My past 3 phones were Motorola, each was a couple hundred dollars. This time I thought to try something new and more expensive.  Now consider that I am not a power user, 99% of incoming calls are spam.  That said, I don't see much of a difference to justify the price. Yeah, the Samsung is a bit more refined and some nice features (better camera of course) but there are a couple things that I really don't like. First, I have to tap the screen twice to wake it up even though I have the setting to wake if I handle the phone. The Motorola wakes just fine with the slightest touch. Second, the finger print sensor is at times hard to see, so sometimes it takes too long to get into my apps. The Motorola has a dedicated finger print hole that worked much better. I'll probably go back to Motorola when this phone gets old.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value for money",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "I like the cover. Looks stylish and is sturdy. Added is the cam cover!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good camera",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "The quality of the photos from this phone are extraordinary!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome phone",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "awesome phone I love it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I love this phone!  It's the best phone I've ever owned.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Calidad",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Excelente producto. Muy recomendable."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Choice",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "I gifted this phone to my wife and now I want one for myself. It's a stylish model with brilliant colors and image quality that stands out every time. She has been using it for a month and we have no complaints. The photos and videos are of very high quality; in fact, we've used it to shoot videos for our channel. I would recommend this product without hesitation.Pros and Cons:Pros: Stylish design, excellent image and video quality, no issues after a month of use, great for multimedia content creation.Contras: None mentioned.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I like this product",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "It is very nice phone. It gives me comfortable life. But the translation function is not that useful yet. They need to improve the function easily."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Works great. Love the color pictures turn out good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .my new phone",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "A good phone, a little heavy and I had to order a phone case because you can't find this case anywhere it's a specific size"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Enjoying it",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "I needed a new phone and this one has been great. Purchased 11/2024."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked or Not",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I liked the phone and think it was a good buy.I had to return it because I was unable to add it to my phone plan. My catrier stated that the phone was not unlocked that's why they were unable to connect. I purchased the phone because it was supposedly unlocked.I still plan on buying the phone just have to find an unlocked one.The screen quality was very good. It was very easy to transfer my information from previous phone.I didn't have any issue with returning the phone and receiving the refund.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad but expected more...",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "My past 3 phones were Motorola, each was a couple hundred dollars. This time I thought to try something new and more expensive.  Now consider that I am not a power user, 99% of incoming calls are spam.  That said, I don't see much of a difference to justify the price. Yeah, the Samsung is a bit more refined and some nice features (better camera of course) but there are a couple things that I really don't like. First, I have to tap the screen twice to wake it up even though I have the setting to wake if I handle the phone. The Motorola wakes just fine with the slightest touch. Second, the finger print sensor is at times hard to see, so sometimes it takes too long to get into my apps. The Motorola has a dedicated finger print hole that worked much better. I'll probably go back to Motorola when this phone gets old.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great features- Not so great battery life.",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I like the powerful AI features and great display. I'm disappointed in the battery life, my 3 year old A52 running simular programs got better battery life."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Without a charger",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "It came without a charger but only the cable",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You need a sim card.",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "No sim card included. Amazon should notify buyer that you must get a sim card in order to activate this phone!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing charger n pin",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Great item, excellent condition but did not come with a charging cable or the pin to open the chip holder"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too technical",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Not for senior citizens"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broken speaker on arrival",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Supposedly new and the speaker is already messing up."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    some items are missing in the package!",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Received sealed box but it has only phone. the below three items are missing.Charging Cable (USB type C) - Cable onlySIM Tray EjectorQuick Start Guide"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "What a great phone, unlocked as stated easiest set up ever.. how ever fingerprint reader doesn't work and the sound is hit or miss. Also the trusted areas never work neither does the optimized charging."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Phone Poor Packaging`",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Honestly FU Amazon. You put a big ugly label on the pretty samsung box that ruined the box."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Received At&T branded phone",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "The description does not mention anything about this being a carrier brand phone. Carrier phone come with 3rd party carrier software/bloatware that normally can not be uninstalled. I received a At&T unlocked phone. This should be disclosed in the description.*update returned for a refund, ended up ordering directly through samsung's site and saving 100$ due to trading in my old s20."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with Straight Talk if you buy on Amazon.",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "Says unlocked for all carriers.  It is not.  I am sure the phone itself is just fine but you have to purchase a phone from Wal Mart if you use Straight Talk.  Just the way it is."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No sd card slot",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Very disappointed to find out that Samsung has gotten rid of the micro SD slot.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Unlocked",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Tiene un buen diaeño y tamaño, pantalla grande, es rápido y tiene muchas aplicaciones interesantes pero la batería dura menos de 24h, es algo que deberían mejorar. Lo cargué en la mañana y en la noche ya batería baja. No veo películas en mi teléfono, ni tengo juegos. No soy de las que esta todo el día en el teléfono.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Average phone for low usage",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "Overall the phone is average given its camera quality, connectivity. Looks are below average as it looks similar to any low end samsung phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not good",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I purchased this phone it said brand new.  I think different....every time I use the phone  it get hot hot hot I have to put it down now I have a phone not in use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Length",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "BAttery does not as listed.  I lose battery within one day, without using it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm LIVID",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I ordered the blue S24FE in blue and it's the ugliest and flattest blue I've ever seen so I'll put a case on it. Also, the phone is $15 cheaper than it was on Black Friday. What a Scam!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT UNLOCKED",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "I purchased this phone on Dec 2nd on sale it was listed as UNLOCKED. I attempted to activate it through Straight Talk and was told the phone was locked and the IMEI was invalid. Nothing could be done by Straight Talk or Amazon so we are having to return the phone. Now my money will be tied up for up two weeks while waiting for a return (weeks before Christmas) I can't imagine the people who bought this as a Christmas gift will be happy either when they go through similar issues on Christmas morning. It would have been a great phone if I could actually use it. This is extremely disappointing as I have already purchased all the accessories and was excited for my new phone.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    arrived ice cold",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "This phone seemed to work fine for the window of return, but for the last couple of weeks the phone doesn't work at all. I've tried multiple phone apps, and they don't work. My calls come in and go out constantly, and I can't have conversations with people. I can't return the phone, so I'm left with a phone that doesn't work. DO NOT BUY A CELL PHONE FROM AMAZON, THEY STORE THEM IN ICE COLD TRUCKS ALL DAY, NO HEAT, THIS DAMAGES ELECTRONICS!!!!!!!",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is junk, warranty sucks AVOID",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Phone has had network connectivity issues since I got it the week it came out. Samsung sent me to asurion to get it repaired, they said it is un repairable. Now samsung wants me to go without a phone for a week or two, and mail it in so they can \"repair\" it. I would absolutely not purchase this or anything from samsung again.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung S24 FE- Not compatible with Spectrum",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Purchased because described as unlocked for all networks, but not compatible with Spectrum.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is actually LOCKED.",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "Purchased this phone- actually two of them- for Christmas gifts for two of my children. The only reason this phone was purchased was due to the fact it was on sale and marketed as unlocked. We use tracfone carrier and after four days of attempting to get this activated before Christmas, we have figured out that it is actually locked. As it is bought from the Samsung store itself this is very infuriating and disappointing as it was marketed for ALL CARRIERS.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    horrible quality",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "not the best phone. I will not recommend",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DOES NOT DESERVE ONE STAR",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "BEWARE this vendor will not take back the phone.  Impossible to navigate, nothing seems to work.  I HATE THIS PHONE.  will never buy another expensive item or  phone from amazon.  Stuck with a bad product",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it.",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Have had nothing but problems with this phone have changed sim cards but most time can not answer a call unless have to restart the phone. Very disappointed about to go back to my trusty s20 atleast it works all the time.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't work the way it supposed to work",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "This phone doesn't work it looses a lot of calls also it takes too long loading short videos I went back to use my old phone it works way better the  phone signal is good",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Android from Hell",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Plan on returning since it seems to have some kind of problem letting me sign on and the software has a malfunction that even my grandson ( a computer geek ) could not to work for him, suggested I return and try another android cell.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    don't buy from this seller!",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Arrived 2 days late. Sold as unlocked . That's a lie. Current carrier could not activate it. Tried 2 other carriers and they couldn't activate it. Looks like a blatant scam. Thanks Amazon. And why can't I give it negative stars?",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy S24 FE AI Phone",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "This phone was not usable on Straight Talk Wireless. Straight Talk informed me that the phone was locked and could not be used on their service until it was unlocked. This phone is listed as unlocked and usable on any service. I contacted Samsung because these are new phones, they had me do a factory reset on the phone and said that would fix the issue. This did nothing to fix the problem.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Compatability",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Verizon advised it was not compatible with their Verizon network.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Super slow",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Im a iPhone user since 2008 I give it a try but its super slow, keeps me restarting the phone several times in the day. Not for me. Good camera that’s it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Horrible  phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk product nowhere near a tier 1 phone",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Advertised battery life 24 hours in the real world expect 6 or 7 hours. You can't make it through a work day without charging. Also this product is buggy and a pain to set up. Looks like Samsung made a cheap horrible product a total joke in my opinion don't buy it save your money and go else where.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IT IS NOT UNLOCKED, UNUSABLE PHONE",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "The listing says the phone is unlocked, but when trying to activate it my service provider informed me it is locked to T-Mobile, meaning I cannot use the phone in any way because that is not my provider.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not compatible with straight talk",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "I bought this because it said unlocked with all carriers, it is not. The only carrier listed for me anyway is t-mobile. It's a really nice phone, works well, great camera. I just either have to switch to a new network or return this. Really unfortunate.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    STOLEN IMEI.  DO NOT BUY",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Stolen IMEI.  Could not activate.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Immediately Disfunctional",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Died within three days of usage and had to return.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for Spectrum",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "This phone does NOT pair with Spectrum. Do not waste your money if you have Spectrum service.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what is advertised",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Not actually unlocked",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dropped once.",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Not sure if they replace screens on these but I dropped the phone once since I purchased with both a case and a screen protector and the screen scrambled. Screen has no cracks.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a good quality",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "This is the second phone I have order within the past 6 months very poor quality phone.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging issues",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Phone is having a issue while charging",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing Parts",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "Missing parts...Protector Screen and cleaning kit...",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ick",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I had this phone forced on me through work so it was effectively free, and likely purchased directly from AT&T. That price was too much. At 6.7 inches it is incredibly heavy in my hand. Theres no headphone jack. The glass back gives me uncomfortable sensory issues so a case was a must for me. I opened Teams 3-4 times today on it in my 6 hours on shift and the battery is at 61%. Hopefully that is just the new battery not yet benchmarked by android.The thumb reader is built into the screen and seems to work fine. It works as a phone. It works as a Teams client."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen producto, mucha demora en la entrega y resolución de problemas",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "El producto llegó muy bien, La experiencia de compra muy mal. Tuve muchos inconvenientes después que realice el pago para que me realizarán el envío y múltiples contactos con soporte al cliente, pero finalmente lo pudieron enviar.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is not unlocked",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Phone was not unlocked as advertised, I can't activate with my current phone carrier.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone but...",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Cannot sync passwords with Samsung tablets.Tablets use Samsung pass. The phone upgrades you to Samsung Wallet.And they don't sync with Samsung cloud. So your passwords cannot be synced acrossdevices.Also, your bookmarks won't sync to Samsung internet browser _ i got a notice about that yesterday.So, as a phone it is good. Excellent cameras. Finger print sensor works well.Battery life is good. But, I got it to sync info like passwords and bookmarks with my Samsung tablet.And it can't/won’t.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    What is normally included isn't",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "No charging block or option for expanding memory.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not unlocked.  No Samsung support.  Sent it back.",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "The phone was not unlocked and thus useless.  Samsung support punted to Amazon and told me I should have bought the phone at their website.  This purchase was from their Amazon store!!! This is the end of my 14 year Samsung run.  I was a loyal customer.  No more.  I'm incredibly unhappy, no furious, with this outcome.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is only for US Version!!",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "The description is not clear it states it is unlocked but then later it states US Version! Very misleading. If it is for US Version only it should be stated up front. What a waste of time if you are looking for just a unlocked phone"
    }
  ],
  "productDetails": {
    "productTitle": "SAMSUNG Galaxy S24 FE AI Phone, 128GB Unlocked Android Smartphone, High-Res 50MP Camera, Long Battery Life, Brighter Display Screen, US Version, 2024, US 1 Yr Manufacturer Warranty, Graphite",
    "asin": "B0DCLCPN9T",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "MOVE IT. REMOVE IT. IMPROVE IT: Take a great pic, then make it better using Photo Assist¹ with Galaxy AI,² It gives you suggestions for improving your photo and makes it easier to move, remove or resize objects for post-worthy pics every time.",
      "NEVER BE LOST IN TRANSLATION AGAIN: Understand text, calls and in-person conversations in another language using real-time translations¹ with Galaxy AI.²",
      "SLOW-MO MADE SIMPLE: Sometimes you just want to make the moment last longer. Using Instant Slow-Mo¹ with Galaxy AI,² simply tap and hold to replay any video in epic slow motion.",
      "DO MORE W/ EPIC BATTERY POWER: Do what you love, whether work or play, without worrying about your battery. Galaxy S24 FE intuitively manages your apps to make your charge last longer.⁴.",
      "CAPTURE HIGHLIGHTS IN LOW LIGHT: Poorly lit portraits? Not anymore. Bring details out of the dark with Night Portrait. Using AI,² your Galaxy S24 FE can analyze and optimize your low-light shots and make them shine."
    ],
    "boughtCount": "2K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: SAMSUNG",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$614.00$614.00$614.00",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$473.10$614.00$614.00",
    "buyUsedAvailability": "Only 5 left in stock - order soon.",
    "shipsFromNew": "Amazon",
    "soldByNew": "Mavis Supplies",
    "shipsFromUsed": "Amazon",
    "soldByUsed": "Amazon Resale",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 3,
    "startingPrice": "$473.10",
    "url": "/gp/offer-listing/B0DCLCPN9T/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0DCLCPN9T",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Galaxy S24 FE",
        "Charging Cable (USB type C) - Cable only",
        "SIM Tray Ejector",
        "Quick Start Guide"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$614.00",
    "listPrice": "$649.99$649.99",
    "savingsPercentage": "-6%",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "Friday, March 21",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}