{
  "asin": "B0BN72FYFG",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality, great price, fast shipping options",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Really fast shipping option was great because I broke my phone. The phone is in excellent condition as described. The screen has one needle pin scratch (literally a teeny tiny dot that is less than a speck of dust) and one scratch that’s less than a mm, which is incredible. I expect some wear and tear, but it is way better than my expectations and experience buying refurbished phones. I’m very pleased. It’s as described if not better. I will be purchasing from this seller again. Great prices and reviews on their page by the way. Works like brand new and it has 86% battery life. Came with a charger box and a chord, very nice of them to include both with the amazing deal it was already at. I would recommend anyone to buy a phone from here and am eyeing another now for family. Thank you so much seller!",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it 💛💛💛",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Great phone in great condition. Battery health was a bit low at 90% but was in great condition and works well. I had a it of trouble setting up the Apple ID, I upgraded from an IPhone 12. I had previously disconnected my previous line so no longer have the number. Unfortunately the old number was still connected, so every time I would try to use the Apple ID connected to the iPhone 12 it would send a confirmation code to the phone number so I had no way of using the phone number. So I had to create a new Apple ID and email. Other than that everything works fine and I purchased the yellow option and love the phone and the color is cute!💛💛💛",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    1st purchase was great! This one was not!",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "I have had this iPhone for 38 days.It has the worst battery life of any iPhone I've ever owned, and I have owned ONLY iPhones since the first version was released 17 years ago.This is the second iPhone 14 that I've bought from the renewed store .The first one I bought on December 4th, 2023, and I could not have been happier with the phone.It arrived in brand new condition, and performed flawlessly.On the recommendation of a friend, I checked the battery health and charging after having it for MONTHS and it was at 100%! I was thrilled!I absolutely loved the phone!I never had a single problem with it.Unfortunately, on July 30 of this year I dropped it, and it was beyond repair.I immediately went back to the Amazon renewed store and purchased another iPhone 14 because my experience with the first one was so fantastic.It arrived in new looking condition, exactly like the one I bought in December 2023.It was not scratched or anything really noticeable, it just seemed to be \"worn\" a little bit, but I fully understood that it was a renewed phone, and any cosmetic issues were not that important to me, including the color, which, when my iPhone is in its case, you cannot tell what color it is anyway.Unfortunately, I DID NOT look at the battery health and charging when I first got the phone 38 days ago, but I did look at it about two weeks ago, and it said 93%.I thought, ok, it's a renewed phone, it's not going to have 100% battery life.I can live with that.Well, I just looked at it today and it's now at 90% battery health and charging.So this phone is dying quickly.After being fully charged it dies within hours.I have it completely set up for optimized battery life.I have lost emails and messages that I was in the middle of composing, and the phone just dies.I've been in the middle of important phone calls when the phone dies, simply because I had just fully charged it a few hours before that, and thought I would be fine for hours to come.I just had a total shoulder replacement surgery a week ago, and I was on the phone with my doctors office yesterday about my first post-op appointment, and my phone died in the middle of it.I thought I had HOURS left before the phone would die.Then I had to plug it in, and wait for it to come back alive, so I could call my doctor back and hopefully not wait a half hour after losing my place in line.On top of that is also has issues with the touchscreen being glitchy, and sometimes I have to tap on things several times to get them to work.As I said, I have been an iPhone owner/user since the very first version came out 17 years ago.I've always loved all my iPhones, and I will continue to be an iPhone user for the rest of my life.This is in no way reflection on Apple iPhones whatsoever.They are an amazing and fantastic piece of technology.I think I just got a bad one for the first time in my life.Luckily, I have just checked and I have until November 6th to return this phone, and I WILL be returning it.The problem is, what do I do in the meantime?Am I expected to buy a new one and get that shipped to me, transfer all my information from this phone to the new one, and then return this one?That is extremely hard to do financially!I am actually still paying for this phone on my Amazon Prime American Express card!Or, do I return this phone and wait until the refund has been issued and then buy another phone? Then wait until that is sent to me.I would not have a phone for at least a week in the interim, and we all know these days that's a practical impossibility.I am also having several medical issues.Like I said, I just had a total shoulder replacement surgery last Monday, September 9th, and have several upcoming follow up appointments, and physical therapy appointments.I also have several other non-related medical issues that definitely require that I have a phone.I just don't know what to do.",
      "helpfulVotes": 168
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Well, worth the purchase",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Awesome product I chose the excellent unlocked version. I had absolutely no issues connecting it. The phone itself is in brand new condition not a blemish scratch or damage of any sort I would recommend this seller to anybody.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Good so far. Phones battery healt is at 86%. Phone condition is good, no scratches. Phone seems to be working well. The screen looks great. The only thing I would say makes a difference is that the camera has a little visible wear and tear. I was scared to order as the reviews werent great but im glad I did.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good!",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Battery life is at 86%, sure the iPhone has defects and some weird dirt/rust on the back of camera but I haven’t had any issues yet as I’m setting it up. I can’t speak for other customers who have had issues but so far so good!Edit after a week: It was some weird junk on the back camera, the phone has to scratches or any dents and has been working properly. Only downside is that the camera doesn’t detect QR codes. That’s not a deal breaker for me. Glad it works and satisfied for a used iPhone 14!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone and save my boyfriend money",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "My boyfriend loves his new phone. Looked like new when he got it. He’s never bought used before and I talked him into it having had such a good experience myself with a used phone from Amazon. He’s so glad he did it, saving him over $200 from what the phone store was going to cost him. He loves the features on this phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s perfect",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "I love the color and besides a few small scratches which are to be expected, the phone works perfectly and has a great battery life. A very affordable and reliable option if your not looking to get a brand new iPhone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy set up and decent for the price",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Needed to replace my old I phone but didn’t want to spend the money required for a new one. This one was easy to purchase, came quickly and was fairly easy to set up.  Make sure you have a current backup for your phone before you transfer.  Has a few minor dings but nothing crazy.  A little bummed that the battery life was in the 80s, I was hopeful it would be higher but still and improvement from my old phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Verify with geekbench6",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "So far so good…the only thing that bugs me is the fact they can’t warrant the water resistance that a new or apple certified phone would have.Which means it has absolutely  been  worked on (renewed iPhone) by a third party vender ???Had it a few days and it has been fine 90% battery life …charged it last night at around 8:30. 9 oclock it was fully charged and it’s now at 38 % so about 15 hrs.with little to mild use .The camera acts up a little ,as in scanning an id for identity verification.but all around it seems to be performing like an I phone ."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone! Good price!",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "I got one classified as “good.” I can’t see any damage on the phone. It looks like new. Setting it up went perfectly, absolutely no issues, and e sim was installed without problems. The battery is at 87% which is what I expected. My old phone was a year and a half old and it’s 87% too. The phone though lasts longer than the old iPhone 12.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Very happy so far with this phone.  It arrived in excellent condition. There was a few tiny scratches, really not noticeable unless you are really looking. The color is exactly as pictured and it holds a charge as it should. I have not had any issues with the phone getting to hot. I have played games and watched videos, the temperature remained fine.Overall, I feel this was a good purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great seller, issues with 18.0.1 update and porting old to new phone but found a workaround",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "The seller is great, we had to send back the first phone because we thought it was defective, it turned out that there is a significant conflict with the portability of the old phone information and 18.0.1 upgrade.  When we cut on the phone we set it up to transfer the old phone material first, then it wanted to upgrade the software prior to the transfer.  The upgrade spooled around for 18 hrs, then the portability function (over WiFi and Cloud) simply would not work.  AT&T couldnt figure it out....we sent the phone back thinking it was defective (turns out it was fine), got a new phone same model, etc.New phone had the same issues, and I was thinking at this point it cannot be coincidence so it must me a software conflict.  And....it was.  After MUCH tinkering with it here is the workaround for those of you who are in the same situation (as an aside, we were upgrading my wife's ancient XE to a 14 but I think this happens with a lot of phones no matter the model)1.  Cut on the new phone2.  Opt to NOT set up the new phone with the old phone (ie, do NOT transfer the old phone data yet).3.  Go to settings, opt to update the software to 18.0.14.  After this, ERASE the phone.  It will keep 18.0.1 on there, it will remove any impediments to port over the information.5.  KEEP the e-sim information on there(it gives you that option when you erase, it is ok not to do it but you will have to put it back on so just keep it on).6.  Boot the phone back up7.  OPT to set it up with the old phone (likely the older phone will prompt you for this first).8.  You can set it up over Wifi or Cloud, make sure you have backed up the old phone on the cloud just before set up if you opt for that.9.  There is an option to use direct cabling to transfer, but it is a pain because Apple insists on using the proprietary cabling they have, so it means you have to first port everything onto a laptop then transfer it.  Safer but not any quicker.  I would not do that unless you have cloud issues and/or bad WiFi.Phone has worked great since we did the workaround, and I want to compliment the seller as they were quick to send a replacement phone to us and very communicative on the issues.  I hope the workaround here helps others, it was utterly baffling to us.  Apple needs to get it together on the portability issues since they just released the new model and apparently this is an issue with a number of older to newer transfers, very disappointing for them to not catch this.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished, but not “like new”",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "I purchased this as I wanted a newer phone and this seemed a less expensive way to go. I was a refurbished iPhone 14. It came in a nice box and a charger cable, but not a charger. Not usually a problem as most people over time accumulate several them over time. It looked brand new and works fine. Unfortunately, I had assumed that refurbished meant “like new”, but apparently it also means “it was checked out, cleaned up and it works”. What it does not mean is a new battery. Mine had a battery with 84% charge capacity. In fairness, the company’s fine print indicates this so that’s on me to have overlooked that. In fairness I did get a “newer” phone just not one that was “like new” which meant like a new one, not just close. So, the iPhone is a newer one and works well, just will not hold a charge as long. If that doesn’t matter then this a good choice.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used iPhone 14 Excellent",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "iPhone showed up in like new condition.  Came with lightning cable.  In case someone else runs into the issue I did.  We use Visible which says it’s by Verizon so I assumed (incorrectly) that I could use a Verizon locked phone.  It did not work so I had to return the first phone I bought and I purchased an unlocked phone.  Everything transferred over from my old phone just fine and everything is working great.  No complaints!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Experiencia 10 de 10 Muy Recomendable Batería al 100%",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Quejas? ¡Ninguna! Estaba un poco nervioso por realizar esta compra ya que es la primera vez que compro algo “renovado” y que buena experiencia primeriza me he llevado. El iPhone llegó en EXCELENTE estado con la capacidad de batería al 100% y nuevo (Revisando el número de serie verifiqué que, en efecto, el celular es nuevo).Sin rasguños de ningún tipo, quizá un rayón diminuto en la pantalla que es imperceptible a primera vista a menos que lo observes cuidadosamente. La batería le dura 1 día y medio a 2 dependiendo del uso que le dé. Esperé una semana para testearlo bien y escribir una reseña correcta para que las demás personas sepan bien cual fue mi experiencia y así facilitar la compra de otros clientes. En fin, estoy satisfecho con mi compra. Gracias al vendedor por enviarme el producto rápido.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s ok",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "I got the phone about two days ago it’s working good so far no issues the battery is 85 percent which isn’t bad for a used phone the physical appearance is good so far I can say it’s working well and I have it for four days"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn’t get this phone on my xfinity network but no problem getting a refund",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I tried to save myself some money and having to renew my xfinity plan for another 24 months by buying a refurbished iPhone 14 for my son. The phone looked brand new but even though it was unlocked we spent hours on the phone with xfinity and in person trying to get it on my xfinity account.  Very frustrating.  Even called apple but no one could figure out what was wrong.  I finally gave up and bought a new iPhone 14 from xfinity.  The seller was great about issuing a refund. It actually happened very quickly.  In hindsight I wish I had just bought the new one from xfinity to start with.  I gave the seller a 5 cause I don’t think it was their fault.  I did email him twice and the answers back didn’t really help much but they were responsive with the refund.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great for price",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "i had the smallest crack near my camera and top speaker but other than the the phone is perfect.i dont know if it was just me but its a little slower than a brand new phone to set up eSIM. but after some time i got the hang of it.phone works perfectly! the battery life was af 98% when i got it (4.5 months and it is now at 96%)."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as advertised",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Phone seems to be working well, however, cosmetically it has some scratches on the corner that are viewed from further away than 12 inches. Listing says free of scratches when viewed from 12 inches.  Not a big deal, but not as advertised."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT!",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "The phone came in great condition. No scratches or anything. Had 100% battery health and everything. My order just kept getting delayed but other than that it was great!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    88% battery life. We will see...",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Pretty much the most important thing about an iPhone that matters more than a camera, some scratches, and even the overall iPhone is, and will always be, the battery percentage.Mine is 88% for the excellent condition. I just hope this lasts, as I bought it for use in Peru and not the states. So, charging your phone is a whole lot less convenient when not in the US, surrounded by chargers and plugs/outlets.I will update this within a few months to see the battery life and how it will hold up.Other than that, it looks great; it even got a USB-A cable + charger box, which is a plus."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy again",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Good but the battery life was 83%iPhone 14 red"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this new iPhone 14",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I have had my new iPhone 14 for three days and I love it. I had to call TracFone to get the phone set up, but they were so nice and set me up in a few minutes. My iPhone is so much easier to use than my old iPhone 6. I am so happy with this new phone because itis so easy to use."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ordered a phone in good condition and mostly happy with it",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "Ordered a phone in good condition. According to Amazon there isn’t supposed to be any scratches on the screen when it is in good condition. There are 2 deep scratches and smaller scratches on the screen. Not upset about it but it doesn’t follow what Amazon says. Battery was at 100% health so It makes up for the scratches. But i am a bit disappointed in that there were scratchesBesides that the phone is in good condition, was a bit of scuff marks on the side but a case hid that. The speakers are loud, was fully unlocked and was able to switch it over to my carrier easily. Was worried when I saw reviews saying the phone wasn’t unlocked but I didn’t have that issue.Overall I’m happy with the phone, just the scratches were disappointing.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s okay",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "It is wayyyyy smaller that I thought looks almost like my iPhone 12 but anyways it also doesn’t have the slot to enter a SIM card but it came with a SIM card opener thing. Really makes no sense but I haven’t started using it but it’s pretty but very small",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Truly unlocked & easy set up",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I’m very pleased with the iPhone I purchased through Amazon.  It was truly unlocked.  I use prepaid service through straight talk and I was able to  simply call my phone company and have my number transferred to the phone.  Easy peasy.  And the phone looks just like it would had I went into a phone store and purchased it brand new.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not completely wiped. Prevent data transfer of Facebook.",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Good for the most part. However, the phone was not completely wiped. My Facebook account will not transfer. The previous owner’s account will not go away."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    “Excellent, like new” condition",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Phone arrived packaged nicely and included charging cube and cord.  I had to present my drivers license and sign for it when FedEx delivered it.  Some scratches on the sides, but front and back screen look new.  Very disappointed however to check the battery health and it only be at 85%.  I would have thought that an “excellent, like new” phone would’ve came with a new battery since that has always been my experience with Apple refurbished products. (I do realize this is not a certified Apple refurbished product) I purchased this as a gift for my daughter, so no time to return and get a different phone.  For the price paid, I would’ve expected a “like new” phone that has a new battery.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Faulty product, phenomenal service",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Phone arrived in non-working order. That happens from time to time. But what doesn’t always happen is quality service after such an event. No issues at all, the phone was easy to return, quick turn around on the refund.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    THIS WAS REFURB GOOD CONDITION",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "WORKING FINE SO FAR"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone 14",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "No está mal tiene algunas imperfecciones porque es de uso pero funciona bien",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life 88%",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Will update with pictures. Overall the phone is nice and works great. No scratches or chips. The battery life is at 88% which isn’t a huge deal for me I’m home a lot and have the time to keep it charged. The sides were very obviously painted. You can see it on the back and front glass. But other than a little bit of cosmetics and the battery life I would 100% recommend this!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So I was very mixed about doing this",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "Ordered just the basic quality level !!Had very mixed feelings about ordering because it’s like you just gotta be one the lucky ones ones to get a good one so I rolled the dice being cheap bastered I am but I love quality at same time haha I got lucky my iPhone 14 was in mint condition only problem was battery life in settings said 82 percent I’ve had the phone nearly 3 months now that hasn’t changed it charges to 100 percent every time and last long time but it dies at 4 percent life everything else perfect and I ordered just the basic cheapest quality level !!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Been enjoying this phone since the moment I’ve gotten it battery life’s great easy to use and got used to all its features after like a week."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great experience",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "My phone was delivered three days early and it works great! Setup and information transfer was seamless. My new phone was ready to use in 10 minutes. This is the first time I've ever bought a phone that wasn't from a cell phone service provider, and I couldn't have been more pleased with the experience. I will definitely buy from this seller again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    More than expected",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "I though phone will have either low battery health , or scratched screen or any fault. I didn’t find any fault ."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Good product"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2 phones",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "I’m very impressed with the reliability of this phone, second purchase from this seller and both have been great experiences."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean iPhone 14",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "No scratches or any issues from this seller . Product looked like new and zero wear and tear issues . Back was shining like new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery at 100% health! Brand new phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "I think I got pretty much a brand new phone lol. Battery was at 100% health wise or whatever, everything’s perfect and all set up."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly what I ordered",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Good condition"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Llegó tal cual se ve en las imágenes. Estaba en buen estado y limpio. Lo llevo usando semanas y no me dado ni un solo problema. Sin duda lo compraría de nuevo para alguien más."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Should have read desriptions more closely",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I purchased this phone based on so many good reviews. The phone arrived quickly and cosmetically it is beautiful, no scratches, dings or dents. The phone is functional but battery life was 86% on arrival and a month later is down to 85%. I should have looked for a phone with a premium rating. Since I do not use my phone for gaming or internet and only occasional texting, it will probably be ok for me.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    product description incorrect - ordered an unnecessary sim card",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "The phone seems fine.  But the product description said I'd need to get a sim card from my provider and this phone uses eSim.  No sim tray in this phone.  Caused some confusion...",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really Great",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Excellent condition phone. Works great. Was able to transfer information easily. Battery life is much better than my last phone. Definitely recommend."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sweet as Apple iPhone Pie",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "I'm just a regular customer.  This iPhone 14 Pro Max is what it says it is. It does what it is supposed to do. It was much less than a new phone but other than that I noticed no difference between this phone and a new one. I've upgrade from a 11 Pro to this 14 ProMax.  I'll be using this phone until it fails, or maybe somewhere around the release of iPhone 18."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Need new phone asap!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "My son loves his new phone.  He can't put it down."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Phone quality is great, 87 battery health but it lasts very long"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Cumple las espectativas",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "Excelente el estado del telefono"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Nice phone for the price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fixed first mistake",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "First time the box came completely empty but after notifying Amazon, they made things right. Great phone at a great price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is a good phone and unlocked let's you join any network",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Excellent. It was unlocked and we added it to the Xfinity plan. Great deal.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone if you’re looking for something cheap",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Very nice quality on the phone there are a few scratches on the outside of the phone but nothing major. Battery health is ok it’s at 89% so not bad but could be better but for the price of this phone it is very good."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought mine for less than $330",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "At first I was expecting a phone in not so good conditions as it was “used-acceptable” I was expecting visible scratches etc. It arrived earlier than expected as well as in super good conditions. It looked and felt brand new. No visible scratches and works great. Definitely worth your money. Battery life is great as well as camera quality.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great purchase",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "phone looks great and everything transferred perfectly my only issue is the battery which is at 85 percent but other than that its good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Phone Is So Pretty ! I Love The Color & The Phone Works Really Well & Is In Perfect Condition. Very Durable"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent transaction / excellent product",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Very pleased with this ... easy to set up, works like a charm!Thank you for an excellent transaction!!  A++++"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    100 batery",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "Toda la bateria, sin rayones, sin detalles. El empaque no es original ni tampoco el cargador.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 14",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Came excellent condition even tho shipping took forever. No problems at all"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is great",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "My son loved the phone thank you so much"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new iPhone!",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Great phone, great price. fast delivery, excellent battery life.It’s like a brand new phone… no scratches or imperfections on the exterior case or screen.. Battery health showing 100%. I have only been using it for three or four days, but so far I could not be happier with this purchase.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would buy again",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Very pleased with phone so far. Arrived late, but that's on fedex not the seller. Anyway was as described and my daughter loves it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its a great phone",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "The phone I got looks brand new and works perfect. I highly recommend it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is Good not Excellent",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Phone is good. Few areas you can see where the screen was replaced and not seated all the way.  Corners of the screen are lifted a little and not flush some fix areas near the camera where the sames was smoothed and polished. Overall Good I would not rate as excellent as seller has listed and would expect it to be $50 to $100 less than what I paid. Function of phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I14 Cell Phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Good Deal"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ok",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "as gift"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great investment",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "100% battery percentage! Very pleased and happy with my buy :)"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Fast delivery and good product."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Would recommend"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Muy buena compra",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Excelente"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen producto, pero dos rayones medianos en la pantalla",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "El teléfono funciona muy bien, sin embargo he comprado en ocasiones anteriores teléfono reacondicionados y los daños estéticos suelen ir en la parte de atrás, algunas esquinas. Este tiene dos rayas en la pantalla, una pequeña y otra mediana."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 14",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Its great it came with no scratches or damage’s charges good was easy to set up 90 percent of battery"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "It came like brand new cell phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buena calidad",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Definitivamente lo volvería a comprar"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phond",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The delivery was a day delayed but it arrived and the phone worked great. Transferred data without any problems."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great buy",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "I love the phone, it was in great condition, but not excellent as I purchased. Minor scratches not big enough to spoil the look and the battery health is what annoyed me, 87%. It wasn’t a bad buy all around"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 14 Rec",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "iPhone was an excellent shape and works perfect. Much appreciated.!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good Apple phone",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "What can I say? Is Apple phone work just like all Apple phone work it’s good."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Product, like new!",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "So happy with the purchase. The phone is like new and it was delivered before the expected date. I was so happy!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works like new",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I was SUPER hesitant to buy this phone because of some of the reviews but I still bought it anyways and it actually works like new. I have no problem with it so far and there’s zero scratches. It was also very easy to set up.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished like new",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "I can’t tell this is a refurbished product. Looks feels an operates just like brand new."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Calidad/precio",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "El teléfono se encuentra en buenas condiciones físicas, sistémicas, con sus sistemas de audio bien hasta el momento, identificador de Face ID  en buenas estado. Bajo porcentaje de batería."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Amazing condition"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "I’ve had this phone over six months now, and I have not had any problems with it. This one looked and worked as if it was brand new when I received it. I’m very happy with this purchase.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "In perfect condition and with charger cable"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked great",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Good price works good and fast shipping"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works but definitely not “excellent” category",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I purchased an “excellent” condition phone. I certainly wouldn’t classify it as excellent. “Good” would be a better category considering the markings on the phone. It was clearly dropped several times. The functionality of the phone is fine. It came unlocked and was easy to setup with T-Mobile."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better off getting a new one",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "All of this was experienced in the span of about 24-48 hours, and due to my work, I couldn’t keep the device because of the performance issues experienced:I needed a phone quick because my last phone died. While I appreciate the quick turn around on my order and delivery, the device had issues.For starters, the refurbished one I ordered and received took a long time to set up. You couldn’t just pair it with another device to get everything transferred. If you tried this, you would see the latest update would take days to complete and the timeline never changed.I reached out to apple and they helped me get it set up, however, there were several performance issues with the device I received.Total time it took to get the phone set up: 6.5 hours.Details: Started at 4pm as soon as the device was delivered, and after seeing the update was still not completed around 9pm, I worked with Apple support to get the device finally set up around 10pm.Performance issues:The charging port was loose, so even if the device was connected to a plug in charger, it wouldn’t always charge. This also impacted connection to CarPlay when driving. The phone would be sitting in the seat beside me, plugged in, but if it moved slightly, the connection wouldn’t work and I’d have to unplug it and plug it back in. It’s not tight enough to keep a good connection.There was an issue with screen responsiveness and phantom typing. If you needed to tap or select anything closer to the edge of the screen, it wouldn’t register. At times the screen wouldn’t respond at all, or if it was face down and I picked it up, I would see it was randomly typing characters in the Home Screen search box. I would have to manually turn the screen off (side button) for it to stop.There was also an issue with the front facing camera and sensor. The camera was really fuzzy and not able to pick up anything at times. The sensor wouldn’t always correctly adjust the screen brightness over the night I had it.The physical device itself also has scratches and dents all over it. While I don’t care about cosmetic as much as the above, the phone I received was more along the lines of poor condition overall.For this seller, I think it would be a good idea to do more intensive performance testing with the phones/devices before you send them out. You should also include correct setup instructions with the devices so your customers can set them running with ease and not have to waste half a day trying to get the phone setup to work.Overall, with the issues and hassle I experienced with the device I was sent, it was more cost effective to go buy the same model in new condition for the additional $100 at a local Best Buy.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works great",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Looks great and works great."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Perfect"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    teléfono como nuevo",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Excelente calidad precio. Super cumplidos"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase!",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Perfect. Out the box, clean IPhone 14. Powered up and connected. IEMI clean no issues activating. Pleasure to work with.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Loved it",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "I gave it to a friend who needed a phone  after being without for over a month  He was ecstatic"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It said it'll deliver in 4 days IT CAME THE NEXT DAY",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I was scared to buy this because yk how it be when shopping online for things especially high in value. And one thing I LOVEEEE is the fact that IT CAME THE NEXT DAY!! It said it would be delivered on Sunday, for reference I bought it on Wednesday and it came on Thursday the next MORNING!!! Omg I'm very grateful for that. Another thing, my phone came in perfect condition no scratches or defects. I'd say get it if you need a phone it's perfect and it's UNLOCKED",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not original iPhone screen",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Phone looks and works like new. But the screen is not an original. And the replacement is not a real iPhone screen. They also wiped the info from the phone showing if it’s original parts. For the price it’s worth it but kinda shady for real."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent shape",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "Overall the phone condition is fine, I’d give it a score of 8.5/10 looks-wise, and the phone is functional which is important. I’m surprised it came with a brand new charging cable! Thumbs up for this. We’ll see what happens within the next couple of weeks."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    JUST AS DESCRIBED! THE PHONE UNLOCKED!",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "The phone is in mint condition, touch great, battery health good and most importantly it’s unlocked! I recommend it",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beautiful Red",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "I would never know that the phone wasn’t new. It arrived a day early and was packed very wellThere are no blemishes scratches, the color is gorgeous, and the phone works with no problemsDon’t hesitate to buy refurbished electronics, I was a bit worried buying the refurbished phone but totally happy with this purchase  AND I saved so much money!!Thank You to these sellers",
      "helpfulVotes": 3
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    1st purchase was great! This one was not!",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "I have had this iPhone for 38 days.It has the worst battery life of any iPhone I've ever owned, and I have owned ONLY iPhones since the first version was released 17 years ago.This is the second iPhone 14 that I've bought from the renewed store .The first one I bought on December 4th, 2023, and I could not have been happier with the phone.It arrived in brand new condition, and performed flawlessly.On the recommendation of a friend, I checked the battery health and charging after having it for MONTHS and it was at 100%! I was thrilled!I absolutely loved the phone!I never had a single problem with it.Unfortunately, on July 30 of this year I dropped it, and it was beyond repair.I immediately went back to the Amazon renewed store and purchased another iPhone 14 because my experience with the first one was so fantastic.It arrived in new looking condition, exactly like the one I bought in December 2023.It was not scratched or anything really noticeable, it just seemed to be \"worn\" a little bit, but I fully understood that it was a renewed phone, and any cosmetic issues were not that important to me, including the color, which, when my iPhone is in its case, you cannot tell what color it is anyway.Unfortunately, I DID NOT look at the battery health and charging when I first got the phone 38 days ago, but I did look at it about two weeks ago, and it said 93%.I thought, ok, it's a renewed phone, it's not going to have 100% battery life.I can live with that.Well, I just looked at it today and it's now at 90% battery health and charging.So this phone is dying quickly.After being fully charged it dies within hours.I have it completely set up for optimized battery life.I have lost emails and messages that I was in the middle of composing, and the phone just dies.I've been in the middle of important phone calls when the phone dies, simply because I had just fully charged it a few hours before that, and thought I would be fine for hours to come.I just had a total shoulder replacement surgery a week ago, and I was on the phone with my doctors office yesterday about my first post-op appointment, and my phone died in the middle of it.I thought I had HOURS left before the phone would die.Then I had to plug it in, and wait for it to come back alive, so I could call my doctor back and hopefully not wait a half hour after losing my place in line.On top of that is also has issues with the touchscreen being glitchy, and sometimes I have to tap on things several times to get them to work.As I said, I have been an iPhone owner/user since the very first version came out 17 years ago.I've always loved all my iPhones, and I will continue to be an iPhone user for the rest of my life.This is in no way reflection on Apple iPhones whatsoever.They are an amazing and fantastic piece of technology.I think I just got a bad one for the first time in my life.Luckily, I have just checked and I have until November 6th to return this phone, and I WILL be returning it.The problem is, what do I do in the meantime?Am I expected to buy a new one and get that shipped to me, transfer all my information from this phone to the new one, and then return this one?That is extremely hard to do financially!I am actually still paying for this phone on my Amazon Prime American Express card!Or, do I return this phone and wait until the refund has been issued and then buy another phone? Then wait until that is sent to me.I would not have a phone for at least a week in the interim, and we all know these days that's a practical impossibility.I am also having several medical issues.Like I said, I just had a total shoulder replacement surgery last Monday, September 9th, and have several upcoming follow up appointments, and physical therapy appointments.I also have several other non-related medical issues that definitely require that I have a phone.I just don't know what to do.",
      "helpfulVotes": 168
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better off getting a new one",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "All of this was experienced in the span of about 24-48 hours, and due to my work, I couldn’t keep the device because of the performance issues experienced:I needed a phone quick because my last phone died. While I appreciate the quick turn around on my order and delivery, the device had issues.For starters, the refurbished one I ordered and received took a long time to set up. You couldn’t just pair it with another device to get everything transferred. If you tried this, you would see the latest update would take days to complete and the timeline never changed.I reached out to apple and they helped me get it set up, however, there were several performance issues with the device I received.Total time it took to get the phone set up: 6.5 hours.Details: Started at 4pm as soon as the device was delivered, and after seeing the update was still not completed around 9pm, I worked with Apple support to get the device finally set up around 10pm.Performance issues:The charging port was loose, so even if the device was connected to a plug in charger, it wouldn’t always charge. This also impacted connection to CarPlay when driving. The phone would be sitting in the seat beside me, plugged in, but if it moved slightly, the connection wouldn’t work and I’d have to unplug it and plug it back in. It’s not tight enough to keep a good connection.There was an issue with screen responsiveness and phantom typing. If you needed to tap or select anything closer to the edge of the screen, it wouldn’t register. At times the screen wouldn’t respond at all, or if it was face down and I picked it up, I would see it was randomly typing characters in the Home Screen search box. I would have to manually turn the screen off (side button) for it to stop.There was also an issue with the front facing camera and sensor. The camera was really fuzzy and not able to pick up anything at times. The sensor wouldn’t always correctly adjust the screen brightness over the night I had it.The physical device itself also has scratches and dents all over it. While I don’t care about cosmetic as much as the above, the phone I received was more along the lines of poor condition overall.For this seller, I think it would be a good idea to do more intensive performance testing with the phones/devices before you send them out. You should also include correct setup instructions with the devices so your customers can set them running with ease and not have to waste half a day trying to get the phone setup to work.Overall, with the issues and hassle I experienced with the device I was sent, it was more cost effective to go buy the same model in new condition for the additional $100 at a local Best Buy.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not original iPhone screen",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Phone looks and works like new. But the screen is not an original. And the replacement is not a real iPhone screen. They also wiped the info from the phone showing if it’s original parts. For the price it’s worth it but kinda shady for real."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition, minus a critical phone feature",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "The phone was in great condition for the most part, and 85% battery. However when calling several people, they could hear an echo of their voice on speaker. Never had that before in any phone I’ve owned. Chatted with support and they decided it was likely a hardware problem, so I’ll be returning it unfortunately. Maybe not a huge issue for some people that always use headphones, but it was a dealbreaker for me."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Eh I wouldn’t buy again",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "I like the phone. It has good qualities but I’ve had such issues with this phone already and it’s been 5 days. Currently waiting for the seller to reply to me.I bought an excellent condition iPhone 14, purple. Supposed to be free of scratches on the screen & no dents/cracks within 12in view… mine has 2 what looks to be bite marks & scratches on the screen. Contacted the seller they said I could choose 1 of 3 things… partial refund ($25) and keep the phone. Refund & send back. Or return & replacement. I chose the $25 & keep because it was small things & it would be a hassle to send it back & replace it.A couple days go by & I start making phone calls. Other caller says they can’t hear me. I’m muffled or cutting out. 3 or 4 people have now said they can’t hear me on this “excellent” condition phone. So now I’m having to contact them and/or fork out $70+ to fix the speaker issue. Just do yourself a favor and spend the extra and buy it new.Also a $25 refund on the $300+ phone compares to a .10 raise at your job, in my opinion.  It’s pitiful.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Old LCD instead of OLED",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "The phone overall is in good shape, everything works . Battery is at 86% max capacity. The only problem I have is the display was definitely replaced. And I have no problem with replaced displays- they got cracked every time. The problem is it was replaced with cheaper LCD version instead of standard OLED. Considering it was the most expensive option available and stated as Certified Refurbished(Like new experience) would be great if this fact was at least mentioned in the description."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm in the phone universe again 😁",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "After over an hour at cell provider we finally were able to activate this phone, First phone we ordered was blacklisted and we could not activate but seller Did refund our money.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is not in excellent condition",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I have purchased several refurbished iPhones (all for my relatives) through Amazon in excellent condition. This is the first time I’ve received an iPhone with a battery health below 90% (its battery life is 86%). However, what concerns me the most is that the phone gets hot after being used for a certain period, which has never happened with any of the other iPhones I’ve purchased before. Due to this issue, I am considering returning it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Little dings ALL over the iPhone",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Disappointing to open the package just to find multiple dings on the camera, sides of phone, and bottom near the speakers. Other than that, I’m Impressed with the phone being so clean, coming with a charger, and carefully packaged. Overall the phone was  definitely NOT in excellent “like new” condition. I’d say it was good, if any more dings it’d be “fair” at best. I’m accepting it as my homeboy was still grateful and bought this because he didn’t want me to spend too much on him. Next time I’m just buying him a phone brand new."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Who “certified” this?",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Got my iPhone14 today! It arrived earlier than expected, so I was super excited! Set it up just fine, the phones screen isn’t scratched or chipped anywhere, neither are the back glass or the lenses. The phone functions mostly as it should…. Once I started to use it I noticed there’s a rattle like there is something loose inside of the phone. Upon getting my first notification, I realize the vibration is very weird, not what an iPhone normally sounds or feels like… so I wonder if that’s what is rattling inside of it 🙃. It also almost feels like the screen is loose on part of it. Appearance wise there is nothing off, but whomever repaired and recertified this phone was either rushing through their jobs, or they didn’t care whether it was done correctly or not!! Video attached, only one video is allowed per review so I compiled 2 videos into 1 to show both issues. 2 stars since it came early, and outside of the loose vibratory box ( I made the term up 😂, I’m not phone savvy) it works as it should.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The phone had a lot of scratches, was not worth it at all."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 14",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "It's a  very good phone but only there is a mark on the screen😫🤕"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Delivered Unlocked but later on got Locked",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "The product, itself, was great; and it worked very well from when I bought it until Dec 6 when I was alerted that someone had been trying to call me and call was going straight to voicemail.  When I looked at my phone, it was in SOS mode.  Talks with customer reps from our service provider, Tello, and later Xfinity, I was informed that my refurbished, unlocked phone used to be with Verizon and Verizon locked it.  No additional details on why; however, since it was working for some time, Xfinity customer rep surmised that previous owner must have reported it lost or stolen.  These are the typical reasons for why phone would be locked.I chose to get a brand new phone from service provider for expediency, as I don't have a landline nor another mobile phone to use.  As of Dec 11, I have a new working phone.I have initiated a return of the phone; there was no reason for return in the drop-down menu that truly applies to why.  I chose \"No longer needed\", as that was the one closest to why I was returning the item.I think that Amazon should bear some responsibility for selling refurbished, unlocked phones.  It appears that \"unlocked\" status does not guarantee that it will remain unlocked, as was my case.  Previous owner may still report to service provider that phone was lost or stolen, in which case the service provider locks the phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "The battery condition is low"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lag when typing - maybe a screen issue",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "For the most part the phone is good except for the screen. I don’t know if it was replaced before they sold it, but there’s a lag or disconnect when typing - not every letter button registers being touched, making typing very slow because you have to retype and go back to every other word. It’s very frustrating. Also the bottom speaker (right side) came very clogged/dirty. I want to give 4 stars but typing is extremely important with smartphones, so this issue complicates almost every interaction I have using my phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Battery health is only at 89% on a “Fully refurbished/ Excellent condition” phone. Apparently , “Amazon only requires it to be at least 80%.” The new charger cord it came with is junk. The phone showed it with an exclamation point along with wording that it’s a slow charger and suggests to use a better one."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Se publica como excelente pero no lo es",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Le producto se publica como excelente pero no es así ya que tenía muchas raspaduras en la zona de las cámaras ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Ls bateria no sirve",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "El tel bello , pero la bateria no sirve"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Problema con la cámara",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "El funcionamiento está perfecto pero la cámara frontal está corrida. Se ve un borde negro."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is in excellent conditions",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "The phone arrive with the checklist the technician tested. The phone is in good Condition minor one or two spot on the edge was chip off but with a case can't even tell. The only thing I wasn't happy about is not correct charging cable. This model use Apple Lighting to USB, but they sent Type-C cable. Which is not compatible with this phone"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    T-Mobile made phone unusable after 2 months, SOS Mode unable to connect to network",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Product purchased November of 2024. Was perfectly fine, but all of a sudden in late January of 2025, phone was locked out by T-Mobile, couldn’t connect to the network, and would only be in SOS Mode. They said that the prior owner (identified by this phone’s IMEI and EID) of the phone still owed them money??? Locking the phone doesn’t help them get their money, it just tries to discourage secondhand purchase. Their offer was for us to purchase another phone through them. Luckily, there was a 90-day return/refund policy, but I shudder to think about what would have happened if this occurred after those 90 days. Very nervous out the next phone coming because it’s from the same third party seller.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Could be better",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "The sound gets low outta nowhere & I have to restart just to hear .. the charger that was included doesn’t work unless you leave plugged for hours. The phone itself is good condition tho."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Frustrating",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "The screen doesn’t always work so I have to to constantly reset the phone which is frustrating but serves its purpose for now. It obviously had the screen replaced and now isn’t working properly"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't get an iPhone on Amazon",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "The iPhone 14 they sent did NOT WORK WELL. it would freeze or not connect. etc.Based on my experience, I suggest getting a refurbished phone elsewhere!I bought it in October and sent it back in Novemeber It is now March. When Amazon received  the phone back, they sent me a notice that I would get the refund by Dec 21,2024. It is now March and I still have not received my credit card. I am on the phone with them right now trying to get my refund. This also means I've been accumulating interest on it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So sorry but this is getting a poor review",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "The battery life is terrible on this refurbished phone, and there is an odd tendency for it to randomly switch from the qwerty keyboard to numbers and or symbols. I do not have time to get another phone and do another set up so I will be using this and recommending buyers Look to a different company for a refurb phone. On top of it all , it only included a charging cable- no plug. The cable is the USB C cable and I don’t have a plug for that so I will have to buy a new plug also. Overall yes it is a phone and it works but the most frustrating thing is the battery life should be better than it is. For the cost - the battery shouldn’t degrade so much."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible battery life",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "I purchased the excellent condition option. The phone it self was in good condition, already had a screen protector on it. However the battery capacity is 83% and doesn’t hold charge very long. So a bit disappointed that I paid nearly $500 for a phone that doesn’t have a decent battery. Wish I would’ve went with purchasing a new one instead of refurbished from Amazon! I would return it but I’ve already switched my eSIM to this phone so don’t want to go through the trouble with switching back to my old one and waiting on a newer one to ship and then going through activation process."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall very good, but if you need tech support it becomes a pain",
      "date": "Reviewed in the United States on May 20, 2024",
      "body": "UPDATE: After speaking to a very helpful agent at Loop Mobile, the company who deals with these refurbishments, I discovered my phone was still under warranty and they would replace for free. However I needed to send my phone in first, before they would ship me a new one. I use my phone for work so this is a problem, but I can make it work for a few days. I'm told the turnaround is very fast too, so I figure I'm looking at a week maximum.Due to a tracking error on FedEx's end, it takes them longer to process my return, so it's nearly a week and a half before I get my new phone. And then when I get it, it's set up for TMobile, not AT&T so I can't even use it. And all attempts to call this week have been met with a message of \"no available agents, call back later\". They have been relatively fast to respond via email, but honestly, this has been such a mess I'm wishing I had just spent some extra money for a new phone. I know there is always a risk with refurb items, but I've rarely had issue and when I do they are resolved quickly.I purchased a refurbished iPhone 14 in August of last year and it was working great with no issues. It was a like new phone. However, in the last few days I've started getting \"Unknown Battery\" messages and my phone will turn off at random multiple times throughout the day, to the point where I don't feel confident making phone calls with the phone for fear of them being dropped.I went back to the order to see what my options were in terms of warranty and tech support, and it's EXTREMELY convoluted. It's hard for me to even tell if I qualify for the 90 day guarantee or the 1 year, because my phone was classified as \"new\" but the Amazon site only lists guarantees for conditions which are premium, excellent, or acceptable. When I tried to chat with someone I found my message was sent over to Loop Mobile, who must be the third party company who actually refurbished the phone. But it's unclear who I need to contract to see how to get this fixed or if I just need to pay out of pocket. I haven't even had the phone a year, so it's a disappointing development for what has otherwise been a great phone.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Misleading Description. Mixed Experience",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "Condition (3.5/5): Despite being listed as excellent, my renewed iPhone 14 from Amazon arrived with noticeable scuffs and spots, which was disappointing. The overall condition was not as expected based on the listing.Functionality (4.5/5): On the positive side, the phone’s functionality was not compromised, and it works perfectly fine without any issues like sound quality. The performance is smooth, and all features are functioning as expected including charging. The only negative here was the battery health received was 90%.Suggestion: While the product works well, its appearance is something that can be reflected upfront. It would be beneficial for Amazon to provide exact pictures of the item they are selling in renewed condition. This transparency would help manage customer expectations better and prevent surprises upon delivery.In conclusion, while the iPhone 14 I received functions well, the discrepancy between the listed condition and actual product appearance was a downside.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone 14",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Todo bien el problema fue que me llegó con ese porcentaje de batería, la cámara se pone borrosa aveces y como que no enfoca no sé qué pasa."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone works, but excellent condition is a huge stretch",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "Cosmetically the phone looks fine. Unfortunately, whoever supposedly “renewed” this phone didn’t do a very good job. The battery maxes out at about 85% which I would not say is excellent.  Also, the power button on the right hand side sticks beyond belief. I’m still deciding whether or not I want to return it because I already activated service on it and it’s gonna be a pain in the butt.  Let me just say I’m not thrilled with the seller. Oh, also, they left the previous user screen protector on it, which is not particularly helpful either."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't Buy!!!",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Well packaged in a box on arrival, however, unable to connect to my phone service provider. After multiple attempts t-mobile connected me to Apple care and they weren't able to fix it either and recommended taking it to their shop to get it fixed. I have the phone sitting here if no use and the return policy has run out and can't be returned. I bought it for my daughter for Christmas. By the time it was unboxed, it was no longer eligible for return."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Chips around the camera and Moro scratch in the back.",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Everything seems fine other than the chips are on the camera and micro scratches."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ! Disappointed !",
      "date": "Reviewed in the United States on November 3, 2024",
      "body": "I am not happy that this phone doesn’t work with my work app the reason I purchased this for.Got rid of my phone for this one and I’m not understanding why it doesn’t work!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I had problems, would not acquire Wi-Fi",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Return is taking quite a long time for refund to show up."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not so good",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "I got my iphone today and screen is raised which is from a replacement screen not put on right and back was scratched im gonna keep it and use because i have already switched from my other phone and return process sucks but would def not recommend its not a replacement screen the geek squad said it was a bulging battery"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I don’t recommend",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Scuffs on screen, dent on case, no sim-card slot. Battery 86%"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health came at 75%.",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "The phone overall looks nice no scratches anywhere however the battery health was 75% I noticed after first initial charge it was over heating. I will see how it does in a few more weeks."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is ok, but...",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "I purchased the phone because it was a good price and product description said excellent. Which to me means pretty much like new. Disappointed when it arrived to find scuffs around all 4 corners, but I can deal with that. It's being pretty nitpicky. What I'm really upset about is the fact that a new battery wasn't put in. Couldn't check battery health until I actually logged into the phone and I was extremely irritated to find that the battery health was only 88%. I expect more from an Amazon retailer. If I wanted a not in excellent condition phone, i could have paid less and purchased off the street.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Item not in excellent condition as stated",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Very disappointed in the item received. Body had numerous dents, camera scratches and did not look like it was even cleaned down before shipping. What was supposed to be a gift now has to be retuned and I’ll be empty handed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cosmetically perfect - Battery life Garbage",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "The phone arrived ahead of shipping estimate well packaged and just as described. Couldn’t find a flaw cosmetically on the phone anywhere. Phone turned on and worked perfectly. However the battery life on the phone is worthless. Battery health claims it is at 88% but phone battery drains at a rapid rate even on low power mode and with several battery draining features turned off to save battery life.  For the amount spent on the phone it has to have a better battery to justify this purchase"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is a pretty good phone for the price",
      "date": "Reviewed in the United States on April 17, 2024",
      "body": "Got the “excellent” condition phone. It came dirty like it was just taken out of someone’s pocket. I didn’t mind cleaning it up, but if you do just keep that in mind. Upon cleaning there was a deep scratch in the screen that some might even consider a crack. It was about a centimeter long so i can see how it was overlooked. But I was expecting a bit better for excellent quality. Other than that the phone itself works great and battery health was 95% when i checked the settings. It is decent for the price if you don’t mind the things I mentioned"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful, I did not get what was promised.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "The phone arrived with a cracked screen.  This was not disclosed in the description.  The refund was a lengthy process.  This set my communication needs back several weeks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was locked to a different provider",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I ordered it for T-Mobile service, phone was locked to AT&T as the previous owner still had an installment plan that was unpaid. I inherited someone else's problem. Pathetic."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wouldn’t say this is “excellent” condition…",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "Overall I’m satisfied with the purchase. The screen is cracked and held together by a screen protector but I needed a replacement phone immediately so this will do. The body is dinged up and a scratch on one of the camera lenses. I can overlook those, I think it’s the tiny cracks on the screen that they just put a screen protector over that irk me the most. Not what I would expect when the description was “excellent condition.” I did not mean to purchase an eSIM, because they’re a pain in the butt with Xfinity mobile, so be advised this is an eSIM but yes technically compatible. Probably won’t purchase from here again. I’ve gotten better refurbished electronics elsewhere."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trade in sucks",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "The product was good. But, the trade in plan is horrible.  Don’t expect to get anything for your used device. That team is horrible."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery bad",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "iPhone 14. Looks okay but the battery only last 3h 27 minutes when occasionally texting. 1 1/2 hrs when watching YouTube videos."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would Recommend Something Else",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "I bought this phone on the “excellent” condition, but I am very disappointed in the quality. The phone itself had dirty ports, and the lens had these weird scratches on the metal. The screen also have a few deep scratches and scuffs. Battery life is at 86% which is less than ideal. They should show the picture of the actual product so costumer's have an idea on what they’re buying.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone14",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "The phone  has a problem with the mouth piece someone can not hear me every time I make a cal",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery max at 86%",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "Although it’s a used phone, I hoped the battery would be replaced so the peak would be better.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery capacity",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Bought excellent but the battery capacity is 87% I expected better, minimal scratches on the screen",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Appearance: Phone scratched a lot for a good condition refurbished item",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "The phone was delivered 3 days earlier than speculated which I thought was grand. Although, it mentioned it was good condition, it was pretty scratched on the screen, and edges. The crevices were also pretty dirty around the camera and phone edges.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Condición",
      "date": "Reviewed in the United States on September 1, 2024",
      "body": "El teléfono estéticamente está bien, solo tiene unos pequeños rasguños en los costados. Funciona bienLo único que no me parece bien es el estado de la batería para ser un reacondicionado excelente el estado de la batería está muy mal"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MUST READ phone locked. Perfect con. But wrong color",
      "date": "Reviewed in the United States on January 7, 2024",
      "body": "I ordered purple iPhone 14. I got a white iPhone 14. It is in perfect condition so far. The battery was only at 65%, but seems to be ok this phone is LOCKED I called my provider know one knows much about the eSIM. Overall I do wish I would have looked at the overall review most of these phone seem to be locked. The phone looks brand new. You are taking a gamble. If I could activate the phone I wouldn’t care that it’s white. They took the time to clean everything. I have not seen any scratch or sent everything else works great other then I can’t call anyone I can sign into iCloud that’s it this can not be activated and it’s Saturday so can’t talk to anyone. GOOD LUCK to ALL I think I would rather stick with the old school SIM card.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    you can try you might be lucky",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "the product is not bad. it has scratchs at the back"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issues",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "I have spent hardly a month with this phone and not only did it come with a battery life much lower than promised considering the “excellent condition” advertisement, but I have found scratches on the camera lens, which is much worse than promised. Now, I’ve found it acting up and lagging as if it were an ages old phone.I trusted the positive reviews would be fairly applicable but now that I have the phone, I would not trust and would not recommend buying again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screens are not original apple screen",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "The product color is same as the picture, battery health is wonderful and the exterior of the phone was clean 👍🏾. I don’t like the fact that the phones are being refurbished and knock off screens are being used. Get original apple screens for the phones because when persons buy the phones and the screens aren’t original it cost us more than what we pay for the actual phone to repair the screen.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The speaker doesn’t work",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "Everything is ok except the speaker."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Uso",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Venían muy rayados"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone locked with in 6months",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Seller  deserves a 0 star rating. I bought refurbished iPhone 14  from this seller few months back for $550. It was working fine for couple of days. When iOS was updated as part of apple iOS updates, phone got locked by apple. After contacting apple support i found out the device had been reported stolen and seller is not an authorized apple dealer. Apple will not provide any kind of support to devices sold by unauthorized sellers.  Not sure how many of the devices sold by this seller are stolen. Apple requested for the receipt from seller proving that he bought it genuinely from previous owner. Seller didn’t even respond after multiple messages. Now the phone is totally useless.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging port doesn’t work",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "The Charging port does not work. It doesn’t charge. Everything else works but the charger."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Calidad del equipo, en perfectas condiciones",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "Excelente producto"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent but doesn’t have SIM card slot as advertised on the details page",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "This iPhone doesn’t the SIM slot and the seller advertises on the page as it does. Luckily my carrier has the eSIM technology, otherwise it would have been a waste of money!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blown speaker",
      "date": "Reviewed in the United States on December 31, 2023",
      "body": "I just activated this phone and had to get a new carrier since I didn't notice the GSM network doesn't work for Verizon. The speaker is blown at a certain volume ! I can't find if that is acceptable within the renewed standards but since I am trading in my old phone I don't want to go through the trouble of trying to set up my old Verizon phone, with a new network which I would have to wait for a new SIM card, ugh so only option is to return this phone and wait for 2 weeks to get refund and be without a phone.. but I will get another one and hope it's better then return this phone when it comes in.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I phone was locked",
      "date": "Reviewed in the United States on March 22, 2024",
      "body": "The I phone look like New. And seam to function like new.On the other hand Verizon had tould me most IPhones sold on Amazon can not be unlocked. The I-14 phone was locked and could Not be unlocked. It took around 13 days to receive the full refund.  It seams like Verizon has problems with Amazon regarding the selling of refurbished iPhones.The phone was in excellent shape. Communication with the seller was great just a bit slow.. and I did receive a full refund.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Did not charge well",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "The phone was in excellent cosmetic condition however the battery died every day by about 4pm. This was the same thing that happened to my old phone (XR) and the reason I got a new one!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Paid for Excellent condition",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "I have purchased Amazon Renewed products before and have always been very pleased with the quality and prices. I paid for excellent condition and the edge of the body (right against the screen which was obviously a gnarly drop that led to a screen replacement) has very visible gouges and a slight gap/separation in the edge between the body and screen. Excellent condition promises no visible (from 12 inches away) cosmetic issues or damage. This is very visible at 36 inches, let alone 12. The slight separation between body edge and screen makes me nervous about the phone’s water resistance and any other potentially compromised internal components from what was clearly a high drop. I kept it because it seems to work electronically and falls within the promised battery health range at 85%. I am mostly afraid to return it and gamble getting a different one that is in worse condition. I am leaving a low review because I paid for “excellent” condition and received one in arguably “acceptable” condition which isn’t cool.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with non-functioning camera",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Arrived with a non-functioning camera, otherwise as described"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "The condition was great the problem was that I wasn’t able to activate it. I’m with Verizon so I thought it wasn’t going to be difficult but it was impossible. The phone was blocked and took me so much time between trying to activate it and then returning it. Everything else looked fine"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was defective..camera did not work",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Phone was defective…camera did nor work. Phone was returned several days ago, but I still have not received my refund. When? Please respond.  Thank you James R Smith"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as described",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Item was listed in excellent condition, this is not the case. There are multiple deep scratches on screen and there is a problem with the charging port"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Locked",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "Ordered phone and activated in July 2024.  Phone went to SOS mode in December 2024, due to prior owner having outstanding debt- TMobile locked SIM card.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dissapointed",
      "date": "Reviewed in the United States on May 19, 2024",
      "body": "This product dissapoint me a bit because the edges are all scratch. I wouldnt recomend buying this phone on DNCL-TECHZONE because they send phones all scratch and they offer excelent state of the device, and honestly looks like a normal renewed phone and I choose the excelent renewed phone but is far away from excelent. thumbs down :)",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Reviews are deceiving",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "For an Excellent Refurbished product, I expected much better. Obvious scuffs on the camera. Battery Health is 84%! Horrible for the price. All of the reviews rave about a near full battery health- the most important thing to me when buying a new phone. I’d take cosmetic damage over a battery that isnt going to be worth its weight in 2 months. Will most likely be returning- have it idling now to watch how quick this dies. Packaging was also very poor and did not indicate fragile or having cushioning in any way for the phone. Very dissatisfied.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BEWARE OF UNASSURED SALES!",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "On October I bought an iPhone 14 from this seller and all seemed well until today. The phone went into SOS mode and I was blocked from sending any messages, and outgoing as well as incoming calls. I called my mobile phone carrier, T-Mobile, and found out after lots of trouble shooting and investigation from their tech support team that the phone I was SOLD HERE ISN'T FULLY PAID for. The original account holder didn't even finish their payments on the phone, so as a result, it the phone has been \"BLACKLISTED\" by the cellular provider, essentially preventing it from accessing network service due to an unpaid debt, a DEBT THAT WASN'T MINE. This provider, nor any other third party seller should be allowed to sell without verifications made.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad bad bad! Please read",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "The phone I purchased was midnight black. When trying to active I wasn’t understanding why my phone carrier kept saying it’s active when it wasn’t I been fighting with them for 4 days. I logged into my Verizon online account and noticed the phone I purchased and the phone on my account that was active was a different color, starlight 14 active, what? I ordered and received the midnight black 14. The phone I received has the wrong information on the id. So now I have to send it back and wait 2 weeks for a refund then go buy a new phone somewhere else. This was the worst experience I’ve ever had. I knew I shouldn’t have bought a phone on here but the reviews looked good. Never again. So somewhere there is a phone that’s been active with my account and my sons number for the last 4 days but it’s not this one! So now I’m in the process of shutting it off and turning on his old phone until I can get another one when my refund is issued. What a nightmare! Don’t do this!!!!!!",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Damaged",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Product is damaged"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condition",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "I didn't expect the phone in pristine condition but the screen had 2 deep scratches"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "The back camera and flashlight didn’t even work and the battery health is at 89"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not \"Excellent\" condition",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "The delivery was fast. When I received the Apple iphone 14, the packaging was high quality and professional, and the phone looked brand new, however the battery would not charge over 2%. I was very disappointed considering this was supposed to be a Christmas gift for my son. I requested a replacement, but the seller stated they did not have one available. I started the return and dropped the package off 4 days ago, and I still haven't received the Amazon credit. 3very return I have ever made with Amazon has put the credit directly on the account shortly after checking in the product at return counter. After several calls with customer service I was told I would have to wait until the seller received the product to release the funds from the sale. I will NEVER buy another refurbished phone from any seller on Amazon again after this fiasco!!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s good",
      "date": "Reviewed in the United States on August 13, 2024",
      "body": "The phone is actually pretty good but it had scratches like someone used sand paper to scratch it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on May 3, 2024",
      "body": "The product came with a little crack on the screenBut so far I don’t have any issues with itI love it just that I have to get use to holding this small phone",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Honest review",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Got the phone turned it on it was on 10% so I went and charged it and attempted to set it up. It then said the phone needed to update so I started that. The phone started running hot while sitting and trying to update. After about 2 hours I checked and the phone had not updated or anything tried to slid the screen up to get inside the phone and the phone wouldn’t slid up to allow me into the phone . The phone was cosmetically in perfect condition but the rest really ruined it!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trouble with Media",
      "date": "Reviewed in the United States on March 23, 2024",
      "body": "I was super excited to get this phone and it seemed to work great! But then I noticed a lot of issues when it came to downloading or uploading files, pictures, or videos. Including just trying to save a picture sent via text, trying to add a picture to make a collage in an app, basically anything dealing with “selecting” media. It’s incredibly inconvenient 😔",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    “Renewed?” Isn’t it just “used?”",
      "date": "Reviewed in the United States on March 26, 2024",
      "body": "The phone itself was in excellent condition with a few scratches to indicate it is a used product. However, the battery was at only 90% and dropped down to 89% after one weekend of use. My 5 year old iPhone is at 83% and the battery is at its deathbed. So, if the battery, screen, and phone case/housing hasn’t been “renewed” what has? Isn’t it just a “used” phone?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of money",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Phone was in good condition when received but after activating and transferring the Esim i got a message from my service provider saying the service was going to be blocked. after contacting support i found out the device had been reported stolen and would not longer work. Went and bought a new device from best buy to transfer the number to and found out the sim was locked to the stolen device. After a few hours dealing with customer support on a separate phone (phone calls are blocked as well as text messages) the issue was resolved. Not sure how many of the devices being sold are stolen the service rep said it is a common occurrence, but be warned it will ruin your day and in my opinion is not worth saving 200$ on a new device. Deserves a 0 star rating",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Locked out 6 months later",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Do not buy a refurbished phone from this seller. I reached out for support and no response. Was sold a refurbished IPhone 14 with T-Mobile connection. After 6 months, suddenly T-Mobile locked us out and couldn’t make calls. After investigating, they learned that the previous owner of the phone had an unpaid or open contract with T-Mobile and did not settle it prior to getting rid of the phone. T-Mobile locked it even though we as the new owners pay our bill. They couldn’t override it. We were told there was nothing we could do and should only buy from Apple. I reached out to the seller- no response.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was blacklisted",
      "date": "Reviewed in the United States on November 9, 2023",
      "body": "Phone was good, great condition and all but it seems it was blacklisted (either someone didn’t pay it off or stole it, then it ended up on third party seller hands) so it was practically useless as a phone since I couldn’t connect it with carrier even with it being unlocked. It was huge pain, I was without a phone for almost a week until I needed up ordering a SIM card for my old phone which I’m so glad I didn’t trade in.The only reason I’m giving it two stars is because the sellers customer service was great, very responsive so I’ll give them the benefit of the doubt and say they just got a lemon. When you’d go to settings>general>about your see under esim that it’d say *device not allowed* or something similar which seemed like that’s a tell tell for blacklisted devices. Final nail on the coffin was after I took it to an Apple Store and they told me it was fine but most likely blacklisted.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unusable, Never Cleared, Blocked",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "The phone was never cleared and was blocked. Prior owner didn't pay his AT&T bill so that company froze him out. The Find My ap wasn't removed. I checked all facets of getting old owner's data off but impossible. Phone unusable, trash. Company stood behind their bogus techs. No refund because I gave it as a gift and was after the return date. I'm out $537.03. I couldn't do zero stars, which this deserves.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unsatisfied customer",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Worst experience ever I got this phone for my daughter unlocked . Got the phone on transfer her number to this phone “ She had it for a good week and a half before she got a message saying that whoever owned the phone before still owe a  bill so they locked the phone . I couldn’t retrieve her number that she had since she was 12 she’s 16 now because the phone was locked SMH I’m just thankful that I was able to return the phone and get a refund feel bad that my daughter lost her number",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    82% battery",
      "date": "Reviewed in the United States on May 31, 2024",
      "body": "I ordered what it was supposed to be an \"excellent\" product, and although it seems to be impecable on the outside, it came with battery capacity at 82% only."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This person is using a scamming technique",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "This person seems to selling the same or similar phones that are not payed off by the previous owner. I payed over $400 for the phone for it to shut down after a few months. I wasn’t able to make calls or send texts. I also am not getting a refund, they keep sending to Amazon knowing they can’t do anything because by the time the phone stops working Amazon can not issue the refund. My phone was a iPhone 14 midnight color with 128 GB. All the people with the same phone have the same story",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    esim; trouble...get out your patience",
      "date": "Reviewed in the United States on January 14, 2024",
      "body": "I moved from an old phone that had a SIM card to the 14 which DOES NOT HAVE A SIM CARD--BEWARE).I had to put in three extra hours of my time to get THis phone to work.  one hour at the Verizon store (be sure to factor frustration and your time st the store into this purchase) where I was told the refurbished phone was big time deactivated by Apple which is why there was a problem.  why I asked?  \"probably because it was stolen\" So if you don't have the stomach for the e sim hassle try a 13 which still has a sim port.  afterward, the phone is working great, worth the extra three hours of my time.  OH, AND THE shipment was missing the charging cable, and the box was crumpled and broken say what?  you need fortitude to move to the esim!!!!!!!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy this.",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Don’t buy. The top portion of the screen doesn’t respond to touch properly. There is also a bunch of scratches around the screen and back of the phone. It didn’t even come in an Apple box. Return process is made difficult and I’m sort of in a bind financially, so I’m stuck with this crappy phone for the moment. I wish I would’ve just bought one new. Very disappointed and frustrated.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s pretty good",
      "date": "Reviewed in the United States on February 19, 2024",
      "body": "I rated it 3 stars because the battery health was at 90 there’s a few scratches on the the side of the phone. Packing was awful it came in a small box with bubble wrap around the phone. Other than that the phone works great it just heats up a every now and than."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good however some damage and 82% battery life",
      "date": "Reviewed in the United States on April 9, 2024",
      "body": "The product was good easy quick set up however there’s some damage on the sides regarles of paying for excellent finish, the battery life was 80% 2-3 scratches on screen however the price was good for it being the 14"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought 2 phones both had problems",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "Aug 30th 24 I purchased 2 iPhone 14’s premium renewed or so I thought, they arrived it a small box with lightning cables but no blocks, phones looked fine I go through the process to switch lines and set them up only to find out one phone doesn’t have sound when making or receiving a call, the other phones flashlight & camera zoom doesn’t work and when taking photos the picture shows up with wavy green and red colors on the screen, these phones could not have been tested before shipped.  I contact the sell and they offer a 15% discount if I keep them?? Or I can send them back and wait for replacements, problem is I need to transfer the data to something because the original phones are junk hence why I upgraded to 14’s  after explaining this to the seller they wouldn’t budge.  I ended up buying 2 different 14’s this time from 100% Amazon Renewed and they work flawlesslyI recommend using only 100% Amazon Renewed when buying a used phone.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came damaged, not excellent for refurbished.",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "This iPhone 14 was listed as refurbished in excellent condition, but it came with frame damage that was more than tiny nicks. One larger dent is right next to the front glass. I’m sure this makes it no longer water resistant. It also came with zero battery charge which makes me question battery life. The seller did not disclose any of this. Those is good condition not excellent."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Packaging was not good quality and aftermarket accessories...",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Packaging was not good quality and the charging cables were aftermarket brands.  Disappointed with this seller."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy unless you expect to lose service",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Bought this phone a few months ago and at first it worked great. Then my husband lost service because the person who PREVIOUSLY had the phone didn't pay their bill and a service lock was put on rendering useless. After 2 hours of talking to T-mobile, Apple and Amazon, they all sent me back here to the seller to get the carrier lock off and they said there was nothing they were willing to do to prevent it from happening in the future. My husband is deploying next month and his phone will be our only communication and if it goes back into SOS, we are basically SOL if his phone goes back into SOS. Very disappointing service and don't recommend unless you want to have your service lost every time there is an update and be stuck talking to customer service until they can temporarily fix the problem.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condtion",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "Happy with the phone, but not happy with the scratch’s it came with on the camera .I bought this as excellent condition, expected better for the money",
      "helpfulVotes": 4
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone 14, 128GB, Midnight - Unlocked (Renewed)",
    "asin": "B0BN72FYFG",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).",
      "Please check with your carrier to verify compatibility.",
      "When you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on screen prompts to activate service.",
      "The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable.",
      "Tested for battery health and guaranteed to have a minimum battery capacity of 80%."
    ],
    "boughtCount": "3K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$309.70",
    "url": "/gp/offer-listing/B0BN72FYFG/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0BN72FYFG",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone and Charging Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$347.99",
    "listPrice": "$410.40$410.40",
    "savingsPercentage": "-15%",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}