{
  "asin": "B0BGQKY8S9",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy.",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I have bought refurb phones for years. Some better than others. However, this is the first premium label I have been able to get. I could not be happier. Absolute perfect condition and luckily 100% battery life. Money well spent.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like a brand new iPhone",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "So I was really pretty skeptical at first of buying a refurbished iPhone off of Amazon no less, but I was in desperate need of a new phone and Amazon partners with Affirm so I could finance, so I carefully read through the reviews and ultimately ordered the dark green iPhone 13 back in April and here I am in almost September and I can’t even tell you how happy and impressed I am with this phone!! Not a SINGLE scratch, dent, crack or any indication of cosmetic damage whatsoever, came with original charger and pamphlets, started up perfectly, transferred over my sd card and my phone service to this phone without a SINGLE hitch, works like brand new, camera quality is up to par, battery health is 100%, speakers and audio are perfect! So glad I went this route and bought a refurbished iPhone through Amazon and didn’t spend hundreds more at a phone store! If you’re on the fence, I definitely recommend!!I feel I should also mention real quick that only about a WEEK after I got the phone I dropped it the freaking TOILET and at first I was HORRIFIED, I of course majorly panicked and acted very quickly so it was only in water for a few seconds and I dried it off as thoroughly as physically possible (don’t use rice!) but I of course am so relieved to say that even after that incident the phone is still in perfect operating condition!",
      "helpfulVotes": 45
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    New to I Phones",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Great phone for my first I phone.  I love the color, and there is no physical damage on this phone.  It is fun learning how to use this phone.  I recommend taking a chance on a renewed I phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was an Okay Buy, Love the Feel Buttt.....",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "This phone is amazing, does everything I need it to and the pictures are amazing. Speed is top notch and the sound is amazing.But and here's the cather. It didn't come with any screen protector and the screen had scratches. As these are minor mishaps though, thought I'd keep it and watch how it turned.Felt that if I returned it, may get smt worse. But rlly it's okay just never like the scratching. Good thing though is that it has 1 yr warranty so gonna be watching it in that time, if ntg changes will come back and edit.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100% Battery Capacity and iPhone was in perfect condition",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "I am so happy with this purchase. The sound quality on the phone is immaculate. Absolutely no dust/buildup in the speakers. The phone is in like new condition, without ANY scratches or dings. It is beautiful. I have a case on it now to protect it and keep it in the pristine condition it came in.I have had this phone for approximately 4 days now and it has given me zero issues. I was able to put in my SIM card from my carrier, transfer all of my data from my old iPhone 11, and go.Seamless experience with using apps, surfing the web and making calls.Amazon renewed seems to be the way to go, THANK you!!! I love my new phone so much.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10/10",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "If you are struggling to pick a seller, then I promise you aren’t short of your findings congrats.  Phone came with 100% no issues a clear screen , wrap around the phone and camera was clear of no issues. Scratches  were nowhere near the phone it’s almost flawless. Doesn’t even feel renewed.feels like I bought a brand new phone at a reasonable price. The taxes or shipping is killer but it’s worth it. This color is like a midnight blue it looks great.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Anyone would think I paid Apple store prices for this Refurb",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I was beyond delighted when my pretty blue iPhone (my first!) arrived in factory perfect condition.  Shopping the refurbished items such as this one bought via Amazon was a great first experience and I'll do it again for other things. The warranty is terrific and prices are reasonable. Highly recommend but also realize it might have been a fluke -- that's why Amazon's return policies are very protective toward customers when it come's to their Refurbished Items -- big Thanks!I just wish I could operate it, haa!  My daughter sent \"iPhone For Seniors\" from Amazon and there's some slogging along happening right now but I'm determined to tackle it and come out on top.  (There's still a good 10 yr old Android in my desk...not as versatile but we need to re-learn versatile sometimes. I'm working on it).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome iPhone",
      "date": "Reviewed in the United States on March 2, 2023",
      "body": "This is my second iPhone my first was an iPhone 12 Pro Max. I have to say that for me the pro max isn't worth the extra money and the size is too big to use with just one hand but this iPhone 13 with it's 6.1 inch screen is just perfect for that. The battery life is really good I can go two or maybe even three days of use before having to recharge the phone. The display is awesome but all OLED displays are awesome and I love that this phone can display Dolby Vision so I can watch Netflix in 4k on my phone if I wanted to. I can't speak to the speakers because I always use my Bose Bluetooth headphones or the Bluetooth in my car. The pictures are amazing and coming from a crappy Samsung A10E to this the pictures really amazed me with how easy it is to use the camera and how even with my shaky hands they come out very clearly almost as if I was using a tripod and the zoom function is crazy good with how much detail is available even when using the zoom. I'm glad I waited for the iPhone 14 to come out because I got to save myself $100 but even then it's still a crazy expensive purchase coming to a total price of $804 (if I remember correctly) for the 128GB version so brace yourself for that. Even though it was more money I'm glad I bought it brand new as opposed to used off Amazon like I did with my iPhone 12 Pro Max. It's just better because you don't have to worry about what condition it will be in or how much battery life it will still have left on it. Even using Amazon's Premium Renewed plan with a one year return window and a supposed guarantee of a battery life of at least 90% which the first phone didn't have so I had to return it and wait for my refund which takes literally one month to do. I'm not sure why but I've had to return two phones to Amazon and both times it took exactly 30 days before my money was refunded to me and I was able to buy another phone. Trust me just avoid it because going one month without a phone is no easy thing to do (unless you have an extra $800 lying around and can buy another one right away). All in all I'd definitely recommend this phone to my friends or anyone else for that matter. While it may not have the level of customization that an Android phone may have it has better app support and it's greatly easier to use even for the first time. Plus Apple's maps app just blows Google maps out of the water with their directions. It even tells you if there is a stop sign coming up or if there is a speed trap ahead which is something that Google or Samsung never could do. Just buy it you won't regret it even at a price of over $800.",
      "helpfulVotes": 36
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone quality",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "It’s been good. Have had it for a day but it would have been nice if the battery capacity was stated. It came at a 98 so that’s aight. The packaging was nice tho"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen protectors not sticking",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Everything is good, very minor scratches, almost unnoticeable. But one major issue is screen protectors not sticking to the screen properly. I’ve tried many different quality screen protectors, each and every one of them did not apply properly no matter what I did. Very annoying. Other than that, the phone is decent and in good shape."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Glass has nick",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Was expecting it to be nearly perfect but unfortunately has a small nick on the glass. Have not had service connected yet in order to check phone out. Will add to review later."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Item received as advertises."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "No issues so far"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely remember this is a refurbished phone",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "No major issues, battery health was around 95% when first got it, but almost a year later it has dropped to 87%. Camera has some weird bubbles in the lens but doesn't affect camera quality. Overall good deal."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    They will have to pry this from my cold hands",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "I LOVE the size of this phone.  I do NOT carry a purse, and since I only use it as a phone and an occasional mobile game I do not need a half brick in my pocket.  That’s what my tablet is for.  I can text, scroll, etc with one hand due to the smaller size and has enough battery life for my uses.  I’m devastated that Apple has discontinued the mini, and they will have to pry it from my cold, dead fingers once it now longer takes updates.  Please Apple, for the love of all that is holy, make it an option and I will gladly pay more."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"PREMIUM\" was my key word!",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I was searching for a renewed phone for my wife and came across the grading specs. The term \"premium\" gave me a goal to shoot for. When I found a phone with the memory I wanted and in an acceptable color, I ordered it for a Christmas gift and got a Dec. 20 arrival date. Well, I applaud any company who exceeds expectations and promises and my phone was delivered today .... the 16th!! It was indeed PREMIUM and lived up to the commentaries I had read. Thank you, ELECTRONIC DEALS and Amazon!On an activation note: it was seamless and went flawlessly. At the very end, it told me I could activate an \"E Sim\" and wouldn't need to swap out the card. I called T-Mobile to make sure that was true and they confirmed it. So all-in-all, I got a very good product, fantastic service, and a happy wife. What more could you ever ask for?"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "A good product. However, I do not expect the battery health decline so quickly, though it still can last two days. In the past five months, the maximum capacity of the battery declined from 98% to 92%. I am not a heavy user of the cell phone. Other aspects is good."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bastante bien",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "El color no es tan rosa como esperaba.. la pantalla esta intacta, impecablePero la parte de atras tiene como manchas que no se quitaron con nada (no es muy importante por que el celular siempre andara con estuchesEl porcentaje de bateria fue de 95% y ahora esta en 94% despues re una semana de uso, eso me preocupa, pero tampoco estoy usando cargador original, no puedo culpar del todo al productoPero entre lo que cabe esta bastante bien y funciona bien",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Todo estaba en orden",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used for a few months now. Works perfect otherwise I would complain",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "I needed an apple watch because I practice Kendo, swim--allot of cardio. So I switched main phones and got an apple to use with the watch. I had used android until this. I like it allot, its just better made. No problems at all. My favorite thing to write. I have been using it for a few months now zero issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health at 86%",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "So far it’s good and the camera quality is great ✅"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s looks like brand new",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "I like that it’s exactly what I expected. Very reasonable price. Holds a charge well and charges fast. Size is 6.1 inches and much thinner than my old SE. picture quality much much better. Only negative is it’s a little slippery probably because it’s so thin. I drop it much more than my old one.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product is renewed Excellent and NOT Premium",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Product is renewed Excellent and NOT Premium. It has scraches on the botton where we connect the lightening cable.As i bought for my daughter for her birthday, i couldnt resend and replace the same."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best way to get a refurbished phone",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I admit that I was skeptical about buying a phone off of Amazon but I was able to get a great deal and the phone arrived quickly and in perfect condition with 93% battery life. Overall amazing quality with an affordable price and would absolutely recommend to anyone interested in buying used phones."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks great",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "I bought my mom this iobone 13 as her iPhone 7 was going out & she needed to upgrade. Obviously she’s not into having the latest phones so we thought this was the best option. We got refurbished premium hoping we don’t need to return for whatever reason but making sure we are covered for at least a year. Looks great almost new. Has a very tiny scratch on the lower side of the front screen but nothing you can see right away. Came with 100% battery as you can see. Came with a charger that works just fine. Very well taken care of packaged well and all. Sound is good too and everything works fine so far. I will definitely buy again as the prices seem wayyyy more reasonable. I will update if anything changes.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just what I expected!",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "It works! ... durability to be determined."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phonr",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "It’s a iPhone. It’s works. It’s not blue but red . We are purely utilitarian with phones so we don’t care."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    a good deal, amazon renewed premium iphone 13",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "looked good out of the box, battery life is good, easy transfer of backup.  the e sim transfer did not go well, so i took the sim card out and put it into the 13. so far, all good. pleasantly surprised so far. stay tuned.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone!",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "I am so pleased with this Iphone 13!It charged up to 100% and takes wonderful pictures, vastly improved from my old phone.It arrived in perfect condition and functionality!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Came in great condition!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Like New and Perfect Gift",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "The Apple iPhone 13, 128GB, Pink is amazing! It arrived like new and works perfectly. It’s the perfect gift without breaking the bank or adding monthly payments to your bill. I'm so happy with this purchase—highly recommend!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    EASY AND FAST PURCHASE",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Me gusto mucho este iPhone, le puse 5 estrellas por la calidad del producto sin ningun rasguño, todo funciona a la perfeccion, lo unico es que esperaba un poco mas del porcentaje de la bateria, vi varias reseñas que algunos tenian 100%, en mi caso un 90%, pero bueno asi funciona esto de los productos Renewed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "I’ve been using this phone for almost 3 months now, I have had absolutely zero issues with it so far. The phone came in perfect condition with no scratches, cracks, etc. The sound and camera quality of it is also absolutely perfect and the maximum battery capacity also came in at 100% and is still at that. The last phone I had received from Amazon had battery issues, it constantly restarted, came in with access glue around the screen, and ran slow, so I was pretty nervous ordering another phone off of here. But I am really glad I gave it another chance! I would definitely recommend!",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium unlocked! Great purchase",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Very pleased! Phone arrived almost a week earlier(6days) & in great condition. No scratches, no dents. So far so good. Highly recommend.I bought this for my daughter, considering purchasing another for myself. Saved some money & very happy with the product.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works good but healthy it’s 91% and came very bad in box",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "The phone works really good like new,but it came in the box without any care,and zero battery,,the sounds it’s good,good quality,the condition of the phone it’s good until now,it’s changing ok,until now I buyer 3days ago didn’t got really problems yet"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Tech Dad for the win!",
      "date": "Reviewed in the United States on March 19, 2024",
      "body": "Let me share a win in the world of teenage tech upgrades! 📱 The iPhone 13, 128GB, Midnight - Unlocked (Renewed Premium) came to the rescue when my daughter's old phone was on its last legs.With her frustrations mounting over a sluggish device, it was time to step in with a solution. And let me tell you, the value for the product is a total win-win! Opting for the renewed premium quality not only saved us a bundle but also delivered a device that looks and feels brand new.From the sleek Midnight finish to the lightning-fast performance, it's like watching her unwrap a brand-new world of possibilities. With 128GB of storage, she's got all the space she needs for her endless stream of photos, videos, and apps.The unlocked feature adds another layer of freedom, letting her pop in her SIM card and  carrier just worked. And as a dad, the renewed premium quality provides peace of mind knowing she's got a reliable device by her side.Seeing her face light up with excitement as she explores all the features of her new iPhone 13 brings me pure dad joy. It's not just a phone; it's a tool for connection, creativity, and endless teenage adventures. Highly recommend it for any fellow dads looking to score major cool points with their tech-savvy teens!",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Truth to quality and condition. Properly market.",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "So far it’s good ,vey good condition easy to setupI hope I have no issues in the future.Thank you."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone doesn’t come with proof of purchase.",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I’m sure the phone was great but there’s apparently no way to get the serial number off the phone when they refurbish it. If the set up goes well that’s no problem. I had trouble with the setup. I mistakenly connected to an old iTunes account to set it up but it wasn’t my Apple account. I didn’t have the Apple ID for that account so I couldn’t delete it. Apple won’t unlock it remotely unless you have a receipt WITH THE PHONE’S SERIAL NUMBER WRITTEN ON IT. You won’t get one of those when you buy these refurbished phones. Amazon can’t even produce one for you.  Fortunately Chris (Christian) in customer support was able to help me with the Return fortunately.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Brand New!",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "So I have received this product a couple weeks ago and I waited a little while so I can connect it to a carrier after that I had connected it to my Apple ID and everything went smooth. I love the phone no scratches no dents no dirtiness on the phone basically a brand new Apple iPhone from the Apple Store, I would higly recommend this specially premium because it gives you more special package. It comes with the Sim card removal as well as a tested certified ticket and an other card for warranty if you purchased warranty . , I would hug you recommend this specially premium because it gives you more special package. It comes with the Sim card removal as well as a tested certified ticket and an other card for warranty if you purchased warranty the camera works I love the cinematic mode. Really nice nice color really nice for the price. Highly recommended in 2024. The microphone works on the keyboard. Keyboard is nice. Camera works microphone works for sound. FaceTime works. Text messages works. Cellular data works charging port works MagSafe works ETC (As Well As Face ID), mine was at 100% for my charging my battery life so I got out on this phone. I love it and I had to recommend it.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent product that is almost brand new",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "i bought this iphone 13 to replace my sons iphone x that doesn't work anymore.  we bought renewed premium based on all the reviews posted.  the iphone arrived and i inspected the physical phone.  no blemishes, scratches, dents, or marks.  the battery was almost 100% on a full charge.  everything works and it looks practically brand new.  the charging cord was a basic lightning cord, but my son uses his wireless charger to charge his phone.  i bought a case to protect it from drops and scratches.  i'm impressed on the excellent quality of a renewed premium iphone that i received.  definitely buying renewed premium again.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good phone",
      "date": "Reviewed in the United States on August 3, 2024",
      "body": "I am new to iPhones.  I am still learning but I am enjoying the unit.  Amazing all it can do!I do wish I had purchased the mini phone.  This one is just a little too large for me.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works perfectly!",
      "date": "Reviewed in the United States on August 28, 2024",
      "body": "Purchased a refurbished phone. My first time doing so an amazons refurbished program was awesome. The phone was flawless and worked as expected. Thanks"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good product",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "Got the green iPhone 13 with 128GB and just got it activated and came with 100% battery capacity and it works like a brand new phone and didn’t come with any scratches or anything.  Also it got delivered on time and came with the charger but not the box which is fine bcz I have plenty. But definitely recommend 👍🏽",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    battery came with 98 or 97 that i remember",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "hey, i received this phone march 20th and right now it’s july 26. when i first received this phone the battery health was 97 i believe, the phone did not have no scratches, it was like brand new. right now my battery health is at 92 but I think it has to do with the way I charge my phone. There really wasn’t anything wrong with this phone and you’re saving money, can’t go wrong with that! I had a sim card with metro on my old phone so all I had to do was call them telling them that I was switching the phone and put the sim card in the new phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone just like brand new",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "Decided to upgrade my grandmother’s phone. She had an iPhone 8 for years so I just went ahead and helped her pick out a color and model. She wanted a pink 13, so I searched online. I came across this listing and was quite shocked by all the other great reviews about quality, appearance, size, cameras, touch screen, color, and the phone overall. I can confidently say that the reviews are true. My grandmother opened it up and didn’t believe how clean and pretty the phone was. I am happy to report that buying off Amazon renewed is just as good as purchasing directly from apple, but you save much more money and give phone’s another purpose and owner without the waste!Have a good day or night if you have read this far. :)",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is a good phone but could have been better",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Battery health is at 91 and it came with a big dent on the side definitely not a premium renewed",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "I was worried when I bought this \"renewed\" phone but it has been working just fine.  Glad I took the chance on it versus a new one for so much more.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy set up with Tracfone",
      "date": "Reviewed in the United States on July 8, 2024",
      "body": "I love this phone! I had an iPhone SE, 64 gb, but was running out the of space. I found this deal for a 256 gb iPhone 13 and thought I would upgrade. It definitely is an upgrade! The transfer of everything from my se went automatically and took only about 1/2 hour. I bought the tracfone’ bring your own phone’ SIM kit, about a dollar on Amazon. Put in the SIM and went to the tracfone website and the phone was working for calls and texts in minutes. I would definitely recommend this phone! The one is awesome and charging is fast. It is in great condition too! A great find!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is obviously not new",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "I’m really disappointed I payed extra for a premium refurbished phone and it came scratched the paint all around the cameras is peeling…. There’s are multiple dents on the phone . The battery like is at 96 and is draining in seconds",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing USB Cable. Wrong color.",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The phone arrived in an Amazon Renewed box, and while the packaging could have been cleaner, the device itself was well-protected in bubble wrap. Unfortunately, the USB cable was missing.I originally ordered the Pink color but received the Starlight variant instead. On the bright side, the phone was in excellent condition, with 90% battery, no visible scratches, and no dents. I tried to contact customer support and they all seemed to be new associates, as all of them kept making mistakes over and over, so I ignored it and kept the product."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still have",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "Works like new I get all my phones from here"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone was ok but speakers sucked.",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    To be honest im happy with how the phone came a bit. It came in looking almost brand new, I was kinda expecting more tho since i payed more for Renewed (Premium). the phone battery capacity was at 89% and was scratched around the camera lenses which is fine it is renewed. The only thing that upsets me is the speaker quality. I personally love music and like to play it out loud sometimes but it sounds so weird as if it was muffled or has been dropped in water…If you really want a phone with good quality on everything I suggest buying a brand new Iphone, if quality isnt so much of a problem for you and you just want a little upgrade this is good for you but i don’t recommend buying “refurbished (premium)” just buy a refurbished in excellent condition. its a bit cheaper and many people get better phones from it.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Back packaging but the product works fine",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "Over the last few days, it has tested great. The phone is itself is legit neat and working fine but the packaging the phone came with is so poor. I bought it as a gift for my wife's birthday and it came in some generic plan box. She literally asked me where I got this from? You have nice devices but I wish it came in a good package",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very satisfied",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "I gave it 5 months or so to write a review. I purchased a premium renewed iPhone 13 from Amazon. I made sure the seller was Amazon. The phone I received still had warranty on it, along with 100% battery life remaining. Virtually brand new, and there was no physical indication it had been used. So far very satisfied with buying this over a new one at a great savings. The 365 day return policy is the icing on the cake should any issues arise in that time, which I don't expect to happen.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy with the device. Better than expected.",
      "date": "Reviewed in the United States on July 19, 2024",
      "body": "I know that refurbished companies can be hit or miss with their products since they are just reselling used devices. However, the phone I received was flawless with a certified apple new battery. No issues and no discernible damage. Am glad I paid extra for renewed premium. The only feedback is that the device came in already turned on, the charging cable supplied with the phone is of very low quality, and the box was a bit beaten up. Also, the device was not registered with Apple so I don’t know what is up with that.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm a repeat customer!",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "This is the 2nd phone I purchased from this seller because I'm very happy with the quality of the work they do. The phones look just like brand new phones and the batteries also are in excellent condition and keep a charge for a long time as well. The phones work perfectly. We are very happy with this seller."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone looks new with 100% battery health",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "I was skeptical of some of these reviews.  But this phone is perfect. Not one scratch, dent, ding, or anything.  And the battery is at 100% health.  It’s like new.  I bought a phone “pristine” phone from another vendor a year ago and there was no comparison to how great this phone is.  The other vendor’s phone came with several dings and the battery heath was 81%.  I like that Amazon stands behind these purchases too.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I really love the renewed premium",
      "date": "Reviewed in the United States on April 27, 2024",
      "body": "So this is the second renewed Amazon phone that I purchased and I will say that I am pleasantly satisfied. everything works as far as microphone & camera. It’s fast when opening apps and text messages. The battery health is at 97%. Everything is pretty much perfect except one little itty-bitty flaw that I wish I never even noticed, and I probably would not have except for last night when I was putting on the screen protector and I was doing, an excellent job at taking the dust off with the little sticky tab and I noticed a tiny little scratch on the side of the screen, its not even noticeable until it is.  but that’s OK  . Thank you Amazon",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My first refurbished iPhone",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "I bought this IPhone 13 only after I looked around and asked questions and read lots of reviews.  I've had it for three days now and, so far, it's been fine. It was easy to set up (thank you, Apple!) and has the better camera and increased capacity that I wanted. I wondered if I would live to regret the decision to get a refurbished phone, but then it didn't make sense to spend twice as much for an iPhone 15 when this one seemed to work for so many others.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium Renewed Phone is “Premium”!!",
      "date": "Reviewed in the United States on March 14, 2024",
      "body": "Ordered this phone to replace 5 year old iPhone.  I went with Amazon’s Premium Renewed option to save money on the purchase.  Took the chance because of great reviews on this “used” option and because I knew Amazon’s return policy works very well.  The phone is spotless - the case and the screen do not have a mark on them.  The battery shows 97% capacity, which is fine in my opinion.  And checking the warranty info shows the phone is less than a year old. The box contained a new power cord and plug, and the device to swap out the SIM card, so I did the swap from my old phone myself.  I can highly recommend using the Amazon Premium Renewed program to buy an iPhone at a very good price!",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "I traded up from an iPhone 7 to this iPhone 13. Still learning how to navigate this one.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works like new",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "I have had no issues with this phone. Works like new. Looks new. Great sound quality, screen is in perfect condition. Great battery life. I have no complaints.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on August 27, 2024",
      "body": "Have my phone about 3 weeks now & am still getting used to iPhone. Had android for years. It came packed in a secured box & is in pristine condition. I would never guess that it was refurbished. It is a premium renewed phone. Am very happy with everything about it. Except for the feature that the ringer lowers if your phone is close by you after the first ring.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful you get the top and bottom not mixed up",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Good protection for phone"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so great > updated: frustrating and disappointed Amazon service",
      "date": "Reviewed in the United States on March 4, 2024",
      "body": "update: from 5 stars to 2phone stopped showing more and more problems. Amazon send me to manufacturer: first wrong one. Then Apple. Since then I keep going between Apple and Amazon. Now after months of Apple not being able to resolve the issue they determined that it is a Amazon hardware problem. They determined that if the initial moist internal components were effected on the long run. They said Apple never repairs phones but exchanges them completely. Amazon doesn't. I couldn't even exchange it, although still under warranty. Had to buy new one and send this one back. However you dont get the full refund because of the time I had it, although under full warranty (that's why I optioned for Premium Renewed and paid the more expensive price). The time I had it was so long because they made be go back and forth and didn't take any responsibility. Apple (and now myself) is recommending not to mess with refurbished products via Amazon and that I should pass on this message to Amazon - that they send out faulty products! I feel cheated with the premium warranty and won't do the same mistake again.original review upon arriving:I love the phone. Everything seems to be working fine so far but haven’t tested everything yet.The charging  connector often says: liquid detected, try later. Although everything is dry, inside the house, never was in contact with anything wet. So I’m not sure what this is about. Otherwise love the phone, it’s basically brand new with 100% battery charge.There was a little tiny lint between the frame that I couldn’t get out. So perfect besides  those two things - still gave it 5 stars. Otherwise great deal and happy. I’ll update.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like brand new!",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "This showed up looking like brand new with 100% battery capacity."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Como nuevo !!",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "En excelente estado 100 % de bateríaSin ningún rasguño todavía lo uso y escribo esta reseña desde el",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfection",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "The pink iPhone 13 I ordered arrived in excellent condition & next day arrival. If you’re going to order a phone on Amazon 1000% do it through this storefront!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Responsabilidad y puntualidad",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "Desde qué me comunique con el vendedor Big Box LLC - Fast & Free Shipping, me dijo que el equipo cumpliría con todos los estándares de calidad que solicite excelente, me llego a mi hogar muy rápido y al ver el equipo se encontraba con una calidad premium sin ningún daño estético ni arañado en la pantalla y lo mejor la batería al 99% los recomiendo al 100% son responsables y puntuales una muy buena compra de verdad quede muy contento con la compra del equipo. Very good!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy with my decision to buy renewed",
      "date": "Reviewed in the United States on December 1, 2023",
      "body": "I begrudgingly replaced my old iphone 8+. It works fine, has no battery or memory issues, and is in pristine condition. But I am so deep into the Apple universe that not getting complete system updates was starting to screw with other stuff, so I started shopping for something newer.I had zero interest in getting the latest phone and even less in paying >$1k for it. This was not the cheapest Amazon Renewed option, but since Premium Renewed has a better warranty, I paid a bit extra.The phone is great -- more compact than the 8+ and far more robust. I would prefer not to have to replace something that still works fine, but that phone gave me many years of service. I guess I can use it as a pet cam.I will definitely look to Amazon Renewed before making major purchases like this from now on.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium condition iPhone.",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "I paid extra for premium condition and that is what I received.  I did not notice any scratches and the battery still has 100% capacity."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon Renewed gave me hope again",
      "date": "Reviewed in the United States on October 26, 2023",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I’ve had absolutely nothing but horrible experiences when buying renewed phones. I was fed up but gave Amazon a chance as a last ditch effort and they didn’t disappoint. For context, I have two devices, an iPhone 14 which is my personal phone, and I was buying a phone for my job, to be contacted at, and to contact others with from the business and so on. I decided to get Amazon’s Renewed Premium iPhone 13 (Product Red) and it is literally a new phone. Battery is at 100%, no scratches or dings, phone was completely clean, and all functionality is flawless. I couldn’t ask for a better phone. It’s just about brand new minus being in the original box and that I’m the second owner, but for such a good price, these “downsides” are not even a thought. I would definitely recommend getting any refurbished device from Amazon now that they have shown me they can actually do it right.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Basically brand new",
      "date": "Reviewed in the United States on September 15, 2024",
      "body": "Phone came with 100% battery health, although it was only charged to 20%.  Looks brand new.  I did receive a Japan spec phone here in the US, but it works nonetheless.  I think it’s missing a few 5g bands compared to the US model but I’m not sure I’d notice the difference."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good on battery",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "Good on battery, my dad like it"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Condition, But Missing Charger and Cable",
      "date": "Reviewed in the United States on May 27, 2024",
      "body": "The iPhone I bought was described as being in “excellent” condition, and it really was.However, it didn’t come with a charger or cable, which is why I’m giving it four stars.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No macro",
      "date": "Reviewed in the United States on September 27, 2024",
      "body": "Had I known this phone had no macro I would have probably gone back to an android phone.My wife talked about how great her iPhone is but I’m not  in agreement with her.I was going to send it back and buy a 14 pro until I saw that I would only get back 80%."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks and works just like new",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "It is a gamble with a refurbished product, and in this case, everything turned out well. My battery shows as 100% and no cosmetic damage anywhere.  I was surprised to learn that Amazon was a vendor in this space.  They also have a return policy if you don’t like what you received. I recommend considering Amazon for a refurbished mobile phone!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excellent",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Solo lo del cable para Cargar lo más esta buenisimo",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is perfect",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "So far the phone exceeds my expectations. It works perfect"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Perfecto",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "El teléfono en perfecto estado tal cual la descripciónPero el cargador de muy mala calidad en la PRI era conexión empezó a oler a quemado antes no daño el equipo"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived a day early!",
      "date": "Reviewed in the United States on February 20, 2024",
      "body": "Phone in great condition except there was dust around the buttons on side. There was no instrument to remove Sim card in box..just an empty envelope.Phone was easy to set up on AT&T network.Phone was in great condition!Easy to set up on AT&T network.There was no instrument to remove Sim card.  Just an empty envelope!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new",
      "date": "Reviewed in the United States on May 10, 2024",
      "body": "Has only the tiniest of a scratch near the front camera but after putting the screen protector on it completely disappeared. Then with the case forget it, it’s a brand new phone! Battery strength was at 95% so totally worth it for the price.Edit: just bought another for my girlfriend. Came in perfect. No scratches, battery 100%, sim card worked well. No problems. Came out about $50 more than when i got mine. Prices fluctuate but still worth every penny. As for mine still works like a charm and i enjoy using it constantly.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good",
      "date": "Reviewed in the United States on March 25, 2024",
      "body": "The phone came in perfect conditions, 100% battery condition, not a single scratch on the back glass neither the screen.Only reason to not giving 5 stars is the charging cable wasn't the advertised instead I got an USB A to lighting but the rest was all good.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No regrets on this purchase!",
      "date": "Reviewed in the United States on May 1, 2024",
      "body": "I have only had this a few days, but I have to say that after waffling about ordering a \"Renewed\" item I am very very happy with my new phone.  I did pay a little more for the Premium Renewed, but the phone is in perfect shape-not a mark or scuff on it.  The battery is 100% and other than learning an iPhone I have had absolutely no issues with the condition or response on the phone.  I definitely would highly recommend the seller and the condition of the phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unisex red",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "I purchased this for my husband, his preferred color is red. He has always wanted a red mobile device and he loves Apple. The greatest feature in my opinion is the color. I was worried that the red would be too feminine but it is simply red. I also paired it with a clear case so he can see his phone and the color!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched up, used battery",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Item arrived scratched on two corners, around the camera lenses and the charging port. Battery health at 94%. Is this what you get for renewed/premium? Otherwise the phone is functioning properly."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    There is a scratch on the screen",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "The phone is good, but there is a scratch on the screen, I don't think it should be called \"Renewed Premium\"",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "I got 91% battery capacity. Mine has a very minor scratch on the screen that is only noticeable in certain lighting and close up. I would say it's in great condition for a used phone. I have had this phone for about 8 months now and have had zero issues.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase",
      "date": "Reviewed in the United States on February 28, 2024",
      "body": "This is my second renewed iPhone. I bought a 12 from another seller and it was in perfect condition except for one thing. The battery health was at 85%. That made it a terrible buy for me. I saw this and decided to take the plug. What surprised me about the renewed premium was the battery health. I received this phone with 100% battery health. Everything else seems to be in good order. I’ve only had the phone for a few hours so far but I’d definitely recommend that anyone who is buying renewed, go for renewed premium and make sure the seller and the shipping comes directly from Amazon. You won’t regret it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    looks like brand new",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "working good so far"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome",
      "date": "Reviewed in the United States on March 15, 2024",
      "body": "Order one the day before but a problem occurred when shipping ,currently waiting on my refund to be processed. Reordered and received it later in the evening. Everything with the phone is what you’d expect. Battery percent is at 95%. Overall satisfied with my purchase.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gps issues",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "The phone physically looks great but this phones gps services are horrible. No matter what I try to the gps can’t seem to figure out where I am.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Perfect works like brand new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived in pristine condition and packaging is pretty neat",
      "date": "Reviewed in the United States on January 12, 2024",
      "body": "This was exactly what I expected from Renewed Premium as I had seen the good reviews before deciding to get a semi-new phone.Came with a generic 5V/2.4A charger and cable. I appreciated the wire, as OEM ones tend to break and connectors get burnt.Didn't care much for the power adapter as I have like 3 more Apple 5V/1A charging bricks for overnight charging, however having a higher Amps one is useful as this phone has a pretty hefty battery vs the older iPhones (almost twice the mAh capacity).I recommend getting a separate USB-C charging cable if you want fast charging capability. Hopefully from a reputable brand as it's gotta handle higher currnet."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent, like new",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "Excellent refurbishing, quality as advertised. I would buy other Amazon refurbished iPhones for sure."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Prácticamente como nuevo",
      "date": "Reviewed in the United States on January 28, 2024",
      "body": "El producto esta prácticamente nuevo, sin rayones y funciona completamente, tanto cámaras, pantalla, FaceID, vibración y todas las funciones del teléfono se desenvuelven de maravilla, la única observación es que la batería me llego en un 100% y se ha ido degradando relativamente rápido, ya que en 2 semanas de uso a bajado a 96%, pero el funcionamiento del teléfono no se ha visto afectado, ya que la pila dura prácticamente lo mismo desde el día 1. También cabe resaltar que mi dispositivo vino con todas sus piezas originales, ya que todas cuentan con su numero de serie y código de identificación, así que no pudiera estar mas satisfecho",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "El teléfono se ve como nuevo, buena compra recomiendo los productos de Amazon renewed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "Muy bien"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very impressed.  Like new with 100% battery health.",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "Phone is like new, 100% battery health, not a mark anywhere on it.  Can't beat that.  Very happy!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective, shuts down often, then doesn't work for 20+ minutes :(",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "As the title says, I got a defective unit and it shuts down all the time, at least once a week. Mostly when I'm using the camera or sending a picture. Then it keeps shutting down about 6-7 times in a row before finally calming down. Usually takes about 20-30 minutes before I can use it again and it gets super hot, so I put it in the fridge or freezer to help speed things up. I'd like to exchange it for another one, but the only option that comes up is to return it for a refund, which would leave me without a phone. The refund option makes no sense either because I'm losing about $100 between the price I paid and the refund amount. No clue what's going on but I'm very frustrated because now on top of everything I'm going to waste my time calling Amazon customer service to hopefully get this resolved for an exchange. Not impressed.",
      "helpfulVotes": 2
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product is renewed Excellent and NOT Premium",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Product is renewed Excellent and NOT Premium. It has scraches on the botton where we connect the lightening cable.As i bought for my daughter for her birthday, i couldnt resend and replace the same."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone doesn’t come with proof of purchase.",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I’m sure the phone was great but there’s apparently no way to get the serial number off the phone when they refurbish it. If the set up goes well that’s no problem. I had trouble with the setup. I mistakenly connected to an old iTunes account to set it up but it wasn’t my Apple account. I didn’t have the Apple ID for that account so I couldn’t delete it. Apple won’t unlock it remotely unless you have a receipt WITH THE PHONE’S SERIAL NUMBER WRITTEN ON IT. You won’t get one of those when you buy these refurbished phones. Amazon can’t even produce one for you.  Fortunately Chris (Christian) in customer support was able to help me with the Return fortunately.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is a good phone but could have been better",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Battery health is at 91 and it came with a big dent on the side definitely not a premium renewed",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is obviously not new",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "I’m really disappointed I payed extra for a premium refurbished phone and it came scratched the paint all around the cameras is peeling…. There’s are multiple dents on the phone . The battery like is at 96 and is draining in seconds",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing USB Cable. Wrong color.",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The phone arrived in an Amazon Renewed box, and while the packaging could have been cleaner, the device itself was well-protected in bubble wrap. Unfortunately, the USB cable was missing.I originally ordered the Pink color but received the Starlight variant instead. On the bright side, the phone was in excellent condition, with 90% battery, no visible scratches, and no dents. I tried to contact customer support and they all seemed to be new associates, as all of them kept making mistakes over and over, so I ignored it and kept the product."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone was ok but speakers sucked.",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    To be honest im happy with how the phone came a bit. It came in looking almost brand new, I was kinda expecting more tho since i payed more for Renewed (Premium). the phone battery capacity was at 89% and was scratched around the camera lenses which is fine it is renewed. The only thing that upsets me is the speaker quality. I personally love music and like to play it out loud sometimes but it sounds so weird as if it was muffled or has been dropped in water…If you really want a phone with good quality on everything I suggest buying a brand new Iphone, if quality isnt so much of a problem for you and you just want a little upgrade this is good for you but i don’t recommend buying “refurbished (premium)” just buy a refurbished in excellent condition. its a bit cheaper and many people get better phones from it.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so great > updated: frustrating and disappointed Amazon service",
      "date": "Reviewed in the United States on March 4, 2024",
      "body": "update: from 5 stars to 2phone stopped showing more and more problems. Amazon send me to manufacturer: first wrong one. Then Apple. Since then I keep going between Apple and Amazon. Now after months of Apple not being able to resolve the issue they determined that it is a Amazon hardware problem. They determined that if the initial moist internal components were effected on the long run. They said Apple never repairs phones but exchanges them completely. Amazon doesn't. I couldn't even exchange it, although still under warranty. Had to buy new one and send this one back. However you dont get the full refund because of the time I had it, although under full warranty (that's why I optioned for Premium Renewed and paid the more expensive price). The time I had it was so long because they made be go back and forth and didn't take any responsibility. Apple (and now myself) is recommending not to mess with refurbished products via Amazon and that I should pass on this message to Amazon - that they send out faulty products! I feel cheated with the premium warranty and won't do the same mistake again.original review upon arriving:I love the phone. Everything seems to be working fine so far but haven’t tested everything yet.The charging  connector often says: liquid detected, try later. Although everything is dry, inside the house, never was in contact with anything wet. So I’m not sure what this is about. Otherwise love the phone, it’s basically brand new with 100% battery charge.There was a little tiny lint between the frame that I couldn’t get out. So perfect besides  those two things - still gave it 5 stars. Otherwise great deal and happy. I’ll update.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No macro",
      "date": "Reviewed in the United States on September 27, 2024",
      "body": "Had I known this phone had no macro I would have probably gone back to an android phone.My wife talked about how great her iPhone is but I’m not  in agreement with her.I was going to send it back and buy a 14 pro until I saw that I would only get back 80%."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratched up, used battery",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Item arrived scratched on two corners, around the camera lenses and the charging port. Battery health at 94%. Is this what you get for renewed/premium? Otherwise the phone is functioning properly."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gps issues",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "The phone physically looks great but this phones gps services are horrible. No matter what I try to the gps can’t seem to figure out where I am.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective, shuts down often, then doesn't work for 20+ minutes :(",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "As the title says, I got a defective unit and it shuts down all the time, at least once a week. Mostly when I'm using the camera or sending a picture. Then it keeps shutting down about 6-7 times in a row before finally calming down. Usually takes about 20-30 minutes before I can use it again and it gets super hot, so I put it in the fridge or freezer to help speed things up. I'd like to exchange it for another one, but the only option that comes up is to return it for a refund, which would leave me without a phone. The refund option makes no sense either because I'm losing about $100 between the price I paid and the refund amount. No clue what's going on but I'm very frustrated because now on top of everything I'm going to waste my time calling Amazon customer service to hopefully get this resolved for an exchange. Not impressed.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Full of scratches",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "\"Premium\" must mean something different than I think it does. Multiple scratches on the face. My beat up iPhone8 is in better shape. Going back.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Go to Best Buy or something",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "The phone would die at 4% and froze frequently. It also started pressing random buttons I wouldn’t really be touching. The charger or the phone itself was also messed up because my phone would stay on 12% for the whole night if I plugged it in at 12%. Not a good phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Read the description carefully",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "We purchased a iPhone 13 premium renewed phone. According to the information, a technician should’ve tested it before shipping. When it arrived, cosmetically it was perfect. Charged it, phone booted up, but there was a passcode needed. Phones that are factory reset and looked over by a technician shouldn’t have a passcode. I chatted with Amazon and they started a return right away. Once they received the phone, Amazon waits 30 days from receipt to refund your for money because it was a large purchase. We had to chat again after the 30 days as the refund did not process and the customer service person had to “manually” process the refund. The refund was received in full on day 31. It was a hassle, but I think this is not the norm and we just were unlucky. I think Amazon could’ve done a better job of processing the return since it was their fault and not our fault, which is why I’m giving the 1 rating.We ordered a second iPhone premium renewed and it came in perfect. Set up was easy and quick. Transferred data from my old phone and it was up and working in less than 10 minutes. It’s a shame we didn’t have this experience with the first phone we ordered. We have purchased 2 other iPhones from Amazon for other family members and have been pleased.The phone itself works as expected. Flawless cosmetically. 95% battery life.Would I purchase again. Yes. Do I love how the transaction was handled. No.",
      "helpfulVotes": 60
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not sure how this clarify as \"Excellent\" condition more like good quality.",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "Phone has noticeable chips/scratches on each of the edge of the camera lenses as well as one on the back with some very light warping to the glass. I did end up buying this phone accidentally. Honestly I was kinda happy that I got it because I've been looking but was very disappointed when I saw the chips. Phone battery life % was only a 93% so not awful but the chips was a big let down definitely not Excellent quality and I'm sure Networkstore knew this.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WORST CUSTOMER SERVICE",
      "date": "Reviewed in the United States on April 1, 2023",
      "body": "I AM BEYOND DISSATISFIED AND DISAPPOINTED.I bought an iPhone as my husband’s birthday gift. He opened it and put his SIM card in and started transferring his information. As soon as everything was transferred, he got a text message (see picture) stating that the phone was attached to an account with an unpaid balance. We immediately contacted Amazon and the representative stated that the best option was to contact AT&T who could reset the phone. We called AT&T and we’re told that the phone is a BLACKLISTED aka STOLEN phone!! We immediately called Amazon back and explained the situation and was told by that representative that he was “sorry to hear that, but maybe I should’ve bought something more special” for my husband’s gift. I was told there is nothing he could do but send me the return label. I tried to ask what does Amazon do to “renew” their phones and ensure this does not happen again and he said that he is just customer service and that’s not something he handles. I then called the support number on the “Certified Renewed” card included in the phone’s packaging. I was first sent to Kindle support and he transferred me to the correct department. The next representative told me that the only thing she could do was send me a return label. I posed the question again how Amazon certifies their devices to ensure we do not get another black listed phone again. She stated “we don’t have an answer for that question” and “maybe I just got unlucky because this usually does not happen”. In conclusion, this was the worst customer service I have experienced in years and I am truly disappointed and disgusted with how this situation was handled.",
      "helpfulVotes": 127
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    80% battery capacity for Renewed PREMIUM!!??",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "You should know that I bought this phone as a Renewed Premium.  The main reason I needed a new phone or newer model iPhone was due to battery issues with my iPhone 11.  The renewed premium phones are supposed to have > 90% battery capacity.  Which means the phone should have been barely used.  This iPhone 13 came at 80% battery capacity which means they misrepresented the item that I purchased.  Everyone knows that an iPhone battery goes lower than 80% and it’s done. So basically either Amazon or the third-party seller sold me a phone that was already to begin with.  Buyers be aware."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium should not have scratched screen",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Screen is scratched despite buying a “premium phone. Second refurbished premium item that was defective.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed with Premium",
      "date": "Reviewed in the United States on March 26, 2024",
      "body": "The one I received has the battery strength of 91%. Drainage of battery is much faster. Performance is mediocre and just OK. The 5G On/ Auto setting seems to drain the battery faster and I was asked to choose LTE (4G) as part of cellular data settings. Disappointed with Premium for the extra money paid.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a premium Renewed",
      "date": "Reviewed in the United States on January 17, 2024",
      "body": "This iPhone had scratches all over the screen ,the cameras and in the back of it too.The one positive thing that  I can say about it is the battery life (95%)I think, if it said premium renewed and you Pay extra for that you believe that you will receive something premium. I know that is not new but with that many scratches is not fair.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed Premium came with no charge cord and incorrect charge \"cube\"",
      "date": "Reviewed in the United States on November 29, 2023",
      "body": "The price was good, however:Although the \"Renewed Premium\" iPhone itself was \"like new\" as advertised, it did not come with a USB C - Lightning charge cord at all, and came with a USB A \"cube\". The unit was supposed to come with the same accessories as a new phone, although maybe not Apple branded. A new phone would have come with a USB C cube and a USB C - Lightning cord. Ultimately, I will keep the phone, and I ordered a new cube and cord at my own extra expense. Amazon has a real problem with their \"Renewed\" quality control. This is not the first time for me.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    don't bother buying renewed premium",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "Bought this item for my wife. I ordered and payed for the renewed premium but by the looks of it and the battery life amazon delivered just renewed. Phone battery was at 82%, while at least 90% was guaranteed. There was a scratch on the side on the top of the iphone and the screen had a small scratch which you will not see after a screenprotector is placed. Overall I am not happy because i think I could have just bought a renewed in stead of renewed premium for at least 60 dollars less.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I purchased with the premium option and received it that the top earpiece does not work.",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "For me it is a bad buying experience, I bought the equipment and looked for it in the premium option, thinking that they would be more rigorous to review the device. My surprise, when it arrives at destination and they check its operation, the top earpiece does not work. For me this is a waste of money and for Amazon a loss of credibility.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon Renewed \"premium\" standards are no good",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "Beware - I purchased an iphone 13, 256gb, which was labeled specifically in the \"Renewed Premium\" condition - the phone looked cosmetically fine but did not function as promised.  I opened the camera app and discovered that something internally was broken. I could see what looked like cracks going across my screen as I aimed my camera around the room.  The outer appearance of the camera looks perfectly fine, no cracks or damage on the lenses at all.  Amazon customer service was responsive, but the solution offered was to contact the apple store to explore repairs, and when I did, I was told there's a chance my repairs would cost me extra money.  I am extremely disappointed in what I thought was considered \"premium\" condition.  I know I purchased a used phone but it is clear that Amazon refurbish/renew  does not thoroughly check condition of the phone; opening the camera app one time would have shown that something was not working with the camera.  Started a return the same day the phone arrived.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine but charger doesn't work",
      "date": "Reviewed in the United States on May 5, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    The charger does not work for the iphone I got. I've tried multiple chargers and it just will not charge. Truly unfortunate cuz I was looking forwards to this"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fake iPhone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Ever since I got this phone my life has been a nightmare/ my passwords never transferred, my online accounts canceled themselves and are unrecoverable, and the phone doesn’t connect to internet and intermittently just stops working and goes into sos while I’m sitting next to a router.. I paid on a payment plan so I can’t return without penalty…"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A waste of time",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I’m so irritated that I bought this phone. I wasted my time switching the service from my other phone to this phone and I can’t even use it.The mic doesn’t work and the touch is kinda messed up. I can’t hear people but they can hear me. You only can hear on speaker or with headphones.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not “Premium” renewed condition",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "Ordered the Premium renewed expecting no scratches or light scratches that would be hard to see. Opened the box and immediately saw the scratches (see picture) on the back. I’ve ordered refurbished phones before so I know what to expect. I consider this to be a tier down from Premium. Returned the phone and ordered elsewhere.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Falsely Advertised",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "THIS IS NOT SOLD BY AMAZON.It’s advertised that it comes from Amazon renewed store , but when you have issues they say that it comes from a third party. Also advertised as an unlocked phone , but doesn’t work with certain carriers. Returning and just paying the extra at the store."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Second attempt to purchase refurbished iPhone from Amazon Renewed - they sent wrong item both times!",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "I ordered an Unlocked iPhone 13 Amazon Renewed (Premium) phone and they sent me a locked phone, unusable with our carrier.  This was my second attempt to purchase a refurbished iPhone from Amazon.  I had previously ordered an iPhone 13 Amazon Renewed (not Premium) phone and they sent me an iPhone 12!  Even worse, I could not find a phone number for customer service on the Amazon website so that I could talk with someone about all the troubles I am having with my orders.  I am finished with Amazon Renewed.  I thought I was in good hands since the program is run by Amazon, but I was wrong. It appears Amazon has gone way down hill - bad products, no customer service.  So disappointed !",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on April 16, 2024",
      "body": "Phone was not packaged well it was loose and moving around in the box but came out unscathed"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You get what you pay for.",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "I knew what I was getting myself into when I purchased this device so I had pretty low expectations, really. But I was hoping it wouldn't be too bad. The device itself works and does what it needs to do so far but it was terribly packaged and came with plenty of dents which was pretty disappointing. The battery health was also 89%, takes forever to charge to 100%, then dies fairly quickly.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible!",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Bought a renewed premium iPhone that is supposed to be at least 90%. It has 81% health. Barely acceptable for a renewed product. Very unhappy with this purchase and the return is even more annoying."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    That it is really good for kids and teens",
      "date": "Reviewed in the United States on April 14, 2024",
      "body": "I liked the idea that you had"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed Premium NOT!!!!",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I had this IPhone less than a week. Screen popped off multiple times.  I’m so sad and disappointed.  This is my third refurbish phone and it is the worst. Unbelievable  The one star is because it did arrive on time and the body of the phone was beautiful."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works",
      "date": "Reviewed in the United States on August 8, 2024",
      "body": "Bought this phone knowing it was refurbished it came looking like a new phone in sporty Amazon packaging.  After a couple hours of use I got a warning that I was using a non genuine apple screen so I will forever have a notification on setting widget telling me it’s not right.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Selling unpaid for phones",
      "date": "Reviewed in the United States on February 2, 2024",
      "body": "As soon as I set up my phone, I got several notifications from my carrier stating that the phone was not paid off by the previous owner and I needed to move everything back to my old phone - which I had just finished factory resetting. I thought I could take care of it in the morning, but at midnight AT&T shut off services entirely, and I spent two hours transferring things back to my old phone so I could have service again. Amazon is not able to provide me any sort of verification that the phone was actually paid off, so the only option is to credit my Amazon account upon return and allow me to purchase a new one. I am in another state for a few days, so I have to order the new phone once I get back. I’m glad to at least be credited but I just can’t believe that Amazon doesn’t verify the phone is paid off before reselling it. Seems like something that would be a pretty important step in certifying it.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY THIS PRODUCT!!!",
      "date": "Reviewed in the United States on April 16, 2024",
      "body": "I had bought this phone in the hopes of switching from my old xr to the iphone 13. As i was in the process of switching the sim card through my carrier, i was notified that the phone i just bought was still connected and active with a different carrier/account. I was basically sold an illegal device!! Amazon should be more thorough with these 3rd party sellers and verifying that they aren’t defective. The phone also had a huge chip on the top right corner, scratch on the lens, would heat up quickly, and had 80% battery life. Not to mention the phone was also sent in a sketchy white box with no protection which seemed very unprofessional especially for being a renewed premium device. Now i have to wait until the seller sends me a return label in 2 days and wait a week until it gets sent back, as well as another week to have the refund issued. I would honestly save the headache and just spend the extra 100 with apple or a more reliable website. Do not recommend going through this mess!",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed with Amazon Renewed...",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "I specifically ordered an unlocked iPhone so that I would be able to use it overseas, but received a phone locked to AT&T networks. The phone had three deep scratches on the screen but not very noticeable, and came with 97% battery life. The charging brick is slow, as the phone itself notified me. Would not take the risk of buying from Amazon Renewed again, checking if the phone is unlocked should be a part of the checks before the phone is sold, especially if the device is being advertised as \"unlocked\".",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone worked great for 3 months",
      "date": "Reviewed in the United States on June 14, 2023",
      "body": "The phone worked great for 3 months and now it is saying SOS and the SIM card isn't being accepted. Maybe a problem with the SIM card but still super annoying and never had this problem with any other iPhone. Luckily we found out the phone does have an E-SIM and hopefully that works with our network"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 13",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "This phone was said to be an unlocked phone when in reality it wasn't an unlocked phone. It was actually a stolen phone from Tmobile and they put a lock on the imei was locked because the person bought the phone and then never paid for it so the phone service company then reposed the phone by locking it. Now we are fighting to get our refund after sending the phone back almost a month ago.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IMEI was blocked and phone couldn't be activated",
      "date": "Reviewed in the United States on December 26, 2023",
      "body": "My son was so disappointed.  He got the phone for Christmas and the phone would not connect to our carrier.  After an hour on the phone with tech support and then another hour in the carrier store today, we found out that the phone was not carrier locked, but that the IMEI was \"insurance locked\" and that it either had a claim or was reported as lost or stolen and therefore the phone was blocked from being activated.  I expected more from a \"Premium Renewed\" product from Amazon.  I didn't purchase a used phone off the street corner.  Not sure I'll go down the refub path again after this experience.  I wrongly assumed that Amazon would clear any such issues as part of their refurbishing process.  Thank goodness for a good return process.  The phone is already in route back to Amazon for a refund. I will say the phone looked good and seemed to be in good condition before trying to activate it....buyer beware.",
      "helpfulVotes": 63
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY used phone from Amazon",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "The phone I purchased was listed as STOLEN, it was claimed on someone’s insurance and it locked my phone from being used with any providers and became an expensive paperweight. The 365 replacement offer was magically not provided to me, so I was NOT given the option to replace as promised. So I tried the refund option but Amazon only offered me a portion of what I paid for it, 115 dollars less than what I paid was offered back to me WHY? Amazon guaranteed that this phone was in good condition and not stolen and now I’m unable to use it and I’m out money. It’s not worth the risk! Amazon does NOT do what their policies promise.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No more renewed phones for me",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "I purchased an iPhone 13 mini and an iPhone 13 for my family and found out that one of them does not work. The phone does not recognize the sim card. We have tried several methods and different sim cards, and the problem persisted. The sim cards all work on other iPhones. Three visits to the carrier store to find out the problem is the phone. And here is the big problem, the phone was gifted to a family member that lives in another country. Upon contacting Amazon, they said that they cannot provide a returning label of offer the easiest solution, simply locking the phone and offering a refund. I paid a lot of money for a \"renewed premium\" phone that is defective, and to learn that Amazon will not offer a solution. Time spent and the hassle, on top of all the frustration. Lesson learned!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    no audio, battery drains, freezes frequently",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "Phone is not working and bought renewed premium phone and they closed the return window a day before and totally upset the way these support guys providing the information and not helping. Even they won't read the warranty and saying the 30 day window is closed and we need to educate them and they informed it is closed and not able to help.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth the full price",
      "date": "Reviewed in the United States on October 4, 2023",
      "body": "I have had issues with faceid randomly not working even after I update and restart multiple times. And the mic or something doesn't work properly. The person on the other end hears a lot of noise. Had to restart or call again to fix that.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is not come like a new phone",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "The can’t even open",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is fine,  but most likely stolen!",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "Two months of use this phone blocked from the network by T-Mobile. On contacting them they say there is a balance due on this phone from the prior owner. Now I’m in a battle with T-Mobile to get it unblocked. In the meantime, it is useless to me.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SOLD iPHONE WITH EXISTING PAYMENTS",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "The iPhone received had outstanding installment payments making it unusable.  This was confirmed by AT&T.  Returning the phone ASAP.  Very frustrating and disappointing purchase!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    STOLEN / BLACKLISTED PHONE!",
      "date": "Reviewed in the United States on March 3, 2024",
      "body": "I bought this phone for my wife and waited 2 weeks because it was placed on an unexpected hold. Once I finally got it I put the SIM card I got from t mobile into the phone and it would not read it. So naturally I took it to my local t mobile store to get them to get it going . Well they played with it for 2 hours trying to figure it out until finally they got help on the phone and we were informed that the phone was blacklisted from service . It was a stolen phone!!!! So embarrassing! Degrading ! And on top of that I have to wait 30 days to get my money back AND still find another phone and WAIT FOR THAT ONE! Incredible disaster. I would rate this with no star but it wouldn’t let me submit without clicking at least one . Go figure",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery swelling",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "Bought in Sept 2024 it's the beginning of December (1st) 2024The battery started swelling and couple of weeks ago causing the screen to detach from phone. The screen is glitchy and giving you to rainbow effect on the screen.I know buying a refurbished phone is risky but I really needed it to at least last longer than a couple of months. I should of just bought new for the amount I paid.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "2nd order from Amazon where the SIM tray does read! A waste and inconvenience"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wasn’t unlocked like they said",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "The phone was in decent shape, worked fine up until I needed to port the old phone number to the new phone. SIM locked. The phone is listed as unlocked, and you can’t see the locked part until you’ve set it up to get to that part of settings. A $1 trillion company can’t figure out if a phone is released from the carrier before selling. No other option but to return it, get a refund, and buy a phone from another company instead.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stolen phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "If you buy this phone it may be stolen and resold. This is happening to me right now and we’re about to file a claim"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY - READ THIS REVIEW",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "This product was advertised as unlocked but it is LOCKED and this doesn’t work with new SIM. I bought it as a gift for my mother who lives abroad and cannot ship it back. The support has been ABSOLUTELY useless (name Christina) and told me there’s nothing they can do. I would give it -100000 stars if I could as it’s falsely advertised.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I never leave reviews - DO NOT buy this phone.",
      "date": "Reviewed in the United States on April 13, 2023",
      "body": "I purchased this phone after doing research on other refurbished phones from Best Buy and Apple- and since this phone sells directly from Amazon I trusted it. I received it and followed the instructions given in the Amazon Renewed packaging and transferred my Sim Card. About 20-30 min later, I received a text and email from my phone carrier:Unpaid Device Message: Hi, it's AT&T - we had to block your device and turn off your service due to an unpaid installment plan.Turns out, Amazon sold me this device illegally. Wherever they got it from, it was unpaid, and now I don't have phone service. After speaking with their Customer Service team (on chat because I cannot make calls now... to anyone) the most they could do was set me up for a return as if what they had just done wasn't illegal.Save yourself the headache- spend the extra $150 on a new iPhone 13 directly from Apple.Sincerely, Someone who doesn't want you to have the day that I've had.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Carrier unlocked - IEMI LOCKED...TWICE!",
      "date": "Reviewed in the United States on January 4, 2024",
      "body": "Edit: This same thing happened with the replacement phone. If you are in a pinch I would just spend the extra money and buy brand new. What a hassle.Did you know the carrier isn't the only thing that can stop your refurb phone from being set up with your carrier. A previous carrier may have also locked the IEMI for a number of reasons rendering the phone totally unusable with ANY carrier. You would think for the premium refurb this would be checked? No worries though, only took me 6 live chats and four hours for someone to figure this out and advise me, and then miss work because I can't access VPN security without my phone number. Thanks for sending a dud nerds, feel like you all owe me now, was counting on that working and paid a premium to get it in time. sadge.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wasted my time with a $550 “CARRIER UNLOCKED” phone",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Absolute waste of time. Product was sold to me by Amazon claiming to be carrier unlocked and it is not. Called my carrier to try and connect it and it did not work. Went to the storefront and was told this is a LOCKED DEVICE. The worst part is that I now have to return to a WHOLE FOODS that is 14 MILES AWAY as this product is unable to be returned to UPS . Absolute waste of time.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t buy refurb! It won’t last",
      "date": "Reviewed in the United States on September 6, 2024",
      "body": "The screen went green after less than a year of use. Phone is basically trash.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy reenewed",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "I bought a renewed i13 iPhone and it is JUNK!!! It started well but could not transfer anything from my old phone to my renewed I13. I thought I was doing something wrong; I took it to Spectrum store and they tried to fix and transfer my apps and things to the renewed i13 but, no luck. They asked me where I bought the phone I told them Amazon renewed. They said it is a mistake buying renewed. I am having a very hard time sending it back for a refund! NEVER will I buy a RENEWED item again.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stripped screen after a year",
      "date": "Reviewed in the United States on July 3, 2024",
      "body": "At first it was great looked it and worked nicely , the phone was far from cheap but only lasted 14 months. Still looks perfect but the light of the screen randomly went."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stolen",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Stolen iPhone. I’m unable to get service on it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Given a phone with Overheating Problem",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "I am not sure what kind of testing is done but this phone is overheating and cannot be used without ear phones . As we suppose to leave for vacation soon after receiving phone , it was a very bad experience . I wont recommend anyone to buy this refurbished phone , if you are specially gifting anyone . This much to money is not worth . It is not being properly tested .",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed premium is not worth it.",
      "date": "Reviewed in the United States on March 22, 2024",
      "body": "I like the size and weight of this iPhone Mini, so I was going to use it as a second phone. But an issue is that battery maximum capacity is 91% This is bad, considering that is the average one-year-old iPhone battery capacity. Another downside, the screen gets hotter than my iPhone 15 Pro Max. I will return the phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BEWARE of Amazon Premium!",
      "date": "Reviewed in the United States on June 1, 2024",
      "body": "*Apple iPhone 13 - Amazon Renewed Premium (Red) - Hardware issue, Glitch, Frozen, etc., occurred 21 days after turning phone on! **Per 2 Amazon Rep's, I was informed there is actually NO \"TECH DEPT\" despite everything they say & guarantee! *NO Replacement issued, so have to wait for refund & will NOT match price 1st paid for! Just HORRIBLE experience! They do not do what they say they will, EVER & YOU have to track your refund. While my son has to wait, w/o a phone, until Amazon decides to refund even when it's going back to your \"Gift Card Balance\" & they've received the phone! Incredible! **Think VERY hard before you decide how you want to purchase anything!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "I knew it was refurbished, but I still expected it to work correctly. I didn’t. The touch screen had areas that didn’t work and other areas that were so touchy you couldn’t control anything. Then the whole screen would freeze up numerous times a day. Returned and bought new directly from Apple Store.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery not recognized",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    After switching my number and everything over and deactivating my old phone, the one started spontaneously shutting off and wouldn’t start again. Even when plugged in it doesn’t always restart. This morning it shut down 3 times in the middle of the same text message. I even bought a new iPhone MagSafe charger directly from Apple to make sure. I finally got this message regarding battery not recognized. This explains a lot of the really weird and maddening issues with this phone. I hate it. My replacement from a different vendor finally arrived today so I can return this.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lock screen button doesn't work..",
      "date": "Reviewed in the United States on May 26, 2024",
      "body": "I just received this iPhone and on day 1 the lock screen button on the right side doesn't work. Already dysfunctional. I'd return this but I can't go without a cellphone for work."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed premium junk",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "Bought this renewed premium iPhone 13 for my wife and just over 3 months later the phone is dead. Took it to apple care and the drive on the phone is toast, let's see how Amazon does with their 365 day renewed premium warranty. I'm not expecting much",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective Camera",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "First of all it came without a charger. Then I discovered that the camera did not work. Very disappointing this was supposed to be renewed premium. Now I’m told I can only return to certain places. So now I have to travel 20 miles to return it. Not happy!!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sent me locked phone…",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Title saying “unlocked”, but received LOCKED phone. Made me run to whole food market (no other location accept return) which located very far from me to return (only allows 1 day to return after received). It’s been waiting for a refund for almost 3weeks now. Totally wasted time.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was reported lost or stolen-could not activate",
      "date": "Reviewed in the United States on September 15, 2023",
      "body": "I would rate 0 if I could. We tried to activate this phone with our mobile carrier and were told that this phone was reported lost or stolen. Returned the phone over a week ago and still have not received the refund. I can't believe Amazon does not have some way to monitor if phones they are selling have been lost or stolen. Terrible customer service.Update-it has been almost a month since I returned the phone, I called on Sept 17, they said a refund would be issued Sept 28. No refund. Now they are saying Oct 14. First, they sell us a stolen phone, and then cannot seem to get a refund sent in a timely manner-ridiculousStill no refund, Oct 14th.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery maximum capacity started plummeting",
      "date": "Reviewed in the United States on February 18, 2024",
      "body": "It was fine til about a month ago when it when from 99 to 97 which is not to bad. Then I noticed I had to have it on the charger a lot. Checked the other day and it was 87. Now it’s 84. The warranty end on 1FEB24. Very convenient.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth your time or money",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "This phone died within 6 hrs of receiving it. The tmobile guy instantly knew what was up when I told him I bought a phone on Amazon. This is a scam. Phone was rose gold not pink and died with no ability to reset or restart the phone. Do not purchase from this seller! Now I have to wait for my pickup and refund. Meanwhile I had to figure out how to find and pay for my next phone, while not have a functioning phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Take forever to my refund",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "iPhone doesn’t work",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    90% battery life only",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "Don’t buy, taking back because it was only at 90% battery life."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "Wasted so much time trying to transfer service only to find it was sim locked to a carrier from previous owner.Beware! Alot of money for a phone that won’t work",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer Beware: Phone Was NOT Unlocked",
      "date": "Reviewed in the United States on April 6, 2024",
      "body": "The phone arrived in \"like new\" condition as advertised. There were absolutely no scratches, scuff marks, or any other cosmetic blemishes. And the battery life was 100%! Unfortunately, I was not able to activate my cellular line (eSIM). After powering the device down and turning it on again, I finally called my mobile provider and learned that the phone's IMEI was locked. Most likely its previous owner was a victim of theft and had reported the device as stolen. Thankfully, the return request was approved, but it will take up to 30 days for the charge to be refunded to my credit card per Amazon's policy. Buyer beware!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stolen phone sold by Amazon",
      "date": "Reviewed in the United States on November 30, 2023",
      "body": "I bought this phone straight from Amazon (premium renewed) and after 2 weeks of use, the phone was disabled. It was reported as lost or stolen. Be careful in buying a renewed phone, even when sold by Amazon. Regarding the phone itself, the speakers have thin sound. It feels fairly light in the hands.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Falla en el equipo",
      "date": "Reviewed in the United States on March 16, 2023",
      "body": "Al momento que se quiere salir de las páginas se cuelga y se pone negra la pantalla y lo permite salir"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 13 currently working but I can't insure it.",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Amazon make sure  to notify customers to call Applecare as soon as you purchase this because you can't get insure it after 30 days you will not be eligible.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unable to activate due to an outstanding balance owed on the device.",
      "date": "Reviewed in the United States on March 6, 2024",
      "body": "I received this phone and activated it successfully. After deactivating the old sim card and moving it to esim I received an email from At&t stating that the new device was being blocked due to an outstanding balance being owed on the phone from someone else's account. Basically some one owes money on the phone and Amazon should have never been selling it in the first place. Now I am unable to reactivate the old sim and have no phone until I can go to At&t and get a new sim card. I do not recommend.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor performance",
      "date": "Reviewed in the United States on April 30, 2023",
      "body": "Huge mistake purchasing a \"renewed\" phone. Was in a jam, and needed one overnight. Operating system does not work efficiently. Still had presets from previous owner. Back glass cracked first week with case on it. Not orginal replacement parts. It makes calls and texts. My mistake for trying to save a 100 bucks. Should have ordered from apple directly.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No signal without wifi",
      "date": "Reviewed in the United States on February 24, 2024",
      "body": "This is probably the worst purchase I've ever made on Amazon. We spent hours talking to the people at apple, and hours spent on the phone with our mobile carrier trying to resolve the issue. It can't hold a signal, even with wifi it drops calls continuously. It goes into SOS mode repeatedly when there's no wifi. The carrier tried changing towers, we tried resetting everything that can be reset. It's the phone. So now three months later, we're buying another new phone, and we find out we can't even trade this one in because it's already been traded in.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Will Go Bad",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "Had for just over a year and of course the battery is already failing, and of course it’s out of warranty. Waste of money, bought phones brand new that will last at least four years.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IT IS NOT UNLOCKED",
      "date": "Reviewed in the United States on January 1, 2024",
      "body": "I got this as a gift for My dad and went to go hook it up to his carrier and it wouldn't work because it said the sim cared is not supported...come to find out its a locked phone! How is it amazon verified and renewed premium if it is not what it says on the description! Then I contacted them and they want the ups drive to pick it up from me. Even though I'll be at work so I'll miss the driver and then not be able to return it. Does that make sense? I am beyond upset. This was an expensive purchase",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Una mala experiencia 👎🏻",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "Teléfono bloqueado con reporte de robo y ahora tengo problemas con la devolución de mi dinero y ya ha pasado un mes que hice la devolución… Definitivamente una mala experiencia. 👎🏻",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overheats",
      "date": "Reviewed in the United States on March 10, 2024",
      "body": "Been like 2 weeks already, it overheats i watch one video on youtube or Netflix and it gets hot and i feel like it charges way to fast.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A little more flaws than I expected",
      "date": "Reviewed in the United States on April 28, 2023",
      "body": "Alright to use but couple of noticeable flaws"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would not switch over! Had to buy another phone.",
      "date": "Reviewed in the United States on March 17, 2024",
      "body": "After 3 days of constant trying and tension, I couldn't make this phone work outside my WI-fi. Finally took it to Verizon and they couldn't make it work either. They said their computer asked to scan my license also something they'd never had happen. Made me wonder if this phone was stolen or used in some sort of crime? In the end had to buy a new phone and return this one. This may not be the usual, but I can not recommend based on my experience.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Yes",
      "date": "Reviewed in the United States on February 11, 2023",
      "body": "Phone is a little glitchy and seems to be hacked by Amazon",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    PHONE IS LOCKED DON’T BUY",
      "date": "Reviewed in the United States on July 3, 2024",
      "body": "DON’T BUY, IT LOOKS LIKE NEW, BUT IT’S REALLY USED. THE PHONE WASN’T UNLOCKED AND DIDN’T ALLOW ME TO USE ANY SIM, NOW I HAVE TO RETURN A PHONE I WAITED A WEEK FOR IN JUST AN HOUR! 0/10 STARS",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen doesn't even work in less than 2 months!",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "I got this phone just a few months ago and already, for no reason (didn't drop it, no water damage etc) the screen just died!! I tried to return it but there was no option. I'm really upset.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    doesn’t work",
      "date": "Reviewed in the United States on April 22, 2024",
      "body": "I bought this as a gift for someone and we spent several hours and days attempting to get it to work but to no avail. returning it was a massive ordeal I had to finally speak to three different people at amazon to get it returned it was extremely difficult. ended up purchasing a new phone from the apple store and got it working and switched over in about a half hour. don’t waste your time with these save yourself the headache",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Glitching",
      "date": "Reviewed in the United States on February 14, 2023",
      "body": "Not working too well",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality issues",
      "date": "Reviewed in the United States on May 13, 2024",
      "body": "I had ordered a blue iPhone and when I had got my package in the mail it was a COMPLETELY broken (screen mutilated, didn’t turn on,) it was not functional whatsoever, and the last thing I would address was the phone wasn’t even blue.WAST OF TIME AND MONEYDo not recommend",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    HORRIBLE",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "Never buy a recondition phone off Amazon. Wasn't able to switch to phone carrier. Amazon did refund 100%.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got the Amazon Certified - still didn’t work",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "Thought buying a refurbished Amazon Certified phone would be. A safe route- I was wrong.  The phone turned on but the touchscreen didn’t work.  You also only have 24 hours to return-  luckily I was able to start the process right away- but buyer should beware.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Premium quality as they advertise",
      "date": "Reviewed in the United States on April 14, 2024",
      "body": "I purchased this phone labeled as Premium condition but it came with scratches on the corners and dirty speakers. I’d purchased phones on premium condition before and they always come in pristine condition (no scratches at all) but this one was not the case. Is very disappointing",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy",
      "date": "Reviewed in the United States on May 20, 2024",
      "body": "Don't buy it. not as I expected, bad customer service, slow shipping and not happy with the phone. I\"m so upset I have not even had very long but just long enough to be able to return it",
      "helpfulVotes": 1
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone 13, 128GB, Midnight - Unlocked (Renewed Premium)",
    "asin": "B0BGQKY8S9",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "6.1\" Super Retina XDR display. 5G Superfast downloads, high?quality streaming",
      "Cinematic mode in 1080p at 30 fps. Dolby Vision HDR video recording up to 4K at 60 fps. 2X Optical zoom range",
      "A15 Bionic chip. New 6-core CPU with 2 performance and 4 efficiency cores. New 4-core GPU. New 16-core Neural Engine",
      "Up to 19 hours video playback. Face ID. Ceramic Shield front. Aerospace-grade aluminum"
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$309.09",
    "url": "/gp/offer-listing/B0BGQKY8S9/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0BGQKY8S9",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone",
        "USB Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$332.61",
    "listPrice": "$363.63$363.63",
    "savingsPercentage": "-9%",
    "standardDeliveryDate": "Saturday, March 22",
    "primeDeliveryDate": "Friday, March 21",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}