{
  "asin": "B0CH964JZ8",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely worth getting, I bought two jitterbug phones!",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "This phone is easy to understand, comes with a manual that is easy to read, as well as customer service is  outstanding and quick to answer you calls. The layout is great if you don’t want a complicated phone and you need to be able to see it clearly. I recommend this phone to anyone young or old that has trouble with the sophistication of the modern cell phones.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Seems it works well for confused senior. Just using phone and pics now but it is new.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good option for seniors or young people",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "The phone was not too difficult to activate online, once you find the activation page. You have to activate it with Lively, it cannot be used on any other service.It is large enough for most people to see the screen well.  It has a clear and simple menu, which can be adjusted as needed in the options. For a Senior who can learn, it will not take much effort to master the phone. Since it is an android, some features from google are available. An account from google will help transfer contacts to the phone. It is able to share location with other users of Google Maps without purchasing the Lively upgrade to track the phone location in a separate app. We are not using the advanced emergency response services from Lively yet but expect to in the future.For Seniors who cannot learn there are a couple of issues. It does not have a lift to wake feature, requiring the push button on the side to be pressed. This can be confusing for a person with some dementia to learn if they are transitioning from an Iphone to this phone.  Another issue is the contact list provided through Google contacts permits favorites which are displayed on the top of the list if you open contacts, or if you open the phone app, but not if you open texts. These minor differences may be hard to learn for someone without a memory. The solution is probably to delete all of the contacts except a few critical ones, and eliminate the favorites.  It is also possible to turn off the lock screen to make access simpler, but it will have no security at that point.We will see how it works, and I may update this review. At this point it appears to be the best option for a simple phone with actual features.",
      "helpfulVotes": 83
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The marketing might be great but the phone is a nightmare",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "We bought this phone for my older adult mother who has mild dementia because her IPhone had so many features she was getting a bit lost in it. Rather than get her a new IPhone we researched the best options for older adults and watched all the lively videos. What can I say the marketing is amazing. We learned quickly that is where the amazing ends. The phone arrived and there were challenges with their website porting the number. We should have stopped there and RUN back to Verizon. While the home screen is great, NONE of the actual features are. We connected her hearing aid but when it disconnects, reconnecting to Bluetooth is not easy. The phone locks every two minutes and the button on the side is tiny and by the time she swipes up it tells her face recognition didn't work so she still needs to enter a pin. She was in tears and feels like this is all her fault. When she gets it to work, she can call us, she can't text, and she also can't hear when it moves audio sources, nor can she figure out how to move it back as she could on her Iphone. Meanwhile, I knew exactly where she was with find my phone and could see \"read\" messages on her texts even if she didn't respond. Do NOT purchase this phone if you have a loved one who needs something that is easy to use. We have ported the number and bought this fairly useless phone, but we are ready to bite the bullet two days in and go back to Verizon with a new Iphone on accessibility mode. Save yourselves and your older adult parents from endless frustration and a fairly useless phone. They might have amazing marketing, but their product is far from that.",
      "helpfulVotes": 34
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect Phone for Grandparents – Simple and Reliable!",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "I couldn’t be happier with the Jitterbug Smart4! These phones are incredibly easy to set up and navigate, thanks to their simple and intuitive interface. My grandparents were able to use them with minimal guidance, which was a huge relief.Lively's customer service was also fantastic—they helped me set up a \"family plan\" deal when I called them, making it even more affordable to get one for each grandparent.A note for tech-savvy buyers: while the phone runs a full Android OS with an easy-to-use skin, a few apps don't seem compatible with this model (TCL). Some apps have generic Android versions that work fine, but others only support Samsung or iPhone.Despite this, the phone is perfect for its intended audience. The Lively LINK app is an added bonus, providing great peace of mind by keeping us connected and informed. Highly recommend if you’re looking for a user-friendly phone for a senior loved one!",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "This phone works okay.  I have had to restart it a few times in the first week I've had it because it glitches sometimes and won't respond to anything.  Not completely happy with it.  Apps that I put on the home page don't stay there and I have to keep putting them back.  That's kind of irritating.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for my 95yo mom",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "This smartphone is everything I needed for my mom!  I transferred her landline number to it, & it took a couple days longer than anticipated.  Calling customer service connected me with a super helpful agent, who patiently tried a few fixes before it went through.I appreciate being able to simplify the choices on the homescreen, so my mom isn’t overwhelmed by things she won’t use - like email, web browsing, weather, etc.  It was easy to add contacts, & easiest for my mom to not even set up voicemail at all.My mom got the hang of using this phone quickly, & she can hear on this better than she could on her previous (non Jitterbug) flip phone.  The monthly phone plan is very reasonable (we have the plan without the emergency service).Exactly what I needed for my mom!",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great smartphone with SimpliTend app",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "This phone is fantastic! I installed the SimpliTend app on it, allowing me to keep track of my medications and daily tasks. It's now connected to my daughter's smartphone, so she can help me whenever I need support.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT a good phone for someone who has short-term memory issues!",
      "date": "Reviewed in the United States on November 28, 2023",
      "body": "The Jitterbug Smart3 phone is heavily marketed to appeal to caregivers buying a simpler smartphone for a loved one diagnosed with one of the dementias. My husband has mild cognitive impairment with short-term memory loss. He is still mobile, dresses and feeds himself, reads the paper, and watches TV daily. However, I was surprised to discover that the Jitterbug Smart3 actually is MORE DIFFICULT and TAKES MORE STEPS to use to make and answer phone calls, open and reply to emails, send texts, and listen to voicemails than on my normal Android smartphone.For example, for my husband to call me, he has to remember one of three ways to place a phone call.Make a Call Option 1: From the main screen, he has to tap Dialpad and then enter my phone number (including area code) from memory using the dialpad, then tap Place Call.Make a Call Option 2: From the main screen, he has to tap Contacts, find my saved name on the Call History list, tap my name, and then tap Place Call.Make a Call Option 3: From the main screen, he has to tap Phone, then tap Call History, find and then tap my name and phone number, and then tap Place Call.With his short-term memory loss, all three options proved impossible for him to remember and reliably perform, even with written instructions.Answering incoming calls is too complicated for him as well. When a call comes in from someone on his approved caller list, their name appears on the screen. However, to answer the call, he has to PRESS AND HOLD the Phone Icon button, then while pressing down on the button, push his finger up to Answer or down to Ignore. It's too many steps that must be performed perfectly in sequence just to answer a phone call.And don't get me started on how easy it is for him to accidentally press the red Urgent Response button that is at the top of the Home screen and is very easily accidentally tapped or pressed while working elsewhere on the Home screen. Once the Urgent Response button is accidentally pressed, it automatically calls a Lively Response Agent who then calls you on your phone first to ensure your loved one is actually having an emergency. My husband's palm or fingertips holding the phone accidentally pressed the Urgent Response button several times. There's no way to deactivate the Urgent Response button and once it's accidentally pressed, there's no way to stop the Lively emergency team from being contacted. This is a definite design flaw that there's no way around.Despite multiple practice sessions over several weeks, the multiple steps to complete the simplest activities on the Jitterbug Smart3 were just too much for my husband to recall and perform. It frustrated him terribly and it frustrated me too. I finally had to give up and buy him an even simpler phone that is much easier for him to use and is much more intuitive to operate compared to a Jitterbug Smart 3. He's now doing fine calling me and answering calls with his second simpler phone.If you think the Jitterbug Smart3 phone is going to be easier and more straightforward for your loved one with cognitive impairments to use, it is NOT easy and it is NOT straightforward. There are more steps required to perform the simplest phone actions than on my normal smartphone, and worse, the steps to follow are not intuitive. For someone like my husband with almost no short-term memory and logic processing issues, the Jitterbug Smart3 proved to be a complete waste of my money and time.I hope this detailed review helps you avoid the expensive mistake I made.",
      "helpfulVotes": 114
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Important info for elderly",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "The Jitterbug Lively 4 phone does not have a \"Lift to Wake\" option. That means if you want to use the phone, you have to push the power button on the side for the screen to turn on. I bought this phone for my elderly mother and small power button on the side of the phone is very hard for her to find and press.This is important to know for anyone using the phone that has declining dexterity. I'm especially concerned that my mother has a medical emergency she'll have to find and press the button before she could use the phone. I am disappointed that a phone made for elderly people doesn't have a work around for this.Just for clarity, if the phone receives a call the screen does turn on automatically. But if she tries to initiate using the phone, the only way to turn the screen on is to push a small and hard to see power button on the edge of the phone.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    That I could do it.🥴",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "All is well , and that's from an 94 year old. 👍"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Love it. Easy to use"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hope for the future.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Too complicated to start up. The potential customer got confused by the phone assistant . You should have a phone call set up for use and all the customer has to do is call in to activate the unit and get the phone number. Or better still have their old number if available activated.All by provision of a charge card."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Simple phone",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Nice phone. I bought it for a friend."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I was excited to have an easy cell phone",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I am older and cell phones are to difficult for me so this looked like the \"cats meow\".  I was really turned on to see something so simple to use.  But when I went to Comcast to sign up for carrier service, they denied me for some reason which I didn't understand, and they sold me a inexpensive Motorola phone with their service.  The downloaded operating manual was 120 pages.  It will take me years to learn how to operate this.  I'm glad I learned how to do mathematics in school.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for seniors but longevity a problem!",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "This was my 2nd Jitterbug purchase.  The upgraded features from the Smart 3 to the Smart 4 were substantial.  As my 1st cellphone experience at 80 yrs. old I had some navigation issues, but found the manual & customer svc, helpful.  The only negative issue is with the longevity of the phones.  My 1st lastest approx. 1 yr & the 2nd ony 6 mos. & losing all my conntacts & photos disappointing.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for senior use",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "My mom is 87, loves this phone. Great screen for her to see. Reallyeasy to learn and use. Perfect!! Super value for money.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good - mostly",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "Product satisfies most of my 88year old needs and is easy to navigate through the various apps/services.  I especially like the Voice Typing feature for texting and the Voice Assistant for answering almost any question I have about anything.  What I don't like is that there is no way to text an announcement or invitation or any message  to a group of recipients; you have to text the same message to each individual.  There's also a very annoying practice of interrupting the playing of one of their game apps to promote another game app; happens periodically and not easy to stop and return to the game you're playing.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for Seniors",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "I purchased this as a replacement for my brother who's old one died a very quick death for no apparent reason.  His old one lasted about 3 years which is not bad for a $100.00 phone with no contract and a low monthly bill.  Beware that Lively Customer Service is a bit of a challenge.  While trying to get him set up,every time, when getting put on hold for several minutes, we got disconnected.  After 3 hang ups and 3 different agent, we got it activated but they never did get his contacts and photos transferred over.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Interface wasn't useful if you're blind",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "While the interface allowed you to set the size and dark mode settings, it didn't allow you to modify the background for the icon.  If you notice the call icon or message icon will always have a white background.  It would be more useful if you had the option for putting the icon on a black background with yellow lettering so users with limited visibility could better distinguish the differences.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone but slow.",
      "date": "Reviewed in the United States on July 31, 2024",
      "body": "I have had this phone for one year now. Overall I'm pleased with the phone and it seems to do everything that I needed to do such as call, text, internet surfing, etc. The phone is kind of slow and if you're trying to browse the internet and you're not on Wi-Fi it can be quite slow. Obviously it's not a $1,000 brand new iPhone or Android phone so you're going to have to make some sacrifices. For the money it's a good phone and I plan to keep it and continue to use it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOOSE CHARGER CABLE Causes SLOW Charging & Pops Out Easily.  Same with Replacement Charger.",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I WAS!  After letting it sit for three hours to charge the battery...or so I thought...I found that it was still at 50%.  I disconnected it and then tried again.  This time a message appeared onscreen telling me I was using a SLOW CHARGER...and that I should use the charger that came with the phone.  I WAS using the one that came with the phone!  I then phoned Customer Support.  After wading through the prompts, a recording told me someone would assist me in \"30 seconds.\"  Over the course of the next 12-13 minutes, I heard this recording THREE TIMES!  I finally phoned Amazon to complain.  The Amazon customer service rep could tell I was upset.  Her solution to the problem was satisfactory.  I had spent 2 or 3 hours earlier today just setting the thing up.  Now I'll have to do it all over again tomorrow.  I had a Jitterbug Smart2 which provided several years of service before needing to be replaced.  What's happened to that company?  UPDATE:  The phone, itself, appears to be okay.  It's the high-speed charging cables that appear to be the problem.  Had the same problem with a replacement.  You have to jam them in HARD, and then hold your breath...and very GENTLY put the phone own on a flat surface.  Don't STARE at it!  Staring at it may be enough to cause the cable to pop out.  Just tiptoe out of the room.  If you come back an hour later and the screen says, \"slow charging,\" you'll know that someone probably looked at it.  Or maybe a housefly flew by and the air turbulence caused by its flapping wings dislodged the charger.  Easy to understand why the Jitterbug Smart4 is marked down to only $71.  Why doesn't the company just fix the charging cables so they fit SECURELY into a Smart4's USB charging port?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is great for seniors! I'm 80 and I love it!",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "My son set the phone up for me and said it was very easy to do.  I find it easier to dial and easier to see the numbers when dialing.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Simple interaction for a smart phone.",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "I bought one for my girlfriend and was jealous. I'm getting mine on Tuesday."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst customer service and Company Ever!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I have never wrote an Amazon review before but thought this terrible company was worthy!Maybe the worst customer service ever! Maybe worst company ever! This is the phone you buy your mom when her smart phone has finally outsmarted her. I thought this was the phone that we could get some peace knowing that 24/7 she could pick up this phone and there would be someone on the other end to help, wrong. What if I’m having an issue with my phone on Sunday? Sorry we’re closed!  Scan this code to for help setting up your phone….as long as it’s during normal business hours. Did I mention that according to the recorded message they only answer phone calls during normal Monday - Friday business hours. Did I mention how easy the setup is using the handy manual the worst company provides, very vague and often just flat wrong information.  of The most frustrating part of the set up for me is that to do a phone to phone transfer is you need a cable, they suggest the charging cable….how stupid can you be ! You can not use a charging cable to do data transfer, They Are Not The Same Thing! You do have the option to do a wireless transfer but that failed multiple times …. If only there was a help line you could call for advise. Had to go to Verizon and buy a data transfer cable for and additional $40. Since no one has any issues on the weekend we gave up and will resume with the worst company and support system that Amazon has to offer…. The Worst!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "My 78 year old mother has been through several phones trying to find one she can use, they were all to difficult for her until she got this one, I highly recommend it!!!*******",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "I wasn't a senior when I started using Jitterbug phones, but the price was right and they are super-easy to use. Great customer service, too. Now that I am a senior, I see no reason to change. These are fine phones, and the newest model, the Smart 4, is supposed to be \"much improved.\" The only way they could have improved it, in my opinion, was the camera. But unlike young people, that's not a huge concern for me. My Smart 3s were perfectly adequate for me, at a great price. I've had about half a dozen and will not change from them. Good, good product.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wanted easy toUse phone for husband with dementia. This worked like iphone",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Dementia patient. Sent item back",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impossible for my father to turn on",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "The phone is easy to use and I think overall it's functionality is great for most people.  However, my father has difficulty with his hands to begin with and his sense of touch is pretty much gone.  The phone requires that you push a button on the side (a very low profile button that matches the rest of the phone), to bring it to life, and my father cannot find the button to turn it on.  It also requires a swipe up to get to the screen, which again, is difficult for my father.  We will continue to use the old iPhone SE which has a button, and the ability to get rid of the lock screen for him.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ORDERED 2 JITTERBUG SMART PHONE 4 PHONES.",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "THESE PHONES ARE TERIFFIC AND YOU DONT NEED TO BE AN ENGINEER TO USE THEM. BIG SCREEN, EASY TO READ, EASY TO USE AND DOES EVERYTHING WE NEED OUR PHONES TO DO!GREAT CAMERA AND VERY EASY BOOKLET TO USE WHEN YOU ARE NOT SURE HOW TO MAKE SOMETHING WORK. SHORT AND TO THE POINT WITHOUT ALL THE BLAH BLAH BLAH!LOVE THESE PHONES!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Simplicity",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "This is a great phone. It is easy to use. It has the emergency app I can use if I am having any trouble and need help. It's a little big for me but it's a great phone.Price was reasonable also.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitterbug phone",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Doesn't offer access for additional SD card to expand storage. The only disappointment. Otherwise great phone for seniors."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, but charger doesn’t fit this phone",
      "date": "Reviewed in the United States on March 2, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Update: the phone itself is great, easy to use. My dad has never had a smart phone before and this was pretty easy for him to learn. He loves its! We bought the correct charger for the phone since the one it came with did not fit. It’s was a great buy. Gave this to my father for his birthday and decided to charge it but the charger does not fit in the phone’s charge port. It’s much smaller than the port and I cannot get a live human only an automated customer service who wants to set up return when all I want is a replacement charger that actually fits the phone. Very disappointed",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ease of jitterbug 3",
      "date": "Reviewed in the United States on February 24, 2024",
      "body": "I'm pretty sure I am going to like my Jitterbug 3.  It is a little different that my Jitterbug 2 which became obsolete.  I am not tech savvy and have no one to help me get and use an iphone. The price is very fair.  It only took me 2 phone calls to lively to get it set up by myself.  The phone people are very patient and helpful.  I wouldn't get this with the other high end smartphones and if fits my needs.  I am 80 yrs old and on a fixed budget.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wish we could use the services in Canada",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "Purchased the phone, but unfortunately, we can’t purchase a plan in Canada. It’s only good for the USA. Great phone though"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    tech support required to transfer data from old phone to new phone.",
      "date": "Reviewed in the United States on February 18, 2024",
      "body": "I bought this new Jitterbug smart 3 to replace my old jitterbug smart 2.  I was not able to activate (and transfer current service, and the old data to my new phone) on my own.  I had to call Lively and get a tech guy to help me.  With the help of the Lively tech guy I was able to activate the new phone but I lost photos, contacts, and call history in the process.  I like the phone. But I have to say, getting it up and running was a real chore.",
      "helpfulVotes": 32
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not so easy",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "I got this phone for my daughter, who has special needs.  Thought it would be easy.  Not!  Hand to set up.  Had my son, who is a pro at that sort of thing, do it.  It took him quite a while and a phone call.As for the phone, she likes the pre installed APS . But adding to them is problematic.  I have a Google phone and like it way better.She can call me easily, however, which is really why we got it.  Not an easy phone.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I needed a new phone",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "When I was looking for a new phone when my old phone died I saw this phone on Amazon and it was good for price and I got it next day.Love it.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to setup and use",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "I recently made a huge mistake by spending a lot of money on an Apple smart phone. It lasted six weeks then quit. Apple said it was full of water and could not be fixed. That was a total lie. I won't ever purchase another Apple product for as long as I live. This phone was a fraction of the cost and does everything an Apple phone will do. (as long as it lasts for more than six weeks!)",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is much easier to set up and understand than other Androids that are complicated.",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Easy to set up, easy to use, easy to read. Friendly. Perfect for just phone, text and photos, and you can take it to higher levels if you wish.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitterbug. I'm returning this.",
      "date": "Reviewed in the United States on October 12, 2023",
      "body": "I went to activate my phone, got all the way through, about to finalize and found this:''Handset Activation Fee$25.00''There was nothing about this that I saw prior to ordering. It's infuriating.Other annoyances:1. The instructions called for typing in the serial number, which was said to be on the sticker attached to the side of the box or on the ''activation card.'' What activation card? The only number there was useless. I got a message saying something to the effect of ''We're unable to find a device with that serial number. Please try again.''I tried again. Same result.To get the correct number, I had to moisten the sticker so it could be removed. The correct number is printed on the box.I let them know what I had to do. The response I got was to the effect of \"Yes. That's the correct serial number.'' No explanation for their error, no apology for my inconvenience.2. In addition to creating a password, it's required to create a ''customer service'' password, which must be no longer than 10 letters long and is not visible while typing it. So it's necessary to write out something the acceptable length and then type it in.3. There is also a requirement to buy a data plan whether one wants to or not. That should be optional and something a person could add if they decided they were going to need it.I wasn't buying this for the emergency features. Thank goodness. It's my personal opinion that I would want to see far better proof of the capicity for attention to detail by this company before I'd trust them with my well being.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is a very easy, efficient cell phone to use.",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "This is my second LIVELY cell phone.  I rely it to keep my life running smoothly.  I use it for contact, alarm clock, email., news, flashlight etc.  It is a fine phone for seniors.  Grace",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Phone for Cost",
      "date": "Reviewed in the United States on January 30, 2024",
      "body": "I am still learning about my new Jitterbug 3 phone.  Thus far, it seems to suit my basic needs which are texting, camera, and sending/receiving calls.  It has more features than I truly need or use, but I am slogging my way through internet use, and the screen configurations that are different from my old Jitterbug 2.  Tutorials in the phone are not always helpful, but going through them more than once sometimes pays off.",
      "helpfulVotes": 32
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My dad, Mostly Deaf at 83 does well with it.",
      "date": "Reviewed in the United States on November 6, 2023",
      "body": "I recently lost my mom to cancer - she was the tech one (if you can call it that at 82).  My dad hated all technology and, other than golfing, would spend his time watching the stocks roll across the bottom of the TV screen. Well, had to do something so purchased this phone and spent a week teaching him how to 'fax', meaning text. He is doing it, using the microphone to speak the messages back (I know as it spells my name wrong, lol). He is trying and that is really all can I ask for now before my next trip out to visit in another couple of days.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A simple, no frills, smartphone.",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "My wife is not tech-savvy and has no desire to be, but she wanted to upgrade her old flip phone without having to re-learn how to use it.  I ordered the Jitterbug for her and set it up.  She loves it, had very little trouble learning to use it, and it works perfectly.  She now prefers it over using our landline phone, a choice that she never believed she would make.  It's a great, no-frills, easy-to-use phone.",
      "helpfulVotes": 33
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works with Verzion network",
      "date": "Reviewed in the United States on March 14, 2023",
      "body": "Did not go with Lively but Net10. Verizon network.  Only problem I have is that the voicemail app does not work.  It is preinstalled by Lively.  If anyone knows how to override this let me know.  Have to dial *86 to get voicemail messages and set up the greeting.  You won't know that you have a message unless you see the missed call.  I am paying $20/month.  This is a great little phone I bought for my husband who cannot use a standard smart phone. Nobody that sees it knows that it's not a standard smartphone...so he looks smart!  If I didn't have a regular smartphone I would use this myself.",
      "helpfulVotes": 70
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My husband died before I could activate it.",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "Being a technically challenged senior citizen, I hoped this phone would be easy for my confused husband to use.  Unfortunately, activating the phone to begin with was an obstacle course for me.  The tech support at  Lively customer service was very helpful for me to get registered and get an account going.  But then I had to wait 11 days for the 'Welcome Kit' to arrive by snail mail.  Meanwhile my husband took a turn for the worse and passed away.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    hate this phone",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "have had nothing but trouble with this phone can't do anything about it because of the carrier",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was good! But not anymore",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "My 84 year old mom wanted to try an smartphone for the first time so I thought the jitterbug was perfect but when it updated she had to learn texting all over again! No easy! There are so many ads and junk on the screen I wish we would have bought her an iPhone. We are dissatisfied and disappointed!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "arrived timely....seems ok.....",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like the phone, not the company so much!",
      "date": "Reviewed in the United States on July 1, 2024",
      "body": "They start charging you for service about a week before your phone is in service .  Not right !!!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    On the fence about this one!",
      "date": "Reviewed in the United States on April 4, 2024",
      "body": "Bought this for my 78 yr old mom as her first cell phone ever! She is hard of hearing and not tech savvy at all. I first noticed the size, bigger than I expected, excellent size! The on/off and volume buttons are nice and large. The volume on speaker is LOUD lol ringtone volume so loud my daughter walked away. Excellent! I opted to take the offer on the enclosed info packet for self activation on website to save some bucks I highly do NOT recommend this!!! Activate and purchase plans with a live agent!!!! Keep in mind there is a ($25) activation fee regardless of how you activate it.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Grear for elderly",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "Nice phone great for 911 responseGreat prices and easy set up.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very difficult to use.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "It is not as easy use as advertised."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone!",
      "date": "Reviewed in the United States on September 1, 2024",
      "body": "I had an old, old version of this phone and it finally just wore out.  I decided to buy the newest model and I am so glad i did.  The battery holds its charge for days.  Easy to use and has the same great features as my first jitterbug.  Great choice for a great price.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad choice",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "The phone was defective. Sent it back,the replacement phone was uncomfortable to hold. I had to spend a lot of money to have it activated. Sorry I bought it. There are other phone companies that don’t charge for activation.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use for basic operations, but not satisfying for the tech-aware",
      "date": "Reviewed in the United States on May 29, 2023",
      "body": "Apparently intended for the elderly (or those who just aren't interested in high-tech), this phone is pretty easy to use for basic operations. Being something of a tech geek myself, I would not have been happy with it for my own use--but I got it for an elderly friend, and it serves her well.The company attempts to interest users in subscribing to a monitoring service that I consider rather pricey, but may be a fit for some people who are likely to be incapacitated by a fall, etc.",
      "helpfulVotes": 40
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty easy for an older person to figure out",
      "date": "Reviewed in the United States on June 6, 2023",
      "body": "I'm 76 and it's easy for me to use. I don't like the camera and photo part of it. I can never find photos or figure out how to send them. I've had Jitterbugs for many years. It's great to have for urgent calls. I don't think I'll buy it again. The reasons: Cost of monthly fees,  I can't answer my calls unless I swipe it 3-4 times, and I want more options now. It works great for my older friends in their 90's.",
      "helpfulVotes": 44
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought for elder relative...",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "Design and engineering not bad for basic talk & text features. A money saver.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "Much better than the jitterbug 3, now if they could make it with a five inch screen....",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not as simple as Smart 2",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "There are too many add ons that i did not want,  Had to go through each and deliete. It did not come with a car charger and i am having a hard time on  Amazon to find one that says Smart 3. Why it did not come with a car  charger i can not understand.  I spent several days getting used to all the bells and whistles.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Weak battery",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "I had to return the  new phone as the battery didn't hold a charge.  Lively did promptly replace the phone.  I appreciate the instruction booklet and ease in setting up the phone.  Hopefully the replacement will be O.K.  It is a bit inconvenient to make an extra trip to return the defective one but thankfully is possible.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is great for elderly",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "I like the less complicated format. The text and font and numbers are bigger. These things are essential for elderly people.My mother in law had a iPhone and it was starting to become too much for her. The Jitterbug is effective and easier for her to use. She is able to call and communicate with ease.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unimpressed",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "I bought this for my elderly mom hoping it would be simple and straightforward but it is not. Too many steps just to make a phone call and just pretty clumsy over all. For instance, it has fingerprint technology to open the phone but you have to place your finger on the tiny power button on the side of the phone, not the screen. Not so easy for an elderly person. If it had voice calling technology that would be great, but it doesn’t. They say it has google voice ability but if it does, I couldn’t find it and if I can’t find it my mom certainly can’t . I will be returning the phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the jitterbug.",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "Had one a few years ago and got a smart phone. Was I sorry. Went back to jitterbug. Program is easy to follow. Its larger than the oder model and texting is easier. Never should have changed.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not quite as easy as I expected",
      "date": "Reviewed in the United States on February 9, 2022",
      "body": "I bought this phone for my husband, who has Alzheimer's Disease, because I thought it would be really simple for him to work. (he previously had a flip phone.) To be honest, even I occasionally have trouble with it. I have an iphone. When it updates, it throws the whole phone off, and I have had to call support to help reset the apps so he can even use it. If this happens when he's alone, he won't be able to work it. He's not capable of calling to get help resetting it so it works again. That kind of defeats the purpose of him having this (simple) phone.It was a pain to port his old number, and took 3 days. They assigned him a new number in the meantime, but he's not able to learn new numbers, so if someone asked him for his phone number before his old number got ported, he had to say \"I don't know,\" or ask me if I was there.I'm not sure whether I would buy this again.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slim and good icons.",
      "date": "Reviewed in the United States on January 29, 2024",
      "body": "88 year old had to have sister in law aged 65 program phone.  He is still having trouble understanding its use.  Will have SIL come give him lessons.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use.",
      "date": "Reviewed in the United States on January 30, 2023",
      "body": "I keep it turned off most of the time.  I only use it when I want to text the children or go to a store where I have to let them know I am there to get curbside service or when traveling to keep in touch with the children.  I have only had the phone a month or so and have used it only to let the children know I have a new phone and give them the number.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wonderful but use their plan",
      "date": "Reviewed in the United States on August 29, 2023",
      "body": "This is a really good phone for the technology challenged however it is not comparable with most cell phone providers.  Spectrum would not accept it at all, Verizon wanted $80 and Tmobile told me that its likely to freeze up.  I think this is a great phone for those that want a prepaid service.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wish it was easier to use",
      "date": "Reviewed in the United States on April 24, 2023",
      "body": "I bought this phone for 102 yo aunt. I like that the phone was cheap. I wish it didn’t take 4 or 5 clicks to call someone using the easy set up mode. That is to many for her. I was able to load an app on the phone that makes it a lot easier for her to call someone with only 1 click to open the app and then one click on the picture of the person u want to call. I do like that it hooks up to here hearing aids, otherwise it is not loud enough even when on speaker. The ringer is not loud enough to get her attention so I wish that was louder.",
      "helpfulVotes": 50
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as easy as advetised",
      "date": "Reviewed in the United States on December 27, 2022",
      "body": "We are presently going through the process of activating this phone. Calls to Lively produced nice people, but the connection at their site made them difficult to hear. It's as though they are in an echo chamber or a large room. Activation requires several passwords many seniors may not have written down anywhere or may not even know they need one for the service. Did manage to access using it as a phone. More to come later.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's easy to start up.",
      "date": "Reviewed in the United States on January 24, 2024",
      "body": "I got it for my husband and his hands are always cold so he has a little trouble getting it to do what he wants.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "This is a great product for anyone but especially for someone who struggles with technology.",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Phone for Seniors? No.",
      "date": "Reviewed in the United States on September 24, 2022",
      "body": "This was a gift for my grandmother. She kept eyeing my phone. And ironically her 10+ yr old FLIP phone stopped working. She had seen an add for a cellular starting to be suitable for seniors so we investigated and and I got her the Jitterbug and a pretty case. She really thinks she's hot stuff now even though she still can't work it! But she looks awfully cute with it!",
      "helpfulVotes": 52
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good deal",
      "date": "Reviewed in the United States on October 27, 2024",
      "body": "It's a phone for seniors. What more can be said",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ease to use",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "very easy to use nice big screen",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Yes, it was as advertised.",
      "date": "Reviewed in the United States on April 10, 2022",
      "body": "Only a couple of drawbacks:  I can't speak a text message and see it in printed form - only an actual voice message; Two, the camera on this phone isn't as clear and good as I'd like it to be.  Third, I receive over a hundred texts a day from Lively to sign up for the emergency service number.  That is a nuisance - even though in an e-mail I told them to stop that chronic message.",
      "helpfulVotes": 76
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Tech Support",
      "date": "Reviewed in the United States on December 29, 2022",
      "body": "My 93 year old mom loves her Jitterbug. This one was a replacement for an old one that she’d had for several years and just started to have some issues. I was tempted to get an Apple but she had been so pleased with the Jitterbug, I purchased this one. Called support for help setting up the new one twice (not that it was difficult, but b/c I’m not that tech savvy) and both times  there were minimal wait times and both reps (Sara and Emma) were very patient and helpful. The phone actually arrived earlier than expected so mom got it before Christmas.  The price, device, support make the Lively Jitterbug a good choice.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for your favorite elder",
      "date": "Reviewed in the United States on December 16, 2023",
      "body": "Purchased for my 86 year old roommate and shenloves it. Its simple for her to use as she can see the screen very clearly.  Its loud enough that she can hear the ring tone and she was able to text for the first time.Setup was easy no issues.  I did a test call to customer service and while i had to have them call me back they did so within 10 minutes.Highly recommend",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    returned not what I expected....nice product",
      "date": "Reviewed in the United States on February 11, 2024",
      "body": "personal  use...being 93 I felt it was more phone than I could handle...my error.  also commsumdf cellar was my provider and Lively is more expensive.  all this technology is not easy sos I am sticking with what I know. thank you..good product, excellent Amazon service delivery as alwalways...thank you",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone At A Bargin Price",
      "date": "Reviewed in the United States on February 23, 2023",
      "body": "Getting older, downsizing and had more phone than I used or needed. I was surprised at how easily it was to set up & use. Of course there is a learning curve to any electronics that are new, this was about two days. But I made texts & calls the next hour. The technical people were friendly & helpful.  The best thing about the Jitterbug Smartphone 3 even if you're not a senior is that you get all the bells & whistles of a basic phone for a much lower cost. I have recommended it to all my skeptical friends. You'll be pleasantly surprised.",
      "helpfulVotes": 39
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst buy of a lifetime",
      "date": "Reviewed in the United States on November 2, 2022",
      "body": "This is supposed to be easy to use.  Yes, there are many other bad reviews, but somehow I was hopeful and tried it anyway.  It's my third cell phone, and the only one that I may have to return or throw into the trash.  First of all, to set it up, you're supposed to call a certain phone number.  But when you dial that number, all you get is a recording that says the number is out of service.  Then, somewhere in the instruction booklet, I found a second phone number, but that number gave the same result as the first one.  So I called their Customer Service.  That person managed, after about an hour, and with some difficulty, to connect me to a \"set-up specialist\" with whom I spent two or three hours on the phone.  Finally she said my phone was ready to go.  But it wasn't.  It still won't receive incoming calls.  It's advertised as \"simple,\" but it's by far the most ridiculously complicated and impossible to use of any phone I've tried.  I will be either returning it or tossing it into the trash.",
      "helpfulVotes": 301
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great for him",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "My husband loves that he said it is so easy to use. He's very very happy.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a good phone for my elderly mom",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "Bought this in Jun hoping it would be  easy for my mom to use. I have tried for over a month to make it work but this thing has proven to be more difficult then any other phone we have in the family to keep operating. Since it is now late July (and the return window has closed) I will probably just toss this in the trash and go to another phone for her.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really good, simple-to-use smart phone for a modest price",
      "date": "Reviewed in the United States on November 8, 2022",
      "body": "This is my first smart phone (having owned a simple flip phone for years), and so I wanted something simple-to-use and not too expensive.  The monthly fee is not cheap but not expensive either.  It's very easy to set up and extremely easy if you don't keep your old phone number.  If you keep your previous number, it will take much longer to activate.  I chose a new random number, and it was working within an hour.  I highly recommend this item to anyone who wants a phone that is easy to use and that won't put too much strain on your finances.",
      "helpfulVotes": 45
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    text messages, etc.",
      "date": "Reviewed in the United States on December 6, 2023",
      "body": "it doesn't always tell me I have text messages waiting and doesn't always shut off when I tell it to but rather asks me do I want to reboot....Doesn't allow me to hear voice mail even though I have it set to do so.....had to reinstall all contacts as Lively couldn't do it.....",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lively no longer activates IPhones, period.",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "Well G O L L Y - - - I ordered this at the end of June, granted it took me a while to think about activating it - but still, I just got off the phone with the people at Lively - Jitterbug - and he told me that they stopped doing IPHONES nearly a year ago.  AND just how would I know this ??????  There is no way anyone could know this, in fact, I chatted with a guy there in June and told him of my situation and he's the one that advised me to purchase an IPHONE and call him back - yes, all at the Lively 800 number.  What a mess and not a super big deal if you don't mind flushing $72.00 down the drain all because it won't work with any other carriers and can't be returned after 30 days - - - - makes me kinda sick.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Guarantee of product",
      "date": "Reviewed in the United States on January 11, 2024",
      "body": "Lively is taking care of me",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect",
      "date": "Reviewed in the United States on August 12, 2024",
      "body": "Organized in a fashion to help my 92 year old mother use technology in today’s world.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on August 29, 2024",
      "body": "Gave as a gift and they love it,works great,easy to use",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitter Bug Phone - waste of money",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Have had this phone 6 months it has been nothing but problems.  Ringer goes to do not disturb automatically so I don’t receive calls.  I don’t get notification of voicemail messages; I have to press star 86 to get any voice messages - many messages are are never received .  Customer service has never resolved any of my issues or offered to replace this unusable phone and I have called them many times.  Is this a good phone for seniors? I would not recommend it to anyone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    activation",
      "date": "Reviewed in the United States on July 2, 2023",
      "body": "not activated an blind can't call as no direct person just screening doesn't work on other phone. i have a acct just need to add and remove old but can't call becaa]use of screening need direct line. its a simple thing to add and remove but login to acct and no way to add new phone? i scanned label at 500x to see but number are close together?",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for Non-Tech User",
      "date": "Reviewed in the United States on March 6, 2023",
      "body": "This replaced my flip-phone & I could not be more pleased. I am \"tech challenged\" & setup was a breeze. All functions are easy to use without trying to interpret numerous icons found on most Android phones. Texting is a night & day improvement compared to the flip-phone. The camera, maps & directions work perfectly. Was able to enter my contacts in minutes.  When I show friends how easy it is to navigate, most responses are that they want this Jitterbug instead of their non-user friendly I-Phone.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of the difference between the Smart2 and Smart3",
      "date": "Reviewed in the United States on December 17, 2021",
      "body": "After the battery on our second Smart2 began expanding, bulging the case - that's after three years of use - I bought the Smart3. After activation and transporting the Smart2 contents, I discovered that the new Smart3 requires a 6-step process to delete contacts, something the Smart2 did from the simplified home screen. I've brought this up with Lively and am waiting for a work-around, if one exists. Otherwise, both my wife and I are happy with the Jitterbug/GreatCall/Lively/Best Buy experience. Seems that the technology on these phones lasts a couple of years before something breaks or a newer version supercedes this inexpensive phone. I'm probably not the only one yearning for a simple smartphone.",
      "helpfulVotes": 71
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value",
      "date": "Reviewed in the United States on December 24, 2023",
      "body": "Price can't be beat! Some problems with the ringer.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for older people",
      "date": "Reviewed in the United States on June 1, 2024",
      "body": "Gives them exactly what they need and for the extra money you have peace of mind that they have alert button for ambulance on cell, works the same as any smartphone",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works good",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "And it was lower priced than most..",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    haven't one",
      "date": "Reviewed in the United States on August 6, 2023",
      "body": "liked the simplicity of operation. But in some cases just a little road track to get, in my case, to where I wnted to be",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nicely simple phone, but does NOT have the feature to limit callers to those in address book.",
      "date": "Reviewed in the United States on January 26, 2024",
      "body": "I got the phone for someone starting down the dementia/alzheimers route because all the features, buzzing of alerts we could not seem to keep turned off on her android was driving her crazy -- BUT we were able to block out callers who were not in her address book which is good for keeping scammers and dubious salespeople away from her.the jitterbug phone VERY nicely is simple and straightforward for her to use, but if the blocking of unknown callers is a need you have, don't get it till they offer it.  I will be getting rid of the phone because the lack of this feature.",
      "helpfulVotes": 39
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I DON'T  THINK IT'S  'SR-FRIENDLY'",
      "date": "Reviewed in the United States on April 16, 2022",
      "body": "I was FOREVER  hitting the Emergency  key.And You can  FORGET  all the features,  You're  used to, because  nothing  is where You're used to it being.I GLADLY  returned it, but  only  after  more than 2 weeks of hassles. trying  to get through the channels, of RED TAPE , REPETITIVE  QUESTIONS,  and 90% of it, by online  CHATTING.It wasn't until  I  got  forceful,  that  I actually  spoke  with a VERBALLY  LIVE PERSON.I got  so frustrated,  I  GLADLY  gave them the PROTECTIVE  case too.It just  wasn't worth  any other  red tape.Has Anyone else  noticed,  that it takes an ACT OF CONGRESS , to actually  SPEAK  TO  SOMEONE,  nowadays?PLEASE  DON'T  BOTHER,  with this phone,  unless it's  Your  VERY FIRST  CELL,  EVER.Remember that  I'm  reviewing the LIVELY SMART PHONE,  not the  RED JITTERBUGSincerely,  Maggie",
      "helpfulVotes": 31
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The marketing might be great but the phone is a nightmare",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "We bought this phone for my older adult mother who has mild dementia because her IPhone had so many features she was getting a bit lost in it. Rather than get her a new IPhone we researched the best options for older adults and watched all the lively videos. What can I say the marketing is amazing. We learned quickly that is where the amazing ends. The phone arrived and there were challenges with their website porting the number. We should have stopped there and RUN back to Verizon. While the home screen is great, NONE of the actual features are. We connected her hearing aid but when it disconnects, reconnecting to Bluetooth is not easy. The phone locks every two minutes and the button on the side is tiny and by the time she swipes up it tells her face recognition didn't work so she still needs to enter a pin. She was in tears and feels like this is all her fault. When she gets it to work, she can call us, she can't text, and she also can't hear when it moves audio sources, nor can she figure out how to move it back as she could on her Iphone. Meanwhile, I knew exactly where she was with find my phone and could see \"read\" messages on her texts even if she didn't respond. Do NOT purchase this phone if you have a loved one who needs something that is easy to use. We have ported the number and bought this fairly useless phone, but we are ready to bite the bullet two days in and go back to Verizon with a new Iphone on accessibility mode. Save yourselves and your older adult parents from endless frustration and a fairly useless phone. They might have amazing marketing, but their product is far from that.",
      "helpfulVotes": 34
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "This phone works okay.  I have had to restart it a few times in the first week I've had it because it glitches sometimes and won't respond to anything.  Not completely happy with it.  Apps that I put on the home page don't stay there and I have to keep putting them back.  That's kind of irritating.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT a good phone for someone who has short-term memory issues!",
      "date": "Reviewed in the United States on November 28, 2023",
      "body": "The Jitterbug Smart3 phone is heavily marketed to appeal to caregivers buying a simpler smartphone for a loved one diagnosed with one of the dementias. My husband has mild cognitive impairment with short-term memory loss. He is still mobile, dresses and feeds himself, reads the paper, and watches TV daily. However, I was surprised to discover that the Jitterbug Smart3 actually is MORE DIFFICULT and TAKES MORE STEPS to use to make and answer phone calls, open and reply to emails, send texts, and listen to voicemails than on my normal Android smartphone.For example, for my husband to call me, he has to remember one of three ways to place a phone call.Make a Call Option 1: From the main screen, he has to tap Dialpad and then enter my phone number (including area code) from memory using the dialpad, then tap Place Call.Make a Call Option 2: From the main screen, he has to tap Contacts, find my saved name on the Call History list, tap my name, and then tap Place Call.Make a Call Option 3: From the main screen, he has to tap Phone, then tap Call History, find and then tap my name and phone number, and then tap Place Call.With his short-term memory loss, all three options proved impossible for him to remember and reliably perform, even with written instructions.Answering incoming calls is too complicated for him as well. When a call comes in from someone on his approved caller list, their name appears on the screen. However, to answer the call, he has to PRESS AND HOLD the Phone Icon button, then while pressing down on the button, push his finger up to Answer or down to Ignore. It's too many steps that must be performed perfectly in sequence just to answer a phone call.And don't get me started on how easy it is for him to accidentally press the red Urgent Response button that is at the top of the Home screen and is very easily accidentally tapped or pressed while working elsewhere on the Home screen. Once the Urgent Response button is accidentally pressed, it automatically calls a Lively Response Agent who then calls you on your phone first to ensure your loved one is actually having an emergency. My husband's palm or fingertips holding the phone accidentally pressed the Urgent Response button several times. There's no way to deactivate the Urgent Response button and once it's accidentally pressed, there's no way to stop the Lively emergency team from being contacted. This is a definite design flaw that there's no way around.Despite multiple practice sessions over several weeks, the multiple steps to complete the simplest activities on the Jitterbug Smart3 were just too much for my husband to recall and perform. It frustrated him terribly and it frustrated me too. I finally had to give up and buy him an even simpler phone that is much easier for him to use and is much more intuitive to operate compared to a Jitterbug Smart 3. He's now doing fine calling me and answering calls with his second simpler phone.If you think the Jitterbug Smart3 phone is going to be easier and more straightforward for your loved one with cognitive impairments to use, it is NOT easy and it is NOT straightforward. There are more steps required to perform the simplest phone actions than on my normal smartphone, and worse, the steps to follow are not intuitive. For someone like my husband with almost no short-term memory and logic processing issues, the Jitterbug Smart3 proved to be a complete waste of my money and time.I hope this detailed review helps you avoid the expensive mistake I made.",
      "helpfulVotes": 114
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Important info for elderly",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "The Jitterbug Lively 4 phone does not have a \"Lift to Wake\" option. That means if you want to use the phone, you have to push the power button on the side for the screen to turn on. I bought this phone for my elderly mother and small power button on the side of the phone is very hard for her to find and press.This is important to know for anyone using the phone that has declining dexterity. I'm especially concerned that my mother has a medical emergency she'll have to find and press the button before she could use the phone. I am disappointed that a phone made for elderly people doesn't have a work around for this.Just for clarity, if the phone receives a call the screen does turn on automatically. But if she tries to initiate using the phone, the only way to turn the screen on is to push a small and hard to see power button on the edge of the phone.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hope for the future.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Too complicated to start up. The potential customer got confused by the phone assistant . You should have a phone call set up for use and all the customer has to do is call in to activate the unit and get the phone number. Or better still have their old number if available activated.All by provision of a charge card."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I was excited to have an easy cell phone",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "I am older and cell phones are to difficult for me so this looked like the \"cats meow\".  I was really turned on to see something so simple to use.  But when I went to Comcast to sign up for carrier service, they denied me for some reason which I didn't understand, and they sold me a inexpensive Motorola phone with their service.  The downloaded operating manual was 120 pages.  It will take me years to learn how to operate this.  I'm glad I learned how to do mathematics in school.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for seniors but longevity a problem!",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "This was my 2nd Jitterbug purchase.  The upgraded features from the Smart 3 to the Smart 4 were substantial.  As my 1st cellphone experience at 80 yrs. old I had some navigation issues, but found the manual & customer svc, helpful.  The only negative issue is with the longevity of the phones.  My 1st lastest approx. 1 yr & the 2nd ony 6 mos. & losing all my conntacts & photos disappointing.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good - mostly",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "Product satisfies most of my 88year old needs and is easy to navigate through the various apps/services.  I especially like the Voice Typing feature for texting and the Voice Assistant for answering almost any question I have about anything.  What I don't like is that there is no way to text an announcement or invitation or any message  to a group of recipients; you have to text the same message to each individual.  There's also a very annoying practice of interrupting the playing of one of their game apps to promote another game app; happens periodically and not easy to stop and return to the game you're playing.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Interface wasn't useful if you're blind",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "While the interface allowed you to set the size and dark mode settings, it didn't allow you to modify the background for the icon.  If you notice the call icon or message icon will always have a white background.  It would be more useful if you had the option for putting the icon on a black background with yellow lettering so users with limited visibility could better distinguish the differences.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOOSE CHARGER CABLE Causes SLOW Charging & Pops Out Easily.  Same with Replacement Charger.",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I WAS!  After letting it sit for three hours to charge the battery...or so I thought...I found that it was still at 50%.  I disconnected it and then tried again.  This time a message appeared onscreen telling me I was using a SLOW CHARGER...and that I should use the charger that came with the phone.  I WAS using the one that came with the phone!  I then phoned Customer Support.  After wading through the prompts, a recording told me someone would assist me in \"30 seconds.\"  Over the course of the next 12-13 minutes, I heard this recording THREE TIMES!  I finally phoned Amazon to complain.  The Amazon customer service rep could tell I was upset.  Her solution to the problem was satisfactory.  I had spent 2 or 3 hours earlier today just setting the thing up.  Now I'll have to do it all over again tomorrow.  I had a Jitterbug Smart2 which provided several years of service before needing to be replaced.  What's happened to that company?  UPDATE:  The phone, itself, appears to be okay.  It's the high-speed charging cables that appear to be the problem.  Had the same problem with a replacement.  You have to jam them in HARD, and then hold your breath...and very GENTLY put the phone own on a flat surface.  Don't STARE at it!  Staring at it may be enough to cause the cable to pop out.  Just tiptoe out of the room.  If you come back an hour later and the screen says, \"slow charging,\" you'll know that someone probably looked at it.  Or maybe a housefly flew by and the air turbulence caused by its flapping wings dislodged the charger.  Easy to understand why the Jitterbug Smart4 is marked down to only $71.  Why doesn't the company just fix the charging cables so they fit SECURELY into a Smart4's USB charging port?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst customer service and Company Ever!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I have never wrote an Amazon review before but thought this terrible company was worthy!Maybe the worst customer service ever! Maybe worst company ever! This is the phone you buy your mom when her smart phone has finally outsmarted her. I thought this was the phone that we could get some peace knowing that 24/7 she could pick up this phone and there would be someone on the other end to help, wrong. What if I’m having an issue with my phone on Sunday? Sorry we’re closed!  Scan this code to for help setting up your phone….as long as it’s during normal business hours. Did I mention that according to the recorded message they only answer phone calls during normal Monday - Friday business hours. Did I mention how easy the setup is using the handy manual the worst company provides, very vague and often just flat wrong information.  of The most frustrating part of the set up for me is that to do a phone to phone transfer is you need a cable, they suggest the charging cable….how stupid can you be ! You can not use a charging cable to do data transfer, They Are Not The Same Thing! You do have the option to do a wireless transfer but that failed multiple times …. If only there was a help line you could call for advise. Had to go to Verizon and buy a data transfer cable for and additional $40. Since no one has any issues on the weekend we gave up and will resume with the worst company and support system that Amazon has to offer…. The Worst!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wanted easy toUse phone for husband with dementia. This worked like iphone",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Dementia patient. Sent item back",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impossible for my father to turn on",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "The phone is easy to use and I think overall it's functionality is great for most people.  However, my father has difficulty with his hands to begin with and his sense of touch is pretty much gone.  The phone requires that you push a button on the side (a very low profile button that matches the rest of the phone), to bring it to life, and my father cannot find the button to turn it on.  It also requires a swipe up to get to the screen, which again, is difficult for my father.  We will continue to use the old iPhone SE which has a button, and the ability to get rid of the lock screen for him.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitterbug phone",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Doesn't offer access for additional SD card to expand storage. The only disappointment. Otherwise great phone for seniors."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not so easy",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "I got this phone for my daughter, who has special needs.  Thought it would be easy.  Not!  Hand to set up.  Had my son, who is a pro at that sort of thing, do it.  It took him quite a while and a phone call.As for the phone, she likes the pre installed APS . But adding to them is problematic.  I have a Google phone and like it way better.She can call me easily, however, which is really why we got it.  Not an easy phone.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitterbug. I'm returning this.",
      "date": "Reviewed in the United States on October 12, 2023",
      "body": "I went to activate my phone, got all the way through, about to finalize and found this:''Handset Activation Fee$25.00''There was nothing about this that I saw prior to ordering. It's infuriating.Other annoyances:1. The instructions called for typing in the serial number, which was said to be on the sticker attached to the side of the box or on the ''activation card.'' What activation card? The only number there was useless. I got a message saying something to the effect of ''We're unable to find a device with that serial number. Please try again.''I tried again. Same result.To get the correct number, I had to moisten the sticker so it could be removed. The correct number is printed on the box.I let them know what I had to do. The response I got was to the effect of \"Yes. That's the correct serial number.'' No explanation for their error, no apology for my inconvenience.2. In addition to creating a password, it's required to create a ''customer service'' password, which must be no longer than 10 letters long and is not visible while typing it. So it's necessary to write out something the acceptable length and then type it in.3. There is also a requirement to buy a data plan whether one wants to or not. That should be optional and something a person could add if they decided they were going to need it.I wasn't buying this for the emergency features. Thank goodness. It's my personal opinion that I would want to see far better proof of the capicity for attention to detail by this company before I'd trust them with my well being.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My husband died before I could activate it.",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "Being a technically challenged senior citizen, I hoped this phone would be easy for my confused husband to use.  Unfortunately, activating the phone to begin with was an obstacle course for me.  The tech support at  Lively customer service was very helpful for me to get registered and get an account going.  But then I had to wait 11 days for the 'Welcome Kit' to arrive by snail mail.  Meanwhile my husband took a turn for the worse and passed away.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    hate this phone",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "have had nothing but trouble with this phone can't do anything about it because of the carrier",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was good! But not anymore",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "My 84 year old mom wanted to try an smartphone for the first time so I thought the jitterbug was perfect but when it updated she had to learn texting all over again! No easy! There are so many ads and junk on the screen I wish we would have bought her an iPhone. We are dissatisfied and disappointed!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "arrived timely....seems ok.....",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    On the fence about this one!",
      "date": "Reviewed in the United States on April 4, 2024",
      "body": "Bought this for my 78 yr old mom as her first cell phone ever! She is hard of hearing and not tech savvy at all. I first noticed the size, bigger than I expected, excellent size! The on/off and volume buttons are nice and large. The volume on speaker is LOUD lol ringtone volume so loud my daughter walked away. Excellent! I opted to take the offer on the enclosed info packet for self activation on website to save some bucks I highly do NOT recommend this!!! Activate and purchase plans with a live agent!!!! Keep in mind there is a ($25) activation fee regardless of how you activate it.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very difficult to use.",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "It is not as easy use as advertised."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad choice",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "The phone was defective. Sent it back,the replacement phone was uncomfortable to hold. I had to spend a lot of money to have it activated. Sorry I bought it. There are other phone companies that don’t charge for activation.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought for elder relative...",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "Design and engineering not bad for basic talk & text features. A money saver.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not as simple as Smart 2",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "There are too many add ons that i did not want,  Had to go through each and deliete. It did not come with a car charger and i am having a hard time on  Amazon to find one that says Smart 3. Why it did not come with a car  charger i can not understand.  I spent several days getting used to all the bells and whistles.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Weak battery",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "I had to return the  new phone as the battery didn't hold a charge.  Lively did promptly replace the phone.  I appreciate the instruction booklet and ease in setting up the phone.  Hopefully the replacement will be O.K.  It is a bit inconvenient to make an extra trip to return the defective one but thankfully is possible.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unimpressed",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "I bought this for my elderly mom hoping it would be simple and straightforward but it is not. Too many steps just to make a phone call and just pretty clumsy over all. For instance, it has fingerprint technology to open the phone but you have to place your finger on the tiny power button on the side of the phone, not the screen. Not so easy for an elderly person. If it had voice calling technology that would be great, but it doesn’t. They say it has google voice ability but if it does, I couldn’t find it and if I can’t find it my mom certainly can’t . I will be returning the phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not quite as easy as I expected",
      "date": "Reviewed in the United States on February 9, 2022",
      "body": "I bought this phone for my husband, who has Alzheimer's Disease, because I thought it would be really simple for him to work. (he previously had a flip phone.) To be honest, even I occasionally have trouble with it. I have an iphone. When it updates, it throws the whole phone off, and I have had to call support to help reset the apps so he can even use it. If this happens when he's alone, he won't be able to work it. He's not capable of calling to get help resetting it so it works again. That kind of defeats the purpose of him having this (simple) phone.It was a pain to port his old number, and took 3 days. They assigned him a new number in the meantime, but he's not able to learn new numbers, so if someone asked him for his phone number before his old number got ported, he had to say \"I don't know,\" or ask me if I was there.I'm not sure whether I would buy this again.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wish it was easier to use",
      "date": "Reviewed in the United States on April 24, 2023",
      "body": "I bought this phone for 102 yo aunt. I like that the phone was cheap. I wish it didn’t take 4 or 5 clicks to call someone using the easy set up mode. That is to many for her. I was able to load an app on the phone that makes it a lot easier for her to call someone with only 1 click to open the app and then one click on the picture of the person u want to call. I do like that it hooks up to here hearing aids, otherwise it is not loud enough even when on speaker. The ringer is not loud enough to get her attention so I wish that was louder.",
      "helpfulVotes": 50
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    returned not what I expected....nice product",
      "date": "Reviewed in the United States on February 11, 2024",
      "body": "personal  use...being 93 I felt it was more phone than I could handle...my error.  also commsumdf cellar was my provider and Lively is more expensive.  all this technology is not easy sos I am sticking with what I know. thank you..good product, excellent Amazon service delivery as alwalways...thank you",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst buy of a lifetime",
      "date": "Reviewed in the United States on November 2, 2022",
      "body": "This is supposed to be easy to use.  Yes, there are many other bad reviews, but somehow I was hopeful and tried it anyway.  It's my third cell phone, and the only one that I may have to return or throw into the trash.  First of all, to set it up, you're supposed to call a certain phone number.  But when you dial that number, all you get is a recording that says the number is out of service.  Then, somewhere in the instruction booklet, I found a second phone number, but that number gave the same result as the first one.  So I called their Customer Service.  That person managed, after about an hour, and with some difficulty, to connect me to a \"set-up specialist\" with whom I spent two or three hours on the phone.  Finally she said my phone was ready to go.  But it wasn't.  It still won't receive incoming calls.  It's advertised as \"simple,\" but it's by far the most ridiculously complicated and impossible to use of any phone I've tried.  I will be either returning it or tossing it into the trash.",
      "helpfulVotes": 301
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a good phone for my elderly mom",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "Bought this in Jun hoping it would be  easy for my mom to use. I have tried for over a month to make it work but this thing has proven to be more difficult then any other phone we have in the family to keep operating. Since it is now late July (and the return window has closed) I will probably just toss this in the trash and go to another phone for her.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    text messages, etc.",
      "date": "Reviewed in the United States on December 6, 2023",
      "body": "it doesn't always tell me I have text messages waiting and doesn't always shut off when I tell it to but rather asks me do I want to reboot....Doesn't allow me to hear voice mail even though I have it set to do so.....had to reinstall all contacts as Lively couldn't do it.....",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lively no longer activates IPhones, period.",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "Well G O L L Y - - - I ordered this at the end of June, granted it took me a while to think about activating it - but still, I just got off the phone with the people at Lively - Jitterbug - and he told me that they stopped doing IPHONES nearly a year ago.  AND just how would I know this ??????  There is no way anyone could know this, in fact, I chatted with a guy there in June and told him of my situation and he's the one that advised me to purchase an IPHONE and call him back - yes, all at the Lively 800 number.  What a mess and not a super big deal if you don't mind flushing $72.00 down the drain all because it won't work with any other carriers and can't be returned after 30 days - - - - makes me kinda sick.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitter Bug Phone - waste of money",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Have had this phone 6 months it has been nothing but problems.  Ringer goes to do not disturb automatically so I don’t receive calls.  I don’t get notification of voicemail messages; I have to press star 86 to get any voice messages - many messages are are never received .  Customer service has never resolved any of my issues or offered to replace this unusable phone and I have called them many times.  Is this a good phone for seniors? I would not recommend it to anyone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    activation",
      "date": "Reviewed in the United States on July 2, 2023",
      "body": "not activated an blind can't call as no direct person just screening doesn't work on other phone. i have a acct just need to add and remove old but can't call becaa]use of screening need direct line. its a simple thing to add and remove but login to acct and no way to add new phone? i scanned label at 500x to see but number are close together?",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware of the difference between the Smart2 and Smart3",
      "date": "Reviewed in the United States on December 17, 2021",
      "body": "After the battery on our second Smart2 began expanding, bulging the case - that's after three years of use - I bought the Smart3. After activation and transporting the Smart2 contents, I discovered that the new Smart3 requires a 6-step process to delete contacts, something the Smart2 did from the simplified home screen. I've brought this up with Lively and am waiting for a work-around, if one exists. Otherwise, both my wife and I are happy with the Jitterbug/GreatCall/Lively/Best Buy experience. Seems that the technology on these phones lasts a couple of years before something breaks or a newer version supercedes this inexpensive phone. I'm probably not the only one yearning for a simple smartphone.",
      "helpfulVotes": 71
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nicely simple phone, but does NOT have the feature to limit callers to those in address book.",
      "date": "Reviewed in the United States on January 26, 2024",
      "body": "I got the phone for someone starting down the dementia/alzheimers route because all the features, buzzing of alerts we could not seem to keep turned off on her android was driving her crazy -- BUT we were able to block out callers who were not in her address book which is good for keeping scammers and dubious salespeople away from her.the jitterbug phone VERY nicely is simple and straightforward for her to use, but if the blocking of unknown callers is a need you have, don't get it till they offer it.  I will be getting rid of the phone because the lack of this feature.",
      "helpfulVotes": 39
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I DON'T  THINK IT'S  'SR-FRIENDLY'",
      "date": "Reviewed in the United States on April 16, 2022",
      "body": "I was FOREVER  hitting the Emergency  key.And You can  FORGET  all the features,  You're  used to, because  nothing  is where You're used to it being.I GLADLY  returned it, but  only  after  more than 2 weeks of hassles. trying  to get through the channels, of RED TAPE , REPETITIVE  QUESTIONS,  and 90% of it, by online  CHATTING.It wasn't until  I  got  forceful,  that  I actually  spoke  with a VERBALLY  LIVE PERSON.I got  so frustrated,  I  GLADLY  gave them the PROTECTIVE  case too.It just  wasn't worth  any other  red tape.Has Anyone else  noticed,  that it takes an ACT OF CONGRESS , to actually  SPEAK  TO  SOMEONE,  nowadays?PLEASE  DON'T  BOTHER,  with this phone,  unless it's  Your  VERY FIRST  CELL,  EVER.Remember that  I'm  reviewing the LIVELY SMART PHONE,  not the  RED JITTERBUGSincerely,  Maggie",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jitterbug Phone",
      "date": "Reviewed in the United States on December 1, 2022",
      "body": "I haven't learned how to use it yet. I haven't had a cell phone for 3 years and this one is so different  that I'm having a hard time learning it. I'm 84 years old and I have problems learning things.  They said it was very easy and I didn't believe them and still don't , I've been thinking of sending it back and just get a flip phone. I'm still undecided right now. I haven't used it at all yet.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Know what you are getting",
      "date": "Reviewed in the United States on April 11, 2024",
      "body": "Need refund phones want work. JOHN West",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be aware of them nickel and diming you",
      "date": "Reviewed in the United States on October 8, 2023",
      "body": "As someone else had mentioned the first thing they do is charge a $38.12 to do an activation. The salesperson pushed the 1GB of data that cost $10. I told him I didn't need it because I have intentions of going on the Internet with this phone. But still he was pushy so I let it go. I just called lively and asked them to drop that they said in order to drop it I would have to go to and use a flip phone.I can't use the flip phone I have no use in my fingers. Anyways she did cut it down the $5 for the minimum data and again even though I have no use for any data at all. This phone was bought for emergency purposes only. Meaning when we have no electricity I don't have any Internet. Which in turn leaves my landline phone dead. Even wit backup battery hooked up I still couldn't use VOIP landline.Other than that I have nothing else to say i'm just fuming because I hate when companies have to nickel and dime people.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    . I feel a bit decieved",
      "date": "Reviewed in the United States on June 8, 2023",
      "body": "Still navigating the set up. Not sure if I like this product or if I want to switch from consumer cellular. I thought the jitterbug was through consumer cellular, not Lively. I thought I ordered 1 phone and received and was billed for 2, but I did not realize it until I received the product.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cannot take this phone to other carriers.",
      "date": "Reviewed in the United States on February 18, 2022",
      "body": "Bought for my 87 yr old mom. Had no desire to deal with Lively’s service and excessive costs. Took phone straight to AT&T to set up. Store clerk put in a new SIM card, and was able to get the phone on my account. He had to make their system think it was an older iPhone version, and it works great.Phone displays a set up error “Something’s wrong” Insert a SIM card. You need a SIM card to finish setup. Please insert a SIM card. Code: 01Called Lively, rep informed me the phone is not compatible with other providers. He went on to say, he has never seen it work elsewhere. He told me to go back to AT&T, or talk to Lively’s support reps.Figured I would check with their support 1st. Was told, I am not a (paying) customer, and they would not be able to offer any support. Any troubleshooting to be done on/with the phone would be have to be done by AT&T.They rig their phones to be used with Lively & only Lively.I have no experience with their service, and reading various reviews here & elsewhere… I have no desire to use there service.It has been too long to return. Will find a place to donate it.Got a iPhone SE instead.",
      "helpfulVotes": 84
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smart 4",
      "date": "Reviewed in the United States on February 3, 2024",
      "body": "This phone is supposed to be easy for a blind person.I purchased it for my totally blind husband. we have to called every day because the play start sound doesn’t work or if it does only lasts for a day..We have to reset it by calling the number listed but half the people we talk to don’t know how to fix it….They shouldn’t be working there sometimes they hang up on me…not good customer service…The phone shouldn’t have been released until it works perfect",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not impressed",
      "date": "Reviewed in the United States on October 16, 2023",
      "body": "Did much research before purchasing this phone for my 85 yr old Mother.  It is really not much different from other phones. It's only means  of simplifying is to give what limited things you can do in list form instead of icon form.  It is a very basic phone but if you aren't in need of the emergency services, it doesn't offer much by way of making things very easy for an elderly person to operate.  In fact, there are more steps to make a phone call then on a regular phone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Advertisement did not specify clearly the add on charges",
      "date": "Reviewed in the United States on March 20, 2023",
      "body": "I didn’t like pressing the on button constantly to bring up the ( or open) screen. Also type plan was not fully explained. All I needed was a 2nd phone purposely to make&receive calls as well as text. The ad about  paying $19.95 or $14.95 per month plus tax is confusing.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT BUY THIS PRODUCT!",
      "date": "Reviewed in the United States on May 3, 2022",
      "body": "Bought this phone for my 82 year old mother. Terrible Lively customer service experience! Multiple calls to the activation line, left on hold for extended periods of time and dropped connections. Voice greeting recording said they were \"busy\". Once I finally got to a real live body, the female agent was polite but refused to activate the new Jitterbug 3 because, according to their Website/Zip Code entry, there wasn't any cell phone service in the community where my mother lives. Not true! Lively operates off the Verizon network and I'm a Verizon customer. I used my cell phone to talk to the agent! Anyway, after some pleading to activate the phone using my zip code instead of my mother's zip code, they still would not activate the phone. I even tried to explain that my mom has WiFi and travels thus would not need a cellular connection where she lives. Not good enough. I suspect they probably wanted to sell me the \"Health & Safety Package\" which requires a cellular connection. Overall this was simply a terrible customer service experience and had I known the process was so restrictive, I would not have purchased this product in the first place. Buyer beware! Do your homework and some Internet research. Plenty of other unhappy Lively customers out there.",
      "helpfulVotes": 78
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not completley compatable with Jitterbug 3 Smart Phone",
      "date": "Reviewed in the United States on March 28, 2023",
      "body": "I bought this for my wife's Jitterbug 3 Smart Phone. This fits the phone quite well, except it does not have a provision for the Google Assistant Button on the left side of the Jitterbug 3, otherwise I would have given it 5 stars.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10 working days to transfer number ?",
      "date": "Reviewed in the United States on August 10, 2023",
      "body": "After  going through set-up process with customer service I was told it would take 10 working days for myPreferred  number to be transferred to the Jitterbug Smart 3.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is not a simple phone",
      "date": "Reviewed in the United States on June 4, 2023",
      "body": "This was supposed to be a smart phone for seniors who didn't want all the gimmicks. It is no longer that. This phone, like all the rest (I assume), tries to micromanage your life. I didn't sign up for a FRIEND, I signed up for a SMART PHONE. The smartest thing to do is not to load the phone with apps that try to run your life and make you happy happy happy. I don't need artificial intelligence thrust upon me, I have enough of my own. I will not buy Smart Phone #4 when it comes out, unless it actually does what it advertises.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No so Easy",
      "date": "Reviewed in the United States on August 21, 2023",
      "body": "I bought for senior mom. The on/off is too difficult to press.  Then once on, it should just go to home screen. You have to swipe and swipe and swipe.  Swipe to answer.  Swipe another way to ignore call.  Please no more swiping.  It's just Too much work for what should be a simplified smart phone.  It should be touch on,  touch application, and touch contact, touch screen to answer..... That would be easy.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works ok but has error message",
      "date": "Reviewed in the United States on October 1, 2023",
      "body": "Got this product for my elderly father had service hooked up to it from tmobile ...works fine but has and error message from the programming",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    LOT OF PERMISSIONS NEEDED TO USE APPS",
      "date": "Reviewed in the United States on August 28, 2023",
      "body": "GOOGLLE NEEDS TO SPY ON YOU FOR  A NUMBER OF APPS TO WORKi SHOULD HAVE KEPT MY OLD PHONE",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Difficult To Use",
      "date": "Reviewed in the United States on June 27, 2022",
      "body": "I got this phone for my wife who is in a nursing home.  She can not operate this \"easy to use\" phone by herself.  It is one of the most difficult products I have ever experienced.  It was almost impossible to set up; I could not have done it without tech support, which was excellent.  Controls are inconsistent. I have to click on \"contacts\" multiple times to display them; and sometimes it jumps to a different screen.  When I click on a certain \"favorite\" contact, the phone shows the contact below it.  I had to delete that one in order to call the intended one.  You have to press a button to \"speak\" to the active assistant \"hey google.\"  With other phones you just talk.  Do not buy it!",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looked simple enough",
      "date": "Reviewed in the United States on July 19, 2023",
      "body": "Purchased this for a client of mine.He's always had a flip phone.He could not grasp the smart phone technology so had to return it.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very disappointing product, support and Lively policies",
      "date": "Reviewed in the United States on April 26, 2023",
      "body": "Very disappointed in the performance of the Jitterbug phone.  AARP endorsed but far too many passwords for this senior even to just make a call.  I was also caught in the Lively revenue enhancement policy.  It seems if you attempt to activate the phone (a $35 fee) online, and receive a message it has failed and to contact customer support, you will be charged two activation fees instead of just one.  Their Senior Customer Support Sarah, said this was the standing company policy.  Lively will also attempted to conceal to double charge by not sending an invoice or bill, just multiple attempts to sign me up for their Personal Emergency program...for another monthly charge.  The extra charges just appear on the required card with the non refundable first month payment.  My iphone works better and is much simpler than the Jitterbug so I stayed with Apple.",
      "helpfulVotes": 34
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Difficult",
      "date": "Reviewed in the United States on March 6, 2023",
      "body": "It was more difficult for my mother to use than we had expected.  We also thought we could add this phone you our phone plan and not have to purchase theirs",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk! Won't come on after 4 months.",
      "date": "Reviewed in the United States on June 20, 2024",
      "body": "Waste of money. Poor quality.  Won't come on after 4 months of very limited use."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I canceled my plan. Phone not in use.",
      "date": "Reviewed in the United States on August 3, 2023",
      "body": "I did not personally like this phone so I canceled.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Privacy concerns",
      "date": "Reviewed in the United States on April 4, 2024",
      "body": "Ever since I got this for my grandpa and I put my info in when registering the account for billing, I have been getting a ton of spam emails. Also there is no way for my grandpa to only allow calls and texts from people in his contact list with the lively phone and text app.The main reason we got my grandpa this phone is because he was messing with his iPhone settings too much and always ended up putting his iPhone in \"do-not-disturb\" mode and calls wold go straight to voicemail. Well with this jitterbug he keeps putting it into airplane mode so we're still having the same issue 🤦",
      "helpfulVotes": 16
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lively keeps interfering with my Government phone service",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "I had the previou model of the Jitterbug & it lasted me for years with NO problems!  When I bought a new Jitterbug from Amazon Lively kept trying to force thier service on me to make the phone work, however my Gov'mt service plan keeps sending me new sim cards to help make my phone work!  One of the worst purchases I have ever made on Amazon!  Amazon should warn their Customers that IF they buy this phone LIVELY expects the customer to use thier service!",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst Customer Service and phone is not user friendly.",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "Trying to set the phone up for my 97 year old. 30 minutes on the phone to activate and then they said it will take another 10-15 minutes to activate and will cost $35 to activate. Requires a data plan too, so the $20/month turns into $30. This is suppose to be for older people. My aunt is 97, she had NO clue what email or the internet is she doesn't  need a data plan. This is false advertising and will file a complaint with the FCC.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for my mom",
      "date": "Reviewed in the United States on January 13, 2023",
      "body": "As I began setting up this device it became apparent that it is NOT as easy to use as advertised. See that OPTIONS button up top? My mom is mid-stage dementia and I just know she'd smash that button over and over until most every day she'd change things to a point where she'd call me to complain, \"My phone is broken again.\" Google (yes, this is an Android) is more interested in collecting its data than in helping my mom and others like her. I'm changing to RAZ Mobility - the phone is MUCH more expensive and will only enable my mom making and receiving phone calls, but it will (fingers-crossed) head off my mom messing things up daily and stressing because she can't reach me or her grandkids or her friends.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not good.",
      "date": "Reviewed in the United States on December 21, 2023",
      "body": "Not worth all the hype. My main issue is the volume. I can hardly hear out of the speakers on this thing much less my 95 year old mother in law who I bought it for.  Way too many steps to place a call. Need to go to contacts, select the contact, confirm and select again then hit call, again. Should be a one step process since this is targeted at elderly adult consumers. Not good, would not recommend. Just get standard android phone that's literally all it is and a cheap phone at that. Poor value for the money, not a well thought out product at all.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone, bad service",
      "date": "Reviewed in the United States on January 12, 2023",
      "body": "The phone was decent to use, however the service felt like it would take advantage of people. Unlike most services I have dealt with, they charge so much for extra data use without your knowledge. The person I was helping get this phone for did not understand how data works so we got charged almost 200 dollars extra... Get this phone, but switch it to Verizon or something else.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broken",
      "date": "Reviewed in the United States on July 2, 2023",
      "body": "Charging cable is broken!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lively jitterbug 4",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "Spent time setting it up. Paid all the fees. Come to find out no coverage in my rural area. Canceled the service but I'm still out price of the phone and all the fees. $150. Live and learn. Careful !",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s not easy to use for my Mom (she’s 92)",
      "date": "Reviewed in the United States on February 2, 2023",
      "body": "Completely different than iPhone lending confusion for my 92 year old Mother.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So-so",
      "date": "Reviewed in the United States on February 26, 2024",
      "body": "Phone service works fine but is generally a tool for sales; features are far to s la carte so actual cost is much more monthly than implied.  (And the phone ONLY works through the proprietary lively cell services.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT RECOMMEND!",
      "date": "Reviewed in the United States on February 10, 2024",
      "body": "Useless phone unless u use the cell phone company. Does not say on information about phone. Phone  has capability to switch to reg cell use but continous issues with contacts  etc. Too bad did not return within a  etc. Too bad did not return within a timely manner. Bought 2 , 1 mom and 1 for dad. Even us savy  mom and1 for dad. Even us savy users are frustrated..As jitterbug, senior citizen clicks phone and person  has to click on phone again to dial once contact is phone. Too many steps.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon does not stand behind their products",
      "date": "Reviewed in the United States on February 22, 2024",
      "body": "I love this. The only problem is it only lasted 6 weeks and they won't replace it they won't help you because it is a third party purchase. Don't do it, don't go third party because , they don't care about you. They get their money for whatever it is. They use it for but they don't help you with the product. Once it nessess up and a product should last. I think more than 6 weeks this one only lasted 6 weeks.  Don't buy it as a matter of fact. Don't buy anything from Amazon. I'm not gonna help you.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone sucks for the most part",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "Do not believe any reviews that claim this is a great phone for older people. It has been a giant hassle to get it to half way function well for my mom. The help people are rude and unhelpful. Do not buy this phone. I'm sure there is an easier option out there, but this is definitely not it! My mom is 88, and will most likely go back to her iphone.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broke after 6 months",
      "date": "Reviewed in the United States on January 4, 2024",
      "body": "This phone was barely used and completely stopped working after 6 months.  Not that easy to use as there are too many steps to everything before you get to what you actually want to do.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed",
      "date": "Reviewed in the United States on January 20, 2023",
      "body": "We haven’t had the phone for a month yet and we are so disappointed! Customer service staff are all very nice BUT their system is always down and they can’t do anything for you without it! The Jitterbug 3 has an internal glitch and we’ve had to call support 4 different times, hold for an hour to be told they can’t help because their system is down!!! 🤬",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery!",
      "date": "Reviewed in the United States on November 24, 2023",
      "body": "Phone powering down to off after 5 seconds the first time I turned it on. I charged it a few time but it keep powring down to off in 5 seconds. It won[t turned on when plugged in. Tech says this phone's battery cannot be replaceed. I sent it back to the seller for a refund and canceled my Lively.com account. The newxt week Lively.com took $31 from my auto-pay credit card that was set up in my Lively.com account when I opened this account. I had to lock my credit card from them.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked.",
      "date": "Reviewed in the United States on July 3, 2023",
      "body": "The phone worked really well for my visually impaired mother however neither cricket, spectrum, nor at&t was able to activate it. If you want to get a separate mobile plan from Lively I imagine it would be a good phone, but not working on any of the major networks near me makes it usless.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "Had to rewrite my review, so let’s see if I can reword it, got the jitterbug for my sister ordered the NEW ONE not a USED ONE . She hates it and is still having trouble with it.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seniors Beware",
      "date": "Reviewed in the United States on November 13, 2021",
      "body": "Tried to do this phone for my dad. First there is an activation fee, which is unusual in this day and age. I guess most seniors aren't aware of that. Second, they ask a ton of really dumb questions before they even get to activation. Third, if it is a smart phone that you do not want to use internet,  etc., on they tell you you can't.  That their unlimited text and phone plan requires a data plan too at $24.99 per month. Bringing the $19.99 advertised plan up $5. Even though their minimum data plan is only $2.49/mth. They false advertise.For seniors, please note, as long as you don't use any carrier data, you can use a voice and text-only SIM card in whatever smartphone you want and not have a data plan. Smh.",
      "helpfulVotes": 173
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not available for our Zipcode, despite being solid red on the map.",
      "date": "Reviewed in the United States on September 7, 2023",
      "body": "Can not set up this phone for my mom. It says Service Not Available For Zipcode, even though southeast Utah is entirely red on the map and Verizon is one of two cellphone companies operating in this town and the one that's been here the longest.If you go to Lively's website you can plug in your Zipcode and get this information without spending the $75 to learn it, but I went by the map in the Amazon listing. DO THIS! it will cost us $7 to return the phone and $7 to return the $14 case.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    needs better short cuts and texting",
      "date": "Reviewed in the United States on April 28, 2023",
      "body": "texting is not intuitive the camera is awful and grainy and you have to view the pictures in order to see them. it takes like 5 stages to send a picture. i’m thinking of just giving my elderly family member an ip phone n just simplifying the apps",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone poor service",
      "date": "Reviewed in the United States on April 20, 2023",
      "body": "Beware they don’t tell you upfront. You can’t use your service. You have to use theirs. You have to get your carrier to release the old number and if there is a problem you wait 3 days. The 3 days kept adding up. It took over two weeks to start and we were paying for my mom service in two places. Finally we just stopped and accepted their number provided and stopped trying to use our own number we had for years. The customer service are not friendly. They treat everything over and over like Robots and so t try to find a way to help. The talk to you like you are an idiot.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The service with Jitterbug and Lively is garbage.",
      "date": "Reviewed in the United States on May 9, 2024",
      "body": "Had to wait for an operator for 14 minutes.  When canceling service you are not able to do it online it has to be over the phone.  When canceling on day 1 of a month (card charged for prior month yesterday) we are advised that we are responsible for the full charge of the month not yet used wuth no recourse.  Steer clear of this company.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a used bug",
      "date": "Reviewed in the United States on October 30, 2023",
      "body": "God a used phone. It was powered on with finger prints all over it. Security labels were already torn.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not compatible with all seniors",
      "date": "Reviewed in the United States on June 6, 2024",
      "body": "I found the phone to be a bit complicated for my elderly mother who could have used something with more simplicity. Many seniors only need to make a call, receive a call and not much more. They were far too many steps for my elderly mother too be comfortable with this phone.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as easy as advertised to learn",
      "date": "Reviewed in the United States on September 10, 2022",
      "body": "Like the phone not as easy as advertised to learn",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible phone",
      "date": "Reviewed in the United States on June 12, 2024",
      "body": "Calls don't go thru or you can't hear when someone calls. We've adjusted settings just about every other day. Also the T Mobile people said phone was ok and as soon as we got home the same thing happened...can't hear ringer even though volumes are all set at capacity",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Extremely frustrating",
      "date": "Reviewed in the United States on January 17, 2023",
      "body": "Been on hold over 3 hours with 4 different calls trying to transfer over from T-Mobile. Got hung up on twice. Won't accept my husbands AOL account that he's had for years. The phone seems like it will be easy enough to use if/when it finally switches over. Very frustrating!!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Died After a Few Months",
      "date": "Reviewed in the United States on November 10, 2023",
      "body": "Phone died after 6 or 7 months.  Never had a device last such a short period of time.  My advise:  Get something that's made better.i got this for Mom.  She is in her 80's.  It's sold as a simpler phone - it confused her like the Apple SE, but in a different way.  So I can't really say the interface was great.  They did try to make it something in everyday english.Not a fan.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works out of the box then stops!",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "In the beginning, my friend never had a phone. He loved it. But couldn’t charge the phone when the battery got low. After purchasing another charger it still didn’t charge. Something is wrong with this phone. I would not recommend this phone for anyone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish I hadn't wasted my money.",
      "date": "Reviewed in the United States on December 21, 2022",
      "body": "I ordered this phone thinking that it would be easy to use. It is not! I wish I had stayed with a flip phone. It is heavy on my pocketbook and there is no way you could just put it in your pocket. The screen shuts down too quickly and you have to push a button on the side whenever you need to use it and it is not easy to push. The letters are so small I can't read them if I don't have my glasses on. This phone is not made with seniors in mind. I do NOT recommend this phone!!!",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lively 4",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "I had to return the phone to Lively even though I  bought at Amazon as it would not let me put my new phone number on it!",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A humiliating experience",
      "date": "Reviewed in the United States on August 25, 2022",
      "body": "Finally, a smart phone for seniors? Well, at 89 I guess I\"m a senior.  I used to be a college professor so you would think I'm smart enough to activate a simple phone  I spent three days trying to go though the set up process finally giving up in disgust.  I called a tech specialist at Amazon to guide me through the process.I found her to be very difficult to understand and to not be helpful at all.  So I am stuck with an expensive phone I can't use and a humiliating experience I hope I never have to go through again.,",
      "helpfulVotes": 38
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sizing",
      "date": "Reviewed in the United States on July 8, 2022",
      "body": "Ran big and sizing wasn't the ize it said it wassas",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible customer service, poor product",
      "date": "Reviewed in the United States on September 25, 2024",
      "body": "What a waste of time and money: it’s very good advertising for a poor product. You cannot even transfer in your contacts from another smart phone.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't get sucked in.",
      "date": "Reviewed in the United States on September 27, 2024",
      "body": "Phone is easy. However Lively is deceptive. You end up paying 3 times more than you think to use this phone. It's like a mafia.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT simple.",
      "date": "Reviewed in the United States on May 8, 2024",
      "body": "I am very very sorry I ordered this phone.  It is NOT simple.  It is extremely difficult to program; almost impossible to get a real person to help.  After many, many hours, still have only phone working.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone did not function",
      "date": "Reviewed in the United States on April 20, 2022",
      "body": "Original phone arrived and I attempted to set it up but then called Lively support.  Lively told me the phone was not functioning and sent me a new phone after a week.  Attempted to set up second phone but contacted Lively again (six times in total with six different answers).  At this time my return date had elapsed in Amazon and now I am stuck with two $123. phones that are useless.  Lively support was very poor and  will purchase another cellular phone but a totally different company.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Misled by Lively Tech Support",
      "date": "Reviewed in the United States on June 7, 2024",
      "body": "I was told by Lively tech support that this phone can scan QR codes without a third-party app. It does not, so it's going back. I am comfortable with my Smart3 phone, and the QR code feature was the only reason I decided to do the upgrade.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen Protector Too Small - Doesn't Fit",
      "date": "Reviewed in the United States on April 24, 2022",
      "body": "There were no instructions for this case and screen protector.  That was no help at all.  The screen protector is too small to cover the whole screen.  I am going to have to buy other screens protectors to use on my new Jitterburg Smart3.",
      "helpfulVotes": 4
    }
  ]
}