{
  "asin": "B0D7HVWRGN",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the camera on this phone, and the AI features",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "This phone has been a joy to use, and I've already gotten a ton of super nice photos with it, and I love the 5x optical zoom.  The one negative about this phone (and almost all modern phones) is that you NEED a case for it, otherwise it's way too slippery to use, like I don't know who thinks making a phone as smooth as glass front, back, and sides is a good idea.  But after getting a case for the phone so it isn't sliding out of my hands, it's great to use.  Not too heavy either, and the screen is nice and bright but can get darker at night too.  The AI features are nice, I've used it to search up what some things are and it is often helpful.  Battery life seems good as well so far.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great fast android phone",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "I have had this phone for a month. I had an android Motorola g 100 before this, which I liked for the almost pure android, SD card slot and headphone plug. My new Pixel 9 pro has pure Android but no SD card slot and no headphone jack (which I do miss). To make up for these missing items I got the new pixel with 512gb and a separate Bluetooth receiver for my old Klipsch X-10 headphones that are great. So far,  I'm very happy with the tradeoffs.The Pixel 9 pro is a great phone. It takes time to set it up, which is important. This version of Android gives you a lot of control and if you take the time to set it up,  you will benefit. As someone else said, initially, the battery runs down pretty quickly; however, the software learns how you work and over about 2 days  the battery life lasts much longer. I also installed a toolbox app which seems to add even more. I have never run below 40% after my heaviest phone use days. I also like the size of the 9 pro. I do not play games on my phone so I can not comment on its game play use.The bottom line is that the Pixel 9 pro simply works flawlessly, is fast  and is well made. It's expensive but it's a premium phone and worth it.",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the phone",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "Overall a great phone and I'm happy with my purchase.Pros:- Unlocked. I was able to enable developer mode and oem unlocking with this phone. It is truly unlocked.- Very responsive and fast- Great batter life, charges quickly- Improved fingerprint sensor over the pixel 6 pro- I like the sound and speaker phone quality- Rear and selfie cameras are great- Can adjust display to full resolution at 120hz and Adaptive colors for a much better experienceCons:- Default colors are Natural. I've heard the arguments and don't care. Looks washed out and dull and just doesn't look good. However, you can change the defaults in the display settings as I've mentioned above and this will fix it.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium build quality",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "For some time now I've been considering whether it was worth swapping the Pixel 8 pro for the 9 pro XL, as the changes aren't much. I finally decided, even though they are very similar phones I couldn't be happier with my new phone.PROS compared to my old Pixel 8 pro:- Better screen and notably.- Better battery life.- OS and interface runs a little smoother.- Better selfie.- Better sound.- Premium build quality.- Personally I like the curved edges of the screen better.- Retains camera quality like all Pixels.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Switched from IOS. Its a great phone. It has a lot of new features my iphone does not have. Super fast and the camera is great. Its now been almost a month or two. It has so many nice things about it. The only thing I really do not like is the glare with lights at night from the camera lens. IT is bothersome. Easy to personalize. I tried the 9 and it was slow and laggy, the pro 9 is the way to go IF you want power, cooling and good looking phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great device, mediocre phone",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "PROS: Great battery life - I can literally use this phone for nearly two days straight without charging it assuming I am not watching movies or playing games constantly, and is a welcome improvement from my previous iPhone 12 mini. As far as processing speed, it does not seem to be any faster than an iPhone. Picture and camera quality is fantastic! I am able to take great quality pictures in all types of light, and the display quality is the best I have seen on a smartphone. The size is just a bit too large than what I am used to but does not seem to bother me when I have it in my pocket. The charging speed of the phone is very fast and gets a full battery in little more than an hour. The switch from iOS to Android seems to be a lot less painless than before as well.CONS: The call quality is a lot worse than an iPhone, especially for use in buildings. When making a call, the signal bars instantly drop and covert to either 3G or H+, and will not connect with the other line for up to 30 seconds even if I am outside. Note that I am referring to traditional cellular network use and not data calls (Signal, Whatsapp, etc.). These data calls are almost as good as an iPhone but not quite there yet. If I am on a call, I will have to often go outside where I did not have to previously do this with my iPhone mini.VERDICT: If you are looking for a portable computer and mostly data calls, this is one of the best Android phones you can purchase. However if you are still regularly using the cellular network for calls then I would recommend sticking to an iPhone.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I came from an older Galaxy S20+ and I enjoy Google's AI and UI so much better so far. No issues with this phone and it's plenty fast despite other Android supposedly being slightly quicker. That doesn't seem it'd matter unless if you plan on playing games on your phone very frequently.The camera is also great, which is a huge plus. The Zoom is truly impressive. Both of these pics were shot from probably .75 to 1.5 miles away. One is a cruise ship on the coast and another is a building across a bay."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the 9 pro",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Very good phone for the price point. Love how smooth Android UI is on this one. Great cameras, great battery life. Google AI stuff like Gemini, pixel studio are good additions. I barely use screenshot app but can see how it could be useful for someone. Great job Google on the design and execution of the phone. Also great job for making the pro phone available in this smaller form factor.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9 Pro XL is worth the hype",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "I've had the Pixel 9 Pro XL for a week, and after countless hours of testing, I am quite happy with my purchase. To be clear, I am a regular person (not a professional reviewer) and I paid for the phone with my own money. No handouts or compensation here.I would venture to say that the majority of complaints about this 9th gen Pixel are from people who don't have one (Verified Purchase?). This is a great phone. Everything just works, and works well. It is responsive and fast; while Samsung and Apple flagships may win benchmarks, in real world use, this phone is able to handle everything I've thrown at it.And real world use is where this phone shines. I come from Samsung and did not like their bloated UI and baked-in Samsung apps. This is the purest possible Android experience and it shows. Everything just works, intuitively, and works well.It's been a few years since I used an iPhone as my daily driver, but anyone who is stuck on iPhone as the \"just works\" phone, check this phone out. If you prefer the Google ecosystem (Gmail, Docs, Drive, Calendar, etc), the Pixel is the way to go. They are all deeply integrated without the bloat or workarounds on other phones.I've heard of problems attaining the fastest charging levels without buying the expensive Google charger, but I charge on a wireless charger at night while I sleep. Even using a third-party (and cheap) wireless charger, it charges decently. It seems this phone requires the charger to bump voltage to get the 37 watt charging, so if you care about squeezing in your charges at the fastest charging speeds, perhaps get the official Google wired charger or be very thorough in your charger research.But I dont think you'll need it. For me, charging speeds don't matter with this big battery. It has lasted me all day, every day, and I have intensely used it from sunup to sundown. Never once have I risked needing to charge it between 5am and 10pm. As long as the phone lasts all day and only needs to be charged at night, I don't think it matters if it takes 90 minutes to charge. But that's a personal decision for you to make for yourself.The camera is amazing. It takes some of the best photos I've seen come from a phone. And while there are plenty of choices out there for post-processing your photos, having features like Video Boost or Zoom Enhance baked right into the Photos app makes it a simple joy to take photos and edit them. I challenge anyone to find a simpler and easier workflow for taking the best possible photos. If you want to take amazing photos and be able to edit and enhance them in a few seconds without switching between an array of apps, this phone is for you. Of course third-party editing apps are a Play Store away, but you probably won't them them.I know Google hypes the AI, but generally that's not why I got the phone, so I'll leave the in-depth AI reviews to others. Some of it is fun -- Magic Editor is a fun toy and Zoom Enhance stretches the boundaries of what's possible on a phone camera, but things like Gemini Live feel a little half baked. Don't get me wrong; Gemini Live is a leap forward for Google, but the AI as a whole feels disjointed. Gemini Live doesn't communicate directly with regular Gemini, and while it's great for chatting, it can't do even basic tasks (which requires switching to the other Gemini).It's also quite perplexing that there are still basic Google Assistant functions that Gemini can't call up. It feels like it should be a basic ask to relay all Assistant functions, but it's not that simple. These are minor annoyances that will hopefully improve in the future, but (to Google) if you're going to hype the AI so much, please have it more integrated and seemless than this. It feels like a miss that the feature you're hyping the most is the one with the most blemishes. But AI is quickly evolving. Maybe my comments will be moot in a week. And like I said, since I didn't get the phone for the AI, this isn't a ding for me.I'll update if any issues arise, but so far I'm very satisfied with my purchase. This is my first Pixel, and I can see why there are Pixel fans. This phone might not be everything to everyone, but it's not supposed to be. If you want a premium phone that feels great, looks great, and does what it does very well, give this newest Pixel a shot. If you're using an iPhone but not yet too deeply invested in their closed box, or if you're a Samsung owner who's tired of the bloat, I recommend checking out the Pixel 9 Pro XL.  It's great to have so much choice in the smartphone world, and I believe this is a choice worthy of your attention.",
      "helpfulVotes": 209
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Made the switch from Samsung to Google after 15 Years",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "I have been using Samsung phones since they first came out, with the S4 being one of my most memorable experiences. I appreciated some of the more rugged, active-style Samsung models I could take to work with me, especially during my younger years working on the pipeline. However, as I grew older and focused on my education, my phone became essential for assisting me with schoolwork, alongside my laptop, throughout most of my college career. Now that I am finishing my education and starting my career, I rely on my phone to help me accomplish various goals throughout the day. Before switching to the Google Pixel 9 Pro XL, my last phone was the Samsung Galaxy S21.Simply put, the Pixel 9 Pro XL is exceptional. It receives regular and helpful updates from Google and tends to get updated Android versions faster than other phone variants. This is great if you prioritize updating your software efficiently and promptly.This phone charges relatively quickly. It also has a feature that allows it to charge slowly overnight, which helps extend battery life.Speaking of the battery, it lasts all day long. I can often get close to three-quarters of a second day if necessary, even with regular work and personal use. I have never had to enable power saver mode, and when the phone drops to 20%, it automatically shifts to a lower power mode, extending battery life significantly.The screen is clear and highly functional; I have experienced no sensitivity issues. The picture quality and resolution are excellent, and the videos play smoothly without any problems.The camera is user-friendly and takes stunning photos. You can see the attached pictures in my review. Although I'm not a professional photographer, the images have great detail, with a good balance of shadows, contrast, highlights, and other important elements. The \"Add Me\" function on the camera is fairly easy to use. When you take the first picture and then add yourself to a second one, if you position yourself correctly, it can be tough to tell that the picture wasn't taken in one shot.Overall, I highly recommend making the switch if you're considering it. I've heard positive feedback from others who transitioned from iPhones to this phone, and it does include some features that could facilitate the change. While I'm not an iPhone user myself, I suggest talking to someone who is to explore that perspective further.Lastly, if you get it, get a case. With a screen protector, fingerprint functionality will be subpar. But I want an unblemished screen, so I suffer the effects.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google Pixel 9 pro (Hazel color ) (unlocked, BRAND NEW/unopened) 512 GB",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Ok so I was terrified to order this phone through Amazon. I was back and forth for months. I was thinking I was going to run into a problem and it's such a big risk. But I had no choice but to risk it, since they were the only ones offering what I wanted. None of the stores, Even Best buy didn't have unlocked Google Pixel Pros Brand New with 512 GB on it. Amazon charged a little more than other stores but I see why. But It came Brand New. I unboxed it in front of my phone service company. They got to experience that with me. And I love this phone. Oh my I love it. And Again it was BRAND NEW (unopened box) never turned on, everything in tact and I got the color I wanted and everything. And Its just great. So far I've had the phone for 4 days and I love it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This Is A Nice Phone Except For A Few Important Things",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Make no mistake, this is a very fine phone very fine piece of technology. But as usual or typical of all phones, it comes down to whether or not the phone works for each individual. For me, it simply did not.First, I have a Subaru with Bluetooth. Although this phone connects easily with Bluetooth in my vehicle, the voice/sound quality is atrocious. For the first couple of minutes the other party is almost unintelligible, and then it gets better to being able to understand one word in eight. The other phones I've owned had no such problem with this car. The technician from Google cannot figure out why this was happening either. I make a lot of phone calls from my vehicle so this is extremely important to have functioning properly and with clarity. In my to buy another vehicle so that the sound/voice quality from this phone will work better?Although the face recognition software and hardware works fine, the fingerprint recognition software and hardware need some work. If you have the slightest moisture on your finger, if you have the slightest dirt on your finger, the fingerprint scanner will either not read or take several tries before it will read. This is not only annoying, but sometimes in my line of work it is critical to have it work immediately.The sound volume is not nearly as high as with other phones and neither is the haptic feedback. Also, quite annoying. If I'm away from my phone more than a few feet before I realize it's ringing, many times, the caller has hung up! The ring volume and other uses for a higher volume in noisy areas is not as good as with other phones I've owned.It is not until we get another phone that we realize that some of the small things, such as volume, caller voice/sound quality, and other things, are important. This phone, although produced by a reputable company, still needs much improvement. The chipset is a major drawback for me. I do a lot of video calls and this phone freezes a bit more than other phones that I owned. These are things you buy a new phone for to help eliminate such problems.This was supposed to replace my Galaxy Z Flip 6, but it simply does not measure up. Perhaps the next Google generation will be better.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good, upgrade from my previously loved Pixel",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "I've had it for just over a month, and so far, so good. I tend to keep my phones for a long time. This is replacing a Pixel 4A 5G, which was a great phone, and I still use without a SIM around the house for work apps. This is an upgrade in pretty much every way - better cameras, more memory, somewhat faster, longer battery life and wireless charging, etc.  (Although I had few complaints about the older phone.) Especially with the case I chose for this, it is chunkier in my pocket.  The price is a bit hard to swallow, but if it lasts as long as my previous Pixel, the cost-per-year works out better than buying several cheaper phones that don't last or age as well, or drop out of vendor support and security updates."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, bad quality control, great customer service.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Amazon originally delivered a damaged product box and slightly scratched phone, however customer service was great as always and sent a replacement!The phone itself is good, no issues. Definitely update from the pixel 7. I will attach photos of how the first phone arrived in comparison to the replacement."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still made in China. Epilog: Some China / Some Vietnam according to Google contacts.",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Seemed delightful, SIM slot won't open with the tool, a tiny safety pin, a paper clip.  Then I thought these were manufactured in India.  Made in China so no thanks. Dig one out from even Vietnam and I'd take it back but say no to spyware. Back to Google with it.Further review, kept the phone.  Don't put the removal tool in the microphone hole. Easily confused. I guess a hybrid Vietnam/China hybrid is all there is for now. The phone is very intuitive."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Another great pixel",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I've been a fan of Pixel since the 5 and have not been able to use any other brand of phone sense. I've given the OnePlus12 a try for about 4 months and wasn't very much a fan of it for some reason and I don't know how to really explain it. Switched to the 9 Pro XL and am so happy with it. As always with the Pixel cameras, they are amazing. I will always recommend to everyone to try out any of the pixel phones to understand the hype."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pixel 9 Pro",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Supera mis espectativas, lo cambié ya que tenia el pixel 5 y quise renovar con una gama mucho más actualizada. Haré pruebas en el momento que tenga tiempo y editaré el comentario nuevamente incluyendo fotografías."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente compra",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Me ha encantado cumple todo a la perfección a pesar de no ser el mejor celular con el mejor procesador básicamente no hay tarea que no pueda hacer. Y las fotos son una pasada son muy hermosas y el vídeo Boost es otro nivel."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Me encantó, detalles que debe mejorar pero es de lo mejor",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Es un celular muy rápido, me gusta mucho el sonido, su memoria ram y su procesador. Tiene una excelente cámara. Trae algunas fallas como que el puerto USB detecta que está sucio o mojado y también la pantalla tiende a hacer movimientos extraños y el sobrecalentamiento del dispositivo al cargarse. Pero no es algo que afecte mucho. La carga dura bastante. Sus colores y tamaño lo hacen perfecto para personas que, como yo, tienen discapacidad visual."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it!",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Love this phone the camera is awesome. Battery life is great."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a solid phone but the sound controller is subpar",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "It's a fast phone for general use. There hasn't been any hiccups going between apps. Something worth mentioning is the vapor chamber cooling. This means performance will be substained longer periods of the time. The screen is probably the best I've ever used. The motions in the UI is smooth and picture quality is amazing. The adaptive brightness is way too aggressive. I've seen it auto change it below 25 percent in a moderately lit room which doesn't make sense. The battery life is probably my favorite as I can easily last and entire 9-5 work day with 85 percent left to spare.The reason why it is getting 4 stars is because of the price and sound controller. Starting price of 999 USD for performance and build quality is outrageous compared to the competition. The entry level Samsung S24 has all these features and performance is much better.The way the Pixel handles sound is very bad. I couldn't probably sync my Jabra earbuds and Galaxy Watch without problems. I needed to removed my buds from the list of previous sync devices that my Google account had stored, and then I needed to factory reset my watch. Furthermore, there is a latency for how the audio is passed from Bluetooth devices and sometimes doesn't work at all. For example, the audio for Google Assistant will flip between my buds and speakers when called. And there are times when my music doesn't when play at all when Google Assistant is fine with my query. It's clearly buggy and needs more work through patching.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works smooth as butter with excellent camera",
      "date": "Reviewed in the United States on September 10, 2024",
      "body": "I recently gave up my digital camera for the first time... 90% of what I was photographing can now be done with the smartphone that has a 5x optical zoom and 30X digital zoom this phone offers. as a note the camera in digital zoom book superbly up to 20 x once you but beyond 20 x I wouldn't call the images very useful.the fingerprint sensor is light years better than the previous models. the phone design is polished professional and high quality if you infamous camera hi then being slightly bigger than the previous models but aesthetically pleasing to me. I haven't dealt into the AI features yet any intentionally did not initialize some of the features because I don't believe they are quite ready for prime time.  this was a toss-up between Samsung S 24 ultra had this phone but found out the Samsung menu system and some its features are buried in layers and difficult to manage so I stayed with the pixel system I'm already familiar with. I find it pixel Pro XL just the right size for me I don't find it awkward or too large.  at the side note I had an order in wuth Google for this device that they keep setting my order date back the last straw was on I got in October 19th shipping date.... and here I am.  there is so many features in this phone I'm not even sure how have the opportunity to use them all but the menu system and the settings are well laid out and it's easy to find things and get things set up.  moving my data from Pixel 8 to pixel 9 XL Pro was a breeze simply taking a picture of a QR code and Bam everything got transferred over.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pixel 9 Pro XL (512) - We Have A Winner!!",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Google phones rock!  This is my 3rd Google cellphone and I was blown away with how easy it was, to upgrade from my 7 Pro!!  The Pixel 7 Pro was flawless but my better half wanted it, when her phone was spent. This Pixel 9 Pro XL impresses me with the Camera, Speed and Screen (NOT curved edges, yay!)... All are at the next level and I am thrilled, thank you!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    should have purchased more memory",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "The phone is great, but since I use this phone for personal and business use, I should have purchased more memory.  I ordered the 256 GB model and its not enough.  Also, you can't add a micro SD card to this one like you could with the Pixel 6 pro.  I guess this is a trend but it sucks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worthwhile Upgrade",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "Compared to the Pixels of recent vintages (6, 7, and 8 series), the Pixel 9 Pro XL is a worthwhile upgrade. It has a better performing and more battery efficient cellular modem. It gets a solid signal both with LTE and 5G, and has noticeably better battery performance when connected to 5G than previous models. The fingerprint sensor is much improved and usable as well although there are still the occasional blips where it won't recognize my fingerprint. Performance is sufficient for my normal, everyday use. Battery life while still not great, is slightly improved compared to previous models as well. Overall, nothing game changing but all of the slight improvements add up for the Pixel 9 series to be a worthwhile upgrade from older Pixels."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    If you love taking pictures just get it",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "At full price it's debatable if its worth it, but at the moment this phone has the best cameras, even better then some SLRs. 5x optical and 30x digital zoom and so many setting for any serious photographer to geek out. I upgraded from the pixel 6 pro so it's like night and day better so can't say much about never phones, but if you are like me and keep phones till they run out of service life it's time to upgrade."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great upgrade!",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Great phone! I've been Samsung for years and decided to switch from the fold to this, it was a great upgrade!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Google Pixel 9 pro xl",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Me encantó el teléfono, llegó en perfecto estado y su empaquetado no se dañó en ningún momento"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, but still big",
      "date": "Reviewed in the United States on October 19, 2024",
      "body": "I finally upgraded from my Pixel 4a to a Pixel 9 Pro. I loved my 4a, which still had snappy performance along with a physical fingerprint reader that is super reliable and easy to unlock by touch as well as a headphone jack, all in a compact, lightweight, durable body. Unfortunately the battery was getting worn out quickly and are a pain to replace on that model, so here we are.The Pixel 9 Pro feels solid, but even the \"smaller\" body is still too big for my preference. It is hefty, which I understand given the materials used, but I also dont feel confident that the weight translates to durability; the materials still seem delicate enough to necessitate a case, which only adds weight and volume. I also miss the physical fingerprint reader on the back, which could be used by muscle memory and swiped down to bring the notification shade down with one hand. And dont get me started on the removal of headphone jacks and Micro SD cards from phones that cost nearly $1000.That said, the phone functions well and has been reliable for me so far. Calls are fine, and the built-on Pixel call screening is still the standout feature for me. Cameras are great, although the post-processing has gone a few steps too far into being over processed and I wish that could be dialed back a nudge.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    New phone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Worth the upgrade from my pixel 6"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the camera on this phone!",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I upgraded to this phone from the Google Pixel 6 Pro because my husband needed a better phone and he's taking my 6.  This phone is about the same size except considerably thicker.  I don't really mind that because the trade-off is the camera on this beauty!  I loved the camera on the 6, but this is incredible.  This is important to me because we do dog sitting out of our home and sent photos to my clients daily.  Outside photos were always great with the 6, but evening inside photos required a lot of light for any action shots.  This camera is so much better in every way!  My husband is inheriting the Pixel 6.  Other than the camera, and the thickness, it acts the same as my other Pixel 6.... which has always been great.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good.",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "I received my Pixel 9 Pro XL and have been using it for a few days. So far I am very happy with the phone. It replaced a Sony Xperia 1III, but as Sony was not releasing the latest version of their flagship in the US, I was happy to give the Pixel a look. I see no negatives thus far, and will update my review with more use. So this review is after a only few days of use, and coming from Sony.Set up was SEAMLESS, copied everything over from my old phone, just up to me to set up as I want it. The screen is amazing. Super bright and contrasty. The software is excellent, very clean version of Android.For me, the camera on a phone is very important and this one has not disappointed, at least in the very limited use I have put it through. Have used the add me feature, and it worked very well. Macro focus is an outstanding feature and one I will use frequently for close-ups. Telephoto images are bit soft, but I would love to use it with some kind of stability (tri or monopod) to see if the softness is due to user movement rather than lens quality. I miss the Sony software as it really feels like you are using an SLR camera in a phone. So I am in a bit of a learning curve here. But getting there quickly. I look forward to exploring and learning more of the camera software/hardware.Charging lasted easily over a day with very heavy use. Charge with the 45w Google charge \"brick\" was 5% to 75% in 45 minutes. Not bad at all. I have found the speed of the phone to be quick and responsive. Of all the devices in my house (computers, iPads, phones, etc), this has by FAR has the fastest Speedtest results on our home wifi. I mean it is not even close! Face and fingerprint recognition has been flawless.A lot of reviewers out there have talked about build quality and aesthetic. I remember handling an earlier pixel (no idea which model, maybe 4 years ago?) and thought it felt lightweight and \"toylike.\" That is NOT the case here. The phone is gorgeous and substantive in design and feel. Coming from the Sony 1 III the phone does not feel too big, nor heavy.For these reasons, I give 5 stars.",
      "helpfulVotes": 69
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone wver",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "Ok I owed a iPhone 15 pro max, the s24 ultra, the s24 plus and now the pixel 9 pro xl.  I returned the s24 plus to switch to this pixel.  S24 ultra with its sharp corners and weight was too much - sold that on ebay.  Thank you Amazon for your great return policy.  Now I have a pixel!!!!!Ok the YouTube reviews really miss some key points here.  I am using the Nova launcher in this btw  The phone is buttery smooth. I mean smooth like perfect animations.  The weigh feels great. Quality build but not too heavy or big.  Same size at s24 plus and weigh feels same in hand but a little more rounded and comfortable.  The haptic feed back is the best I have ever seen.  And it is integrated everywhere in the os. Super awwsome experience.  I can type like a pro on this better than iPhone due to the haptics and keyboard smarts.  The os is great no duplicate Samsung apps and confusion with Samsung  account etc.  that can lead into a hot mess.  the speakers in this blow Samsung's out of the water.  a perfect balanced sound with bass.  Not tinny like Samsung.  Speakerphone actually works well.  Build quality is apple level.  Screen is stunning.  And the CAMERA.  Rank #2 in all mobile cameras.  See Dxo reviews.  Yes iPhone 16 pro is ranked below this.  No shutter lag like the samsungs.  It just knows how to take the picture Everytime.  Then there is Google snap seed app and the ai features which take this to a different level.  The ai is super cool.  The phone argued with me over the buffalo bills season so far with a logical conversation.  It was surreal.  Go bills. Phone does not get hot and charges fast too.  The whole worry about this being a tensor 4 chip is far overblown.  This phone is super fast in day to day with no issues at all.  Battery life is great too  Android auto work great as well.  The os is really tight always one step ahead of me.  Phone features are great too.  With RFC now adopted by apple iMessage this is the phone to get!  Ps.  The camera will blow your mind!!!!!  Bye bye Samsung and apple.  Helllooooo pixel!",
      "helpfulVotes": 160
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, arrived quick",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Upgrade from a pixel 6 pro.  As with the 6, this one has no defects. Screen image bright and sharp.  Great camera, however I do miss the photosphere option.  Size is nice, although I think it needs a case for added grip.  Other than that, a five star phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't fall for the hype.",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "First off, I have been a happy owner of Pixels going back to the first model. However, the battery life of my Pixel4a 5G is better and the rear fingerprint scanner is far superior than any of these crappy screen fingerprint scanners. The one on the Pixel 9 is no better than the crappy one on my old Samsung that's a few years old. Seriously, none of these newer phones are worth the prices unless you feel the need to have the latest and \"greatest\" phone for nit picking and bragging purposes. Sure the camera is better but it's a phone! Wish I did not purchase and just installed LineageOS on my Pixel4a 5G, instead. Bet I could get a few more years out of it with nothing more than the cost of a replacement battery when the time comes.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the phone",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "I love the phone. The only issue I'm having is a pink line down the center of the display."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good phone",
      "date": "Reviewed in the United States on September 21, 2024",
      "body": "I really liked this phone. The design is new and modern and rivals or, in my opinion, exceeds the iPhone build. The cameras worked great and were more than sufficient for someone that’s not a professional photographer (in which case they should be using a dedicated camera…). The speakers were not too great even though they were stereo they really lacked any bass and the headset speaker was noticeably quieter than the one near the bottom. Display was great and super crisp but it falls short due to Android clearly not being optimized for specific phones. It would stutter when scrolling just regular web page, Instagram, and even stock apps like messages and settings… as an iPhone user switching this was a great one to pick. Unfortunately due to incompatibility between iOS and android including the fact that everything is in my iCloud and Apple Card won’t transfer and my Apple Watch is not compatible and even my AirPods Pro did not work as seamlessly as they should I could not keep the pixel. If not for those factors I would have kept without a doubt.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome phone coming from an iPhone",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "I moved from an iPhone 13 to this and couldn't be happier. It looks awesome and is built very well, and I'm enjoying the Android operating system. I preferred this phone to a lot of other Android options"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Hermoso! Lo amo!",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "Totalmente enamorado y satisfecho de mi pixel 9 pro. Tenía el 7 pro y que gran cambio han hecho con el 9 pro."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Exelent phone, thank you google, very beautiful, fast,"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sick. Got phone!",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I have this phone two days, the Google Pixel 9 Pro, everything is crazy! But the battery life sucks!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than Samsung",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I bought this Pixel 9 Pro as an early Christmas present for my wife as a replacement for her older Samsung. As we both dislike Apple phones, this was a no brainer upgrade and she loves it. She was somewhat familiar with Pixels and the Google world as she liked my Pixel 8. Everything works smoothly, all her apps work well, it is fast and smooth, and the camera is fantastic comparatively. She can now use a fingerprint as her Samsung sucked at that. The size is perfect for her smaller hands. I put a nice Crave case, as it is a slick phone, and screen protector on and she is pleased all around. I may even have to get a Pixel 9 Pro for myself.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A very performant and slick phone.",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "The processor and added RAM in this phone make it very snappy and capable of multitasking.The design nearly copies the profile of the iPhone, and that's a good thing. Apple does design well. The phone isn't as large and clunky as many other modern Android phones.If you haven't used a Pixel, stock Android makes Google phones' software superior to most other big brands like Samsung. The bloat that theses companies add to \"Android\" often slows down the phone and makes them feel sloppy.The only Android phone I'd suggest over this Pixel is one of the new Motorola/Lenovo phones if you are budget conscious.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Love this phone. Feels so good in hand"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice phone",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "So far so good. I love this phone. It was definitely time to get a new one. I had a S10 that was very old so definitely an upgrade recommended 100%"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente celular",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "Super contento con el producto! Excelente servicio"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Llego a tiempo",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Llego perfecto"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Es buen equipo pero estoy desepcionado, esperaba mucho más .",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Compré el Google Pixel 9 Pro con altas expectativas, ya que su diseño, tamaño más compacto y las características de su cámara realmente me llamaron la atención. Debo admitir que las fotos y los videos tienen colores muy reales y una excelente estabilización, pero, lamentablemente, no fue suficiente para convencerme de quedármelo.El mayor problema fue el sonido. Utilizo audífonos todo el tiempo para escuchar podcasts, y aunque esperaba una gran experiencia con los Pixel Buds, no me convenció la calidad del sonido espacial en comparación con lo que ofrece el ecosistema de Apple. Esto fue un gran punto débil para mí.Al final, después de probarlo durante una semana, decidí devolverlo. Aunque es un buen dispositivo en algunos aspectos, no cubrió mis necesidades ni cumplió con mis expectativas generales. Siento que sigue estando por debajo de lo que ofrecen otros equipos.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finally, a Pixel worth owning after generations of crap.",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "I had a 7 XL and a 7a previously and hated them both. The 9 has been great. Good battery life, good fingerprint sensor, everything runs smoothly. I haven’t sworn at it once and from me that is high praise.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "This is my 4th pixel phone and it's a great phone and prefer it to any other android phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    La mejor compra calidadny precio",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "Excelente compra, en mi país hay dos compañías de cobertura Claro y Tigo, las cuales utilizan las bandas B4 (1700/2100 AWS 1) y B5 (850), ojo en mi país solo claro solo utiliza la B4, en octubre compre el nuevo Pixel 9 pro XL y también me dio son problemas, uso dos sim, la sim con Claro y la ESIM con Tigo.Excelente cámara, es muy fluido, tiene 7años de actualización, es muy bonito, muy contento con mi compra",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone in the market",
      "date": "Reviewed in the United States on January 1, 2025",
      "body": "I can relate about a few other phones on the market, and the Google Pixel 9 Pro has everything that someone need and more. The camera really beat the IPhone camera, I had doubts on this before obtaining the phone, but the photos are really good (beyond what you think)."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything included, it all works !",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Perfect size, extraordinary support, nothing left out"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pure Google Perfection",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "My Pixel 9 Pro XL was already a fantastic phone, but the Android 15 update has made it even better.  While it's not a radical overhaul, Android 15 brings a noticeable improvement in performance and responsiveness.  Everything feels snappier and smoother, from launching apps to scrolling through web pages.The updated interface is clean and modern, with subtle refinements that enhance the user experience. I appreciate that Google didn't go overboard with changes, instead focusing on polishing the existing Android experience.While there aren't a ton of new features, the ones that are included are well-implemented.  The enhanced privacy controls give me more granular control over my data, which is always welcome.But honestly, the best thing about having a Pixel is being on the bleeding edge of Android updates.  It's a great feeling to know that I'm running the latest and greatest version of Android as soon as it's available.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    200 Giftcard",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "I bought the phone on Amazon instead of via the Google Store because Amazon offered a 200$ gift card with purchase. I believe Google offered the same thing, but I could use an Amazon card more than a Google card.I've set up the phone, it's smaller than my current iPhone 13 Pro Max (which I like) and I missed android, and it works great. I've had no issues so far. The only issue I have (which is just a personal one) is android car play in comparison to apple car play. Apple is far better. Oh well!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid phone, but not a significant upgrade over previous gen",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I honestly think the Pixel 8's rounded edges made it the more comfortable option, but the 9 Pro bezel polished metal is easy to grip most of the time. I do not use a case, and I've only noticed a difficult grip in excessively dry conditions. I do not have very large hands, and the camera bar adds an ergonomic hold that makes this feel secure in my hand and easy to hold and use.Although this has some more memory and some exclusive AI features, I don't benefit from them much to say they're worth the upgrade. Gemini is great at some conversational AI, but isn't always accurate and I don't need to (re)write emails/texts in new tones or such, so I don't use LLM stuff much.  I love the camera though, and I've never experienced slowness or sluggishness (not that I had much issue with that on the Pixel 8 either).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but like a bigger screen.",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "It's just so small. Every time I am typing a text, I accidentally pressed the home button. I thought I'd get better at it but it's been two months and I just keep doing it. Camera is great. Processing speed it good. I just need a bigger phone screen I think.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best smartphone!",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "I love this smartphone, it's really good. Camera it's just amazing!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best acting Pixel to date",
      "date": "Reviewed in the United States on September 17, 2024",
      "body": "Last Pixel device i owned was the 7 Pro, both that phone and the 6 Pro soured me for awhile on Google.  Bounced around Motorola and One Plus for a bit, and thought i'd try again with a 9 Pro.  The phone i got works pretty much spot on.  I still sense some thermal activity here and there and i'm a bit sad that Google can't seem to figure out Rapid and Efficient phone charging yet, but otherwise this Pixel works very well.  It's a keeper for me.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Huge Upgrade from 6 pro to 9 pro",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "I'm a 15 years google phones user. From Nexus to Pixel. It's still my perfect choice for an Android phone.Highly recommand for those  users who love pure Android experience or want to do some develop of APP."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blazing fast!",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I'm amazed with this phone. Super fast, sleek design. Totally love it. I come from an pixel 8 that lasted less than a year with a problem with the screen. Let's see how this one does...."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than the S24 Ultra by far",
      "date": "Reviewed in the United States on November 3, 2024",
      "body": "I don't regret getting this phone not one bit like I do for getting the Samsung S24 Ultra.Camera on the Pixel 9 Pro XL is very nice and more clearer than the S24 Ultra and more detailed in certain lighting conditions, though that goes both ways.Battery life is extremely good for my use case as I'm only at 3Oish percent left at the end of the day with medium to heavy use and it lasts a little longer than the s24 ultra does for me.( My review is not really that good but I really do love this Pixel 9 Pro XL and it's actually my very first pixel phone I've ever owned )",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Un buen pixel, debil procesador para el price tag",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "llevo teniendo pixels desde el 6 pro, luego 7 pro y ahora 9 pro xl. desde el punto de vista de un usuario promedio de la linea pixel el pixel 9 pro xl es un salto en cuanto a calidad y construcion, por supuesto si tienes un pixel 8 pro o incluso un 7 pro y sigues feliz con tu dispositivo no creo que sea necesario cambiar al nuevo, pero si te importa el nuevo diseno, pantalla mas brillande, AI y todo lo demas pues si es un salto, sin embargo el procesador en numeros crudos es mucho mas debil a snapdragon o A bionic de apple, pero para el 99% de los casos no notara que esta detras de estos.Actualización: la batería es realmente mejor (en comparacion pixel 7P), las camaras si bien son mucho mejores no diría que es un saltó extraordinario pero siguen siendo las mejores cámaras del mercado, el cristal es facil de rayar (consigue un case y protección para la pantalla), las funciones de AI son muy buenas y útiles dependiendo de tu uso, sin embargo solo se puede sacar provecho en inglés.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "It works well, what else should I say?!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great fully unlocked",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "No problems switch from Pixel 8 to 9: 👍 everything works great"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but lacks key customisations options",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "Good but lacks key customisations options found on other Android devices such as type of color adjustments from warm to cool. No a-z in the app drawer etc",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ease of use",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "I thought it would be more like my old one, but something new, that I don't understand pops up about every week."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product! Read full review for more details!",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "I've had this phone for about a week now, and this is the first time I don't have any complaints about a phone. It runs great! (I had a S22 Ultra before this). With comparing the specs to what I had I was expecting to be disappointed in the camera quality, when I got to the camera on the Pixel, I was honestly blown away by the quality of the photos I've been getting. The battery life is better than any phone I've ever had in my hands (iPhones included) when it comes to heavy use. The speed of the processor is great! So far no issues! I really enjoy the experience of having this as my first Google phone. I hope I can enjoy this phone longer than my previous one!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Super Fast and Amazing Camera",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "I got this phone yesterday and have been obsessed. I can already feel the difference with the super fast refresh rate. The camera has incredible zoom that even lets me get close up pictures of stars. I went from having an iPhone Xs to this and the only major difference has been some of the controls. The phone is also incredibly light and looks sleek and relatively thin",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Tremendo equipo",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "Me gusta su comportamiento sobre todo en Youtube."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "I am completely satisfied with my new phone. I am sure I am not using all the functions it has, but so far it exceed my expectations. I am an Android user, so I can not talk if it is better o not that apple. I hope to use it at least for 3 years considering it's cost.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Had to return and had no issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing.",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Best phone I've ever owned. Hands down. I am going to make nice with the AI so when our new robot overlords take over I will be in good with them. I, for one, welcome our new robot overlords.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    all i needed",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "I used to have a 2020 phone and the quality jump is huge. Ultra fast, great camera, good battery, and it's very pretty in the porcelain color.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    cumple",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "CELULAR CUMPLE CON EXPECTATIVAS"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sleek phone",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I'm new to Android. But I'm glad I went with this one. My pictures are amazing and everything is pretty user friendly."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google finally got it right",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "I've been a pixel user for years and although I enjoy the software, every year it felt like they didn't quite get the hardware right. This year, they checked off all the issues. The camera is amazing, the display is bright and gorgeous, the phone doesn't get too warm, and performance is solid with nothing to complain about. A bit pricey at $1000 and up but that's basically just smartphones these days."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it!",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "My favorite phone ever so far. I love the shape of this phone, with the nicely rounded edges, a stable camera bump, and a completely flat screen. I hate screens that curve down at edges because it doesnt actually add anything useful to the phone and just shows a distorted image, and makes using screen protectors worse.This preforms excellent and maintains performance nicely. Sure it might not be as fast as Snapdragon 8 gen 3, but all phones have performed at a level you cant tell the difference for quite a few years now so what does it matter you dont win a benchmark when you cant tell the difference in real life?Battery life is excellent too, and the phone rarely gets hot even in the games I play.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid pretty. Heavy Poor battery life and terrible voice to text",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "That is great aside from the battery. Life sucks. Andthe voice to text is absolutely terrible, which I imagine isn't specifically the phone's fault but Google 's engine. it's just god-awful seeing as how this is supposed to be the be all to end all of Google's technology, the pixel 9 pro XL should be the very best that they have to offer is really disappointing that the flashy text is so bad and the battery  life is pretty crappy",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    perfectly new",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Came on a bigger box, brand new, looks awesome"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Runs hot but it has a lot of neat features",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "This is definitely a keeper even though I'm not happy with some of the things on it like it runs hot",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not happy with this phone",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "I bought this phone because of its camera review. The camera is average quality. After you take a few pictures, the phone drastically heats up. The pictures are good when it's a clear day, but otherwise for every other ocassion pretty average. Will probably go back to Samsung."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Phone",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "10/10 recommend making to switch from iPhone to this pixel 9 pro XL. ZERO regrets"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not integrate in a straight forward manner",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I purchased this phone to replace a pixel 8 pro, as it seemed like a one for one swap with all of the interconnected Google devices. I.e. nest, watch, wifi mesh, cameras, etc... I was wrong.This phone may have great ram, great refresh rate, and on and on, but if it does not integrate, I regret purchasing this.I am leaving this review in the event there are folks out there that are looking to purchase another piece to their already fragile Google \"smart home\", without making things worse. This phone does not support the same thing as the pixel 8 pro. Avoid this rubbish until the QC folks at Google do their job and integrate this insanely expensive telephone with some general use capability. Maybe revision 2 or 3 will be customer ready, the current release is not ready. Do not buy if you expect to use this phone as a part of a larger Google product environment, it does not integrate.As a one off device, it is a flagship brand-name cell phone meant for 2024, it has the same computing capability as all flagship phones, nothing surprising there, every year pixel modules on the phone improve ever so slightly, nothing worthy of note.I was looking for a device to replace my previous multipurpose cell phone, I was mislead to believe this device was essentially an upgraded version of the 8 pro, it is not. After days are of fruitless attempts, this phone will not connect to my Google wifi mesh, my pixel watch, or the other Google home accessories that I've purchased directly from Google.Avoid this bad product, until Google fixes their laziness.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Luv everything about this phone",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Awesome amount of technology packed into thiscompact phone.I don't see how a smart phone can be any better.The camera with telephoto lens is the main reason I got it.But am amazed at even the high quality audio recordings this makes.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nice but pricey",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "it's my best android phone so far... how interesting the metal frame is like certain model of Iphone, though I never used it before and i like the design",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is my third Google Pixel, and I really like it!",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "The quality of the materials is top-notch. It truly looks like a flagship.I'm pleased that with each new model, the Pixel gets better. It really knows how to pleasantly surprise. I also like that the Pixel isn't overly advertised yet. People are still curious about what kind of phone it is and why it's so cool. They're trying to understand why people with money choose the Pixel over \"fruit brands.\" Perhaps when the Pixel becomes very popular and every other person has a Google Pixel, I'll stop using it. I hope that doesn't happen.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente 👌",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Era justo lo que esperaba"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Longtime Pixel User",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Very very happy with this new pixel. Super fast, no more fingerprint issues, camera blows everyone's mind, and the AI actually has daily uses with all the integrations into Google's app. Couldn't recommend more, expensive but if you can swing it you'll be delighted as well I'm sure🔥🔥🔥.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A true top of the line contender.",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Perfect? No. But more than good enough in enough areas to be fairly close. I am still finding new things I hadn't realized it had or could do."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best pixel design so far",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "I love how this thing feels in my hand. I've had every pixel since the 6 and this design is it! Also all the tech stuff works well as it should",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent device",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "Great deal, very happy with my new phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Product",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "Ive been a previous Pixel user (4xl, 6 Pro & several Nexus before that), I wasn't a fan of the P7P or P8P design, unfortunate I had to switch to a iphone 15 Pro Max, wasn't really happy with ios but dealt with it, when the P9P was announced I ordered it ASAP (bummer that I had to wait almost a month for the phone), been using it a while and loving every moment of it and showing my friends Gemini and the add me feature.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on October 3, 2024",
      "body": "After almost a month of owning this device, I can say that I love this phone. It really reminds me of my old Google Nexus 5, a phone I had almost a decade ago. The camera, the screen and smoothness of operation really reminds me of that. The fingerprint sensor in the screen is also a plus, I had a smooth transition from my OnePlus. Overall a great phone so far, and I would recommend.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AWESOME BATTERY LIFE! Beware of users in other languages than english",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "The phone is awesome! It feels sturdy and the flat screen is a GREAT plus for me.I am comming from a Pixel 7 Pro, an also excellent phone but this one is better (not by far, but better).The most notably difference is the battery life! I had difficulties to reach bed time with sapre battery, with the P9ProXL I have 40% left when I go to bed!!!The great problem is that my main language is Spanish and the AI features only work in English.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "First time I splurged on a flagship and so far I'm glad I did, definitely worth it. I've only purchased Samsung or Motorola in the past but after doing a lot of comparison shopping, reading multiple online reviews on various sites and watching side-by-side comparison videos I decided to purchase the Google Pixel 9 Pro XL.Great battery, video quality, size, lightweight, slim even with a protective cover.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great mobile",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "I love it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    True cell phone No Regrets with this purchase",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "My new daily driver this phone is fast responsive amazing quality..it's true you get what you pay for ...did I mentioned amazing 🤩",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Android phone",
      "date": "Reviewed in the United States on October 22, 2024",
      "body": "I'm both Android and Apple user. It's been a full month since I'm using this phone, I like it, I'm not going back to Samsung for sure. One thing to note is that the camera in video mode often doesn't automatically adjust focus... I'd take off some points for that. Otherwise it's a great Android phone with nice features",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pixel 9 pro xl",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "El mejor teléfono que he tenido. Me encanta."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't fall for the hype.",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "First off, I have been a happy owner of Pixels going back to the first model. However, the battery life of my Pixel4a 5G is better and the rear fingerprint scanner is far superior than any of these crappy screen fingerprint scanners. The one on the Pixel 9 is no better than the crappy one on my old Samsung that's a few years old. Seriously, none of these newer phones are worth the prices unless you feel the need to have the latest and \"greatest\" phone for nit picking and bragging purposes. Sure the camera is better but it's a phone! Wish I did not purchase and just installed LineageOS on my Pixel4a 5G, instead. Bet I could get a few more years out of it with nothing more than the cost of a replacement battery when the time comes.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Es buen equipo pero estoy desepcionado, esperaba mucho más .",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Compré el Google Pixel 9 Pro con altas expectativas, ya que su diseño, tamaño más compacto y las características de su cámara realmente me llamaron la atención. Debo admitir que las fotos y los videos tienen colores muy reales y una excelente estabilización, pero, lamentablemente, no fue suficiente para convencerme de quedármelo.El mayor problema fue el sonido. Utilizo audífonos todo el tiempo para escuchar podcasts, y aunque esperaba una gran experiencia con los Pixel Buds, no me convenció la calidad del sonido espacial en comparación con lo que ofrece el ecosistema de Apple. Esto fue un gran punto débil para mí.Al final, después de probarlo durante una semana, decidí devolverlo. Aunque es un buen dispositivo en algunos aspectos, no cubrió mis necesidades ni cumplió con mis expectativas generales. Siento que sigue estando por debajo de lo que ofrecen otros equipos.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid phone, but not a significant upgrade over previous gen",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I honestly think the Pixel 8's rounded edges made it the more comfortable option, but the 9 Pro bezel polished metal is easy to grip most of the time. I do not use a case, and I've only noticed a difficult grip in excessively dry conditions. I do not have very large hands, and the camera bar adds an ergonomic hold that makes this feel secure in my hand and easy to hold and use.Although this has some more memory and some exclusive AI features, I don't benefit from them much to say they're worth the upgrade. Gemini is great at some conversational AI, but isn't always accurate and I don't need to (re)write emails/texts in new tones or such, so I don't use LLM stuff much.  I love the camera though, and I've never experienced slowness or sluggishness (not that I had much issue with that on the Pixel 8 either).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid pretty. Heavy Poor battery life and terrible voice to text",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "That is great aside from the battery. Life sucks. Andthe voice to text is absolutely terrible, which I imagine isn't specifically the phone's fault but Google 's engine. it's just god-awful seeing as how this is supposed to be the be all to end all of Google's technology, the pixel 9 pro XL should be the very best that they have to offer is really disappointing that the flashy text is so bad and the battery  life is pretty crappy",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not happy with this phone",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "I bought this phone because of its camera review. The camera is average quality. After you take a few pictures, the phone drastically heats up. The pictures are good when it's a clear day, but otherwise for every other ocassion pretty average. Will probably go back to Samsung."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not integrate in a straight forward manner",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I purchased this phone to replace a pixel 8 pro, as it seemed like a one for one swap with all of the interconnected Google devices. I.e. nest, watch, wifi mesh, cameras, etc... I was wrong.This phone may have great ram, great refresh rate, and on and on, but if it does not integrate, I regret purchasing this.I am leaving this review in the event there are folks out there that are looking to purchase another piece to their already fragile Google \"smart home\", without making things worse. This phone does not support the same thing as the pixel 8 pro. Avoid this rubbish until the QC folks at Google do their job and integrate this insanely expensive telephone with some general use capability. Maybe revision 2 or 3 will be customer ready, the current release is not ready. Do not buy if you expect to use this phone as a part of a larger Google product environment, it does not integrate.As a one off device, it is a flagship brand-name cell phone meant for 2024, it has the same computing capability as all flagship phones, nothing surprising there, every year pixel modules on the phone improve ever so slightly, nothing worthy of note.I was looking for a device to replace my previous multipurpose cell phone, I was mislead to believe this device was essentially an upgraded version of the 8 pro, it is not. After days are of fruitless attempts, this phone will not connect to my Google wifi mesh, my pixel watch, or the other Google home accessories that I've purchased directly from Google.Avoid this bad product, until Google fixes their laziness.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible charging",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "Mostly a good phone but refuses to charge with chargers and cables that work fine for the Pixel 4a.  Extremely disappointing and frustrating to have to troubleshoot charging straight out of the box at this price point."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Washed out screen",
      "date": "Reviewed in the United States on November 30, 2024",
      "body": "The pixels seem to be going downhill. The screen on tbis one looks washed out, and the blacks are not as dark as on my Pixel 8. I also have a OnePlus 12R that is better. I can't recommend this version of the Pixel.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor quality",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I thought this phone was gonna be great. It turns out for $1400 it has outdated UI, front camera lighting is very weird and poor in low light. Front camera takes good pictures but the lights has a bloom or streak of light in the camera and pictures. I wiped the camera multiple times but it seems to be the camera itself. The audio isn’t very good either it’s kinda quiet and ok sound quality.I personally wouldn’t recommend this phone. Was hoping to give it to my fiancé but instead bought her the exact phone as I have. iPhone 15 pro max"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wish I could return it",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "There are a couple issues, some major some minor, my previous experience was an S21 Ultra, here's how this compares- My biggest issue is the fingerprint scanner - compared to what I had before this is EXTREMELY frustrating, I'm not sure if my phone is defective but I'm left using the code to unlock 90% of the time because it doesn't pick up my fingerprint- For a phone touted as an amazing camera phone something as simple as switching your camera from front to back or vice versa while recording should be a feature like it was on my S21 ultra- Video Boost is unusable - 1) I have to turn it on before i record each time and 2) when I do remember to turn it on it takes literally hours to process a video of a few secondsSmaller peeves- Navigation - I cannot change the order of the on screen navigation buttons so I was forced to use gestures to navigate which isn't that great- A bit duplicitous but navigation / touching the edges of the screen such as when i'm trying to record a voice note sometimes just doesn't work - as in my voice note just cuts off, it really feels as if I've a defective product- The launcher seems just very limiting in general and frustrating to useI've always changed phone brands in the past, oneplus, samsung and even a very old nexus device, this is by far the most frustrating experience I've had with a phone",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crippled by Bluetooth problems",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "I want to love this phone. It's fast. The battery life is great, the screen is awesome, the camera is great.But the Bluetooth...Pairing anything is difficult, sometimes taking multiple attempts.To get media to connect in my car I have to toggle the media connection off then back on every time (connects automatically for calls).It doesn't connect to my Fitbit Aria Air scale without pairing again every single time.Audio in Bluetooth earbuds had static (fixed by disabling hardware offloading in developer settings)I don't know if this is a hardware or a software issue, but I'm on the verge of sending it back for a refund and getting something else after looking into it and finding many others are having similar Bluetooth problems."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok but not great",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Ultimately, it's a phone with a big brand name on it and nothing more. My OnePlus was better than the Pixel, especially the battery life. Even after 5 years the battery on the OnePlus lasted longer than the Pixel's. The quality is good but you ultimately pay a premium price for an average product."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone but fake offer",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "Phone is really good, not complaints for the phone but Amazon and google offer Gemini Advance free for a year but the offer is not available for everyone. Be aware of that is you are going to buy this phone because of the offer.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    9 pro xl",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "There was alot of concern when I got the phone. But I did the transfer over. As I explored the phone I realized the camera was having issues and it was intermittent but most definitely not better then the 8 pro. Then I noticed I lost all my pictures on my google accounts..none would transfer. So after doing everything I could think of I did a hard reset and did a transfer again and had the same issue. I was not willing to lose those pictures and also was confused how that could even happen. The sound was also very quiet. Not sure if they just sent a refurbished phone but I am so disappointed.I did a return after a day. Now I have to wait till Jan 15 for a refund when I could have used any other company and not had this issue. Also the return process is sketchy. I took it to the locker and the person handled it rough luckily we took pictures before it left our hands and as we handed it over.Here we are over 30 days later no refund and still dealing with going back and forth and being told to wait.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible Bluetooth, apparent working as intended",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "I've had this phone for less than a week and spent most of this morning talking with the support people (to their credit, they're open 24/7), the local repair shop, etc.  I cannot get the phone to consistently pair with my Garmin watch, which, apparently is a known issue within a week of the phone being released. I know this because the repair guy's attitude is, \"well it is a problem for everyone\".  It also drops connections with HRMs (Morpheus brand) and several ear buds and the Heartmath sensor.My issue is that ALL of these work fine with a phone that was FAR less expensive and not very good and not very new.  They ALL work terribly with this Pixel (9 Pro, XL, the sage green/gray one). Shouldn't it be the other way around?I even factory reset my Garmin to get it to work with the phone at the repair place (that google sent me to!) and now I can't get my watch face back on because no amount of restarting devices will get the phone and the watch to talk to each other.If this is happening within a week, what's going to happen as we move into year 2 of owning this thing?No issues if they sold this phone for $200. But this is a $1200 phone. Google doesn't seem to care at all.",
      "helpfulVotes": 50
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera reads colors completely inaccurately",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Wow, I will never buy another Google product again. Functionally (except for the camera) the phone is fine. However, I bought the 9 Pro for the much vaunted camera. It's garbage. It misreads colors entirely (for ex., greens usually show up bright blue - see attached photo), and are otherwise often faded or washed out looking. Google's help center is worthless. It's clear by searching that this is a common problem, but the help center has zero info on it. Unfortunately, I missed my return window or I would have ditched this phone. Waste of money. Back to Samsung for me.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Limited Compatibly with integrating to other devices like Windows",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I am very disappointed with phone integrating with other devices such as Link With Windows. You cannot run programs on Windows like with other manufactures like Samsung and ASUS. You can only type a text and make a call from Link With Windows. I miss so much compatibility that I have with the Samsung such as DEX. I hate having to actually lift my phone and type a text or make a call from another app such as WhatsApp.What the Pixel does well is the photos are awesome and the AI corrected photos are typically spot on. You also get monthly regular updates."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery SUX",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Had phone less than 2 months, I don't play video games nor watch movies on it but the battery dies out before the end of day.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will not make calls!  Privacy Nightmare?",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "It must have 40 apps, some wanting to be able to follow links.  Are they sending photos/videos, copies of my text messages, etc., home to Google?  Why do all these companies want your data?  Of course, they say it is only \"non-personally identifiable data\".  Really?  So we're supposed to trust you with that?  I get the impression that this phone is a privacy/security nightmare.  All of them might be; this one just seems to be worse than any of them.Will not make calls!  It says make phone the default app.  So I did, and it shows in settings that it is the default.  A phone that will not make calls is like a car that will not drive.  It is useless!",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No instructions.",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Not a good buy."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen Teléfono, lastima que no se puede usar la promoción deIA",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "Los 12 meses de suscripción AI Premium de Google One de 2 TB, no los puedo obtener.Por lo demás buen dispositivo, pero mejor me hubiese quedado con mi pixel 8 Pro o seleccionar el pixel 9."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Battery Life - No Improvement from Pixel5",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "I previously had a Pixel 5 which finally died.  This device has a noticeably worse battery life,  is heavier, and adds no noticeable value or features.  In addition it actually lacks the headphone jack.  I can't listen to music and charge it at the same time.  The price is astronomical.It seems to go overboard with camera gear.  I think all of the innovation in the last 5+ years must amount to jamming more camera gear into the phone.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "It's a nice phone but the spearkers are horrible. No bass whatsoever and when you turn up the volume (not even all the way) it starts to static and crack.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Ofrecian plan de un año de Gemini Advance y nunca me dejo hacer la actualización",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "No pude hacer la actualización de el Gemini a la Versión Advance"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked Phone, Not All Features Available",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Strange, not all features are available depending on the SIM card installed in this unlocked device.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was fine for 3 months...",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Bought it on October 1st 2024, it updated overnight last week and now has a permanent pink line on the screen. I thought a $1600 phone would last longer than 3 months. Not happy at all, would not recommend.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got a used phone when I ordered a new one",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "I ordered a new pixel 9pro xl and when it arrived the security tab on the phone box were already off and the phone itself had fingerprints all over. Not what I was expecting when buying a 1200 phone.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used Phone",
      "date": "Reviewed in the United States on November 24, 2024",
      "body": "I was sent a used phone. Wasn't in it's original packaging Wasn't factory sealed box was damaged and was missing the sim card remover.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Delivered a used phone",
      "date": "Reviewed in the United States on September 22, 2024",
      "body": "Was one of the first to order during the pre-order period and still received a previously used phone lol. Worst delivery system",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality, size and style not good for the price",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Quality, size and style not good",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bruh",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "Box came with an older phone",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    9 pro bummer",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "S L O WHate this phone",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed coming from iPhone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I’ve had pixels and other android devices in the past. About 5 years ago I switched to an iPhone. I get bored or it’s just time to upgrade and I’ll try a pixel. Last time was the pixel 6. Had tons of issues. After a ton of research I bought the pixel 9 pro. Well… it was definitely disappointing. There’s a wireless charging bug or possible a hardware mess up from Google. MagSafe chargers will constantly disconnect and reconnect until it sort of warms up. It’s janky. The finger print sensor is definitely an improvement over the pixel 6 but is no where near as fluid and reliable as iPhones IR Face ID. Many apps are designed for IOS and there’s definitely a noticeable lag and other bugs when using android. In my opinion Google has some catching up to do. Just got an iPhone 16 pro and it’s been at better than the pixel. Everything works flawless. Just hoping to save some folks some time and money. Stick with an iPhone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    annoying AI",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "I swapped cell providers and they gave me one of these. No way to remove google ads from your home screen and no way to fully remove gemini or assistant"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perspective of someone who had a Pixel 8",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "Performance - I went from a Pixel 7 Pro to a Pixel 8 because I wanted a smaller phone. Unfortunately that meant taking a cut in RAM from 12GB to 8GB. This introduced a pretty massive problem for me because it meant I couldn't run Google Maps + Spotify + V1Driver (radar detector app) simultaneously while driving because V1Driver would keep closing in the background. With the 9 Pro's 16GB, I haven't had any issues at all with my phone closing apps in the background.Size - I'm really glad Google introduced a slightly smaller pro phone. I'd love if Google made a Pixel Pro Mini that was even smaller (iPhone 13 mini size).Design - I'm a huge fan of the squared edges making a return. It makes installing tempered glass so much easier. I stuck to Sony Xperias for a long time almost exclusively for this reason.Fingerprint reader - Google has finally moved to an ultrasonic fingerprint reader and it is so much better than the optical readers of the last two generations. With the Pixel 7 Pro/8 my fingerprint worked about 65% of the time. With the 9 Pro, I have a near 100% hit rate with a Spigen Tempered glass.Complaints - here's what prevents this from being a perfect phone. It starts at 128GB (storage upgrades are insanely overpriced) and is non expandable. Yes, most phones haven't had a MicroSD card reader for a while but I will not stop complaining about it because of how critical it is to the longevity of your device.Final thoughts - I'm far from an average consumer and couldn't care any less about the \"AI features\". I only ever use AI when I'm coding/working and even that I do on my PC with GitHub Copilot. I'm pretty happy to have a phone that does almost everything I need. But if Google ever reintroduced expandable storage, or made repairability any easier, they'd get 5 stars, easily.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't Buy if Picture Quality is Important to You",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Good as long as picture quality isn't important to you. Picture quality is one of the most important features to me so I watched a lot of videos comparing the Pixel Pros 8/9 vs. Samsung S24/25. I found multuple videos saying that the Pixel was better and we needed two new phones so I went with the Pixel and my wife went with the Samsung, both the highest end models from both companies. The Pixel is way behind in camera quality compared to the Samsung. Colors aren't captured well and the clarity is terrible for a phone that cost over $1000. If you are someone that keeps their phone for years, definitely pay the extra for the Samsung, It's worth the cost difference spread out over 3-5 years because you will have thousands of pictures and hundreds of videos that you want to be as accurate as possible. If picture quality isn't that big of a deal to you, the Pixel is fine. It performs all other functions well",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too Heavy",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "This phone seems very heavy in your hand. What ever happened to phones getting thinner?The phones functionality seems fine. Apps are smooth and fast. Bluetooth works flawlessly.Just be warned you will notice this heavy thing in your hand and pocket.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREEN DOTS that Google disowns",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "GREEN DOTS APPEAR in my Pixel 8 pro and see below email on how they disown. Now, you decide if you want to buy Pixel 9.----------------------------------------------------------------Thank you for contacting Google Support.This is Diana, I'll be assisting you today while the previous agent is currently out of office. I understand your Pixel 8 device is having a green screen issue. We apologized for the inconvenience this has caused you.I understand you purchased your device from T-Mobile in the US, but you're currently travelling in India and will be in Chicago in April. Your device's warranty expired on February 19, 2025. While your device was still under warranty when you first contacted us on February 12, 2025, the warranty is only valid in the country where you purchased the device (the US). Because you're currently in India, your device is considered outside of its original warranty coverage.This means that if you choose to have your device repaired in Chicago, there will be repair costs, as the warranty will have expired. However, since you're currently in India, you might want to consider having the device repaired there but it also has a repair cost. There are authorized repair centers in India, and repairing it there might be more convenient for you at this time.If you'd like to explore repair options in India, please let me know.Thank you for your continued support and being a valued member of the Pixel family.Best regards,DianaThe Google Support TeamGoogle Google Help Center© Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043 USA"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon shipping sucks... Buy elsewhere",
      "date": "Reviewed in the United States on August 29, 2024",
      "body": "Great phone! I know because I bought 2, one from Amazon the other from best buy. The best buy one was delivered before the Amazon one even shipped and the arrival date keeps getting pushed.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst phone I have ever owned.",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "The most expensive and worst phone I have ever purchased. I've never had an Android phone this buggy. It changes time zones to another country in the middle of the night and changes my clock with it. So I have alarms going off at the wrong time. It won't let me use Gemini AI because it thinks I'm in another country. Even though Google maps shows me exactly where I am. It's not any faster than my pixel 7 was. unless you need to talk to satellites in emergencies I would buy a used pixel 7 over this and save a ton of money."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Software needs updating (immediately)",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "I just got this and expected a cutting edge device.Sadly, and confirmed by Google reps who I called, their current software build cannot support some simple features like having more than 1 favorite contact or assigning ringtones to individual contacts. (Except for third-party apps for some reason.)This is not just about those features. If they can't do features that we cracked in 1997, what other deficiencies does the software have? I spoke with the reps form my carrier and were unaware of these shortcomings and willing to take the phone back. TL:DR Stay away until they update the software.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No compren",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Compre el Google pixel hace 1 mes y estuve de viaje 17 días, al segundo día se congeló completamente, esos 15 días restantes estuve sin teléfono. No hay tiendas oficiales para hacer ningún tipo de reparación y el servicio en línea es súper deficiente, la única solución que me dieron era borrar todos los datos yo mismo o mandarme uno “nuevo” que en realidad es uno remanofacturado, pero si el problema no lo incluye la garantía, ellos te cobrarán el precio completo de un teléfono nuevo :) . Si tienes IPhone y estás pensado en cambiarte a Android al igual que hice yo, te recomiendo pensarlo dos veces, analiza los beneficios y la comodidad de tener IPhone.En lo personal considero uno de mis peores errores el haber cambiado a Android y el haber comprado este teléfono.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Washed out color levels compared to Pixel 7. Returned the product."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible SIM slot location and terrible body design.",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "Terrible SIM slot location and terrible body design. The SIM slot is right next to the microphone hole, clearly creating an impression that the microphone hole is the SIM opener hole, but it is not !!! The SIM opener hole is highly obscure, it can be barely seen - it is located on the curved corner of the phone, is rather small, is on reflective surface, and given the curvature of the corner location can be barely seen in the glare of the silver mirror-like siding of the phone. What kind of a designer in a sound mind would design such a trap??? The first thing one does is pressing the pin into the microphone channel to open the SIM slot. Fortunately, placing the pin into the microphone hole does not damage the microphone, but it still leaves a bitter feeling, since the owner is still concerned that microphone waterproofing mesh could be broken, or the sound channel may be damaged and lead to sound distortion. This experience spoils the happy purchase. Terrible SIM slot location and terrible body design.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google blocks PPS Fast Charging unless you buy a Google USB C cable which doesn't come in the box.",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "This issue is present since Pixel 7 series. High end 3rd party wall chargers and PD cables that work on other Android phones and iPhones doesn't work on Pixel phones because they are not \"official\" Google products. The issue is when you charge your phone you will experience constant charger disconnects and reconnects. Fast charging only works with official Google cable which costs $20.To make matters worse they don't even allow the charger to slow charge. It makes the charger completely useless. Google should change this policy and release a software update to allow whatever cable we want to use. USB C standard is for everyone.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This Pixel 9 launch is $200 overpriced!",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "The Pixel 7 Pro, launched at $1000 with 256GB, is now overshadowed by the New Pixel 9 Pro XL at $1200, lacking significant upgrades to justify the higher price. The G4 processor falls short compared to rivals of the same year, with no notable battery improvements to justify the cost. While I appreciate my Pixel 7 Pro for its performance at its original price, Google's latest models seem overpriced considering the competition from Samsung and Apple in the same price bracket.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    128 GB SSD",
      "date": "Reviewed in the United States on August 24, 2024",
      "body": "I agree with Neftaly Hernandez  that offering 128 GB on a smartphone this expensive is a travesty.  The only thing that is \"smart\" about this move is your wallet \"smarting\" from shelling out extra money to future proof the storage.  It is basically a marketing ploy of \"bait and switch.\"  Offer a low price to get lookers, then show them the inadequacies of the storage and switch them out to what they really need.",
      "helpfulVotes": 32
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not come unlocked",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "I paid out the butt for this phone only to receive a locked phone that I had to PAY to have unlocked. Amazon was completely unhelpful and useless about it too when I complained, offering a partial refund. A partial refund? Excuse me? Completely unacceptable. Zero stars.The phone itself is good once you pay to have it usable.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "title": "No cumple con las especificaciones",
      "date": "Reviewed in Mexico on December 30, 2024",
      "body": "La descripción indica 256 gb de almacenamiento interno, pero el equipo es de 128 gb. Ocultan los datos originales de la caja con etiquetas nuevas.",
      "helpfulVotes": 7
    }
  ],
  "productDetails": {
    "productTitle": "Google Pixel 9 Pro - Unlocked Android Smartphone with Gemini, Triple Rear Camera System, 24-Hour Battery, and 6.3\" Super Actua Display - Porcelain - 256 GB",
    "asin": "B0D7HVWRGN",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Pixel 9 Pro with Gemini is the most powerful Pixel yet, and now comes in two sizes; it has a pro-level camera and it’s engineered by Google, so it gets the best of Google AI first",
      "Unlocked Android phone gives you the flexibility to change carriers and choose your own data plan[1]; it works with Google Fi, Verizon, T-Mobile, AT&T, and other major carriers",
      "Google Pixel 9 Pro’s triple rear camera is the most powerful Pixel Camera yet; get high-quality video up to 20x with Super Res Zoom Video[2]; enhance your videos up to 8K with Video Boost; and take sharp videos in low light with Night Sight Video",
      "Make your photos better than you can imagine with Google’s AI; take a picture and be in it too with Add Me[4]; Best Take helps everyone look their best[2]; and with Magic Editor, you can reframe photos, reimagine the scenery, and more[4]",
      "Get more info quickly with Gemini, your built-in AI assistant[3]; instead of typing, use Gemini Live; it follows along even if you change the topic or switch the question[31]; and Pixel Screenshots helps you save things you’ll want to remember later"
    ],
    "boughtCount": "50+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Google",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$849.00$849.00$849.00",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$764.10$849.00$849.00",
    "buyUsedAvailability": "Only 1 left in stock - order soon.",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "Amazon",
    "soldByUsed": "Amazon Resale",
    "quantityAvailable": [
      "1",
      "2",
      "3"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 5,
    "startingPrice": "$730.14",
    "url": "/gp/offer-listing/B0D7HVWRGN/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0D7HVWRGN",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "SIM Tray Ejector",
        "1m USB-C to USB-C cable",
        "Google Pixel 9 Pro"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$849.00",
    "listPrice": "$1,099.00$1,099.00",
    "savingsPercentage": "-23%",
    "standardDeliveryDate": "Sunday, March 23",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}