{
  "asin": "B08L34JQ9C",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Should Have Purchased One Sooner",
      "date": "Reviewed in the United States on February 17, 2024",
      "body": "After nearly four years with my Samsung A10e, I decided it was time for an upgrade. My criteria were specific: I wanted a more recent, used Samsung phone that was unlocked, had ample storage, and most importantly, featured a microSD slot for my extensive music library. The Samsung Galaxy S20 FE 5G in Cloud Red ticked all these boxes and more.Transitioning from the A10e, the performance leap to the S20 FE was immediately noticeable. Everything from navigating the UI to streaming content on YouTube and multitasking feels incredibly responsive. This phone has transformed my user experience, offering a significant improvement in speed and efficiency.Despite being a renewed device, the quality of the S20 FE pleasantly surprised me. It arrived with minor marks on the sides, but these were hardly a concern given the excellent condition of the screen and the overall functionality of the phone. I've always been particular about battery health, so I appreciated the \"Protect Battery\" feature, which I also used on my A10e. The battery performance has been exceptional, supporting my heavy music streaming habits without a hitch.The larger display is a game-changer. The vibrant colors and increased screen real estate enhance everything from watching videos to browsing the web. I've disabled certain features to extend battery life, but this hasn't detracted from my overall experience with the phone.One of the reasons I opted for an unlocked phone was the flexibility it offers. While I primarily use the S20 FE for media consumption, it's reassuring to know it can serve as a reliable backup for calls and texts if needed. The phone's build quality and care in its refurbishment are evident, making it a solid investment for anyone in the market for a high-quality, used smartphone.In summary, the Samsung Galaxy S20 FE 5G has exceeded my expectations. It offers a perfect blend of performance, quality, and value, making it an excellent choice for Samsung enthusiasts and anyone looking for a premium smartphone experience without the flagship price tag.",
      "helpfulVotes": 104
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect.",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Ordered this phone exclusively to play PokeMMO on mobile since I’m tired of sideloading ios. Phone came in early in perfect condition, no scratches, no problems over the past couple days ive had it and im seriously considering switching from my iPhone 16 pro to this phone completely. Thanks to the seller for shipping it so fast and securely I’m extremely happy with this purchase. $173 is so worth how amazing this phone is.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be Picky About Refurbished Phones - Don't buy if PDI Mobile is seller",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "Edit: This is officially the worst phone I've had in my 20 some years of having phones. If I dare to let the battery drain completely, it's a toss up on if it will charge again at all. Have tried multiple different cords and bricks, no luck. The screen continues to crack and splinter. I'll likely be on the market for a replacement in less than a year. (I never go through phones this fast, the phone I was using before this was a Samsung S8 active. It's honestly in better shape than this one.)Original:The phone is fine, does it's job. I'm not a heavy user. Calls, texts, simple browsing.It still seems to want to be a Verizon phone - I'll have to figure out how to handle that on my own. For now, my voicemail is finicky and the phone is constantly downloading nonsense apps without my input. (So many games!)I'm no stranger to buying refurbished unlocked phones. I've been doing it for years, this is the first time I've gotten a bit burned on it.It could have been prevented, though. If you're looking to buy, be very picky about the condition the phone comes in and immediately request a refund.Before I ever started the phone up, I noticed a small crack in the top of the screen and excess glue around the bezel. I figured it was fine, I'd ignore that and go on. Chalked it up to the cost of getting a refurbished phone.Don't do that.I should have immediately contacted the seller (PDI Mobile) at that point.Since then, the screen has cracked considerably despite having not dropped it. It went into my pocket, uncracked, and came out of my pocket cracked. I had a simple protective cover on it. I have never in my life cracked a phone screen.I assume the cheapest screen available was used to replace the original. It's a good way to cut the costs down.Despite ignoring the first issues, I was well within Amazon's return window at that point and the seller refused. I contacted Amazon customer support, they escalated it to the seller, and the seller again refused.Currently rocking the phone with a piece of scotch tape on the screen so the glass doesn't splinter off into my finger. Classy!So, be picky. And maybe steer clear of phones sold by PDI Mobile.",
      "helpfulVotes": 90
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Included charging cable DOES NOT work...",
      "date": "Reviewed in the United States on July 4, 2023",
      "body": "This was my first experience buying a used phone. I was very hesitant, but am mostly pleased overall.The included cable (no brick included) does NOT charge my phone. They included a very cheap-o charging cable & this phone is PICKY! Actually I found ALL Samsung phones that we have/ have tried are... they only accept a USB C cable with a thicker wall to the plug in part. Any of the cheapo cables will NOT work.On the plus side, I was able to determine that this phone came with 92% battery life by using the ACU battery app...which was a huge concern for me buying a used phone. That was a happy relief!The camera is pretty nice! I tried & returned a brand new A23 before buying this used phone, and that camera was absolutely horrible.. worse than my very first LG cell phone that I got 8 years ago... yes, WORSE than that!After seeing what a piece of junk the A23 was & after talking to someone at the T-Mobile store, they told me that the A series phones are very bottom of the barrel and poor quality. I came to the realization that in order to get a phone that was decent, I was going to have to buy a used phone. I opted for the S20 FE instead of the S21, because the s20 is able to be expanded with a microSD card & the S21 can't be.I am not about to put all my stuff on some cloud or pay for extra storage. I opted out of an iPhone for that very reason. If Samsung doesn't allow for storage cards to expand their phones'  memories in the future, I will buy a different brand that does. After reading several reviews, I know there are others who feel the same way. I sure hope Samsung listens & doesn't go the disappointing route Apple does with their phones & lack of storage expansion.Overall, I'm happy with my used phone & the seller, minus the fact that they didn't even check to see if the charging cable worked that they sent with the phone. It did not & I had to buy new ones just for this phone.I WOULD purchase the phone again, although I'm not super fond of such a finicky phone in regards to the charging cable. I know it's a Samsung thing because my hubby's old S8 is the same as was the A23 I tried & returned. I don't like feeling like I have to carry a spare charging cable with me everywhere in the event that my main charging cable doesn't work with my phone for some reason. I never had that issue with my other brand USB C charged phones. Samsung phones seem to only work with cables that have a thicker wall to the C part of the charging cable. If LG was still making phones, I would have purchased one of those instead. We've tried TCL & Motorola...& Apple is a hard pass, so that left me with Samsung.",
      "helpfulVotes": 36
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    UNLOCKED!!  Great Phone -  Like New!",
      "date": "Reviewed in the United States on February 29, 2024",
      "body": "For some inexplicable reason, the product description says \"Verizon LOCKED\" -- See attached screenshot.  I ordered this phone before I noticed this.  I contacted the seller and was told these phones are Verizon Factory UNLOCKED.  It arrived as UNLOCKED as the seller told me.  I popped in the SIM card and it connected to my network and began working immediately.  NO PROBLEMS.  This phone is UNLOCKED and can be used on most USA cell networks.I use fingerprint unlock for apps.  Fingerprint on this phone works great.  It's ON SCREEN.  You do not need to find a hidden fingerprint sensor somewhere on the phone.  A circle appears and you place your finger in that circle.  It fingerprint unlocks immediately.This phone is fast.  It executes commands without delay and has a LOT of internal RAM memory so you can store data and install many apps.Because it's an older phone, I'm not sure if it will receive future Android OS  updates, but it does still receive SECURITY updates, so it's fine for now.There is one annoying aspect to this phone, but it can be FIXED.  You may see repeat notifications  that say, \"SIM card is not Verizon\".  You can try every setting, but will never be able to kill this notification.  You can kill it by downloading, installing, and  purchasing (for $2) the app from Play named, \"AutoNotification\".If you long press the notification it will give you the source of the notification.  Then, use Autonotification to kill it FOREVER.It this forever notification doesn't bother you, then you will not need AutoNotification, but if you're like me, it's well worth the $2 to make it go away forever.If you want to save money buy purchasing an older used phone, this is a great choice.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    VERY Impressed. Def a HUGE upgrade from my old HTC U11",
      "date": "Reviewed in the United States on December 29, 2021",
      "body": "I started getting notices from Sprint/TMobile that I needed to upgrade my phone to a 5G compatible phone by the end of the year. I went to the store and even though I had not upgraded my phone in 4 years there was no offers/discounts ( days of subsidizing phones really are dead but dang ). There was absolutely zero offers. Even the basic Samsung A32 was no longer offered as a free phone.I am not cheap but I am simply not willing to pay $800+ for a phone that will be outclassed in a few months.Started looking on Amazon for refurbished phone and the seller Last Of The Loot had the S20 FE for $400. Having read reviews from other buyers I knew was still rolling the die with complaints about scuff marks ( Not from that seller in particular but from refurb phone in general. I can accept cosmetic stuff since a refurb just means it functions to spec and blemishes to the case are something you can expect ), the phone being reported as stolen, the previous owner still owned money so it could not be unlocked, cracked screens, etc.I got this phone and when I opened the box it looked like it had never been used. Screen and case were pristine. It came with the owner's manual and a 15W charger. I know some people complain about that but this phone charges pretty fast and has pretty good power management so unless you are watching 4K videos all day or treating it as a portable game console the charge rate is really good IMHO. I don't have a wireless charger but am looking into it now.Phone is quite responsive in all aspects and the screen is simply gorgeous to watch videos on. Sound on the two speakers ( one at the top facing towards you and another at the bottom facing down ) is simply phenomenal. I had an HTC One when back in the day and I thought that sounded good. The difference in sound quality, volume and range of frequencies you can hear in the highs, mids and lows is like comparing $20 radio to surround sound.I have not delved into all the options in detail but I love the face unlock and fingerprint unlock options to secure your phone. Can't say too much about the camera yet since I have never been much of a picture taker but what I have seen so far it will definitely satisfy the average joe.Have used this phone as my daily driver for about 2 months now and have no had any issues whatsoever. I know that if you read some reviews and compare it to the S21 to upcoming S22 or S21 FE it will be another huge jump in performance and features but this looks like it will keep me chugging along for the next several years. If you want a newer phone but are on a budget or like me, you just find $1000+ for a phone to be ludicrous, this is good combination of price and performance.",
      "helpfulVotes": 48
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Swipe Sensitivity Issues",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "It looks good and works well for the most part, but the touch screen sensitivity is off-putting for me. For example, I try to navigate across sites and apps but end up unintentionally clicking on various aspects of said sites and apps. After some research,  I learned that it is a long standing issue with the FE series of S20s. This is a decent phone, but it fumbled on what should have been a critical feature."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good condition, as advertised",
      "date": "Reviewed in the United States on August 10, 2023",
      "body": "No screen or body scratches. Like new condition, IMO. Charges fast with supplied charger and cable. Battery life  too soon TBD. Also purchased a milspec phone case with screen protectors, which I do for all of my devices and suggest for everyone.Installed and used Samsung Smart Switch app to transfer all my old S8+ phone apps, settings and files to the new one, using wifi direct phone-to-phone. Easy to do but took almost 5 hours to complete due to lots of apps plus huge number of files on the old phones SD card, which automatically transferred to the main 128gb system storage on the new phone. A few settings, like themes and wallpapers, were not applied during this process, but were easy to fix after. I  also have a couple of apps that are licensed and locked to a specific device, (Norton360 and IGO Navigation) and had to uninstall them from both phones then reinstall on the new one. For Norton, I also had to go to my Norton account on PC, remove the old phone and add the new one. Not an issue, just a consideration and a few extra steps.Would have liked to have SD card support, but had researched and knew going in that the 128gb built-in storage would be more than adequate for my needs, including for about 70gb of photos and MP3 audio files I had on the 128gb SD card of my old S8+ phone. I do wonder why it needs 39gb of storage for system files though. Almost 4GB more than on the old phone. That seems extremely excessive to me, but might just be the difference between Android 9 on the old phone vs Android 13 on the new one (after all system updates).Another consideration, which is not really a complaint, as I knew it would happen, is that getting all of the 30+ OS, security and other updates took almost 2 full days to accomplish from a freshly factory reset phone, which this is. This is something that should not be allowed to happen according to the default automatic processes and schedule, as that could take weeks. You need to manually go to Settings / Software Update / Check for Updates, and download and install the recommended system update. Then repeat and repeat and repeat again, as many times as needed, until it says no more updates are needed. If you ever need to do a factory reset, you may need to do it all over again. If you ever sell your phone, remember to do a factory reset to remove all of your personal apps, settings and data, and let the new owner know that they might need to redo this system software update process.Final note: If you are upgrading to 5G for the first time, and have an old 4G SIM card in your old phone, you will need to get a new 5G SIM from your carrier in order to have 5G capability.  For the phone I bought, and my carrier, this was Verizon. I chose to do this only after finishing all of the Smart Switch and system upgrades described above, which only needed wifi. Verizon swapped out my SIM card for no charge.",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was hesitant...",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "I was hesitant as I had never got a rebursished phone before.  I was also worried about how it would be with Visible, if it would be accepted.  Got the phone, was the color I picked out (Mint) so +1 for them.  The defects are not even noticeable, espically after I put my case on it.  Upper left corner is a minor scratch, doesn't affect anything though and then around the seams of the phone on the bottom right.  Right where the front and back snap together.  I am so happy I bit the bullet and got it.  The phone works just like a new one, Visible accepted it, and it is bigger than my old s10e.  The transition from phones was seamless as they are both Samsung.  Would recommend this seller and their phones again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition! UNLOCKED, one issue called a network unlock code, read review!!",
      "date": "Reviewed in the United States on July 6, 2023",
      "body": "I took photos of the phone the day of arrival but now cant find them.. but the phone came in EXCELLENT condition although the packaging was just a box with little to ensure a safe delivery. The phone was unlocked but a **NETWORK UNLOCK CODE** kept popping up when sim card was insterted. (Thats the photo in this review.) So I swore the phone wasnt unlocked. Reached out to the seller and my carrier which was walmart family mobile. I was told by my carrier i needed a new sim card. So i ordered it and when it finally arrived,  boom same error. My carrier reset the sim many times and still no luck. When i had messaged the seller they gave me a code that wasnt right and when i reached out again, still another wrong code. What the phone fails to warn you is that only after a few attempts it will lock you out completely. It will then say **MASTER KEY CODE** needed. I googled what that was and it seemed like a hopeless code to obtain. The startup on the phone says AT & T. So i took it to their store and they had said that yes the phone was unlocked!! But the network was locked to walmart family mobilewhich was my carrier . So come to find out the code i needed, the first code, the network unlock code, I needed from my carrier!  They absolutely missed it and after days of this mess and ongoing phone calls, finally the walmart family mobile agent on that day in the At&T store had told me the codes i needed from day one. Idk how they just skipped the option and blamed my sim card. The codes arent a secret and im still unsure why they didnt recommend theirs to fix it. I guess they just assumed it wasnt their codes needed. But it was!!! Unbelievable right!! So then were now stuck on master key code and no one, my carrier, nor AT&T, nor samsung can help with that. Due to the sellers wrong codes, me googling the wrong codes, and most of all my carriers support line not mentioning their codes, I was locked out and was gonna return the phone. However AT&T did show me other sim cards put into the phone by other carriers were working. It was still unlocked but just couldnt now be used on family mobile and possibly all tracphone carriers due to the master key code lock. So with that said I swapped to AT&T prepaid and got their sim card and it all worked great! It was recommended to get the sim card from the AT&T store directly because sometimes those sim kits at walmart dont always work correctly and are nonrefundable. So if this issue happens to you just be sure to ask your carrier for those network codes!! The seller now knows what to suggest if this happens to another and I'm telling you that the carrier has the codes and all will be fine. Also the seller offered me a replacement phone  and partial refund for this issue. I declined a replacement only because I couldnt send this phone back and await a new one. I was already without a phone long enough dealing with this for days. So the seller at least still gave me a partial refund and that was okay with me. So the customer service is well and fair from them!!! Also even AT&T said the phone itself was in such great shape! So far so good on the phone itself, everything is working as it should.",
      "helpfulVotes": 298
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy Replacement Phone",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "I was a literally leary about buying a refurbished phone, but the reviews made me feel a lot better about my decision and I am very satisfied with my new phone and the service. I saw some people mention issues they've had with transferring their SIM card over if they're not under one of the bigger phone companies, and being a Mint Mobile customer, I was a little nervous about the switchover but everything went over smoothly!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Recommend buying a fast speed charger specifically made for this phone",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "The charger I received was charging at a rate that it would've taken 8 hours to get from 23% to full. I used an old charger of mine and it charged in about 4 hours. There are fast speed chargers, 25W, that are particularly compatible with this phone (not just any USB-C), so I had to buy one separately - multiple Amazon representatives turned down my request for a credit to buy the charger, but the seller XIBER WIRELESS was immediately helpful and gave me the $10 to buy the charger I needed. Amazon was completely useless in resolving the issue, but thankfully XIBER WIRELESS was willing to help right away!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazon cellular store a decent source for those not wanting to pay exorbitant prices for a phone...",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Phone is pristine in appearance and functions perfectly.  Price was reasonable.  Only down side is lack of shipping options.  I would have preferred overnight shipping but ended up waiting 3 days...",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is it Fully unlocked or just unlocked",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "This is a nice phone. A great improvement over the S7 edge. It is really quick and has features that I haven't figured out yet. But yet, there's one thing that I wish was brought along from the S7 edge. When a txt msg comes in, a blue light flashes telling me there's a msg. This one the best I could get was a perimeter flashing on the phone and a msg at the top. Called a brief notification. It's way to brief. But it works. It's got a lot of nice features, it's quick and using the internet, it's way quicker than the old one. (S7edge). A lot of relearning to do. Like the bubble feature of a txt msg that comes in. I couldn't get it off. By accident I tapped and held that position and an \"X\" came up at the bottom to dump it off the screen. That's kinda cool. But, the one thing is, Is it fully unlocked or just unlocked. If there is a difference. The reason is this phone is Verizon based, which I didn't realize till I got the phone. My sim card is att. I didn't think anything of it. Well now, I get a \"Sim card not from Verizon\" msg. I've tried everything available in the phone to get this msg off. No luck. This is embedded deep into Verizon firmware. There is a section that is greyed out that I can't access. That would probably turn that msg off. Should I contact Verizon, I don't know. So that's the rub. Is it completely unlocked. ???  I will just have to live with that. I just swipe it off the screen and it's gone for a while.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not refurbished correctly.  Came apart",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "My previous Samsung Galaxy phone stopped working, and I needed a replacement quickly. To ensure prompt delivery, I paid an additional $30 for expedited shipping, and the phone arrived on time. However, upon inspecting the device, I noticed that it had not been refurbished properly. There were multiple scratches on the bezel (though the screen appeared undamaged), and the back plate was not securely attached—it detached when I was handling the phone. Additionally, the camera was non-functional. I have contacted the seller and am currently awaiting their response.Update:The seller responded promptly to my concerns. Since they were local, I was able to arrange an in-person exchange of the phone. As a result, I have updated my rating from 1 star to 4 stars."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phones cheap priceing",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I will differently order my next phones from this site phone arried early in perfect shape..better than what i ordered..no problems getting service already unlocked...everything worked just like it should oh and a great price too great sound great color.i love this phone its that good"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheaper than retail, but at a gamble",
      "date": "Reviewed in the United States on March 5, 2024",
      "body": "When you buy something that has been renewed or refurbished, you do so with the understanding that the product was returned due to defects, but is being resold at a cheaper cost because those defects were corrected. Right?That was my rational when I bought this phone in November of 2023, replacing a cheap $70 dollar junk phone offered to me at a discount by my cellular provider. I mean, my friend bought a renewed phone off Amazon and has been very satisfied with it. Mine began giving me issues roughly a month into ownership.One of the \"handy\" little security features with this phone is a moisture/debris detector located in or around the charging port. After about a month of owning and using the phone, I was unable to actively charge my phone. The device would give me a warning saying to unplug the device immediately to prevent damage being done to the circuitry. It will not charge the battery so long as the port remains in a \"compromised\" state. You cannot turn off the sensor in the settings. I've tried clearing the port of this supposed dust and debris to no effect. I've taken it to rooms where we have dehumidifiers, and it still gives me this warning when i try to charge.The only option left to me was to buy a wireless charging pad, which can cost you up to $100 bucks. I was lucky to have a friend who had one to spare. It's the only way I can recharge the phone without taking it to a repair shop to test/replace the charging port. Most places I've seen online list replacing the port costs $99 dollars for part and labor, but there's no guarantee my local repair shops will abide by that.I've bought other products from Amazon's \"Renew Store\" that have been listed as renewed and have not given me issues, such as my bluetooth headset. But for whatever reason, this phone's issues slipped through their quality control. For that, I'm rather disappointed. I'm also very disappointed that Samsung would build ransomware into their phone and list it as a security feature.More importantly, I am disappointed in myself for simply accepting the phone as it is and using the wireless charger my friend gave me rather than send the phone back and demand a phone that was actually fixed. I will likely end up paying the extra $100+ bucks to have someone else repair the charging port.Knowing what I do now, would I buy with Amazon Renew Store again? Maybe. Between me and my friend, we've bought 3 products, with 2/3 being a worth while purchase. Those aren't terrible odds, and honestly, I could have probably fixed the situation myself if had brought it up to the seller. I may not have bought the same phone though, if I had to do it over. Samsung knew what it was doing when it added this feature to the phone, especially given they sell you the work-around for an extra $100-200 bucks. Slimey wretches.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Good scratch resistant and it doesn’t freeze. All the features work good and it durable. Screen protection is good"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy s20 review.",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "The version of the Samsung galaxy s20 fe that I received was an OK purchase. When moving the apps over it either made changes to them or they weren't actually moved over and the information of the apps was moved over and the apps were reinstalled with newer versions which I don't like. I would skip this phone if you want everything to work exactly like it did on your old device.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Update ruined the phone",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Worked great till it updated and screen became unresponsive. I blame samsung not the seller. I would still recommend buying from the seller"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    S20 FE Renewed - Mobile Network Connection Problems",
      "date": "Reviewed in the United States on January 7, 2024",
      "body": "I received this S20 FE Renewed from Stalion Requip, Shipped from Amazon. Arrived with Android 13 installed. Phone was well packed and came in a plain box with a nice 5Volt 2Amp (9Volt 1.87Amp) charger, USB C charging cable, and SIM Tray removal tool. The box was labeled NEW. It is NEW, Pristine, Looks and Performs Flawlessly with one major exception. The S20 FE is a 'dumbed down' (cheaper) version of the S20 series. My Cell service is Tracfone through Verizon. I later found out the S20 FE does not support the mmWave bands needed for the fastest 5G Verizon service, nor does it reliably connect to Verizon in my weak signal home location. As a result I couldn’t get connected unless I walked outside my house into my driveway. Other Samsung and Apple phones connect to my Tracfone/Verizon service just fine inside my home. I even tried putting my SIM card in each of those other phones and they all connected just fine. Their SIM cards in the S20 FE had the same bad result. Someone living in a strong signal area would not notice unless they travel into a weak signal area. This seems to be a problem with the design of the S20 FE and not the fault of the Renewer or Amazon. I wasn't willing to wait and try a replacement S20 FE 5G, so unfortunately I had to send the S20 FE 5G back. I ended up ordering the S20+ from Stalion Requip and Shipped by Amazon, The S20+ supports most of the LTE bands and 5G bands (including mmWave bands) used by Verizon in my weak signal area. The S20+ connects properly to Tracfone/Verizon anywhere inside my home. This is important especially if you live or travel in a weak signal area with Verizon or other CDMA carrier. I don’t know about GSM carriers.I can’t say enough good about Stalion Requip. All Renewers are not created equal. Stalion Requip includes a printout of all the internal specs and test results. Purchase your phone from Stalion Requip and you won’t be disappointed with their work.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen producto",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Todo excelente de momento no ha tenido fallas el dispositivo"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly as described!",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Reading the reviews, I was a bit worried that this renewed phone would arrive 1.) in less than excellent condition, and 2.) locked to a specific carrier. However, neither fear ended up being realized! For the first point, the phone was in great condition other than some very minor scuffing on the back (non-screen) side. And for the second point, while seeing the T-mobile logo pop-up on the screen after boot-up was a bit concerning, the phone was truly unlocked and effortlessly accepted my Cricket wireless sim card within minutes.I was upgrading from a 2015 LG device, and my main priorities in a new phone included support for a physical sim card & microSD card slot (as opposed to the new e-sim variety and reliance on cloud storage). It appears that the galaxy s20 is the last in line with these features, so hopefully this phone will continue to service me for years to come.Also, to address some of the negative concerns... after poring through all of the reviews, it seems like the seller may be a defining factor in the overall experience. I ended up choosing SoonerSoft (sp?) after their reviews suggested the least amount of negative feedback concerning product quality or unlocked status, and fortunately I had a good experience. Buying renewed goods is definitely taking a chance regardless of Amazon's \"guarantees\" on the product, best of luck to everyone else in the market for one!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome Quality",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "I loved how easy it was to transfer all my apps and messaged with my SIM card from my old phone. Charging is slower than expected but I also didn't receive the charger that it normally comes it. The overall function of the phone is great and I've had no issues!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pjone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Great quality, great protection, screen is great , no problems with scaring or freezing ,battery last for hours , does not have any issues with phone heat, great sound quality"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works well",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "I just received phone in time for christmas. It looks brand new no scratches, headset wasn't included. No worries. Hopefully it works well.UPDATE: IT'S NOT COMPATIBLE WITH METRO PCS. WORKS WELL WITH TMOBILE BUT NOT METRO WHO IS PARTNER WITH TMOBILE. DISAPPOINTED. GOING TO RETURN IT."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast delivery",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Received  the phone earlier then I expected  and  it is like new phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Weak charger.",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "The charger they sent was weak which took a long time to recharge the phone.  The phone charged great when I used a higher voltage recharger."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mini-SD Card slot stopped working after 4 months (out of warranty, of course)",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The mini-SD Card slot stopped working after 8 months (out of warranty, of course). The only reason I keep buying the Galaxy S20, is that it's the last of the Galaxy series with a mini-SD card reader, which allows me to keep my photos and easily increase the phone's memory. If the mini-SD reader doesn't work, I have no reason to keep an old phone.Of course, the mini-SD reader stopped working in Dec2024, 4 months after buying and 1 month too late for the 3-month refurbished warranty.Only use for me will be to use this as back-up phone and get a most recent Galaxy"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Item Works Well",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "The product came with  some scratches on the frame however it works fine so far. The item was shipped as advertized and packaged very well."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You can buy",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Good Quality"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works good",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "works good so far but the paint stuff on the edges look a bit scratched"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Highly recommend!",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Phone works great! Definitely recommend it came unlocked in good condition ! And worth the purchase!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "Seems to work as advertised"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Freezes every once in a while, now it's not even allowing me to swipe to unlock",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "I reached out to the seller a few weeks ago as the screen kept freezing, no reply.  This is quite frustrating as I noticed this during an emergency.  I went in panic mode as it took nearly 20 minutes to do whatever it had to do before allowing me to unlock the screen.  When this happens, you cannot even shut the phone down.  As of November 24th, 2024, it's not doing anything, I can't get past the home screen.  Ordered August 19th, 2024, never opened until the 3rd week in October to set it up.  This is crazy that the phone is not working at all in this short space of time, I can actually see all of the notifications and not access anything.  The phone is beautiful, nice but not working at all and this started freezing started fairly early.  See the video. To date, no resolution.  I am truly disappointed and will continue to post about this seller.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone overheats but looks new.",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "what I wanted but. I don't know if because the phone is refurbished that it overheats. like I cam literally be using my phone for an hr and it starts to feel super hot to the touch. other then that the phone looks like the description.it is 5G and 128 Gb"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "AmazingPhone arrived fast and in great condition, easy to transfer my old info over as well"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Super happy with my purchase",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Loving my phone absolutely perfect for the price I have no complains .. it’s brand new .."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "I like so much the phone, but the Battery life was really desapointed for me...85% for a certified product is not acceptable"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Gone",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I liked it a lot.  I didn't put a case on it . Was waiting to put the Sim card in.  Couldn't get the Sim card holder out so I took it to youbreakitwefixit.  They got the holder out for me.  I dropped the phone and broke it.  Repair would have cost more than I paid for the phone so........get insurance."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Mi regalo",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Me encantó, fue un regalo perfecto. En cuanto a precio y calidad es muy bueno"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NICE BUT....",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Love the phone no problems with the function...has a bit of screen burn but its not the end of the world. Thanks alot 4 stars!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WHATTA PHONE",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "WHEN OLD PEOPLE MUST UPGRADE THEIR PHONES AMAZON IS THE PLACE TO SHOP...SAMSUNG THE BRAND OF CHAMPIONS !",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great phone",
      "date": "Reviewed in the United States on August 18, 2023",
      "body": "This phone is great - the touch screen is quick, it processes webpages and apps with ease. The size is ideal and fits comfortably in my back pocket or a small purse. This phone doesn't come with an audio jack so we had to get some adapters that plug into the power spot so we can stream music through the phone in the car which was an easy fix. The battery lasts a while and I often have tons of apps open at the same time without slowing anything down. I take a ton of pics and videos (the quality of both is really great) and haven't had an issue with storage space yet which is super awesome - I do back up all my images/video to google photos though just in case, I've lost way too much media over the years to keep it only on my phone. When taking a screenshot, there is a nice pop-up option that allows you to crop it or make edits right away, I use this function regularly and really appreciate having the option.I use it for work functions as well and can easily switch between multiple email accounts and google drive folders - downloading and opening documents is a breeze and its enhanced my ability to work remotely and on the go.As a public figure, I installed google voice so I can have a more personal and more public number and the phone handles both with ease. I also use signal, discord, facebook messenger, and whatsapp regularly to communicate with people all around the world.I love the keyboard function that allows me to switch between languages and daily switch between arabic and english with ease - sometimes in the same text, comment, or email.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Me encanta el teléfono,  funciona de maravilla, muy feliz por la compra"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen was good",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Purchased this phone because the claim was that it the condition was excellent.  Not true.  Screen was in great condition but the outside of the phone, the back of the phone was in rough shape.  Phone works but I was disappointed with the back side of the phone.  Very rough to the point where I had to buy a phone case."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for a good price.",
      "date": "Reviewed in the United States on November 26, 2024",
      "body": "Phone was unlocked as stated. Switched my old phone data to this new phone smoothly. Works well so far. Only flaw, a minor discoloration around camera lenses. Overall good deal!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasantly Surprised",
      "date": "Reviewed in the United States on March 26, 2023",
      "body": "I have now been using this phone for 11 days. Here's what you should know, out of the box the phone was pristine. I looked long and hard to find a blemish or defect, there was none. This looked like a brand new phone. Day one of using the phone I was highly unimpressed by it's battery life. The battery did not hold a charge for even half a day. I didn't believe Samsung would sell a phone with that bad of a battery OR this phone was defective. I did some research online and it seems this is the number one complaint about this phone. This is my 1st phone that has an ADAPTIVE BATTERY. I followed some advice online. Let the phone download all the updates etc..the 1st day or 2 this sucks up major battery power. Day 2 and 3 i kept my eye on the battery usage in the system settings. Until day 3 it said it was still learning my usage, once that went away the phone battery worked so much better! I mean don't get me wrong, I got rid of some apps I don't use, changed some settings to save battery life etc. My battery lasts the whole day now with regular use. The phone automatically puts apps to sleep when not in use so that def saves some battery power. All in all I say buy the phone. If you don't like it you have 60 days to return it. I do not buy expensive top of the line phones, I need a cost effective option for reg text, calls, music, browsing and this one hits the mark. I use the speakerphone for work calls and they are crisp and clear. The camera is much better than my A20. As of day 12 I give my new phone a score of 8 out of 10.",
      "helpfulVotes": 64
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Great quality, fast delivery"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great customer service",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "I ordered this phone and I don't know if it was damaged in shipping or had an issue but I had to return it and get another one.  The replacement was shipped immediately and worked perfectly.  Not every item you buy will be perfect so it is nice to know this company stands behind their products.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You Pay What You Get",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "This phone is great. I’ve had no issues other than one with Verizon when activating the phone. The issue was that it would not remotely activate the SIM card in it for some reason which could have been my personal error, but after going into the Verizon store for 9ish minutes the problem was fixed free of charge, other then the tip for the 2 employees who were only there stuck with both 14 hour shifts lol. As for the physical phone itself was perfect for what it is, a renewed phone. The phone I received had two slight scratches on the bottom Identical on both sides of the charging port, not touching the charging port though. I would assume most likely from putting a case on and off. As for the screen and camera both had no scratches. The phones battery so far, being that it’s only been a little over a week, has been perfect. I got the phone to use as my business phone for my own business and it has had no issues so far other than the small Verizon one. Lastly just as a slight comparison to my iPhone 14 Pro, this phone kinda making me want to switch my main phone to the new Galaxy coming out in 2025 just saying.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WORTH THE PRICE",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "Product was as described! I was leary about getting a refurbished phone but for the price, I was willing to try it out. I'm so glad I pulled the trigger!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent, but with signs that it was opened",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "The phone works fine, it has no signs of scratches, however the back cover is a little separated from the frame, it is not well glued.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on November 17, 2024",
      "body": "I bought 2 of these, one was unlocked seems to be fine, the other would only take Verizon network. Had to re-order another  unlocked phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So very impressed",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "I replaced my Galaxy J7, finally, when its charging port stopped accepting micro USB cables and wouldn't charge. I wanted an S20 since they first came out, so I chose a refurb (excellent) to keep the cost down. Boy was I happy.The refurb was immaculate with great battery condition and no scratches. I had read reviews lamenting that it would only have Android 10, but was elated to find it had 13 installed. SCORE. It also had updated Bixby, another score.I could have paid much more for an S24, but I certainly wouldn't have gained much functionality.Only thing wrong was that I expected to be able to swap in my 32 GB SD mini to copy photos. It has 128 hard wired in with no SD card slot. I will have to transfer by wire.Also, no audio port. I had a couple of Bluetooth earphone sets, and they work, so no harm. Guess I'm getting old.Great speed, and far more settings than I imagined. Also, modes and routines with if/then statements make this phone the closest thing to a PC I've ever seen.Color me boggled.I can push a button or fingerprint and it will do anything imaginable. Just set it up.I'm so happy I could spit.Edit So it does take my SD card on the same slider as the SIM.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speed smooth loading",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Just had the phone for a few days, but so far everything works fine.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Great phone, had to get another one for my son"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on August 31, 2024",
      "body": "The phone is working great so far. Battery life is okay. I was able to activate to my provider with no issues and transfer everything from my old S9 to this one. I like the screen size and phone itself. However, I ordered the phone in excellent condition but the back has a lot of dings, scratches, and scuffs. Sure, a phone cover will hide them, but by ordering as excellent, I expected the back to be free of this many imperfections. The screen and camera is fine, though.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works with Xfinity",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "If you have Xfinity, this works with it! Even if it says it doesn't online, I'm having no issues at all. On top of this I had an issue with shipping and seller started a refund, but it eventually got unlost. Highly recommend. They were super friendly and willing to work through issues. Phone had minimal damage, and I can't even see it with my case that's see through."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it so far, but...",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "This phone seems to be in pristine condition. I love it so far. It's an upgrade for me from the s8 and it's faster, slightly larger and better camera/video quality.I do have one problem, though. It must've been originally designed for verizon because I get a push notification every 10 minutes saying my sim card is not a verizon sim card. I know this is a common problem because I've seen it in other comments but I haven't been able to figure out a workaround that actually works. Maybe the seller could post instructions on their description somewhere?",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First time Amazon Renewed product and it was great.",
      "date": "Reviewed in the United States on July 21, 2023",
      "body": "I owned a Galaxy S20 FE 5G UW.  It's a mouthful. But I love the phone because the quality is there, and it has a removable SD card. I don't remember if it's a micro or a mini but I bought a one terabyte card and it is an incredible amount of storage.  I made sure to buy a higher quality one that has a high transfer speed.I never purchased an Amazon renewed product of this type of floor so I was a little bit wary.  Especially of damage or a poor performing battery.  I was happy to say that the battery was outstanding. I do make sure to always keep the battery protects feature on that does not charge the battery over 85%. Also I'm plugged in almost all the time I'm not sure what effect that has on the battery. But I've not noticed any problems by doing that.Sound and screen were great. I never would have given up using this phone unfortunately I dropped it onto a different floor and cracked screen.  Even with the cracked screen I got a good trade in from Verizon so I ended up upgrading to a newer Samsung S23.I originally had this model from Verizon. I dropped it and caused a crack in it. It was a small crack but the fix was about the same price as this Amazon renewed phone. I made sure I kept my phone in good condition and was careful with the battery. But the cost of replacing the screen was about the same as purchasing this phone. I figured I'd give it a shot and it was very pleasantly surprised with the quality.  Your mileage may vary and you make it a phone that's not as high quality but I had good luck. If I had to do it over I would buy a really good case and a really good screen protector.I considered buying a third model of this phone.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "For a refurbished phone it is in great condition. My daughter is gonna lov3 this for Christmas.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine.",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Works fine. Phone arrived not completely reset to factory settings. Unlocked but still carries info for previous carrier. Games auto download.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Life Could Be Better",
      "date": "Reviewed in the United States on May 12, 2024",
      "body": "I received the phone in perfect condition.  It basically looks new.  Everything works as it should.  My only issue is the battery life.  The  phone charges fast but the battery also dies fast.  If I'm lucky, the battery lasts 8 hours if I hardly use it.  If I'm using the phone I get less battery life than that.  The battery in my last Samsung lasted much longer.  I understand this is a refurbished phone so I guess that's to be expected.  This is the first refurbished phone I have ever purchased so I didn't take that into consideration.  Other than that I am satisfied with the phone. It does what I need it to do.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works but clusters of pixels out",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "It works but isn’t quite what I had expected from Amazon refurbished.  There are scratches in the phone and that’s kind of to be expected.  What I didn’t expect is that there are pixels out on the screen.  Not like individual pixels that you’d need to find under a microscope but clusters of pixels that you can see with the naked eye.  It’s not enough to interfere with the function of the phone but it doesn’t look very good either.  I probably wouldn’t go with “refurbished” again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrific",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "This phone has the same bells and whistles as the higher priced ones.  I love it.  It looks just like a new one and performs just like a new one.  So far no issues at all.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works good!",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "Just needed a decent, durable phone for my father that wouldn't break the bank. My father is HARD on phones, drops his on the daily, throws it, loses it, shoves it in pockets with keys and God knows what else. I mean, it's almost torture what his poor devises go through. After a long 4 year term with my father, his phone finally succumbed to its abuse, and thus a new one had to step to the plate. He's had this one for a few months now, and it's passed so far! No scratches so far, he likes the size and says it's perfect for his hand and pocket (he's 6 foot and pretty stout, so not a small man), he says it works fast and that the camera is better than his last!",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Smartphone from Samsung!",
      "date": "Reviewed in the United States on December 22, 2023",
      "body": "I'd say that this Samsung S20 FE 5G has got to be one of the best smartphones that takes excellent photos that I have ever had in my life.....so far! It has wireless charging on it (something I did not know about), excellent camera set up that takes pretty good photos for the most part, excellent videos, has 128 GB of internal storage....however...there is NO slot for a microSD card for additional storage (a minor drawback]. Fingerprint reader is directly on the screen and it was hard to get used to that at first, but did not take long to get used to it and it works very good. Games seems to play rather well on this smartphone, tho I probably would not do very intensive gaming on this phone. Basic games works mighty well on this smartphone though. Really I think the only issues I have with this smartphone from Samsung are 2 things.....lack of extra storage and the camera will turn itself off if you go wide-angle when taking photos or videos. It seems to be a common issue/problem with Samsung S20 FE 5G smartphones. There are videos on You Tube on this issue and how to fix it....which is overall an easy fix. That issue does not happen until you hit a certain Samsung or Android update on this phone. Overall, a great smartphone and it's water resistant also....not sure about it being waterproof....so don't put it in water at all. I would rate this Samsung smartphone a pretty decent 5 of 5....despite those 2 minor issues with the Camera turning off frequently and the lack of extra storage space.",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked without any problems",
      "date": "Reviewed in the United States on October 13, 2022",
      "body": "Got the phone, transferred the Sim and SD card from s9+ turned on and worked without any problems. Used Samsung Smart Switch and Google play to transfer apps and files from old phone to the new phone. Had to re-setup all the MFAs I use for work, but was expecting that. Love the in screen fingerprint scanner. Much easier to use then the back scanner I used on the S9+. It will miss from time to time, but especially at work where I have to do MFA authorizations many times throughout the day when connecting to user's computers and servers to check settings or perform remote fixes it is so much easier to press my thumb to the front of the screen than having to pull off the wireless charger to scan from the back. Battery life is great. Old S9+ could barely make it through a normal 8 hour shift and sometimes it wouldn't. The S20 FE makes it through a 12 hour extended shift with more than normal MFA with 27% battery still left. Can't really speak to the camera as if I am wanting to take good pictures I will pull out the Canon Rebel. For quick snaps of serial numbers, model numbers and things like that it works fine. Hands free is much clearer than on the S9+ as I don't get crackling or distortions on the S20 FE. A good phone for a refurbished one.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Complete a thorough test of all functions, PRIOR to transfer of settings, data, pics, tunes, etc.",
      "date": "Reviewed in the United States on October 19, 2023",
      "body": "3 days in. 1. GREAT price! 2. SPEEDY delivery. FAIRLY ACCURATE description of the phone. 3. GREAT phone except for the usual Samsung issues. 4. I encourage those that purchase, THOROUGHLY test the phone, PRIOR to transferring all settings/data/tunes/vids/pics, etc. from your previous Samsung phone. After 86 days of dealing with my cell service transfer from VERIZON to TING, I failed to complete a thorough test of the phone. The Power On/Off button does not toggle properly, sticks, & and works most of the time. There is a workaround, for booting, but simple screenshooting without another app can be challenging.  The battery struggled the first 2 days, with a slow charge, and not holding charge well,  but now seems to hold the charge as well as my ancient 2018 S9.  3 months of ownership: bumper/case has solved issue of the power button problem mentioned earlier. Battery seems to work fairly well now. Though I do have days, that it seems to de-charge much quicker than other days, even though there are no apps running in the background. OVERALL, I would highly recommend purchasing a refurbed phone, rather than a new. Use the extra money to help someone truly in need, after-all it is just a phone.",
      "helpfulVotes": 35
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still working",
      "date": "Reviewed in the United States on October 14, 2024",
      "body": "It works really well no problems it can at pretty fast too for the price the quality is good I know it's refurbished it had a few minor scratches at the charging port but good none the less",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone stopped working",
      "date": "Reviewed in the United States on August 26, 2024",
      "body": "sigh.. so disappointed. bought it August 16 and not even a month later the phone just stopped working. I was using it and the battery went dead on me so I plugged it it to charge and went to bed. when I woke up the phone wouldn't turn on. i tried everything. i even used a wireless charger and still nothing. the phone is just blank, dead, Nada!!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Review",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Been using since October and I must say it is durable for a used phone. Good quality, no issues with sound, battery life good solid 9/10.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fantastic replacement",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "I previously had this same phone since T-Mobile released it in 2020. Water multiple drops on concrete, my screen kept freezing up. I read a lot of reviews on this page that made me really nervous about purchasing my phone from this seller but I am thrilled to say I've had ZERO pages with this phone. The case and screen were in PERFECT like-new condition, it is a truly unlocked phone and I didn't need to take any additional steps to get my sim card working.It took about 6 hours to completely get my phone set up (I have a LOT of large files on my old phone and sd card) and the new phone was able to quickly and easily handle the workload with no issues.I chose to twice the same model as my old phone because this is the last version of Samsung Galaxy phones with expandable memory, which was the main selling point for me.  As a T-Mobile customer, I did have to download the T-Mobile app and visual voicemail, but again, they were super easy to find in the app store and VV immediately connected to my voicemail account, which I was not expecting.I've had great battery life so far (I use my phone a LOT for work) and the 5g connection has been phenomenal. I can confidently say this phone is both exceptional value and quality and I highly recommend this seller's products.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No headphone jack",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "Decent phone for an unlocked Verizon prepaid phone. I didn't realize that th gets no audio jack."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "I got purchased one in \"excellent\" condition. I was nervous, as I had never bought a used phone before and did not know what to expect. Physical inspection was fine. It turned on fine. In the box were the usual accessories, charging cord and wall adapter. I removed all the useless apps that phones come with, and stopped all the useless processes. Even so, the first few weeks were rough, as the battery would drain every day. At night, with 0 use, it would drain 20-30% in 8 hours. But then it seemed to equal itself out, and battery is great. It only drains by 1% at night now. I'm not sure what was going on with that. I read the specs before I received it, and it works as expected for me. No usability issues at all. Android Auto works perfectly with this, as opposed to continually disconnecting with my old phone. This charges very fast as well.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great....but....refurbish quality issues",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Product appearance was in Great Shape like new.  However....Had to return it because the phone was locked to AT&T  and I ordered it as UNLOCKED.  The second reason which was the most important issue ,  the Biometrics/ Fingerprint reader was non=op. Error message \" Fingerprint sensor calibration needed \"  there was no way to fix this myself as per Samsung Tech support.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    ME GUSTA",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "ME GUSTA"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition - unlocked AT&T phone",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "So, I always worry about reconditioned phones and the unlock. This phone was perfect. The phone showed a new reset and still had the unlock screen when power on. It accepted my T-Mobile SIM without an issue and the Samsung Mover app worked quite well. As with any phone, the pain is in setting up all the apps again. I'm very happy at this point and will report back if any issues should pop up.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice upgrade from my MOTO Edge",
      "date": "Reviewed in the United States on February 7, 2021",
      "body": "This is an update to my comments from January 15th on the seller's (bayshine trading) comments section.Now that I have been using the phone for about a month I can say that the seller went BEYOND his responsibilities in his description of the phone, the packaging he provided, his ship speed, and the inclusions of all of the stated peripherals. As I said in my initial post, his answers to my my presale questions were accurate, honest and quickly responded. When the opportunity to recommend bayshine trading I will happily do so and will no doubt being doing business with them in the future.As for the phone, it is all I expected. Great refresh specs make for an ultra smooth experience. The screen quality is a nice step up from my MOTO Edge however I did adjust the white balance and RGB settings from the default settings a tad to suit my taste. TMO's 5G network plays well with the S20 FE. I routinely experience 120 mb download speeds inside my house. In full disclosure I got about the same performance from my Edge (NOT the Edge plus) which tells me that even though I traded up a bit regarding the Snapdragon processor, that upgrade hasn't seem to have had an affect on my download speeds. As a side note, I believe the MOTO Edge is an excellent phone and proved to be a great value as long as you're not paying list for the unit. (I paid $499 and list WAS $699) I did tire of the edge-to-edge display but that is a personal taste. Also, I didn't have any of the well documented screen problems that many of the units have had.Still, the S20 FE is an upgrade to the Edge in several areas: processor, display, refresh and form factor (again, a personal taste). My Edge had more native memory (256 gb vs 128 gb) but both can close (or increase) that gap with an sd card. The Edge was nearly a pure Android experience and the S20 FE comes loaded with mucho Samsung apps and bloats. I kept some, deleted some, ignored some but this common complaint about Samsung is true - all with workable work-arounds but true.So, inconclusion if you have a $500 cell phone budget and don't mind buying a year-old model, it's hard to go wrong with this reconditioned option. Coupling the phone with a resell vendor like bayshore trading only sweetens the deal.Buy with confidence.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not actually unlocked",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "The phone while in great physical condition was not actually unlocked. It was still locked to Verizon. When I arranged an exchange, the new phone arrived in similar condition, and also locked to Verizon.I contacted support again, they're telling me to go to a samsung store and get it unlocked there.The phone is fine, physically. But how are people going to advertise locked phones as being unlocked?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, however not unlocked",
      "date": "Reviewed in the United States on August 10, 2024",
      "body": "I was so excited to receive my phone as it's condition is near flawless, however, it is not unlocked. I would like a refund but I don't want to return the phone. I would like to get it unlocked myself. So I would recommend not buying from this seller unless you plan on unlocking the phone yourself.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Not new but new to me. I bought this to replace my cheaper BLU phone because it was not compatible with RAYNEO VR glasses. This phone is compatible. Condition is great seems to still have good battery life. Very happy with purchase. My wife has the newer version. That is the reason I bought it. I also wanted a better camera. The display is much sharper than my old phone. Would buy again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "Took a week to ship out and sent it very slow shipping. Took another seven days to arrive. Phone was in great shape. No visible scratches on it anywhere."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is in excellent (physical) condition",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "Here's why I'm giving 4 stars instead of 5.I have used the charger that came with the phone; it gets hot.I used another charger, it takes a long time and a message shows up that it's 'slow charging'I bought a wireless charger and it still takes forever to charge.I might end up sending the phone back.Other than the charging issue, the phone is in (physical) pristine condition.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Verizon customers beware!!!",
      "date": "Reviewed in the United States on December 29, 2020",
      "body": "I just got the phone and it is in excellent, like new condition. Everything seems to work well and I will provide an update. The description explicitly says that it will work with Verizon. I tried to activate it and after being on the phone for over an hour with Verizon, they put in a ticket to have it activated and troubleshooting. I was told that my phone MAY be activated in 7 DAYS or more! So just be aware that, \"Verizon compatible\" is subjective. I don't fault the phone for this per se but it certainly isn't convenient. Ultimately I think this is just Verizon punishing customers for not buying from them but just be aware that if you buy this phone, you may not have it to use for a while. I'll post an update once it's actually working, IF that happens.Update 8 days later: I've spent some time with the phone and I think at this price point it's really an excellent device. Had I paid the brand new price for it is probay not be as impressed. It's a solid, snappy, well built phone with a really nice camera.  I got rid of all the Samsung bloatware and installed a third party launcher for a cleaner experience as I prefer a pure Android OS.Now the Verizon issue... it took 7 days and me calling once a day for the last three days to get the phone activated with the new 5g sim card that Verizon sent me.  I received the sim card the same day as the phone so that wasn't the issue. Verykept saying that there was a message about a, \" feature\" that wouldn't allow it activate and their IT department had to do something with it. I'm still not sure what the problem was but be prepared for a little frustration if you're using this on Verizon. I'm happy with the end result but it was a headache to get there.",
      "helpfulVotes": 85
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Reliability",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "I am impressed with the service rendered. The customer service is very good and the order delivery is accurate.The item is exact as it's on the picture."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, not-so-great battery life",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "Great phone. Battery life was not great, and I returned it for something better. I’m not sure If it’s the refurbished one I got, or if the model itself was bad. The sound quality on the speakers were great, and the phone felt really nice and comfortable.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works, screen has lines in it",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "The phone works, but the screen has lines running up and down the right side of it. This is another and visual issue and doesn't affect the function, but wish I would have noticed before transferring everything over to the phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Works perfectly 10/10"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lot of problems",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Keys not responding, phone calls dropped,  poor voice recognition hTVy"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasantly Surprised",
      "date": "Reviewed in the United States on June 13, 2024",
      "body": "I have a work phone but not a fan of Apple's privacy policies. I wanted my own phone, something with more control. I did a lot of research and every offer brought me back here to Amazon for the best value on an unlocked phone. I was very concerned though. Not exactly great reviews on Amazon reconditioned phones. To my surprise, the phone I received was in excellent condition. Not one issue to complain about. I've done my share of selling electronics on the the net and I put the extra effort into making sure my customers were very satisfied. It really boils down to the seller on Amazon. FlipCells was my seller and I would highly recommend them for a reconditioned phone. Great phone, great service, great price. I couldn't be more happy with my phone from FlipCells.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone overall!",
      "date": "Reviewed in the United States on May 20, 2022",
      "body": "I need to say that while the phone is supposed to be 100% unlocked (NO carriers attached to it at all), mine definitely has the T-Mobile boot-up screen when it turn it on. Under the networks/'Access Point Names', the listed one is 'T-Mobile US LTE'. When I completed a software update just now, the message that popped up when it was done read: 'Software update completed. Thank you for using T-Mobile'.Now, I'm not a hugely technical person - I don't know if that's because my no-contract carrier (US Mobile) also uses the T-Mobile network (for the SIM card I use - US Mobile allows you to use either the T-Mobile or the Verizon network, they give you a choice of two different SIM cards)... but before I'd even put my SIM card in this phone, I was still seeing the T-Mobile boot-up screen, so who knows.At ANY rate, I can't speak to someone who will want this phone for the Verizon network (or equivalent). Maybe it will work just fine, I don't know. For ME, who happens to be on the T-Mobile network ANYWAY, it works fine.The signal is much better than my older, previous Samsung A-series phone. No more missed calls, dropped calls, delayed texts, etc. It arrived in very good condition (a few TINY scuffs that I barely noticed on the back, but they were almost invisible), the price was good (it's crazy how much unlocked phones normally cost nowadays), the screen looks great, my apps all work great - overall, if you're debating getting this phone (especially since it's renewed/refurbished), definitely go for it. I love it!  :-D",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seller great",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Seller made mistake but it was easy to return carrier was wrong . No big deal. Soon as refund hits I'll try again with this same seller and hopefully the correct carrier,  since I purchased a case for this particular model. Condition was spot on , tools , charger ,overall affordable.  Remember we are all human,  mistakes are easily made and easily fixed.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pay attention to the seller",
      "date": "Reviewed in the United States on June 29, 2024",
      "body": "I bought this in \"good\" Condition from Icellsolution. They were great and had it shipped to me within a week. I was kind of worried About the battery life, but it's been great.There were a couple of light scratches on the screen, but this thing greatly exceeds what I would expect out of a $150 phone. I've owned iPhones for over a decade but I'm very impressed with this phone, especially for the price.Look for a seller that will ship quick, the first one I ordered said it was going to take 3 weeks. 3 weeks came and went and the thing never shipped, I got a notification saying it would take ANOTHER 3 weeks. Yeah F that, I don't think so. I canceled the order immediately and re ordered from the company listed above.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mostly as described",
      "date": "Reviewed in the United States on July 19, 2023",
      "body": "They say there will be no cosmetic damage visible from 12 inches away or more, but there is a very tiny hairline scratch on the screen that I can see very clearly from 12 inches+. I can also see a minor blemish on the back. I took away one star, but the damage was really small. I had to take away something but can't take away 1/2 star. They included a USB-A charger that works but charges pretty slow. Overall, I'm happy. The few negatives are not worth a return.Update: I had to return it because it had a bad camera. It took almost 2 weeks to get the replacement, however the replacement was in absolute pristine condition. I could not see a single blemish no matter how much I tried. It also works well so far.  Still mostly happy. It's a still good phone for the money in 2023 if you get one in near new condition.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but updates so many times",
      "date": "Reviewed in the United States on December 3, 2022",
      "body": "12/29/22 update (read old below)Why buy the latest phone if the previous model feels like brand new & features are the same as new model. The s22 is about $700 to over $1k. While this 2yr old model is $220. I will use this minimum 4 years.My old phone is almost 6 yrs old samsung s8 with 10k text & many apps. So spent 1.5 hours at my phone carrier store. They transfered all my data to this phone.My new used phone was originally Verizon & after getting set up I notice my start screen shows VERIZON. I am not VERIZON! No big deal.Last night I spent a lot of time on lots of app sign up then the annoying UPDATES that feels like 100 updates. I think maybe 28 updates. Be patient.Today is my 2nd day playing with my new refurbished s20 fe. Ordered my case I think this phone is a keeper. Like new condition. No scratch.",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Save your money",
      "date": "Reviewed in the United States on May 18, 2024",
      "body": "I don't know how this phone can possibly be used.  Some 'one word' descriptors I can think of,  to describe this phone are; 'magnificent', 'unbelievable', or 'There's no way this phone can be used, no way'.I always get hardened glass screen protectors, whenever I get a new phone.  As a sacrificial anode, or canary in a coal mine, it's well worth 10 bucks to protect the factory screen.  Somehow this phone picked up a chip in the edge of the screen, before I applied the screen protector.  When I was cleaning the screen for the screen protector,  I discovered that the phones screen wasn't chipped, it was a screen protector that was already applied !  The screen protector that had already applied, saved me a ton of money!  I don't know if all phones from This seller come with already-applied screen protectors, but you should ask.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is ok",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "It is not truly unlocked it is still displaying the version software and the internal entenna must be damaged because I lose the signal very often wouldn't recommend",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broke",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "Broken Christmas aww see my other galaxy also broke from screen ."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be Picky About Refurbished Phones - Don't buy if PDI Mobile is seller",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "Edit: This is officially the worst phone I've had in my 20 some years of having phones. If I dare to let the battery drain completely, it's a toss up on if it will charge again at all. Have tried multiple different cords and bricks, no luck. The screen continues to crack and splinter. I'll likely be on the market for a replacement in less than a year. (I never go through phones this fast, the phone I was using before this was a Samsung S8 active. It's honestly in better shape than this one.)Original:The phone is fine, does it's job. I'm not a heavy user. Calls, texts, simple browsing.It still seems to want to be a Verizon phone - I'll have to figure out how to handle that on my own. For now, my voicemail is finicky and the phone is constantly downloading nonsense apps without my input. (So many games!)I'm no stranger to buying refurbished unlocked phones. I've been doing it for years, this is the first time I've gotten a bit burned on it.It could have been prevented, though. If you're looking to buy, be very picky about the condition the phone comes in and immediately request a refund.Before I ever started the phone up, I noticed a small crack in the top of the screen and excess glue around the bezel. I figured it was fine, I'd ignore that and go on. Chalked it up to the cost of getting a refurbished phone.Don't do that.I should have immediately contacted the seller (PDI Mobile) at that point.Since then, the screen has cracked considerably despite having not dropped it. It went into my pocket, uncracked, and came out of my pocket cracked. I had a simple protective cover on it. I have never in my life cracked a phone screen.I assume the cheapest screen available was used to replace the original. It's a good way to cut the costs down.Despite ignoring the first issues, I was well within Amazon's return window at that point and the seller refused. I contacted Amazon customer support, they escalated it to the seller, and the seller again refused.Currently rocking the phone with a piece of scotch tape on the screen so the glass doesn't splinter off into my finger. Classy!So, be picky. And maybe steer clear of phones sold by PDI Mobile.",
      "helpfulVotes": 90
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Swipe Sensitivity Issues",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "It looks good and works well for the most part, but the touch screen sensitivity is off-putting for me. For example, I try to navigate across sites and apps but end up unintentionally clicking on various aspects of said sites and apps. After some research,  I learned that it is a long standing issue with the FE series of S20s. This is a decent phone, but it fumbled on what should have been a critical feature."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheaper than retail, but at a gamble",
      "date": "Reviewed in the United States on March 5, 2024",
      "body": "When you buy something that has been renewed or refurbished, you do so with the understanding that the product was returned due to defects, but is being resold at a cheaper cost because those defects were corrected. Right?That was my rational when I bought this phone in November of 2023, replacing a cheap $70 dollar junk phone offered to me at a discount by my cellular provider. I mean, my friend bought a renewed phone off Amazon and has been very satisfied with it. Mine began giving me issues roughly a month into ownership.One of the \"handy\" little security features with this phone is a moisture/debris detector located in or around the charging port. After about a month of owning and using the phone, I was unable to actively charge my phone. The device would give me a warning saying to unplug the device immediately to prevent damage being done to the circuitry. It will not charge the battery so long as the port remains in a \"compromised\" state. You cannot turn off the sensor in the settings. I've tried clearing the port of this supposed dust and debris to no effect. I've taken it to rooms where we have dehumidifiers, and it still gives me this warning when i try to charge.The only option left to me was to buy a wireless charging pad, which can cost you up to $100 bucks. I was lucky to have a friend who had one to spare. It's the only way I can recharge the phone without taking it to a repair shop to test/replace the charging port. Most places I've seen online list replacing the port costs $99 dollars for part and labor, but there's no guarantee my local repair shops will abide by that.I've bought other products from Amazon's \"Renew Store\" that have been listed as renewed and have not given me issues, such as my bluetooth headset. But for whatever reason, this phone's issues slipped through their quality control. For that, I'm rather disappointed. I'm also very disappointed that Samsung would build ransomware into their phone and list it as a security feature.More importantly, I am disappointed in myself for simply accepting the phone as it is and using the wireless charger my friend gave me rather than send the phone back and demand a phone that was actually fixed. I will likely end up paying the extra $100+ bucks to have someone else repair the charging port.Knowing what I do now, would I buy with Amazon Renew Store again? Maybe. Between me and my friend, we've bought 3 products, with 2/3 being a worth while purchase. Those aren't terrible odds, and honestly, I could have probably fixed the situation myself if had brought it up to the seller. I may not have bought the same phone though, if I had to do it over. Samsung knew what it was doing when it added this feature to the phone, especially given they sell you the work-around for an extra $100-200 bucks. Slimey wretches.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mini-SD Card slot stopped working after 4 months (out of warranty, of course)",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The mini-SD Card slot stopped working after 8 months (out of warranty, of course). The only reason I keep buying the Galaxy S20, is that it's the last of the Galaxy series with a mini-SD card reader, which allows me to keep my photos and easily increase the phone's memory. If the mini-SD reader doesn't work, I have no reason to keep an old phone.Of course, the mini-SD reader stopped working in Dec2024, 4 months after buying and 1 month too late for the 3-month refurbished warranty.Only use for me will be to use this as back-up phone and get a most recent Galaxy"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Freezes every once in a while, now it's not even allowing me to swipe to unlock",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "I reached out to the seller a few weeks ago as the screen kept freezing, no reply.  This is quite frustrating as I noticed this during an emergency.  I went in panic mode as it took nearly 20 minutes to do whatever it had to do before allowing me to unlock the screen.  When this happens, you cannot even shut the phone down.  As of November 24th, 2024, it's not doing anything, I can't get past the home screen.  Ordered August 19th, 2024, never opened until the 3rd week in October to set it up.  This is crazy that the phone is not working at all in this short space of time, I can actually see all of the notifications and not access anything.  The phone is beautiful, nice but not working at all and this started freezing started fairly early.  See the video. To date, no resolution.  I am truly disappointed and will continue to post about this seller.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen was good",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "Purchased this phone because the claim was that it the condition was excellent.  Not true.  Screen was in great condition but the outside of the phone, the back of the phone was in rough shape.  Phone works but I was disappointed with the back side of the phone.  Very rough to the point where I had to buy a phone case."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine.",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Works fine. Phone arrived not completely reset to factory settings. Unlocked but still carries info for previous carrier. Games auto download.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works but clusters of pixels out",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "It works but isn’t quite what I had expected from Amazon refurbished.  There are scratches in the phone and that’s kind of to be expected.  What I didn’t expect is that there are pixels out on the screen.  Not like individual pixels that you’d need to find under a microscope but clusters of pixels that you can see with the naked eye.  It’s not enough to interfere with the function of the phone but it doesn’t look very good either.  I probably wouldn’t go with “refurbished” again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great....but....refurbish quality issues",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "Product appearance was in Great Shape like new.  However....Had to return it because the phone was locked to AT&T  and I ordered it as UNLOCKED.  The second reason which was the most important issue ,  the Biometrics/ Fingerprint reader was non=op. Error message \" Fingerprint sensor calibration needed \"  there was no way to fix this myself as per Samsung Tech support.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not actually unlocked",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "The phone while in great physical condition was not actually unlocked. It was still locked to Verizon. When I arranged an exchange, the new phone arrived in similar condition, and also locked to Verizon.I contacted support again, they're telling me to go to a samsung store and get it unlocked there.The phone is fine, physically. But how are people going to advertise locked phones as being unlocked?",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works, screen has lines in it",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "The phone works, but the screen has lines running up and down the right side of it. This is another and visual issue and doesn't affect the function, but wish I would have noticed before transferring everything over to the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lot of problems",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "Keys not responding, phone calls dropped,  poor voice recognition hTVy"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Broke",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "Broken Christmas aww see my other galaxy also broke from screen ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    FALSE ADVERTISEMENT",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "BE AWARE ! THIS PHONE IS LOCKED TO VERIZON. FACTOR RESET WILL NOT FIX THIS PROBLEM.VERIZON WILL NOT UNLOCK IT FOR YOU WITHOUT STIPULATIONS, AND THOSE THAT THINK THEY CAN UNLOCK IT THEMSELVES, YOU CANNOT ACCESS THE \" IMEI NUMBER\"."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing battery. Problem with the screen and phantom touches.",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "Decent option if you want wireless charging and micro SD slot.Cons: I've had pretty poor battery life through the day. My older phones outlast by a large margin with the same use. I'm not sure this \"renewed\" phone has the advertised 80% battery life.Phantom touches that make the screen do odd things, like someone else is holding their finger in a spot near the middle of the screen. Fixed with a restart, but very annoying.Regularly get the \"phone is too hot to use maps\" message when using it with android auto."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as good as I imagined",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "The color is beautiful and overall it is a good quality the problem I have is with the OS and battery life. The battery doesn't even last 12 hours when used moderately. I had to order a different charger than the one that came with it because it charged so slow. Definitely not a standard charger that would come with a new phone. Looks like something someone pulled out of their closet. Most of the apps freeze up and I have to restart the phone often to get it to work when that never happened with the same apps on my old phone. It works but for close to $200 I expected a little more value for my money. I wouldn't recommend ordering one unless you want to be disappointed.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone nice/charger sucks",
      "date": "Reviewed in the United States on May 31, 2024",
      "body": "I like this refurbished phone - it was in very good shape and hasn't given me.any problems thus far. However,the phone charger socks. The phone keeps giving me a warning that it's a slow charger and if I use the phone while it's charging with the charger provided,  it doesn't charge!  My cheap charger from Walmart works much better. Maybe they should invest in the $5 charger I bought @ Walmart.  There was also no instruction booklet with the phone,so I had to look up a couple of things before using it.  The screen protector kinda sucks, too. The phone has a hard time recognizing my fingerprints and I usually have to use the code to open the phone, so I will probably throw it away because it's very aggravating."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Freezing screen",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "The screen froze often then there would be big patches of pink jagged static ....don't know what else to call it that would show up. The first time it happened I turned it off then on and it was ok for 1 or 2 days then started again . Contacted Samsung they said to return it to them for repair on my dime. No. It's a renewed phone and that's usually worked well but not this time. It's not Amazon's fault but a glitch in the phone. I'll try again as renewed are more in my price range."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AT&T said Phone not unlocked.",
      "date": "Reviewed in the United States on May 20, 2022",
      "body": "The phone I received was practically new and in great condition and I received it really quickly. The S20 FE also seemed like a very nice phone for being a generation or two old. Unfortunately, I took the phone to an AT&T service center to have everything setup and transferred because a new sim card was going to be needed for this phone. AT&T was unable to activate the phone on their service and said that it was due to the phone not being properly unlocked. They informed me that I could possibly take it to a Fix It shop and pay them to unlock it and they may be able to get it to work.I purchased the phone advertised as being properly unlocked so I'm not wiling to pay another shop additional money to make the phone what I originally purchased. Luckily, with the Amazon Renewed Return guarantee, I don't have to mess with it. I didn't receive what was advertised so I'll just return it and move on. As for the condition of the phone, it was exactly as described, Excellent, and the shipping was very fast. I've purchased many renewed unlocked phones over the years for work, personal and family and I've come to the conclusion that it's about 70/30 if you get a phone that's actually fully unlocked as described. More often than not, it's fine and you feel like you got a good deal but it's definitely not rare that you run into issues. Just know that's what your buying into... with most any renewed phone in my opinion. If you're willing to roll those dice, I wouldn't discourage purchasing from this same vendor.These phone manufactures and cellular companies have tried to put such a strangle hold on their customers via locking devices, white/black listing certain phone manufactures to fighting aftermarket shops from obtaining proper technical docs to refurb/repair certain devices, just to steer the consumer into buying a new phone from them or signing a one sided contract for years on end. That seems to be the game you have to be willing to play when it comes to the aftermarket in Cellular technology.2/5 stars because I happened to be one of the 30% this time. If the phone would have worked, it would have been a 5/5.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unable to make calls",
      "date": "Reviewed in the United States on June 16, 2023",
      "body": "I ordered the Samsung S20 FE, refurbished in excellent condition.Upon initial inspection of the device, there were few hairline scratches on the screen and camera lense glass, but hardly noticeable and do not interfere with the function of the phone. The color on the edges near the screen are starting to wear away, but I will be putting a case on it anyway. The one thing that shocked me was a deep gash near the charging port of the phone. It's deep enough to expose the metal underneath and you can physically feel the divot. It's about a centimeter in length. I would not consider this in excellent condition, maybe just good.All that being said, it's more of a cosmetic thing, and will be hidden under a case, but it didn't meet the Amazon Renewed definition of excellent condition.I was able to activate it to the Verizon network, and everything seemed to work as expected until I tried to make a phone call. The call immediately disconnects when the other person answers. When they call back, the call automatically disconnects when I try to answer.I end up taking it to the Verizon store and after nearly an hour and a half of trouble shooting and replacing the SIM, etc they are unable to resolve the issue.Now I am left with a phone that was Amazon Renewed Guaranteed to be fully functional, but can't even perform its most basic function of making and receiving calls.Amazon said they can't help me, and I have to go through the seller. Until then I am stuck with a phone that can't call, and must await the response of the seller which may take up to 72hours, and then who knows how much longer to get an actually fully functioning device.Extremely frustrated, and unsatisfied with my purchase. Seems there is no quality control to ensure these devices meet the standards and functionality guaranteed by Amazon.Update:The seller \"Joygoods CR\" responded with a very brief: sorry, we don't have anymore. And they sent me a return label so I can return the device for a refund.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing Condition for a Refurbished Phone",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I recently ordered a refurbished Samsung Galaxy S20 FE, but unfortunately, the condition was far below what I expected. While I understand that refurbished phones may show some signs of use, this one had multiple issues. The phone had visible dents, a scratch on the screen, and worst of all, a water bubble on the camera lens. I’ve ordered refurbished phones before and never had this kind of problem.The most frustrating part was that I couldn’t return it because I bought it for my parents, who were leaving for an overseas vacation. The phone arrived at the last minute, and we didn’t have time to thoroughly check it before they left. They only realized the poor condition of the phone when they reached their destination.While I appreciate the affordability of refurbished devices, I was really disappointed with the quality control on this one. It would have been helpful if the condition had been more accurately described. I had no issues with previous refurbished purchases, so this was a letdown.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, disappointing battery life",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "The phone looks nice & is in goodcondition, yet the battery life is disappointing, to make matters worse the charger originally sent was defective, though the seller did respond quickly & sent a replacement charger."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked but there was an issue",
      "date": "Reviewed in the United States on June 8, 2023",
      "body": "I was leary after reading some of the negative reviews. There is always a risk buying a refurbished item from an unfamiliar seller. The side of the phone case came with a couple very, very small scratches which were barely noticeable, they were the only blemishes I could find. Verizon is my carrier and after I switched SIM cards everything worked perfectly. Smart Switch copied everything over fast.There were problems though. The camera was defective and had an shadow artifact in photos. I originally thought it might be dust but after removing the rear cover and cleaning with alcohol it did not resolve. I ended up buying a replacement camera from Ebay for $22 out of my pocket which fully resolved the issue. My wife also bought the same phone from this seller (S20 FE). Opening the rear cover was extremely difficult because the seller had used a lot of rubber cement to seal it (WRONG thing to use).If you buy a phone be prepared that 1) seller does somewhat amateur work refurbishing and uses wrong materials 2) quality control is poor",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waiting for Resolution",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "Bought a Samsung cellphone in October the screen was broken so I returned the phone to the seller  but still haven't gotten a refund or any type of resolution yet"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging port stopped working",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Unfortunately, under a month of purchasing, the charging port stopped working. It costs me half the price of the phone to ship it back to the seller. Sigh.."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's 'ok' for the price",
      "date": "Reviewed in the United States on May 23, 2024",
      "body": "This isn't the worst phone I've ever had. But it's definitely not one of the best. The talk to text is absolutely unbearable. You will not sound like a normal functioning person if you use it and the punctuation is unreal. It will put periods question marks, in the middle of basic sentences. Is the camera quality is kind of trash. It is like a $150 phone. It's literally what you're gonna get for it. I do highly recommend if youre on budget it's done me well for the last five months.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy this phone if you do not have a Verizon SIM card or plan!",
      "date": "Reviewed in the United States on September 17, 2024",
      "body": "The  Unboxing of the phone was good, but when I had to set up with my new phone plan, it became chaotic, cannot transfer my contacts. wireless Transfer did not work, could not answer my voicemail, every app that I saved on my home screen Or even in the phone was erased. I had to re-put my contact information. Manually I repeat if you do not have a Verizon Sim card or phone plan. Do not buy this phone. Also, make sure you are paying attention to the deadline return date I am not really good with computers , so I had to get help through my cell phone provider. It was crazy, Or Cellphone Carrier/ the cell phone company carrier stated was that  this phone is compatible with all these different carriers ,and that’s not True. U Have to be  with Verizon or have a Verizon SIM card. This purchases phone was a Verizon carrier. If you didn’t have the proper Sim card (Verizon only) in your phone will be useless ,to you and they didn’t refund me my money or even replace my phone because my window had closed because again who shops online thats gonna even try to return anything. I have never returned anything from Amazon so you can say this is new for me, but from now on, I just want everybody to know and to just pay attention to your purchase  and return window if you have a defective phone like the one I had. You guys have a great day",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Excellent",
      "date": "Reviewed in the United States on October 21, 2024",
      "body": "rated excellent but the battery only charges to 85% should have been rated good and the battery issue disclosed"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Adequate, but cheap out on some features you'll miss",
      "date": "Reviewed in the United States on July 22, 2022",
      "body": "NOTE - this is all about the manufacturer, not the seller.As a long time Galaxy S-series owner, I assumed any phone in the S lineup would be an upgrade from my old S8. And in many ways, this is. But if I'd read the specs in more detail, I'd have chosen a different model.The fixed-focus selfie camera means shots of more than 4 or 5 people are out of focus - no more propping up the phone and using the selfie camera so you can see the group, you'll want to use the main camera and frame carefully before starting the timer.WiFi management is awful - it's very reluctant to switch to a stronger signal, so if you walk up two floors it will struggle to hold on to the weak downstairs connection instead of switching to the strong signal of the floor you're on. I've never had a phone that made me manually switch WiFi connections so frequently.Still, the rest of the phone's features are what you'd expect from an S-series, and these defects aren't enough that I'm trading it in right away. Just going to be more careful next time.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not duel SIM as advertised",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "Overall I like the phone, it was in good shape and works properly. The reason I gave only 3 stars is because it was advertised as duel SIM and it is not. Since it's always a gamble buying used I decided to keep it only because it is in good shape with no issues except not being duel SIM. It's a good phone for a spare."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Locked to Verizon. :(",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "The phone itself seems fine however it is not unlocked like I thought it would be , it is tied to Verizon and is giving me a lot of trouble unlocking it , I cannot even seem to request its imei  number , I was very much under the impression that all phones sold online would come unlocked and am very frustrated I have to do this , this alone will make me think twice about buying a phone online from you guys or Amazon,  I did not have this issue when buying from Back Market.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Pantalla bloqueada",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "El celular tiene un bloqueo de pantalla con un pin y no he podido utilizarlo"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT UNLOCKED!!!",
      "date": "Reviewed in the United States on September 10, 2024",
      "body": "Okay... say what you want but, I am an Android girl!! So needless to say when I stumbled upon this amazing phone for a great price to replace my S10+ I was in heaven. Thought i did my research with making sure that this phone is unlocked and can be used with my current Metro By T-Mobile carrier.  Not so fast slick...the speed of delivery was amazing. I ordered on the 6th I received it on the 8th. Same day the phone was delivered I went into Metro and to my surprise, the phone was locked and aVerizon phone not unlocked or able to be used by my carried. I have began the process of a refund, went to Whole foods today to start the return process, Lets see how long the refund take to hit!!. hope this helps anyone shopping for a unlocked phone for Metro PCS by T-Mobile.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Block of a Phone",
      "date": "Reviewed in the United States on September 28, 2023",
      "body": "I bought a pair of these phones for my wife & I. They're a decent phone as far as operations & features go. The condition is like new; no scratches, chips, or flaws. The screen is clear, colors are bright, photos are good, performance is zippy, battery life is decent (but not great). But neither of us especially love this phone. It's quite large & heavy, especially compared to the S6 & S9 we were upgrading from. So heavy it weighs down our pockets pulling on our pants. So heavy it's tiring to hold up after a while when playing games or reading a book on them. So big it doesn't fit in our cars' cup holders (especially once you put a case on it), where we're used to tossing them when driving. So for both of us, this phone is just \"meh.\"",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Listed excellent, but received an ok condition one as it has noticeable scratches on edges and dropped corner. I was not able to charge using its USB or my own USB. Returned right away."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price",
      "date": "Reviewed in the United States on May 2, 2024",
      "body": "A gift for my fiance, Phone works great and would've been 5 stars, but fingerprint sensor didn't work on arrival, shows calibration needed.  Everything else appears to operate properly. Didn't want hassle of returning,  so having sensor repaired. Still a descent deal.Got the fingerprint sensor calibrated free of charge at a authorized Samsung repair shop, Good deal!!  Phone now works great, will still leave 3 stars for the inconvenience, but wanted to share my issue was resolved"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Constant phone signal issues",
      "date": "Reviewed in the United States on July 8, 2024",
      "body": "Happy with everything about the phone except the low to no signal at most times. No joke, I usually have less than to about one bar.I've been with Straight Talk for over 10 years and never had an issue until changing phones. I had them troubleshoot and thought the problem was solved but it's still a problem.So either it's a Verizon issue or there's a problem with the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Excellent, like New Condition!",
      "date": "Reviewed in the United States on August 30, 2023",
      "body": "I purchased a Samsung Galaxy S20 FE 5G phone. It was advertised as excellent, like new condition, but it was not. There are scratches all over the back of the phone, like there was never a cover on it. The phone has problems functioning sometimes, it freezes and I have to restart it. The phone also seems to have problems connecting to my wireless carrier sometimes, again a quick restart fixes the problem. This phone came with the cheapest charger, not a fast charger. It would over heat and the phone would show a caution message because it was getting to hot. I had to buy another charger. Overall, this phone is ok, it's better than the broken phone I previously had, but I wouldn't buy again from this seller. I purchased another Samsung S20 FE from another seller for my husband and it works like new, no issues, looked fabulous.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone screen is very weak",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Had the phone for 2 days and it was not handled roughly and had a phone cover and the phone mysteriously cracked. It works but I have dropped android phones hundreds of times without them cracking in the past and nothing happened to this phone and it cracked out of nowhere"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not thrilled",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "First time I've ever gotten a renewed item and it kind of sucks. The back keeps peeling off and there's gunk around the screen. Definitely not waterproof anymore."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cute but Major Charging Flaw",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "Very cute phone. Minor cosmetic damage. Love the color. The battery life is not that great and since day one it has said it detects moisture in my charger port. I cannot charge it normally, I can only use a wireless charger so I had to buy one. Feels like I wasted money but it's better than nothing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wrong model# sent",
      "date": "Reviewed in the United States on September 9, 2022",
      "body": "Phone worked for 1 day.  On PATRIOT MOBILE, tons of problems. Went to Cricket- switched services. (Which I absolutely should not have to do!)  Wouldn't connect or work at all for over an hour, while in the Cricket store.  Left to get internet and drive the block.  Got connected to restaurant wifi.  Then slowly Cricket uploads started working.  20 min of resetting, the service is still in and out.  We used a T-mobile sim card and it fired up immediately.  On 2 phones we just purchased.  But nothing on Patriot Mobile sim card, nor the Cricket sim cards, would work.At this moment it is very clear that the phones are NOT unlocked!The \"unlocked\" phones we purchased here, are **NOT** unlocked!Edit: according to the model#, we did receive unlocked phones. Unfortunately Amazon sent us sm-781u1/ds which is a Canadian dual Sim model number... NOT SUPPORTED BY ATT.Even though we were sent the incorrect model# Amazon would not replace our phones. Forcing us to purchase 2 new phones (hoping they're fulfilled correctly this time) AND THEN returning the old ones. Unacceptable, Amazon.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charger doesn’t work",
      "date": "Reviewed in the United States on June 16, 2024",
      "body": "I ordered this phone for my mom and within few days of use the charger stopped working.I had to order a new charger and send it to her but I couldn’t understand paying all that money for a phone and the company couldn’t provide a decent charger.I am hoping the same doesn’t happen with the phone itself."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera not usable",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Overall the phone operated just fine.  However,  the camera was simply unusable due to blurriness and various lines through the image.  Returned."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    battery does not hold a charge or discharges rapidly",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "its faster than the s10 i bought it to replace but the battery discharges rapidly"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not impressed",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Won't stay charged all day.I haven't had voicemail since I switched over to this phone. Verizons best suggestion was a hard reset."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mediocre product",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Nice polished look. No headphone connection only bluetooth. The phone is very smart, Samsung (AI) reconfigures the phone on the fly (even daily) based on 'whatever'. The issue is that it takes a long time to set it up the way I like to use it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El teléfono en la parte d atrás está como pelado marcado rayado",
      "date": "Reviewed in the United States on May 23, 2024",
      "body": "Este teléfono lo compré para enviárselo de regalo a mi papá en Venezuela esperemos que esté desbloqueado no me gustó q la parte d atrás se ve un poco desgastado por lo demás es liviano y fácil de manejar como todos los Samsung esperemos si le funcione no lo devuelvo x el detalle de atrás porque me da pereza ir hasta un UPS pero si debieron enviarme uno en mejores condiciones x delante está perfecto"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Damage back",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "This phone works ok but I was not satisfied with the back of the phone it has dents on it. Color blue, I can hear fine and 128 memory"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Not completely unlocked",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "Per Verizon support the phone is not completely unlocked. Need ph# for seller \"RenuDeals Inc., Bellrose NY\"Problems:- Wi-Fi Calling missing even though current carrier have enable feature on their end.- Constant notifications: \"SIM card is not from Verizon Wireless\"Verizon support says they need the seller's Account Pin to continue with unlock phone.Back story: did not need this feature until on a ship with zero cell access except for internet.  Wi-Fi calling would have enabled me to talk to a relative before they died. Previous phones had this feature and were all factory unlocked (not branded to a US carrier, i.e. Verizon, Sprint, et al).Moral: NEVER buy a phone unless it is factory unlocked.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good buy for the cost",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "The phone has it issues but it works"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not in \"excellent condition\"",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "The cellphone is not in \"excellent condition\", it has \"Visible signs of use\" (scratches and dents)."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned as had no service with Cricket my provider",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I am returning after trouble shooting many times on why I wouldn’t get service. I have Cricket and my service would cut out at my house and there is no WiFi calling. Tried a new SIM card and that didn’t work either."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor packaging",
      "date": "Reviewed in the United States on August 18, 2024",
      "body": "Phone could be better,  the charging port was loose upon arrival(sigh) and a minor scratch on screen. Phone otherwise seems to operate as it should. 3 stars"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on August 29, 2024",
      "body": "Seems to be working fortunately but when I went to switch phones in carrier website it says phone locked, check with carrier."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unsanitary",
      "date": "Reviewed in the United States on January 25, 2023",
      "body": "My first time purchasing an \"Excellent Refurbished\" smartphone on Amazon. The experience is bad. First, the product arrives 1 day early than expected (hurray!). However, the good news ends there. Within 3 seconds of inspecting the back side, I can see a lot of spots from some sort of liquid. I tried cleaning these off with a soft microfiber cloth + 91% isopropyl alcohol twice to no avail. Then, I noticed a small paint chips around the bottom right of the display-side rim.This is totally disappointing for a device marked as \"excellent\". Still, it does not end there. Upon first time fresh boot up, I am greeted with a folder full of Verizon apps (I thought this was supposed to be unlocked phone). At this point, I just give up and flip the phone down as I am completely pissed. At this moment, I notice a small hair strand sticking out of the camera bump gap. Also, I soon realized it wasn't one strand, but several albeit short ones.Yeah, I'm requesting a replacement. I will update the replacement experience. Hopefully this is an honest mistake.Update: I just remembered to update this review. The replacement came, and they simply removed the hair strands. The spill drop marks or what not remained. It was clear they simply dusted it off. I ended up going for a refund and getting S23 FE instead months later.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone. Wifi calling.. not so much",
      "date": "Reviewed in the United States on April 24, 2024",
      "body": "Everything on the phone works fine but the wifi calling issue. There is no option for it. I took my phone to Verizon and they said it should have the option. I have done a factory reset hoping that would work. My next attempt will be to contact Samsung and see if they can help. If not I will have to return the phone. I need wifi calling while at work or nothing comes to the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was not unclocked",
      "date": "Reviewed in the United States on November 17, 2023",
      "body": "I purchased Nov 2023. I added it to my cart and it was under $180, then when I was Bout to check out the original price jumped up to $210 (not including tax). I went out again and tried to take the phone out my cart and the price was $180, once you get ready to check out the original price jumped up to $210. I didn't like that. After tax it's around $230.I received the phone in good condition and started to transfer information over and the phone was not unlocked. The next work AT&T and I was not able to use my SiM card in it and I kept getting an error message. I requested to return the phone. I'm going to buy from another seller.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbish is refurbished",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "I bought this for my son and it worked okay but the touch screen isn't very reliable sometimes you have to restart the phone in order to get the touch screen to work.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    4 refurbs returned junk.",
      "date": "Reviewed in the United States on June 5, 2024",
      "body": "First, if I was reviewed the phone model, I'd give it 5 stars. My daughter loves this phone but recently broke it and I ordered a replacement. The original was from this store and worked fine. But now they are junk:First one: Rear cover was peeling off at the bottom - I could lift it and see the interior components. It is clearly a badly repaired one. It had been badly assembled after the refurb.Second one: It booted with the AT&T logo and would not accept the Samsung OS updates. It kept saying update unavailable and try in 24 hours. I did that, plus factory resets, plus trying with or without a SIM card. Nothing worked. Without the security fixes, it was unsafe.Third one. All looked good, until I realized it had the opposite problem of the second: as soon as the OS update completed, it reported update available and went again. I gave up after 10 cycles when it wanted to go again. In between, I tried clearing the cache and factory resets. Nothing helped.Fourth (from another supplier): all looked good, but it would not connect to Verizon with the SIM - basically, the unlocked phone was not unlocked.This is an older model, and I think all the ones available as refurbs now are junk. Time to move on to another phone.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is unlocked but a message keeps popping up",
      "date": "Reviewed in the United States on July 31, 2024",
      "body": "Great phone but the message keeps popping up every 10mins saying the SIM card is not a Verizon SIM card. “Please insert verzion sim”"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Warning: sometimes phones are not unlocked",
      "date": "Reviewed in the United States on July 12, 2024",
      "body": "This Phone isn't unlocked when i got it i had to go through the process of unlocking the phone. be careful when buying these phones if you plan to purchese an unlocked device",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Performance is bad",
      "date": "Reviewed in the United States on May 24, 2024",
      "body": "I understand it's a refurbished phone, but there are way too many problems with this phone even for its reduced price.Keep in mind the only reason I bought a refurbished Galaxy S20 Fe is because I previously owned one in it was literally the perfect phone to me.This phone has very poor connection in locations where my old S20 Fe didn't. Even when I see \"5G\" by the maxed out reception bars,  the internet acts as if I only have 1 bar and is very slow.GPS does not work. When it does actually work, the map is oriented in the wrong direction and the map is frozen.The battery dies very fast.The phone overheats randomly with minimal use and apps shut down. This seems kind of dangerous because I'm not sure if this is related to the battery dying fast.I think this will be the last time I take a chance on a used phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Says unlocked. It isn't",
      "date": "Reviewed in the United States on November 20, 2024",
      "body": "The phone quality looks great so far. Couldn't use it though because it says it's an unlocked phone. But when I put my att Sim card in it doesn't accept any other carrier except Verizon. Can't get in touch of the seller because I can't find information on them. So either the phone is useless or I have to switch to verizon."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    False advertisement",
      "date": "Reviewed in the United States on November 30, 2023",
      "body": "Purchased this phone for my mother in hopes of putting her unto Att prepaid network, i bought screen protectors and case protectors for this phone. Ordered a sim card and prepaid plan from Att online and couldnt get the phone to work. Fought with att for over a month trying to get this working then gave up and finally decided to settle with Cricket wireless. The very moment i told them where i recieved the phone from my situation they knew right off the bat that the phone was locked. They further verified this with a \"dummy\" sim they used to check the phone. I ended up just buying a phone right from their store. So in the end i lost an additional $100(not including the $300 purchase plan from Att prepaid, thank god they didnt charge me cause the phone didnt work). Oh and i had to send this phone back for an additional $15 to get my refund. So in all, this phone cost me $115($296.99, had i not recieved my refund). So by trying to save money i actually spent $115 for nothing. This is the worst phone buying experience ive ever had not including the fact that most times you have to fight with the carriers to get an unlocked phone working on their network. Amazon or its vendors need to take better precautionary steps into selling the right product from their descriptions. Dont be like me, just get a phone right from the carrier you want.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished, or reflubished?",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I bought this for my wife who is electronically challenged. So when she had issues I figured it was just her. Two days after the warranty expired she dropped the phone, cracked the display and it was unusable. I've ordered a different phone for her, but decided I'd try to replace the screen and get the old one working. I just started the disassembly and am not at all happy with what I see inside. The 5G antenna is missing, and the screws for the mother and daughter boards are missing. There's not telling what else was done poorly. If I can get it working enough to recover her files it's trash. Not recommended.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "I like the phone, it was supposed to say unlock, but the phone is still locked to Verizon.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy S20 FE 5G 128GB",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I don't  like the condition the phone came in it was dirty and have some mark around  the camera I am so disappointed 😥"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worked right from day one and only gotten worse",
      "date": "Reviewed in the United States on July 17, 2024",
      "body": "I was excited to get my new phone, I had broken the screen on my previous one, and this one was supposed to be nicer, better. I get the phone and had to wait for my payment cycle to be able to switch.As soon as it did, I regretted it.I have not been able to hook to my provider,  I don't have internet (I pay for unlimited) if I am not at home it shows I am not in network. I went to provider they did what they could.If I hit a deer on my way to or from work, I have no way to call anybody.  I work 45 minutes from home, a lot can happen.And now the entire middle portion of my screen does not work.  I can touch it until my finger is sore and nothing will happen.That means not being able to share, tag, correct spelling errors, click a photo from my gallery, and not even have the ability to play certain games. My provider is still working on What they can on their end, but since the center portion of this phone doesn't work, I am making payments on a paperweight that I don't have full access to. If you buy, buyer beware",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Black screen, not working 😕",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "The screen or the phone stopped working before I could connect to a service provider"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible packing.",
      "date": "Reviewed in the United States on June 20, 2024",
      "body": "Package has no phone charger. Package does not have instructions manual. Package was in a plastic wrap. I was  very disappointed with this order."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished shouldn't mean defective",
      "date": "Reviewed in the United States on January 3, 2024",
      "body": "Look, we all know that when you buy refurbished products, it ain't gonna be perfect. But the whole point of the \"refurbished\" aspect is that there shouldn't be any major hardware or software issues that I can find within a few days of having it. First one I bought, data wouldn't work at all. It took me days to find a workaround that could get mobile data up and running... for five minutes. Took it to my carrier, tried fixes and even got a new SIM. Nothing. So of course, I asked for a new one. This one connected quickly to 5G, but the only downside is fingerprints refuse to work at all. Restarted it, updated it, tried countless fixes. But it keeps giving me an error that states there's a \"calibration issue\" and I need to contact support. I'm all for having cosmetic issues, but the fact that both phones I've received are suffering from software/hardware issues is NOT a good look.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Headache",
      "date": "Reviewed in the United States on May 29, 2024",
      "body": "I am so unhappy with this phone. I had an apple prior to this. I'm constantly having reset phone, reset network connections. Battery doesn't last long. It could be my service, but never had that issue with iphone."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in excellent condition as advertised",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "I would not have spent this much on a phone that scratched up",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice phone",
      "date": "Reviewed in the United States on April 19, 2024",
      "body": "I am very satisfied with my phone. It's in very good condition. When I received the phone I THOUGHT it was locked so I reached out to amazon/seller and they got back to me right away and told me exactly what to do and it worked instantly. All in all I am happy!!! SECOND REVIEW- I have had this phone for about 2 months and I'm very upset and I hate to say it but it's garbage. The phone freezes on me all the time, it's gets extremely hot if im.on it for more then 10 minutes and it also gets super hot while I'm charging it. I know it's not the charger because I have a samsung fast charging charger and it's brand new, but for the hell of it I have tried putting it on different chargers and it don't make a difference it still gets very hot."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Device Inoperable After Only Six Months",
      "date": "Reviewed in the United States on June 30, 2024",
      "body": "While it worked, the \"Samsung Galaxy S20 FE 5G, 128GB, Cloud Navy - Unlocked (Renewed)\" (product ID B08L34JQ9C, Condition: New) I bought from seller \"BlueChip Wireless\" (marketplaceID=ATVPDKIKX0DER) worked fine. At six months, the USB port failed, necessitating wireless charging. Within a week of the port failure, the fully intact screen began failing to turn on randomly with increasing frequency until as of today, when it has now consistently failed to turn on for an entire week. The phone still appears to charge wirelessly, as indicated by the LED on the wireless charging pad (on while charging, off when complete), and presumably the phone might still be operating fine otherwise, but there is no way to tell without a working screen or a functional USB port.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer beware",
      "date": "Reviewed in the United States on January 18, 2024",
      "body": "This phone is mostly fine.  Trying to save some money, I bought this phone instead of from the big companies.  When I tried to get it setup with Verizon, I have no access to certain apps, like voicemail.  For some reason, this phone didn't come setup for voicemail and it's not something I can just install.  At least, not with verizon.  I guess next time, I'll have to purchase from a company that makes sure all things are put on the phone appropriately,  instead of from a third, unknown party."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not great",
      "date": "Reviewed in the United States on March 9, 2023",
      "body": "this phone functions ok, but a very cheap thin case managed to flex it so bad the screen cracked. I installed the case and set my phone on the charger for the night, woke up to a cracked screen.  This happened 4 times because I was trying to figure out what caused the cracks.  Since I stopped using the case, no new cracks. It's never been dropped. Replacing the glass is very invasive due to the design.  There was a usual amount of bloatware and I find the size requires me to use both hands.  It seems to be geared towards someone who wants to scroll thru facebook and not use their phone as a tool."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery charging",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "I have a fast charger thick gage wire phone takes 2 hours to charge.  My old 4g 5 year old phone charged full in 30 minutes. Might be returning  this is ridiculous"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast battery discharge",
      "date": "Reviewed in the United States on May 2, 2024",
      "body": "The operation of the phone is very good, I liked it a lot, unfortunately the battery does not last long, in normal use should last about 8 hours I think but I do not have to charge every 3-4 hours."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be careful.",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "I bought this phone for my granddaughter.  It was delivered on Aug 4th 2024.  It had a major issue and would cost 3 times the price to fix. Not worth it!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    purchased excellent condition, came with scratches and dirt in the edges/speaker holes",
      "date": "Reviewed in the United States on April 20, 2023",
      "body": "pretty gross it had so much dirt in the cracks and also a big sticker residue on the back, definetly not excellent quality. minor scratch on the screen and scuff marks on the camera. i feel like ive been lied to with the condition it was in. luckily the phone works fine, still tempted to return it and purchase from a different seller although i dont want to have to go through setting up a new phone again and being out more money. its a gamble buying used but still should have some type of quality control, at least clean the phone before you send it to someone lazy ppl.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I received it",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "It's ok"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen issues",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Here is an update. I got the phone October 1st here we are January 7th I woke up to the phone not allowing me to turn off my alarm zero reaction to me touching it. I took it out of its case to inspect it and noticed the screen had started to detach from the housing also the back is doing the same thing. I had noticed some cracks forming in the already questionable screen thinking i dropped it i assumed it was my fault but is seems like the adhesive had failed front and back. I left my original review below.After a couple of months I would say the phone is in good shape. The major issue I have is the screen glitches out by displaying a negative image, going completely white, and the right hand side is not nearly as responsive as the left. Also I have had to reprogram the thumb print sensor multiple times. I still think it is worth it for the price.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone sucks",
      "date": "Reviewed in the United States on July 4, 2024",
      "body": "This phone is incredibly annoying to operate. I have a screen lock password and yet somehow it will still open apps and web pages or start Spotify in my pocket with the screen locked.I have the phone set to dark mode 24/7 and some web pages will still be in light mode.The phone will be connected to my android auto and display nothing and play nothing.  I have to reset the phone for it to work sometimes.As for my Bluetooth stereo I will be connected but for some reason the music isn't playing. I'm watching the song play on the phone but no audio comes out the phone or the connected Bluetooth speaker.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    face recognition sucks",
      "date": "Reviewed in the United States on April 3, 2024",
      "body": "I just replaced my galaxy S8 with this S20.The facial recognition rarely works.  I almost always have to unlock my phone with my fingerprint or pin.  Other than that I don't see much difference in applications, except that it comes with a malware scanner that my s8 didnt have.  I guess that's good.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent customer service!",
      "date": "Reviewed in the United States on July 31, 2023",
      "body": "I received my phone in excellent condition but within  4 months I began having trouble with the bluetooth aspect of the phone and I was frequently dropping calls. I would have to reboot the phone a couple of times a day in order to receive and make call.I called the seller and was delighted to talk with a gentleman that listened patiently to my problem and offered me a full refund even though I had passed the allotted refund period of 3 months.I returned the phone and I received my full refund as promised.Excellent customer service!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition but Verizon branded",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "Verizon rom and boot screen. Complains no Verizon Sim. Phone still works just not a stock rom"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked well until it didn't. Will probably not buy a phone renewed ever again.",
      "date": "Reviewed in the United States on January 1, 2024",
      "body": "I'm so torn about how to feel about this phone. It looks great, and it worked fine, for some months after purchasing it; I had no reason to believe that I would wind up having an issue with it, especially with my verymodest use. Recently, I have been randomly unable to receive calls. It is not a DND issue or a muted/blocked number issue. I have been through numerous troubleshooting loops; everything to do with data except receiving calls works.It is not an issue with my carrier either, because moving the SIM card to my previous phone makes everything work perfectly. I am tired of it intermittently working and then not, with no rhyme or reason. My only guess is that something internally on the phone is corroded or damaged, or not seated correctly. But, I would not know, and I am too far beyond claiming warranty support for a phone that was clearly sold as defective."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but...",
      "date": "Reviewed in the United States on January 27, 2023",
      "body": "The phone works great. It's very fast, efficient to use, responsive. The only terrible thing is the battery life. It goes so quickly. For example, it was fully charged when I woke up at 5am. I unplugged it and fell back to sleep. At 8am when I awoke again, it was at 80%. It WILL NOT hold a charge all day, even if it's not being used. For now, it'll make due as a temporary option. But bring your charger. Even when I'm not using it, getting up at 8am with it at 100%, it's at about 60% by the time 10:30am rolls around. This is my only complaint with this phone though. Everything else seems to work just fine.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with broken camera",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "Booted up the phone and when I went to go take a photo, i noticed these black spots in all of them. It has to be something wrong with the camera i just don't know what. The surface is completely clean. :(Everything else works good though. The quality of the outside shell was also better than expected. Looked brand new! The camera thing is a shame, although the front works fine.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone but not the phone! Read to find out why",
      "date": "Reviewed in the United States on June 15, 2023",
      "body": "I absolutely love thus model it has a super good camera and the fact that you can add a really healthy gb sd card. It came with a glass screen protector the only thing I absolutely hate is that I bought the fully unlocked version and it's a Verizon phone the sim card I use always gets a stupid your using a non Verizon sim card and it has Verizon apps installed and I mean alot of them that are worthless unless you use Verizon but you cannot remove them and they take up a lot of sapce."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had scratch-like discoloration",
      "date": "Reviewed in the United States on October 8, 2023",
      "body": "I love the color, but in the front at the edge of the screen there’s no color! It came like that, with it rubbed off or something. How in the world did that happen? The screen would’ve been scratched as well because it’s so close. I tried coloring it in with a Sharpee, but that didn’t work. I’m always going to have to see this imperfection. Disappointing because I always thought highly of Amazon. And the phone is smaller than expected. What a way to ruin my impression of Samsung."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped charging after two weeks",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "I did some research to find a good refurbished phone and finally decided on this one. It came looking pretty good the packaging was nice. For a week it worked the camera isn't great and the battery life is so so but I can deal with that.  However it stopped charging. I tried several charges but none worked. It died finally the bright side is that this far the return has been easy and stressful free.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not buy from this company",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "We had a screen protector on this Samsung s20 plus a phone case since day 1. One day the screen just started to go bad. This pic was taken a couple days after the first small screen issue. It progressively got worse as seen in pic. The tech who checked the phone said this refurbished phone was completely missing the white sticker which would indicate by changing colors of the phone had prior water damage. Again she said the sticker was completely missing from this phone!! This leads me to believe this company removed the sticker probably because it would have shown evidence of prior water damage. I will never buy from this company again! Phone lasted about maybe 2 weeks before this serious screen issue!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a decent phone",
      "date": "Reviewed in the United States on June 12, 2024",
      "body": "It does everything wanted it to do.  I only had one complaint.  The charging cord didn't work"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Received a defective phone. The microphone wasn't working properly, and about 2 weeks after purchase, the bottom half of the screen started to freeze up, and then a few days later the entire screen went black and no matter what I do it refuses to come back on. Unfortunately I'm unable to return the item, so this turned out to be a total waste of my money."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked 6 months",
      "date": "Reviewed in the United States on February 16, 2024",
      "body": "The phone looked nice when it arrived and worked fine for 6 months. Now it doesn't recognize my SIM card, however, and it seems to be an issue with the phone. Had hoped it would last me quite a bit longer than this."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging port not in good condition",
      "date": "Reviewed in the United States on June 24, 2024",
      "body": "Charging port not in good condition. Cable coming out automatically."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life sucks",
      "date": "Reviewed in the United States on July 12, 2024",
      "body": "Battery not so hot"
    }
  ],
  "productDetails": {
    "productTitle": "Samsung Galaxy S20 FE 5G, 128GB, Cloud Navy - Unlocked (Renewed)",
    "asin": "B08L34JQ9C",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "6.5-inch FHD+ Dynamic AMOLED 2X Infinity-O Display, 120Hz, HDR10+, 1080 x 2400 pixels, IP68 for water and dust resistant",
      "128GB ROM, 6GB RAM, Qualcomm SM8250 Snapdragon 865 (7 nm+), Android 10, Octa-core, Adreno 650, One UI 2.5, 4500mAh Battery",
      "Rear Camera: 12MP Wide (F/1.8 aperture) + 12MP Ultrawide (F/2.2 aperture) + 8MP Telephoto (F/2.4 aperture), Front Camera: 32MP (F/2.2 aperture) , Under Display Fingerprint",
      "2G: GSM 850/900/1800/1900, CDMA 800/1900 & TD-SCDMA, 3G: HSDPA 850/900/1700(AWS)/1900/2100, CDMA2000 1xEV-DO, 4G: LTE 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 20, 25, 26, 28, 29, 30, 38, 39, 40, 41, 46, 66, 71, 5G: SA/NSA/Sub6 (ensure to check compatibility with your carrier before purchase)",
      "American Model, Compatible with Most GSM and CDMA Carriers like Telus, Rogers, Freedom, etc. Will Also work with CDMA Carriers Such as Verizon, Sprint."
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$128.95",
    "url": "/gp/offer-listing/B08L34JQ9C/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B08L34JQ9C",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "1"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$152.99",
    "listPrice": "$169.02$169.02",
    "savingsPercentage": "-9%",
    "standardDeliveryDate": "Wednesday, March 26",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}