{
  "asin": "B088NQXD8T",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks and works like its brand new!",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "The Apple iPhone SE (2nd Generation) has been an amazing device for me! It offers a perfect blend of powerful performance, sleek design, and affordability, making it an excellent choice for anyone who wants an iPhone without the hefty price tag of the latest models.Pros: 1. Compact and Comfortable Size: The 4.7-inch display is the perfect size for one-handed use, making it easy to carry in my pocket and use comfortably. 2. Powerful Performance: The A13 Bionic chip ensures the iPhone SE is fast and responsive, handling everything from multitasking to gaming without a hitch. It feels just as powerful as the iPhone 11 series! 3. Great Camera: The 12MP rear camera takes stunning photos with excellent color accuracy and detail. The Portrait Mode and Smart HDR features make the pictures look professional. 4. Touch ID: I love that the iPhone SE has the reliable and secure Touch ID, which is faster and more convenient for unlocking the phone and making secure payments. 5. Value for Money: The price point is fantastic for an iPhone, especially with such high-end performance and features, making it a great option for those who want an Apple device without spending too much. 6. iOS Ecosystem: As expected, the integration with the Apple ecosystem is seamless. iMessage, FaceTime, iCloud, and all the apps I need work flawlessly.Cons:None so far—this phone delivers everything I need!Overall:The iPhone SE (2nd Generation) offers exceptional performance, great features, and a sleek design at an unbeatable price. It’s perfect for those who want the iPhone experience without paying for the more expensive models. Highly recommended!",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Purchase! Well worth it!",
      "date": "Reviewed in the United States on February 4, 2024",
      "body": "I am so happy with this phone! I was about to buy from another well known site that sells used phones when I discovered that amazon sells refurbished ones and that are fully operational, checked for quality, have a 90 day warranty AND are unlocked!. My 11 yr old daughter had an iphone SE since she was 7 and took good care of it till it accidentally slipped from her hand onto concrete. Even though she was very responsible with it for a long time, I still dont see the sense in getting a brand new phone and spending hundreds of dollars on it for a kid. Even adults have accidents with their phones sometimes and I think the chances are higher with a kid. So when I discovered this option I was overjoyed. It does everything she wants to do - call, text, go on the internet, download apps and games and hers has 5G (careful because I think amazon also sells a 2G one, so I made sure to get this one that says 5G). And this way, if she has a horrible accident with it, Im not out hundreds of dollars. The one she got looks almost new, only a very light scratch on the back which is covered with a case anyway.  All we had to do was take her sim card out if her old phone and put it in the new phone and then it asked if we had a nearby apple device we’d like to sync it with (in this case, her tablet) and it walked us through that process. It really couldn’t have been easier! The phone even came with a little tool for getting the sim card out! And a generic brand charger to charge the phone with. I am SO happy with this purchase! Thank you Amazon for having these available at an affordable price!! Affordable options like this are why I keep shopping with Amazon! Oh and the battery health was pretty good, better than my current phone! Maximum charging capacity 91%. For a refurbished phone that is excellent",
      "helpfulVotes": 52
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect phone for someone like me.",
      "date": "Reviewed in the United States on September 9, 2021",
      "body": "I previously purchased from Amazon Renewed an iPhone 5s, and was satisfied with it considering the price was barely over one hundred dollars. That phone, however, was originally released in 2013, and at 8 years old it was getting hard to justify its continued use.So when the new iPhone SE (2020) was released I was really tempted to get it, but the pandemic had basically stopped any purchasing of anything for me at the time. Now in September of 2021, with the battery in my old phone failing, it was time to do something.I decided to check out what Amazon might have in their \"renewed\" products and was surprised to find that they now have \"Renewed Premium\", which offers a year's satisfaction guarantee. That meant, in my mind, I could send this thing back if it wasn't good or turned out to be a lemon, so I sprung for it.First of all, this one came in a nice box, oversized, and obviously sturdy enough to protect everything inside. It comes with an information packet describing what \"premium\" means, along with a quick start guide. The inclusion of a standard wall charger was nice, but I have a number of chargers already, not to mention my iPad Pro charger. I'll get back to that in a minute.Another thing that was nice to have included was a tool for removing the SIM card tray. Nice, but it turns out that with the new iPhone SE you can use eSIM! More on that as well in a minute.Now first of all...  This phone looks gorgeous. The red color and the black front make for an awesome combination. All surfaces are smooth as if it was a brand new phone. Turning it on shows the screen is working perfectly, with even back lighting all across to each corner.The first thing I checked was the \"battery health\". Amazon promises that with their renewed premium phones the battery would at least be at ninety percent of capacity, so I immediately checked.Ninety-eight percent! Eight percent better than what they promised. Not bad at all!So it turns out that this phone supports fast charging. So that means my phone gets charged on the desk where my iPad Pro sits, because the charger for that is a high capacity charger. The iPhone SE charges up easily in a little over an hour, which means no need to plug it in over night. In fact, I plug it in before bed, but it's plugged into an outlet controlled by Alexa and that wont come on till in the morning. The phone charges up to capacity before I go to work!Now for setting up the service, the iPhone SE (2020) supports eSIM, which means getting set up with Mint Mobile (or any service that supports eSIM) was as easy as...  Well, I went to Mint Mobile's website, checked my location, checked phone compatibility, chose my service plan, then chose eSIM at check out. A few minutes later a QR code appeared on the screen of my computer that I scanned with the iPhone SE, and a few seconds later I had 4G/LTE and everything ready to go.eSIM is the way to go. It is, just trust me on that.After about a week of using the phone, on some days like I normally do and on other day literally trying to cause it run dry of battery or trying to get it to malfunction, this little phone is holding up way better than I could have anticipated. I believe I can safely say my iPhone 5s can be retired for good.By the way. Get a cover. This phone has a glass back, which means it can be charged wirelessly, but it also means you can break it easily. I got a simple transparent back cover with a raised bezel around the edges. It cost about 9 dollars, came in the same day as the phone.I would recommend this phone and the Amazon Renewed Premium program. Yes the cost of the phone was more than it would have been with renewed only, but being able to return the phone for up to a year is worth it.",
      "helpfulVotes": 251
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good so far gotta keep charger on you when you go out cause it goes down I got it dec 18th 2024",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I don’t have a picture of the phone cause I’m using it to write this lol but I got it in the excellent condition option honestly from reading these reviews I thought it would come in 80% battery but it didn’t I was very shocked little to no scratches I mean there’s like a bit on the back of the phone but I have on case so it won’t matter and the color is good the screen size pretty small but if you’re a chill person like me and you just need a cheap phone but one that moves fast get this one so freezes so far it does move a little slow when you have to much stuff open but it’s not that bad functions pretty well so far and I’ve played call of duty so far and like Roblox  and I’ve downloaded a good amount of apps it came with iOS 18 alr installed which coo I had like 118 gbts left of space and that’s pretty chill dude the only thing is you gotta keep it on the charger on you cause yeah the battery goes down fast but then again I’m a heavy user so could just be me fr but yeah functions well and you should def get it if you’re on a buget alr have a good one",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Product is awesome! Some minor scratches on the back of the phone but it is refurbished and works great! The phone came with 89% battery life not too shabby",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phenomenal phone",
      "date": "Reviewed in the United States on December 24, 2023",
      "body": "This is the best phone I’ve ever owned, in my opinion. I’m passionate about smartphones, and I’ve loved previous high end Androids. This has a few key advantages over those devices.Simplicity. I used to compile my own Gentoo. I understand the value of FOSS. Still, I’ve come to decide that a personal communicator/ data assistant needs to be usable above all else. iOS is feature-complete, thoughtfully efficient, and free of redundancy beyond Android. The toddler’s interface i used on the iPod touch has matured into what it was meant to beReliability. I’ve never had big problems with Android, but it can hiccup. On every phone I’ve used over more than a decade, I’ve occasionally experienced minor crashes, GPS gremlins, battery drains, cooling anomalies, and inscrutable major app discontinuations. In nearly a year of use, this old midrange iPhone has been utterly rock solid and i am confident Apple will not yank the rug out from under any of its core utilities. I do not manage the RAM on this phone or track battery usage. It’s just normal at all times.Durability. I do not use phone cases. The concept is a bit bizarre to me from a design standpoint. It’s not ideal, but i just try to be very careful with my phone. I’m good enough at it that, since smartphones emerged, it has been overall worth it for me despite eventually breaking two phones in that period. Still, I’m aging and I’ve dropped it. It’s clear that this phone is comprehensively designed; the materials and structure are unbelievably resistant to impact on hard surfaces. The damage to my phone is entirely cosmetic to the aluminum frame, and frankly makes me smile that it worked as intended in the face of adversity.Performance. My last phone had significantly more raw computing power than this phone. Still, this phone has a smoother UI and, in my opinion, marks a significant point of diminishing returns in mobile processing power. Clearly, little of the hardware is wasted. It is well balanced.Criticisms include: the ability to edit large blocks of text in iMessage has degraded since the last update. Moving the cursor has become more difficult. Battery life is mediocre. I can confidently get a day of normal use or a few hours of streaming video, and i have to charge it every night. My refurbished phone arrived with a gouge in the screen which i consider barely acceptable.The experience is great. I’ve lost interest in cracking software and customizing each UI element with unlimited freedom in favor of a workflow that aligns with my long-term goals. In that regard this phone excels. Lovely bit of hardware and software.",
      "helpfulVotes": 67
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great replacement phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I lost my phone and didn't want to learn a new phone, so I bought this replacement. I had it activated at ATT today and so far, so good.  Happy with the purchase, phone looks great, no scratches.  AT&T said the screen had been replaced but I wouldn't know the difference.  I am very happy I didn't have to go into debit to replace my phone.  I highly recommended this seller."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blew expectations out of the water with one flaw",
      "date": "Reviewed in the United States on July 30, 2024",
      "body": "I got mine from MOBILESUPPLY in Excellent Condition.This is more of a review of the seller than the phone itself, as I find that a review on the seller would be more helpful for those interested in purchasing it refurbished.TLDR: Very happy with the product but I had a few problems to actually receiving what I wanted.Firstly, the cons.There were many many pros and a few cons with the seller and product. The product that was originally sent out to me had a broken microphone for video recording. The battery health was at 81% (not terrible because Amazon guarantees a 80 or higher, so it wasn’t super bad but just wasn’t ideal). There were very minute scuffs to the top of the phone but nothing bad, more like you can tell someone might’ve lightly brushed the phone along a wooden table and slid it or something. The main complaint was that the product was faulty. So I sent it back.Secondly, the pros.MOBILESUPPLY was fast with replying, regardless of the time. They were fast and helpful with the process. A few days after I shipped the phone, they received it and shipped it to me the next day. The phone right now has a few scuffs but again, nothing too bad, you’d have to look at the phone from very specific lightings and angles to see the very SMALL and light scuffs. The phone came in damn near perfect condition, with a 99% battery health! Super excited to shoot many cool videos with my new SE. Very happy, not a perfect 5 because of the first mishap but I’m very happy with the end product.",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Liked my 1st gen SE better...",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I've had a 1st gen iPhone SE for a long time, and absolutely LOVE that phone, but unfortunately Apple stopped signing ios updates for it, and I noticed a couple of the apps in the app store I was interested in are requiring ios 16 and later, so I decided to give the 2nd gen SE a shot. This particular one I got refurbished from Amazon, and the speaker for the speaker phone sounded kinda blown out, so I will be returning it. Even if it didn't have a blown speaker, I really liked how small my 1st gen SE was (this one, even though it's one of Apple's smaller iPhones, and even though I have big hands, it feels too big in my hand, and I'm constantly shuffling the phone up and down to reach all of the screen). The rounded edges make it pretty slippery, and makes it hard to keep hold of, especially when shuffling the phone to reach the screen. It's definitely harder to get in and out of my pocket than my 1st gen, especially while driving. I also didn't care for the power button being on the side now, as every time I went to turn it off, I would end up hitting the volume up button on the opposite side, and vice versa. The lack of a headphone jack is kind of annoying too, as now I have to buy an extra dongle and bring it with me if I want to plug anything in that uses a headphone jack. All these make me feel like I downgraded my phone. I ended up buying another 1st gen iPhone SE (best iPhone ever made). Not a bad phone, I'd just rather have a 1st gen for a number of reasons. Apple: please bring back the form factor of the 1st gen! No one wants an iPad in their pocket...Did you find this review helpful?"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for Basics, But Feels Ancient in 2025",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "I picked up the iPhone SE (2020) strictly for calls and light web browsing—paying bills, checking emails, and that’s about it. For basic use, it’s solid. But if you’re a content creator or business professional? Look elsewhere.Compared to my iPhone 14 Plus and 15 Pro Max, this thing crawls. I get that it’s an older model, but it shouldn’t feel like an original iPhone in 2025. The battery? Also not great. That said, for the price, it’s still a solid choice for occasional use—just don’t expect speed or longevity.⭐⭐⭐⭐☆ (4/5) for light users. 🚨 Avoid if you need power."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Little power house great phone great buy great price!!!!!",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "I got this phone strictly for photography and the compact size!!!!!  So far so good the phone arrived on schedule and in mint condition!!!!  It works perfectly...I'm new to iphone so navigation was a little hard at first but now I'm getting used to how to use it.  Also I highly recommend buying a case for it as it is small and can easily slip through the hands, I bought a stylish red one for my black beauty.  I waited six years to get an iPhone. I played with an iPhone 11 and saw the great images it rendered but I just couldn't afford it at that time and now I can and I got it and it was just like I remembered six years ago, yes this is the se but it has the same chip as the 11 just in a smaller body which I absolutely love!!!!! Compact iiiiiiis ssssoooooo easy n convenient, so I basically have an iPhone 11 mini now n I'm loving it!!!! I'm happy with it and would buy again!!!!! Oh n it came with an Anker cable and brick to charge a plus cuz I looove Anker they're products are really really good fyi 👍👍👍👍",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad for the price!",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Minor scratches to touch screen and metal back. Battery life is degraded down to 80% of original capacity. Phone is fast and touch is responsive"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE 2 Generation Battery Health Capacity",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Before you buy this product iPhone SE 2 Generation Don’t OVER Expectation are Renewed Condition of Used iPhone Devices are not greatest quality product you can have is the BIGGEST problem is Battery health capacity is 77% BELOW not guaranteed by Seller list description NOT ACCURATELY in iPhone SE 2 generation condition product is horrible details of this Seller Apple iPhone SE model.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer beware ( temporary phone)",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Bought it 2023  and the phone no longer functions. Once it hits 16% battery it turns on and off, screen freezes and the phone crashes often on full charge. So buyer beware"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    some scuffs on phone",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "I received the smartphone in good condition, there are some scuffs, the battery is 92% life. Overall, I am satisfied with the seller. Update: 6th day since I got the smartphone I updated iOS to the latest version today, and the battery percentage dropped from 92 to 88:/ this is annoying"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was a good phone at first",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Phone had been great for many months. But I have noticed lately glass breaking around the edges. I’ve always had a case and glass protector on it and haven’t dropped it. Just odd how it’s doing this."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple OS for cheap",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "Good item for under$150. The display it recessed into the screen which is irritating but it’s fine overall. No headphone jack but it’s got a real sim slot. The fingerprint sensor is nice.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect phone at a great price",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "The iPhone SE arrived in immaculate condition. The \"renewed premium\" option promised 90% battery health -- it had 92%.  Was definitely worth it and would buy again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phones look brand new",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Very good phones they look new and very high battery life I bought 2! One had 93% battery life the other one had 100% battery life, no scratches cracks or dents! My son is very happy and it’s keeping him occupied!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mostly ok seeming. Don’t know how hard it is to find refurbished that truly seems new.",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I ordered one refurbished SE phone only to have it get really fritzy. The screen touching was wonky. To the point that within a few days, it seemed the phone had been hacked. Whatever it was, we wiped it clean, returned (easily and accepted) and I ordered another - this time of the premium quality option.The SE phone is fine, looks fine, but this one seems to have a small volume problem. Taking photos, it sounds (click noise effect).  Turning off ringer, sliding volume, etc do not help. It makes the click sound.However, have not noticed an issue with silenced calls though and am tired of trying new phones, so we think we can keep it and everything else seems to be reliable. Disappointing when taking a chance yet still spending a large amount of money. But …. Ok … enough ….The rest of the iPhone SE seems working and we are iPhone users through and through. This purchase was to upgrade a (3 yr old and still working very well) SE in it’s memory capacity. We have also had iPhone 6s, 11, 12, 15’s in the last few years. So we like iPhones …. Just wish a “refurbished like new” (or I wanted to believe that’s what refurbished meant it was indicating)… wish it actually worked full on. But then again, it’s not new either. And if it’s working, the price is really a good deal less than many out there (unless you want a “free/discount when you sign up for a $60+ monthly service.”  There are some other great iPhone - new iPhone- deals out there. I just didn’t want to upgrade from the $28 monthly service on the phone to $60.Oh yeah. So phone came unlocked to carrier and accepted the small sim card transfer and set up immediately and easily.So again. Satisfied … enough … as a hold over … til a later iPhone (new) upgrade.",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product for little Cost",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "I’ve been searching for a phone that didn’t cost another mortgage payment. This one has been good for me so far for 1/3 of the price plus it was unlocked so I could take it anywhere. The only drawback is the battery is not 100% so it will go from 20% charge to off without warning. Just keep your phone fully charged and you’ll be fine though. 😂"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works like it’s brand new",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Defiantly will be buying 2 more for my 6 year olds birthday"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Using it rn",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "It came with 84 % health battery when it said 90% or more guaranteed and now I gotta replace the battery cuz its at 80% and I just got this on December 8 2024 and been using it for a month and its health goes down pretty fast. everything else works good and no problems besides batter issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE Second Generation",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Great phone! The battery is at 95% and the phone is in pristine condition. This phone definitely gets the job done for what I need it for!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid budget iPhone",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Phone arrived in perfect condition, like new!!!Great phone for a good price"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good phone so far, excellent condition so far.",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "I got this phone yesterday and it looks like new. I am not sure how long it lasts yet, the battery is so far so good.  transfer data is very easy and everything works so far so good."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn’t be happier",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Phone is in perfect condition with 100% battery health! Also came with a screen protector already installed. I will definitely purchase again"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than described. GRT!",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "In as-new condition. Well packaged and arrived early. Grt transaction. Thank you!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Bought previously used iPhone to convert landline to cell to preserve past phone number. The device I received was as clean as brand new.  Battery capacity 98% of original. Excellent condition. Very happy with purchase and seller."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Old Reliable",
      "date": "Reviewed in the United States on March 30, 2022",
      "body": "I had an excellent experience with the seller, and the device came in perfect condition. The rest of this review will be about the device itself rather than my experience purchasing it refurbished.EDIT: this review has been updated for the fall 2023 smartphone market conditions.The GoodThe A13 processor punches far above its weight and compares favorably with the best premium Android processors. This performance level in a phone at this price is very nice. You'll struggle to find a better deal for performance per dollar.With the high end chip, you're also getting camera smarts well above what a single lens shooter should be capable of achieving. While not beating the cheaper Pixel 3a with its multi lens design and Google algorithms, do not underestimate this single camera and brains combination. I found it quite adequate for casual and social media use, so it will struggle in low light conditions due to the notable lack of Night Sight found on newer phones.The phone feels premium and is extremely lightweight still. Wireless charging and Wi-Fi 6 are bonuses that we typically don't see in this part of the market.Apple will support this device for most likely two more years based on the typical support life cycle. This is as expected for the price point whether you go Apple or Android.The BadThe biggest limitation of this phone is the small battery design that hasn't been updated in years. It's the same as the iPhone 8 aside from the upgrades to the internals. This means you're getting iPhone 8 battery life. Unless you are a light user, you'll need to top up the charge before the day is through when combined with that A13 engine. This is like a sporty hatchback with a tiny gas tank. Other phones in the segment have nearly double the battery capacity, and the super fast A13 gives you ample opportunity to spend it.That dated design brings with it a small LCD screen when most of the world has moved on to LED technology. While the screen is one of the best given the technology in use, the display technology is obsolete. The display is objectively less color accurate and less sharp the newer display technology. Only cheaper phones still use LCD today. With that said, it's still a pretty good display with adequate contrast and brilliant colors. It is the best you can get if you don't mind the older technology class.Summary: Insanely powerful engine strapped to a tiny battery wrapped up in yesterday's package.I would recommend this for light to moderate users who often have access to charging during the day, and anyone who wants to get into the Apple world at a lowest price point.I would not recommend this device to someone who plans to use it for watching HD videos, plays games for long periods, or is usually far away from an outlet. I think this person would prefer a device with a more up-to-date display and better battery capacity.",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good. I decided to make a purchase before Tariffs are imposed",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "So far everything is great considering the learning curve in using a new phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Me encanto",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Me encantó vino casi nuevo"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I love that it already came with a screen protector ❤️"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice! Get it",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Nice"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Refurbished, Brand New Phone",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "My white iPhone SE 2020 256GB was advertised as “refurbished premium”. I was expecting a moderately used phone with micro scratches and at least 90% battery health (hopefully). What I actually got was a new or like-new (NO scratches, no dirt) iPhone with 100% battery health (after a charge) and iOS 13.4 installed; You know, the same iOS that the SE2 released with back in 2020. Also, the hardware inside seems to running strong; No defects.Anyway, I’m pretty sure Wcell sold me a surplus iPhone that never sold for the price of a heavily used refurbished 64gb SE.As far as the SE in general is concerned: going into 2025, if you’re on a real tight budget, there isn’t any strong competition to the SE2 for $150 or less. It’s still fully supported by Apple and will be until 2026 (plus a year of security updates). What’s holding it back, performance wise, is the tiny battery. If you’re okay with the old design and small screen. You won’t be disappointed.Entry-level iPhone. Period. It just works.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone unblocked",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Perfect conditions would buy again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The best👍🩷",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "Good condition🩷🩷🩷, I trust👍👍"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "the phone was literally perfect condition i thought it was brand new when opening it and setting up"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product exactly as described!",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "This refurbed phone is like new. Packaged well; came with apple cable, plus a sim-card pokey thing… No complaints!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works Fine",
      "date": "Reviewed in the United States on June 10, 2024",
      "body": "I wasn't sure how beat up a used and old cell phone would be, but this was in good shape.  Screen was without scratches, body was clean, no dents, etc.  It had a scratch protector in place that I didn't want, but it was easy to remove.  Not surprisingly, the battery was at 82% of it's original life.  I kinda expected that.  That's the life at which it is recommended that you replace the battery or get a new phone, so I suspect a lot of people turn in their still-functioning phones at that time.  Phone arrived a few days earlier than promised, which was nice.  I was able to transfer all my data easily from a previous backup.  But I couldn't get my e-sim card to active and make phone calls.  Took it to an ATT shop and they set it up for free.  I will probably try to replace the battery myself, but not without some trepidation.  I ruined my previous Iphone 6 when I tried to replace the battery.  I raised the right side of the phone after I had softened the glue sufficiently.  The phone was so hot from using a heat gun that I raced to open the phone.  Alas, I was supposed to raise the left side of the phone instead of the right, and broke some ribbon cables and ruining the phone.  Let's see what goes wrong next time!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Love this phone ordered  this for my son he’s only 7 . It came fast and with a charger the phone is in great shape and seem to be functioning well so far . This is a bday gift so we haven’t used it a lot but it came well packaged I was able to get phone activated with no issues far as it being locked . Great price and value I highly recommend!!!!  The brightness of the phone is excellent as well no scratches or anything . The Spider-Man outer box was ordered from Amazon as well. Hope this helps someone that’s skeptical I have 4 stars only because he hasn’t had it long but all apps are function correctly great camera the phone looks brand new",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good value for money",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "It works and for fills my needs"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good, but not great",
      "date": "Reviewed in the United States on October 3, 2024",
      "body": "The phone works fine, but the biggest issue I'm having is the charging port doesn't always work.  Often I will put the charging cable into the slot, but it doesn't charge.  I have to wiggle the cable around and find the right angle to get it to charge.  I have woken up a few times to find the phone did not charge during the night which was not awesome.  I also feel like the battery runs down faster than my previous phone which I bought brand new.  I will probably end up taking this to a repair shop and see if they can take a look at it.  Other than these two issues it works just fine.  Apple needs to make it bigger thought.  It is very small compared to other phones.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPhone SE",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Arrived the very next day that I ordered! Seems brand new to me! Love it!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cell phone",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "I like this cell phone it has a touchscreen the battery health was 82% it came with a screen protocter on I use the phone to watch borat every day"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price and good quality",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Very cheap and it works normally definitely should buy"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like New!",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Phone arrived in prestine condition like new! No scratches or dings anywhereBattery health was 95% which is greatSoftware was up to date and phone works extremely wellDefinitely worth the buy! 100% would recommend",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great little phone",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "The price was great. The phone works beautifully. It small and functional."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone se review",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Such a goof working phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely like new",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Excellent as new condition with all parts shipped nicely."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well for the price",
      "date": "Reviewed in the United States on December 31, 2024",
      "body": "Bought it 3 years ago, coming on 4 years. No notable performance issues. Regarding the battery, I'd charge it in the morning, go to work, and by the time I'm home, the battery is around 70%. I'd only use it during work to check the time, or during breaks to browse websites or play mobile games. I like the phone's size and the general ergonomics. 64 GB is good enough for 1 demanding game, 2 generally large games, or plentiful smaller games. It can store a good amount of photos, music, and videos assuming you either have cloud storage or some other external storage method.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Midrange Budget friendly IPhone SE (2nd Gen),128gb",
      "date": "Reviewed in the United States on July 5, 2024",
      "body": "At the moment, iPhone SE series has 3 iterations of this line: 1st generation (2016 release) , 2nd generation ( 2020 release) and 3rd generation (2022 release)One of our family member was looking for an economical iPhone with a similar price range as many Android devices.  The iPhone SE seemed to fit that category of midrange, semi budget friendly.  This 2nd generation iPhone SE was in the low $400 range, brand new.  Waited a few years for the price to drop as other new iPhones were released.  With the added bonus of ordering through Amazon renewed program, it further decreased the cost,  at least 50%+ of the original cost.iPhone 2nd Generation is effectively based on iPhone 8 design great for those looking to upgrade from iPhone 8 or older phones.Quality of the phone when received:  physically the phone looked in great condition, didn’t detect any scratches. Worked & functioned normally, good battery health, 89%,  fits the need of taking pictures & videos as well as internet access.In summary, a good value low cost and still decent quality phone for basic purposes.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wow",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I don’t care much about brand or the latest and greatest. All I wanted was to choose my carrier, use WhatsApp, and google maps. I would use a dumb phone if I could find one that still supports these things. But this checked my boxes at a fair price for a old model phone. Came with cord and charging block. The phone is in great condition and has no visible signs of use. The battery life is as to be expected for iPhone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Affordable to buy it",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "I used my husband's Amazon Prime to buy a phone for a friend a few weeks ago, and delivery was super fast. Unfortunately, she lost that phone, so I reordered it using my own Amazon account this time. The phone is perfect for basic use like answering calls, but the delivery was slower, likely due to Double 11 sales. Overall, it's an affordable option for anyone needing a simple phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was officially good",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Was good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looked like new",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "This phone looked brand new and worked great.  We also received it quickly.  Would definitely buy from this vendor again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great replacement",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Great product. Works great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Quality, I Would Recommend",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "This phone is a really a good purchase.  Especially if you're on a budget.  I would recommend.  Looked brand new."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Bought this phone for my son at a great price for a 2020 iphone. I payed 85 and although it was refurbished it looks brand new. No scratches whatsoever. No other signs of wear I would definitely recommend.  Only issue is that description said came with Charger wire it did not but when I messaged the seller I had it by the end of the week.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "As expected. Great directions. Great refurbished phone to replace teenagers broken phone. Works great."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    APPLE iPHONE SE (2nd GEN) WAS A GOOD BUY !!",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "PRO:  Came with \"renewed premium\" product grade, which we wanted.  We buy these phones because they are economical (can't afford brand new iPhones!).  This is our second such purchase (we upgraded from iPhone 8's) to SE (2nd gen) watches.  The watches we received look like they could be brand new, and the batteries in each are in very good condition.  We also did not want iPhones with black or red cases, which meant the white case (more popular?) took a little longer to get.  We also wanted the SE watch because they are the same size as the iPhone 8 so we could re-use the protective cases we already had.  Upgradable to Apple iOS 17.X.X.  And, they are compatible with Apple Watches model 8 and newer.CON:  The Apple iPhone SE (2nd Gen) has a black face when off (compared to the white face the iPhone 8 has).  This makes it necessary to get  used to finding the \"home\" button.  I solved that problem by putting a small piece of colored tape next to it.  They use 4G technology, not 5G.GENERAL COMMENTS:  For the most part, the iPhone SE-2 operation is like our iPhone 8's.  So, not much of a learning curve.  A couple of the displays that appear when in  use are different, but that is not an issue.  And a BIG PLUS for the two iPhone SE2's that I bought through Amazon is that Amazon will pay us a nice amount for our iPhone 8's when we clean them of all content  and return them as instructed on the Amazon web site.  Now, we have two watches that were sold in 2022 instead of 2 phones that were made in 2017.  One reason we bought these two watches is so we could use them along with our Apple Watches (Model 8's) which we also just bought.  When we carry our iPhones with us, then we can use our watches just as if the watches had the cellular feature some come with (ours didn't, by our choice).",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Seems to function well after a few days.  Battery life is very good.  Tapping home button is a little troublesome, but fingerprint works well.  Camera works as it should, and no signs of wear.  Happy for the price"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s fine not amazing packaging",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Would be 5 stars if it was nicer packaging but it’s fine the iPhone is good"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked Great! Expected better packaging",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "Worked perfectly. Would not be surprised if others received their product damaged. The item is in an oversized box with no protection."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price but not new",
      "date": "Reviewed in the United States on October 28, 2024",
      "body": "Finally cracked my screen so I decided to upgrade a few generations, great for the price point only complaint is it’s obviously not refurbished right out of factory it was used for a while. Battery came at 78% max health, and there’s some dust in the screws and tight parts of the phone, but no defects like scratches or dents that I saw.Especially for the price it’s great, just slightly worn"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good for the price",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "I bought this like 2 years ago, and it has lasted me since then. But the battery life started to suck recently, and it would die at 20%. But all phones die at some point. It fit in my pockets super easily."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery was not as described",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "LIKES: Delivered promptly and was easy to activate and transfer data quickly.  Everything seems to work well and appears to be in excellent condition.DISLIKES:  The listing stated, \"Tested battery health and guaranteed to have a minimum battery capacity of 80%\". After activating and charging to full charge, I checked the battery capacity and it was only 75%.  I don't know if this will be a problem, but one of the reasons I upgraded was because the battery seemed to lose its charge quicker than I thought it should.  My old phone showed a battery capacity of 72%, so I hope I won't still have the same problem.OVERALL:  I don't really want to send it back and try to get another one and go thru all the hassle, but I think they should start actually testing the batteries before they ship a phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed premium work pretty good",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "The phone came earlier than expected so that’s a good start. It was easy to make the Apple ID.  Since it’s a phone for my daughter. It has great volume for a small phone. The camera quality is clear, but it does have the shutter sound when you take a picture. I read online that this can be if the if it comes from another country where it’s illegal for your phone to not have a shutter sound. If you don’t know that that is, it’s when you take a picture and it does that fun noise that later can get annoying. On conclusion, the phone came scratch-free and very pretty."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "minor scratches very good camera quality and picture quality, brightness is high, freeze resistant is probably good, and there was little to no scratches or cracks"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "Item listed as renewed excellent condition. I would say its more of a renewed fair condition. Seller list phone with a 80% battery life or better. Phone came with 76% battery life. Scratches all around camera frame.  Paid $132 for a “renewed excellent” phone according to sellers description. If you buy this phone definitely plan on having to spend extra on getting the battery replaced. Other than that the phone works like it should."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE gen 2 -- plenty good enough",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "I am a big believer in using things as long as possible, so I was somewhat reluctant to replace my 6-year-old 1st gen iPhone SE (yes--I'm one of those), but more and more of my apps wouldn't update. I almost bought a new 3rd gen SE, but then I saw a used 2nd gen SE for under $140, and decided to save myself 300 bucks. I received it yesterday in like-new condition and I'm mostly pleased. The transfer process was fairly quick and easy using Bluetooth. I didn't realize how slow my old phone was until I used the new one, or how diminished its battery life had become. I will have to get used to a few differences in this model--no earphone jack, slightly bigger size in my pocket, different button location and feel--but I'm sure I'll adapt quickly. My one real complaint is that this used version had only 85% max battery capacity, so it'll probably need a new battery within a year. Considering the price, though, it's not that big of a deal.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came with no issues good quality!",
      "date": "Reviewed in the United States on December 16, 2024",
      "body": "Good quality phone for a renewed one!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Capacity",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "I was very lucky, my battery capacity was at 100. The phone seem to work well so far.  I price was ok, even though this phone has been our for over 5 years."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fantastic buy",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "I bought a device that was listed as being in excellent condition and they did not disappoint. There are no scratches, the battery charges to 100% and the battery health has it at 92% which is better than my newer model iPhone. My child loves it and so do I. Highly recommend!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    yess",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "bought for lil sis she loves"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent phone",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I bought this to use in the car to play music. I had tried a mp3 player and it didn't connect with the car. I have an iphone but I didn't want to eat up my phone's memory with all of the music I wanted to play in the car. So I am not using the phone as a phone but as an ipod but so far it works great. The phone looked brand new when it arrived and came with the needed cord to charge. I am very happy with the purchase.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "I ordered this for my self and this is my first iPhone it is in ok condition it has a couple scratches on the front and has no scratches on the back but scratches aren’t noticeable while using the phone but eveything works good except after I order this phone I looked at the maximum battery capacity and it was at 86% which is kinda bad so someone has used this phone for about 2-3 years based of of the maximum capacity of the battery but over all I would rate this phone “decent” and now after I use this phone for about a year the maximum capacity will drop way more leading to me to have to get the battery replaced",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "So far it has done everything I am so happy I had brought two from eBay neither work and I got refund but I do recommend this company to anyone I am to please that finally I found someone that wasn’t going to rip some off"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall Good phone",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "The phone was stated to be in excellent condition, but I think it should be good, as it had scratches and was a little dirty. The battery is at 87%. It runs well, and everything works fine."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished Iphone SE - can be a great option for keeping up with the latest OSes and the Jones",
      "date": "Reviewed in the United States on August 23, 2021",
      "body": "I've been using a 6s which I like the size and functions of.  I was pleased to hear Apple rolled out the SE 2020 (has a home button, same size exactly as 6S, doesn't have a phone jack though, but a $9 adapter can fix that).  This review is about the phone - good, fast, just like your 6s used to be, with a better camera (features that nice 'portrait' mode...and this review is about the seller, since a refurb phone will not always be exactly the same.  It's also a review of Amazon Refurbished phones.My seller BuySPRY was in the US, had  good customer service and made a return easy.  I bought one from them that looked perfect and was perfect - even had a screen protector! - but would drop calls.  The returns RMA process was pretty easy through Amazon and the device was covered under Amazon Refurbished 90 day warranty.  I was pleased with the phone, accessories (charger and wire) so I ended up buying a second refurbished phone from the same seller after returning the old one, after getting RMA authorization from them and removing my ID from the phone, as instructed.  The second refurb SE 2020 works perfectly and looks nearly perfect too - maybe actually looks perfect.  It didn't have a screen protector, but I had one applied locally and am happy (especially with the seller, since when something goes wrong you want a decent experience during the return).I would buy through Amazon Refurbished again, I would buy from this seller again and I would buy an Iphone SE 2020 again.  The Refurb price point at the time I bought was about $100 less than new (for the mid-range SE option.Tip:  You can keep your old 6s etc case if you simply take a hand held manual hole punch and carefully punch out enough room on your case for the SE 2020 flash and camera, which are not exactly where the 6s had them.  Your resulting case will not keep up with the Kardashians after your hole punching, but it will keep up with the Jones well enough.  Maybe if lost someone will return it to you instead of keeping it, thinking it an 'old phone' and taking pity.Tip Two: Though this phone like many new Apple Iphones (for water-resistance, as well as to sell wireless Apple Ear pods!) doesn't have a standard headphone jack, you can buy these for $5-10.  The Apple branded lighting to headphone adapter is probably the cheapest boxed thing Apple sells.  Good luck not misplacing it, though!",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I LOVE THIS PHONE",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "i got it for about $120 and everything has been great it even came with a screen protector and a charger",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Double Check That it Works!",
      "date": "Reviewed in the United States on May 5, 2023",
      "body": "Edited:I contacted the seller (Hybrid IT) and they were extremely responsive.  I confirmed that the phone did not work on arrival and started the refund process.  It took about a week after I shipped it for them to get it and the refund to be issued.  I purchased another phone from the same exact seller and this one had 100% battery life and worked perfectly.  Make sure you READ the email that the seller sends you because mine had return information on it. In order to get a guaranteed 100% refund, I needed to contact them within 48 hours of delivery to let them know the phone was DOA.  So check your phone ASAP.  It took setting up my phone fully to find the problems.Kudos to Hybrid IT for being easy to work with.  I am glad I did not purchase from the first seller that Amazon suggested, because it was a few dollars less but didn’t have the free Prime shipping/return.  It had free shipping but the seller had terrible reviews.  Hybrid IT had great reviews and was a great seller to work with.  Do your due diligence and check out the seller information!———————————————-Like many other reviewers, one of the phones I purchased did not work.  I am currently in the return process.  I bought mine through Amazon's prime link, and it has free returns.  The company I am working with is Hybrid IT.  Depending on how the return process goes, I may increase my rating for the phone.  My phone was not fully unlocked and the power button did not work consistently.  I am willing to give it another shot because it is a phone for a youth, so hopefully the return process is easy.",
      "helpfulVotes": 54
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Yessuh",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "My first iphone. I know its crazy to get this in 2024 but i just switched from samsung a15. Its good even tho the battery capacity at 76%."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall good condition, but battery capacity less than 80%",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "The phone in appearance is in very good condition with only a minor dent on bottom right corner.  As of now after just a couple days of use, everything seems to function as it should.  The one demerit I will give is that the \"Renewed\" designation states it should have at least an 80% max battery capacity, but the device I received only had a 77% max capacity when I first unboxed it and turned it on.  While that may only be a 3% difference, every percent matters when it comes to diminished battery life.  I will monitor how long it can stay at this level, if it causes any functionality issues, and how quickly it may decline further.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect condition!",
      "date": "Reviewed in the United States on December 30, 2024",
      "body": "I purchased 2 of these for my daughters for Christmas and just activated them on 12/25 (couple months after purchasing) and they work great! Had no issues activating with my carrier of choice, they were in perfect condition no scratches, dings etc. My only complaint is the chargers they don’t work well at all but we have plenty of chargers around the house and that has nothing to do with the phone quality or performance.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    #1 returned; replacement great",
      "date": "Reviewed in the United States on February 2, 2024",
      "body": "So, the first SE was delayed a couple weeks due to storms; OK with me. But when it finally arrived Apple immediately threw up a message that the battery condition was critically low and the battery should be replaced. Battery Maximum Capacity was only 79%. I deduct one star for this. Seller guarantees 80% minimum, so I sent it back and asked them to send me a replacement. Maybe it was 80% when they sent it?! I don't know. BTW all the phone exterior looked like new.The replacement SE also looks like new (and I am extremely picky---especially regarding screen condition.) I was really happy to see the Battery Maximum Capacity of this replacement at 93%(!) Way better than 79% you might agree.I have only one dedicated purpose for this SE and that is to run the Ecobee app to set their security system on and off. I mount this on the wall right next to my Ring keypad. Suits me fine: *2* security systems. (I was using an iPhone 7 but its screen is defective slightly, it's a lot slower and it's not compatible with Apple's newest software = too old.)Overall I am very happy with the replacement SE, which BTW arrived very fast.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, great price, needs to have IMEI number printed",
      "date": "Reviewed in the United States on June 18, 2024",
      "body": "This phone looked great, charged up great.  It hold a charge pretty well, for an older iphone.I did spend sometime talking to Amazon customer service because the phone did not come with an IMEI number printed anywhere on the box or the paperwork.  Our carrier, in order to determine if the phone was suitable needed this number. I was given a method to do that, by Amazon customer service but could not get the IMEI number.  The person that I spoke with from Amazon was amazing and  very helpful, and really tried to get me the IMEI number from the 3rd party seller.  I believe that never happened.From some of the reviews of this phone I was lead to believe that this phone came equipped with the eSim capability-- which was not so.I talked to my carrier who told me to swap the Sim from the old phone (Android) into the new iphone.  Cracked the Android's case and found the Sim card was too big and thick to fit into the iphone.  I then ordered a Sim card from my carrier--(3 days wait) . The Android (really old) phone would not download the Move to IOS app.  With the new sim, I got it going, and have manually repopulated the apps I was using.It is working great now. My thanks to all the  great efforts of Amazon customer service!My lesson learned: don't let your Android phone get too old.Maybe the 3rd Party seller lesson learned: include the IMEI number printed somewhere!",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AN HONEST REVIEW HERE - 4 Stars is the NEW 5 Stars",
      "date": "Reviewed in the United States on February 21, 2024",
      "body": "An honest, not bogus review here. This was a great purchase, and after seeing what my local pawn shop wanted for a used iPhone SE (much more than this Renewed one), I rolled the dice and ordered this phone. Overall this is a solid 9.5 out of 10, and if the battery was above 90% overall life I would give it a 10/10 as a renewed product (the battery was at 88-89% if memory serves correct.This a CLEAN phone with no scratches anywhere that I could see, and for the money I spent if the battery was at 100% and you told me this was a new old stock phone with a screen protector on it I would have believed you - it is that clean of a renewed phone (and NO this is not a paid review I would not waste your time here...)This runs iOS 17 just fine, and if you want a small (by today's standards) phone to run iOS, make calls, send texts, take a few photos and just have an easy simple phone in your pocket (that is still very powerful, can shoot 4k video and the red color looks fantastic) - look no further; order this renewed phone today.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen has issues and battery is below 80%",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "The screen looks to have some noticeable damage in the top left and the battery is at 75% max not the 80% it was supposed to have"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Renewed but works perfectly",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Ordered this phone for my son and have to say I am impressed at how well it works. You would never know that it was renewed. It works flawlessly. Extremely happy with my purchase."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No sim card!!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Good phone, but it didn't come with a SIM card :("
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed.....item not as expected",
      "date": "Reviewed in the United States on February 1, 2024",
      "body": "I ordered this Iphone after reading all the great reviews. It arrived pomptly. However upon opening up the box, I observed there was no charger although there was a charging cable and sim removal tool. The phone was dead and I used my husband's charger to charge it. I then observed a sticker at the back of the phone indicating that it had been checked in November 2023 and was described as good. The battery health was however 79%, less than what was expected. A further check of the battery health confirmed the info (photo 2). The phone itself was in good condition however.I contacted the seller and informed of the situation. I asked that the charger be sent which they agreed to do. To date I have not received same. I have also not been able to fully set up the phone and at this point am considering returning item. This is my first time purchasing a used phone. Maybe I am just unfortunate to receive one not as  good as others have. But I do admit to being surprised that an item with less than the initial mininum battery power of 80%, was sent to me.Under the circumstances I will not purchase another phone from this company.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jury is Out on Performance Issues - Refunded",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "Performance is an issue. I use my phone very little but I noticed my screen would open apps for no reason and texting was an issue. Sometimes OK but other times several things would open and then open again after closing making it impossible to text. Opening Amazon and searching was another problematic issue of screen jumping. First impression was great the SE is very clean and new looking with 92% battery. A replacement is on the way so I'll update this review after another try. It seems a few others had the problem and if it happens again I'll go a different route.Update: I was on my third customer service person and was given a full refund by Amazon. I wanted an exchange but that was not an option for some reason? I could not send the phone back without a replacement in order to transfer everything since I traded in my old iphone. Now I can get another and have a phone to transfer data. So beware if you trade up on these refurbs if there is an issue you'll need to buy another iphone first they do not do exchanges if you get a faulty one",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "Wasn't bad"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stellar.",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Zero scratches. Charges to 100%. Works very well for an SE. All apps we installed work great. We added to our existing AT&T family plan with no problem. This experience has exceeded my expectations. Absolutely will buy from this vendor again. Highly recommend."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functions as iPod touch - what I wanted!",
      "date": "Reviewed in the United States on November 2, 2023",
      "body": "I wanted an iPod touch that I could turn off wifi when I wanted, to reduce EMF around my body (and living and work space) - mostly to listen to audiobooks from Audible, also to play a few games during my commute. Sadly, Apple discontinued the iPods, and the only ones still available are reconditioned and more expensive than the original list price - crazy!! This unlocked iPhone is the ideal solution for me. It's an older model, cheaper than the iPod touch, and as long as I don't install a SIM card to use it as an actual phone, the EMF readings are virtually zero when wifi and bluetooth are off. So I can use a wired headset, listen to my audible books, and play whatever games I want that don't require being online without dousing myself with EMFs continually. EXACTLY what I was looking for. Of course, I'm sure it would make a great phone if I ever decide to use it that way, and get a SIM card for it. By way of comparison in terms of EMF emissions, trying to make my iPhone 13 safe... I shut off bluetooth, wifi and cell service, put it in airplane mode, and then power it off... it STILL emits a pulsing EMF spikes that my meter registers as in the dangerous zone. Wow. Literally the only way to stop a dangerous level of EMF radiation from my iPhone 13 (which of course has a sim card installed) is to put it into a faraday bag. Again, I know I'm repeating myself, but powering it down is not enough to stop dangerous spikes of EMFs from it. Only an EMF shield (faraday) bag works for that. So, now I isolate my phone unless I'm checking messages or making calls, and use this iPhone SE for my alarms and general all-around entertainment (music and books), and to load things on, I can temporarily enable wifi.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Had high expectations…",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "I had high expectations for this phone.. and I was not let down! For the price you get it at, you get a nice phone that’s fully unlocked with nothing wrong with it other than some parts not being truly apple (Like the phone battery in mine) But it lasts me a while so no complaint there. Love the color of the phone too.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Front Camera not working",
      "date": "Reviewed in the United States on October 23, 2024",
      "body": "Front camera shakes and blurred , tried all things from turning off live mode, restarting the phone  to cleaning camera lens but still did not work."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unreal condition!",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "WOW these guys are amazing, this phone is several years old but the screen and glass back (iPhone SE 2) are 99% perfect! 90% battery capacity, no water damage, verified all original parts, really next level seller and HIGHLY recommended! ⭐️⭐️⭐️⭐️⭐️",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Reliable",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "This is a good reliable cell phone as a back-up to my current IPhone."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "I ordered this for my self and this is my first iPhone it is in ok condition it has a couple scratches on the front and has no scratches on the back but scratches aren’t noticeable while using the phone but eveything works good except after I order this phone I looked at the maximum battery capacity and it was at 86% which is kinda bad so someone has used this phone for about 2-3 years based of of the maximum capacity of the battery but over all I would rate this phone “decent” and now after I use this phone for about a year the maximum capacity will drop way more leading to me to have to get the battery replaced",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen has issues and battery is below 80%",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "The screen looks to have some noticeable damage in the top left and the battery is at 75% max not the 80% it was supposed to have"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No sim card!!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Good phone, but it didn't come with a SIM card :("
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Jury is Out on Performance Issues - Refunded",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "Performance is an issue. I use my phone very little but I noticed my screen would open apps for no reason and texting was an issue. Sometimes OK but other times several things would open and then open again after closing making it impossible to text. Opening Amazon and searching was another problematic issue of screen jumping. First impression was great the SE is very clean and new looking with 92% battery. A replacement is on the way so I'll update this review after another try. It seems a few others had the problem and if it happens again I'll go a different route.Update: I was on my third customer service person and was given a full refund by Amazon. I wanted an exchange but that was not an option for some reason? I could not send the phone back without a replacement in order to transfer everything since I traded in my old iphone. Now I can get another and have a phone to transfer data. So beware if you trade up on these refurbs if there is an issue you'll need to buy another iphone first they do not do exchanges if you get a faulty one",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible battery issue so far",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Maximum Battery capability 74% ,hopeing they contact me to solve this issueor will be returning.does not last an hour using it"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Microphone Broke 2 weeks after return period",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "As stated, the microphone failed two weeks after the return period... Now I have to replace it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    After 3 months of Usage…",
      "date": "Reviewed in the United States on May 12, 2024",
      "body": "I bought this phone only 3 months ago (February 2024) and while the phone at first had absolutely no issues I’m now experiencing multiple issues with this phone that should not be happening within only 3 months of having the device.For example:• Auto capitalization is toggled “on” but still fails to capitalize words correctly. Autocorrect doesn’t work properly as-well which makes it harder and longer to type on anything.• Home button and device glitches and doesn’t show certain widgets on screen (they all go black colored and unusable).• fingerprint malfunctions and doesn’t scan properly no matter how many fingerprint restarts I make. It makes it very hard to get my passwords and opening my device.•Battery came degraded and obviously became more negative overtime. Dies within 3 hours of usage to this day.There are little to no amazing things about the phone anymore. Only positive feedback I have is that it still does work overall as a very cheap burner phone. It still can text and call, it still is functional besides some glitches and the camera still works properly. There still is appropriate space on the phone for photos and apps so I can’t complain too much. I am getting another phone soon to replace this one and this one will be my back up iPhone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    already giving me issues 3 days into owning it",
      "date": "Reviewed in the United States on November 30, 2022",
      "body": "NOTE: I purchased this as a \"renewed\" product by Amazon. I've mostly purchased renewed phones off of eBay, but I've burned before by waiting a week or two, giving a positive review, then the item crapping out on me soon after so I thought I'd give Amazon's refurbished product a try since you have 90 days of guaranteed satisfaction and you can always come back to edit your reviews.MY ISSUES THUS FAR (3 days into ownership): Essentially, the phone is *not* fully functional.1. I'm already dealing with multiple app crashes. I'd like to blame it on the app alone, but the last refurbished iphone SE (original) that I owned started doing this with a single app which progressed into multiple apps crashing on me. That phone has only lasted a few months. Now, I'm not entirely sure if this is a refurbished phone issue or an iphone SE issue, but I know that the new iphone SE I originally purchased directly from the store didn't do this to me until the end of it's lifespan.2. Rings are not reliably coming through which has already resulted in a couple of missed calls. I work from home so I cannot be missing these calls from my office. Sometimes it rings and sometimes it doesn't. I've checked all of my settings (even the silent mode), and I cannot figure out why only a portion of my incoming calls actually ring.THE POSITIVES: The refurbished guarantee has held true in some regard. I have 82% battery health (renewed guarantees 80% or more) and it does seem to retain it's charge very well. The cosmetic blemishes are at a minimum, and I would say that it is in excellent condition insofar as looks are concerned....I just cannot get past the fact that this phone already has software issues mere days into ownership. I may have to deduct another star and/or exchange this item for one that works properly.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BAD BATTERY",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "Many things to like about this \"renewed\" phone...shipped promptly, packaged well, unexpected extras included like charger, cable, SIM tray tool.Beyond that, it is cosmetically perfect with no visible flaws.HOWEVER, battery life is terrible and nowhere near the 80 or 90 percent promised minimum capacity.  The installed battery has experienced 980 full cycles as of this writing (which I would guess might equate to 60% or less capacity if Apple promises 80% at 500 cycles)  VERY DISAPPOINTING and suggestive of false advertising.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The device was really clean but make sure to check battery %",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Device was scratch free - the screen, back glass, frame, etc.Very impressive.The battery also said 100% battery life, but was actually 44.6%.I recommend downloading Coconut Battery on your Mac, plugging your phone in, and checking.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So so",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Phone in good condition. Battery charged to 96 % but drains fast.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple SE",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "Great packing and shipping speed.The phones look great.The ONLY issue is the battery life is less than 8 hours."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health",
      "date": "Reviewed in the United States on December 18, 2024",
      "body": "Product looked good. Battery health was barely ok sadly was expecting it to be the same percentage as the other phone I got of approximately the same quality on the same day. Bought two at the same time this particular place the battery dies quickly from them."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "It’s pretty good. Okay condition to be used. Corners are scratched up. Did come unlocked. The battery is trash. Came with 88%. Charge doesn’t last for long at all. Gone have to spend another $100 for a battery. Overall not bad."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hit or miss",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "We’ve purchased our family the same iPhone for everyone and we ended up returning two of them due to poor battery life and overheating. The phone gets so hot and then gets slow and shuts off even when it’s in the shade and 80 degrees. We love the streamlined use of apple products and the quality but it really comes down to luck. You can actually see the battery quality in settings from when it was brand new until now. Mine was 88% of what it was so I figured that’s fine. When it’s shipped it looks brand new and you get what you pay for. This is considered an older model but I love the extra storage at this price point. I actually prefer the smaller sized phone. The bigger newer ones feel wonky in my hand.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the money",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "It’s a good little phone, thou th battery sucks .. I wish I had know about this issue"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Battery",
      "date": "Reviewed in the United States on September 5, 2022",
      "body": "I received the phone in perfect condition and right on time. It basically looks brand new. Having upgraded from an iPhone 6s, I’ve enjoyed the quicker processor in the same body size. I do miss having the headphone jack, but I knew about that change and was prepared for it. Overall, I like the phone.However, after about six weeks of ownership, I now have a battery in the same condition as the one in my old 6S. It is in ‘significantly degraded’ condition and the phone will just suddenly power off randomly. I thought I would have at least 6 months before that became an issue. So now I am having the same issue with this phone that I had with my old 6S, and I guess I’m going to have to put more money into having the battery replaced. I could have done that with my 6s.One other note. The phone was delivered without signature requirement and left by the carrier outside my door. Thankfully I had that day off and was 10 minutes away when it was delivered, so I rushed home immediately when I got the delivery notification. Had I been working, it would have been outside of my apartment door all day and very possibly been stolen. Given the fact that my apartment complex had an Amazon hub, I was quite upset by this. I called Amazon and was told that this type of seller cannot access the Amazon hubs, but agreed a signature requirement should’ve been part of the delivery options. Had I known any of this, I would have chosen to have the package delivered to my workplace so it would’ve been safe. I’m very glad my near $200 investment didn’t disappear that day.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery sucks",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Took it to Europe for vacation and battery only lasts like 3 hours at most with constant use. I used gps and camera constantly and my  battery was killing me. It really sucked and stressed me out. Had a portable charger but even that wouldnt get me through a whole day.  Otherwise phone works fine."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    hmm",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "The battery capacity was at 74 percent. I think it’s okay for the price, but he most disappointing thing is that when I tried to apply a new screen protector, I discovered a pretty noticeable crack on the screen and they had covered them with a black bezeled cover glass film. I had wondered why they put it on, because it partially covered the screen and made it inconvenient to use. I’m just going to use it because I’m lazy, but I definitely wouldn’t call it excellent. Covering it up like that doesn’t feel honest, right?"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    intermittently works",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "This phone has a mind of its own. It works sometimes and sometimes not."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as described",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Battery was under specs compared to description"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good exterior condition, suspicious of software reset, battery degraded quickly",
      "date": "Reviewed in the United States on July 15, 2024",
      "body": "iPhone has correct color, storage capacity, model number, etc. as the item description. Exterior is free of damage and the screen is in good condition. Software did not seem fully reset: despite showing the iOS welcome screen when I received it there was a bookmarked webpage in the browser (Safari). I ran an additional factory reset after noticing this. The device arrived with an off-brand charger. Additionally the battery showed 92% of maximum capacity when it arrived, now after only 24 days of use the battery shows 74% of maximum capacity. It has been hot where I live but I use AC while driving and the phone has never displayed any kind of temperature warning. Additionally I am only charging with a brand-new Apple-brand 20W charger that I bought from a local Apple store so the rapid degradation of the battery seems worrisome to me."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awful battery life",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "I bought this used iPhone that was said to be in “excellent” condition but the battery goes from 100% to 30% in 3 hours with normal use. I reached out to the seller and never got a response. For these reasons I can’t recommend this buyer."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life and charging port issues",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "iPhone SE 2nd gen. Went with this company as they have a lot of good reviews and the price was inexpensive. When I received the phone, the phone looked good. Minor scratches etc. Plugged it in with the supplied charger, doesn’t work. Tried my cord from my other iPhone, it works if you wiggle it a little. That’s a sign of a loose/damaged charging port. Once It showed charged 100% I turned it on and checked battery health. 81%! When you see “refurbished” you expect it to be “like new” operating wise. Not to have a bad charging port and a failing battery! Disappointed"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Flickering the home screen",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I'm still examining this product critically because the upper portion of the home screen is glitching/flickering. I also discovered that after a full battery charge, this iPhone loses 20% more power than a new iPhone. So, I am not going to say it is an excellent product, but it is an OK product. I may have to return this item if I encounter any other problems."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Update: The phone was initially flawless, now it's malfunctioning & won't go pass the apple logo:(",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Wow, what can i say! From the phone not having a scratch, it also came with the screen protector already in tact and shockingly the battery life was 100%. Seller was quick with delivery (picked it up from lockers). Thanks for the phone!Update: I had a 5 star on this product, now I'm giving it a 3 star because initially the phone was awesome until it wasn't. The phone doesn't want to turn on at all, just staying at the apple logo sign then turning off and repeating over and over while on the charger but doesn't even go to the apple logo when it's not on the charger. You can see the issue i'm having in the video.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Received with marginal battery.",
      "date": "Reviewed in the United States on October 4, 2024",
      "body": "Battery was supposed to be greater than 80% but is 75% according to the phone.  I was far into the setup when I discovered this so I will keep this phone.  I will end up replacing the battery sooner than I should have had to.  Phone appears to work well other than that."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone locked/broke",
      "date": "Reviewed in the United States on September 27, 2024",
      "body": "I ordered 2. 1 for each my twin grandkids. 1 phone I set up and seems good. However the other phone arrived with other peoples stuff on it and the Home button doesn’t work. I was able to access, from screen, the settings (because again it had somebody else’s information already on it so I could swipe the screen I just couldn’t use the home button) So I was able to factory reset it but I can’t set up the phone because the home button does not work. I’m just very upset because these were a birthday present and they don’t offer to send me a new phone until they have the old phone back. This is just very upsetting. I will update. I sent it back for refund but ordered another one because the 1phone was excellent. But for a large seller to send a broke phone with others info and apps should never happen. I pray the new one I ordered from them is awesome… will see I will update stars when I get next phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as described",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Some knicks and lite scratching but dubbed excellent condition ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    it heats up and the battery was in service",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "i bought the excellent one and got the battery draining so quick and it came in service. couldnt even opt for applecare and it warms up every few mins so i can’t use it normally"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buyer Beware!",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "I bought this phone for my child and when I had it charging one day the cord the seller sent with it literally started to melt and burned my stomach! I still have a scar!! At the time I was leaving an DV situation and I wasn’t able to reach out right away to the seller. The battery also started depleting very fast, dying within a couple hours of using. I did get the upgraded version and wanted to exchange it. Unfortunately before I could do so it had gotten left in a place I am not safe to go back too. I tried contacting the seller over 6 weeks ago to see if it’s possible to arrange a pick up from where I left it or an exchange even though I could of ended up with more serious burns if I hadn’t caught what was happening sooner. My messages have gone ignored. I was disappointed by the lack of communication, some sort of response would have been better than none at all.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s nice could of been better a few scratches on back of glass back",
      "date": "Reviewed in the United States on May 2, 2024",
      "body": "I got a white se 2 256 gb back in feb I’ve been using this phone daily since and it has been great! Got it w 87 percent battery health it has a few scratches on back of glass and a small rock chip on the bottom of the glass other than that it’s good bought it on excellent condition option and got one w scratches and a tiny rock chip so I should of went for the good option instead of paying almost 50 extra bucks for a phone that’s not excellent condition but you get what you paid for it was 160 back in feb now in may 2024 it’s 180 for the same phone so I’ll buy again if this phone gets broken or I lose it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    One of two was a lemon",
      "date": "Reviewed in the United States on January 16, 2024",
      "body": "Got this refurbed phone 2 years ago for my teen. Haven’t had any problems. Fast forward and now my second teen is ready. Ordered the same phone/link and noticed it didn’t come with a screen protector like my first order (which was fine)…however after having it for 2 days I understand why. The bottom right portion of the screen/keyboard is temperamental and unresponsive.  I thought maybe it was just me and my long nails and that’s why some of the letters didn’t work. But after adding a screen protector it was very obvious that a portion of the screen was dead and couldn’t be tapped. Summary: I wasted hours of my life setting the dumb thing up, hooking it to a watch, etc.  And now have to send it back and try again. I think these refurb phones are great for kids. However test it all out before investing time in the setup process.  Because you might get a good one, or a dud.  Important to note my first order is going strong after 2 yrs with no problems.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great overall, but unoriginal battery inside",
      "date": "Reviewed in the United States on July 13, 2024",
      "body": "It really does look and feel like a brand new iPhone (I have a new iPhone as well so I compared every feature). My only complaint is about the battery. The phone came with 96% battery health, but barely a month in I get a warning about the battery being \"significantly degraded\". This doesn't happen with original Apple batteries until they drop below 80%. Whenever I decide to replace it with an original battery, it'll be another $100, which kinda defeats the purpose of getting it from Amazon vs the actual Apple Refurbished store."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good for the price",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "good for the price"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No available to be used in Mexico",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "After buying this phone we tried to us it in Mexico and we were told that the phone was blocked for this country. So far we couldn’t use it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I guess you get what you pay for.",
      "date": "Reviewed in the United States on August 13, 2024",
      "body": "This phone was a good price. However, there is some sort of sound issue. I have to put it on speaker to be able to hear a caller. Sound works fine for music & all other variants, but for me to hear a caller it has to be on speaker otherwise the sound is so faint I can not hear well enough to understand what is being said."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    buy this cell phone",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "Yesterday I bought this cell phone so far the only problem it has had is with the location it does not work for me otherwise it came in good condition with its charger no scratches we will see what happens with the useful life of the charge and I hope to solve it with the location soon and at the end seller, I arrived on time. I will be here soon to tell you how the cell phone is doing."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy at your own risk, pre owned is more expensive in the long run",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Keyboard issues after a month or so too late to teturn and needed the phone so i kept it. Had to get a new phone within the year due to this issue. Was impossible to type without the letters p k l n 🙄",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Might be ok",
      "date": "Reviewed in the United States on March 22, 2024",
      "body": "The phone arrived when expected.  Phone looked new.  Didn't see scratches etc.  Battery was at 70% when I took it out of the box.  It takes forever for it to charge.  Under settings/battery battery health and charging says service.  It says my battery health is significantly degraded.  Service options are available at $69 to replace the battery?  I hoped this would not happen.  I have set up the phone now, and that was a pain in itself for someone with little knowledge of the phone.  My old phone that was replaced was this good as far as battery.  It is a pain to be without a phone, so I am kind of stuck for now.  I will buy new next time.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery not great",
      "date": "Reviewed in the United States on June 14, 2024",
      "body": "Was excited to have the phone as I upgraded to 128 from 64 which made a big difference. After less than two months the battery is down to 80% and I cannot make it through a workday without recharging. Just finished a 10 day road trip and was fighting battery usage constantly. I would look elsewhere for a refurbished phone based purely on my experience with the battery. Phone itself is in good shape, no overt scratches. I’ve bought phones from these guys before and haven’t had this problem. Looks like I’m beyond the return date, so I’ll suck it up and see how long I can deal with this .",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Faulty Lightning Charger Port and Poor Battery",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "I purchased this phone to replace an iPhone SE that was stolen during my vacation in Mexico. Initially, it seemed to work fine, but within six months, the battery stopped holding a charge and would drain from 100% to zero in less than three hours.Additionally, the charging port is unreliable and only functions about 3% of the time. I've tried using official Apple cables, but they don't work well either. The phone often doesn't recognize the charger cable unless it's jiggled and bent in a specific way. I use magnetic chargers to charge it overnight, but they also work slowly and often stop charging, requiring me to reposition the phone multiple times.I do not recommend buying a \"Renewed\" iPhone from Amazon, as they do not properly refurbish the phones before selling them. These are poorly refurbished, used phones, and buyers should beware. This is the second time I've had a bad experience with an Amazon-renewed product, the other being another iPhone SE and a Kindle Paperwhite (Which was replaced). There seems to be a lack of quality control.I am uncomfortable purchasing used or renewed products from Amazon because there is no insurance or warranty to cover faulty components that may not be immediately evident. It's worth spending the extra money to buy directly from your phone carrier or Apple. Apple’s renewed phones from their official website come with better warranties and quality control than those from Amazon. .Now, I don't have a phone to use, and I had to get an iPhone 12 mini as a temporary replacement.The phone also does not come with a charger cable from Apple or official Apple stuff like AirPods or an authentic Apple box.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The sound doesn’t work",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "The phone looks new with no scratches or anything that the only reason I gave it two stars but the sound doesn’t work with out headphones and being that I brought it early for a Christmas presents I wasn’t able to return my daughter still uses the phone with all the other functions but what is a phone with no sound when your talking on it"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointed",
      "date": "Reviewed in the United States on April 30, 2024",
      "body": "I thought this was a good deal (iPhone SE 2nd Gen refurb for $165) until I received the phone. Cosmetically, it looked great. However, internally, it was something else. The battery went from 92% lifetime capacity to 90% in only a few days. Hybrid IT was nice about it and said I could get a refund, exchange, or take it to an Apple Store or Best Buy for a new battery and they would reimburse me. Not wanting to go without a phone for a week or two, I took it to Geek Squad at Best Buy. I had to wait nearly two weeks for an appointment, but that has nothing to do with my rating. They called the next day and said the phone didn’t have genuine Apple parts inside and if they broke during battery replacement, they would have to mail the phone to Apple for completion of the repair and I would be charged the whole cost of the unit. I thought, okay, I can handle the risk and I can understand not using genuine Apple parts, but then what if it broke? I didn’t know if the Amazon seller would cover that cost as well and thought I should contact them first. That’s when the Geek Squad tech says, there’s something else you should know. See attached image. The ribbon cable was taped to the underside of the screen. Cables in iPhones aren’t meant to be taped in place. They are more permanently secured by routing through channels using adhesives. So, in the refurbishment process someone cut a lot of corners using cheap parts, did shoddy work, and didn’t thoroughly test the unit. That was enough for me to say, nope, I want a refund. I will say customer service was great. I returned the phone and was refunded. The only reason I bought this was because it was guaranteed to have 90%+ battery capacity left. Most refurbs seem to be 70%-80%. Unfortunately, in this case, the battery was bad even though it displayed 90%+. So, this whole experience has soured me on buying refurbished iPhones from here on out. I gave up and bought the newest SE brand new instead.",
      "helpfulVotes": 24
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Problem with speaker",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "I bought this phone to use it internationally. The speaker was busted people couldn’t hear me on the other end. I had to take it to the repair shop and change the speaker. It cost 10 $ where I was. Since then no problems at all."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition but less than 80% battery and not iOS 16",
      "date": "Reviewed in the United States on September 2, 2024",
      "body": "I bought this specifically because the listing here says iOS 16 (was hoping for <16.6) but mine came to me with iOS 17.4.1. It's impossible to downgrade so that's pretty lame. Also the battery is at 78% health, not the minimum 80% stated here. Overall it's okay and most people don't jailbreak so the iOS version doesn't matter to them, however I'm not most people."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone runs hot all the time.",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "This phone gets very hot after a phone call or a few minutes or using an app.  I'm not saying it's warm, it's Hot.  For some reason I cannot add any social media.  I've been to the Apple store about it twice and they couldn't figure it out.  I just get a message that says to \"Please try again later.\""
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Probably the worst Amazon experience I have had to date. Unscrupulous seller, Item not as described",
      "date": "Reviewed in the United States on April 26, 2023",
      "body": "Got a refurbished excellent iphone. Through seller under Amazon renewed. Item gave me concerns but I tried to live with it. First issue corner was damaged. (note description said no visible defects at 12 inches) The damage presumably took out the OEM screen. Seller refurbished, but since the damaged area around the frame dents into the recess for the screen just the smallest amount, the screen is not fully seated and shifts/flexes slightly. Also had borderline battery. I saw listing said at least 80%, unit I got was 82% so just barely in spec. I set it up to test as the phone it was replacing had issues with signal/dropping calls. This one was ok, then started dropping then ok, seems antenna may be loose also (can happen when replacing a damaged screen.So I decided I want to do an exchange. Had a week or so left, so I put in the return/exchange. The delivery date of the replacement device was one day before I had to send in the original so I would have a chance to transfer settings. Seller pushed out the date and so I contacted and asked to extend the return and was quoted some fictitious policy that they had to have the original back first (leaving me without a phone and no option to transfer settings which is not acceptable) . I explained the need to have both to transfer and they again claimed some policy to receive the other first to avoid fraud (mind you Amazon has all my billing and if I didn't return the original would get stuck with and charged for both. So I escalated to Amazon and the seller canceled the return. I am probably going to have to get a phone from another seller and just return the original under Amazon A to Z if that works.  Seller is to be avoided.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple Se phone is bascially junk.",
      "date": "Reviewed in the United States on December 26, 2022",
      "body": "I think MobileSupply did a good job. The phone is junk mainly because it will charge sometimes and other times not. If you unplug the charging cord and replug it most of the time it will start charging. I have not used the phone. I got everything transferred but never activated the phone with my service. The screen is too small to see things very easily. I have worked with computers as a programmer for 30 years so my eyes are not as good as they use to be but it is still a small screen. I am still using the old Samsung phone I have had for years. It is an A71 model. If something happens to it I would have to run to Best Buy and buy a new one the apple phone is useless to me. I would never buy an apple phone again. They are more hype than anything. You cannot get all of the apps you can get with an android phone. I should return the phone but I hate returning things. If I don't then I will be out $171.  I guess I could use it to activate it in case something happens to the Samsung until I get a new Samsung from Best Buy."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not quite excellent condition",
      "date": "Reviewed in the United States on September 28, 2024",
      "body": "Bought this phone and everything works ok. However, the battery already needs to be replaced. To my mind excellent condition would mean the battery should be good for longer."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Batería",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "La batería estaba al 77%",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    batería por debajo del 80%",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "Saludos estimadosTendré que invertir en una batería ya que esa batería no tiene 80%, la batería esta por debajo y el teléfono no me dura mucho"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    5 month review, battery life and screen touch.",
      "date": "Reviewed in the United States on May 26, 2022",
      "body": "The phone is great but I been having issues with the battery life. My phone will be fully charged when I get up in the morning around 7am then by time I get to my work at 8am it’s already at 60% without me using it. I have to bring a portable with me all the time.The screen has some areas that won’t recognize I’m touching it. If I’m trying to send a text ad I try to hit send button it won’t recognize me touching it so I have to close out of the iMessage and do it again until it works. The areas that are having the problem are mainly the corners of the screen.Im also having issues with the service, idk if it’s my providers or the phones. When I had my old phone I could get service and data almost everywhere with no problem. Now with this phone the areas that I had no problem with getting service and data i have problems, it will say I have full bars and LTE but it will not be able to send messages or look up stuff on anything. At that point I turn off my phone to try to save the battery. And again idk if it’s the phone or my service provider",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charger is very chip and phone battery is drowning very fast",
      "date": "Reviewed in the United States on October 27, 2024",
      "body": "Don't want to buy again like this products"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Premium Renewed product failed, return easy",
      "date": "Reviewed in the United States on August 16, 2021",
      "body": "I did a lot of research and decided that with the 1-year guarantee, I would take a chance on a more affordable option for purchasing an iPhone SE. When I opened the box, I immediately noticed a pretty substantial scratch along the top part of the screen. I do not think it meets the criteria for \"no visible damage when held at arm's length\" but maybe my eyes are just good. I wasn't overly concerned about the scratch if the device worked great otherwise. I was impressed with the battery life, and the camera was pretty good, though it struggled in low light. The next issue I discovered was a poor bluetooth connection in my car. I cannot guarantee that it was an issue with the phone, but seeing as my previous iPhone 8 was crystal clear in my car, I assumed the new phone was the issue. At that point I had decided I would return the phone once I found a good deal on another phone. Fast forward to yesterday, (almost two months since my purchase) and the phone spontaneously died for no apparent reason. It was charged, I had been using it 30 minutes before, and suddenly when I went to use it, it was totally dead. It would not charge or respond to any of the combination of button holds to reset, etc. I got on a chat with a support rep, and he was very confused and very unhelpful. My main question was whether my personal information would be protected if the phone was able to be restarted after I returned it. I ended up talking to Apple support, and they were much more helpful in walking me through how to erase my phone even though it was dead. I then initiated my return, which was definitely very easy. It is not finalized yet, so I will update this review if I have any issue.All to say... I think Amazon Renewed is too much of a gamble to be worth the money you save. If you are willing to take the risk and deal with the hassle of returning and replacing a defective phone, then I can vouch for the ease of the return process. I ultimately decided to purchase a brand new device directly from Apple! Good luck, all.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality in all respects, but battery life",
      "date": "Reviewed in the United States on February 8, 2023",
      "body": "The product is essentially brand new in every manner except the battery life is poor. The battery did arrive with 92% total capacity. I believe that's meant to mean it's 92% as good as a brand new battery, but the discharge rate is much too fast for that to be true. This is with BlueTooth off and wireless on - my battery drains itself similar to the rate of the iPhone 6 I was replacing.It's a pain because that was one of the main reasons I wanted to replace the phone. I don't think the iOS battery efficiency measurement is a good indicator for how well a battery will perform because lithium ion batteries have some inescapable memory quirks that'll create a false floor for total charge capacity if the battery is repeatedly charged before being completely discharged.Anyway...like I said, the quality of the phone in all other respects is great, not a single blemish. Just be aware that battery percentages aren't going to give you a full picture of how it actually performs.Update: 3 days later, the phone's battery health indicator has dropped from 92% to 85%. This is with just two complete discharges. Normally, that kind of drop would take a year. Either they're deliberately skewing the battery health results so they appear higher on arrival or there's a serious flaw in their process. Do not purchase an Amazon refurbished phone if battery performance is on your mind, regardless of whatever capacities they claim. Minus 2 stars for that."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10 days into Purchase",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "I purchased 2 of these SE’s to replace two IPhone 7’s. I only gave these phones 3 stars because they already say the Battery Life is Seriously Degraded. I’m Having to charge the phones mid-day. The phones are working okay otherwise so far. I have purchased Refurbished previously and never had this battery issue within 10 days of receipt. I will now have to take these phones to have the batteries replaced. I would have been happy to pay more and received a better batteries."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overheating!!",
      "date": "Reviewed in the United States on June 1, 2024",
      "body": "From the second that I turned the phone on, it was overheating. I finished setting it up and got the alert that the battery in the phone is an unknown part, now this isn’t really a problem but it raises concerns like if the phone is overheating just from being turned on then what could happen through extensive use?I’ll update my review after a bit of use but everything else seems to be fine",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A bit sensitive",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "Currently using but it’s sensitive to touch wow, using the phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To buy the item brand new",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "I disliked that I bought the phone refurbished and the 1st owner never signed out of her Apple ID so I can’t create mine until she logs out of it that’s what Apple told me and I spent my money",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Health not as described",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "The phone is in working order, but it did show up with deep scratches along all sides of the body and the battery health is lower than stated in the product description.  76 instead of the 80 percent minimum."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It came with 76% battery capacity",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "Do not recommend “renewed” if not sold by Amazon. A previous experience sold by Amazon was great. This time I got a “renewed” phone with only 76% battery capacity sold by a different seller through Amazon. Disappointing."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not original battery",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "Battery is not an Apple Original. So a permanent alert is always telling you to change the battery.I hate this, so now I have to pay extra to go and get the battery replaced.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    all good !! except for ..",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "condition of iphone was very good, and all systems worked fine ,excepting audio volume of caller on handset and bluetooth .. audio volume on speaker and wired headset were also fine .."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT PURCHASE FROM THIS SELLER!",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I purchased this phone as a back up for when my phone quit working. It sat in the box for 3-4 months. When I finally went to activate it, I found that the right edge of the screen did not work, therefor none of the buttons would work. The phone was defective and useless. I immediately contacted the seller who did not care at all because it was a little bit outside the return period. While I understand the return period had closed, you would think the fact the phone was defective, they would stand behind their products and provide good customer service. So buyer beware, there’s a good chance you’ll get a defective phone and they won’t help you and you’ll have wasted your money. DO NOT PURCHASE FROM THIS SELLER!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "I bought the excellent one hoping for good battery life which was supposed to be a minimum of 80% the phone came in the battery life is 77%"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked for a month and gave up",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "This phone seemed like such a good deal- 80% battery life but otherwise good! However the more I used it the more I understood why the pre ious owner gave it up. It was glitchy, insensitive to touch, and the screen randomly stopped working one afternoon. Definitely wasn’t worth the hassle"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was not unlocked! still tied to a carrier network, about a week of wasted time",
      "date": "Reviewed in the United States on July 18, 2022",
      "body": "I’ve given 3 stars because the phone itself was in terrific shape everything transferred great it’s just when I finally try to make a call and give me some weird Apple network message - The device itself was in great shape only slight scratching around the camera edge - I would’ve just live with that if it hadn’t STILL been attached to an Apple network! It says unlocked on the packaging and in the system itself however as you see by the picture it is still attached to an Apple phone plan- I transfer all my information from my old phone to it and I could use the Wi-Fi but the carrier network would not let me use my carrier because it was still attached to Apple so it’s ‘not unlocked’ when it was promised to be “unlocked” as advertised. I need a phone that’s not on the network that’s unlocked completely so that I can add my SIM that works!  I’ve been doing this the same way for years it shouldn’t have caused a problem. Thanks for the return and I will be buying another one soon as I’m refunded- hopefully this time you’ll get it right. Cheers!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Batteries are seriously worn down",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "Second used iPhone SE I've purchased for my children.  My third child received my own hand-me-down SE that I originally bought new, years ago.  It has no battery problems and keeps a charge fine.  The two refurbished SEs I purchased have batteries that run down rapidly - they cannot maintain a charge through the school day, even if charged to 100% overnight.  I've adjusted all the settings to try to fix.  I don't know where these phones were sourced, or what kind of hard use may have caused the batteries to wear down, but just be aware that a phone that discharges even without use over 4 hours is not much good."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery life and battery health",
      "date": "Reviewed in the United States on November 27, 2022",
      "body": "*** 5 Month Update ***When the phone arrived, it was in great physical condition. There were not any scratches on the screen or the back. However, the major concern I had was that the battery was at 88% health. I did not think too much of this as 88% seems decent. But as I continued using the phone, the battery health decreased significantly and now at 5 months later, it’s at 79% health. I can hardly use the phone for a whole day without it dying on me. I need to have battery saver on all day or plug it in in the afternoon to charge. This is not to mention the charging port which starting malfunctioning a few months into using the phone. It can be frustrating because I’ll plug in my phone only to find that it hasn’t charged.If I were to choose again, I would not buy this phone, I would rather save up a little more and go for a phone with a larger capacity battery.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not premium quality.",
      "date": "Reviewed in the United States on September 2, 2024",
      "body": "Would have kept it if the battery was above 90% as advertised…but it was only at 85. Also, Touch ID didn’t work."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Sucks. Shouldn't be Sold Like This.",
      "date": "Reviewed in the United States on February 28, 2024",
      "body": "Leave my house at one, and by 4 o'clock the battery dies on my walk.  Bought it for traveling. What I'm supposed to do, carry around a heavy – ass battery pack everywhere? 82% capacity, barely above the threshold that allows them to sell it. If I didn't already go through all the hassle setting it up, I'd return the piece of you know what. Take a gamble and buy one if you want, LE is supposed to be better than the iPhone 8 that I replaced Regarding battery life. . This one is actually worse.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks OK so far",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "iPhone SE 2020 is battery is getting a little warm - I will watch closely.Thank You."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone came with 75% remaining battery life",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "The phone states 75% remaining battery health, not the promised 80%. Easier to just live with it than reset it and ship back. Not thrilled."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice but battery not as advertised",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "UPDATE- Returned, could not live with the degraded battery.  Advertised 80% minimum battery health but phone says only 78%. Started to seek refund but figured too much trouble for 2% deficiency but definitely irritating. Phone has one small corner nick but the rest looks good. SIM arrives soon and will decide then if I keep or return it. Accurate advertising is a must!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lower portion of screen presents intermittent malfunction",
      "date": "Reviewed in the United States on May 3, 2024",
      "body": "I was total aware it was a refurbished device but I was expecting it worked perfectly, other than small scraps, lack of original box, etc, typical of a used device. But the lower right corner of the screen presents malfunction and touchscreen works intermittently in that corner (right where are located some app’s critical functions like “send” button in WhatsApp, etc."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got Ripped Off",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Bought this to replace my old phone that had a small chip on the screen and a degraded battery.After I set up the phone the bottom center of the screen has bright spots in it that never go away, and after about an hour of use noticed the battery dropped to 50%. Went to the battery section in settings and it’s telling me to find an Apple provider that my battery is degraded.So, I bought a “refurbished” phone to replace my phone due to it needing a screen and a battery, and I now have a phone that needs a screen and battery.I’m extremely unhappy with this purchase."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "First phone didn’t work properly, seller has sent a new replacement."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was not working properly",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "I disliked this product because The phone volume was too low and I couldn’t hear it when it rung. The silent mode kept turning on by itself and my phone wasn’t ringing and going straight to the voice mail."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condition maybe slightly exaggerated.",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "Was advertised as refurbished-good. Phone does work good and has decent remaining battery health. Very small crack in corner of front glass and a little larger crack in back glass. Was thinking good condition would not have cracks but otherwise happy."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works Great But Went Down Hill Quick",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "Phone arrived with screen not fully meshed on both sides at the bottom. From there the phone screen began to crack in so many different places. I cant even return this product now. The seller did text me when I initially submitted a review early July mentioning why would I not contact them before submitting a negative review and to reply back to the text so he can assist me. When I did I never heard from them. I looked and they even took my review down. What I will say is the phone works great but the screen is important also because it protects the phone. Needless to say I cant return this due to the many cracks through the phone which I believe is due to the screen not being properly installed ."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth it",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "I bought the phone for my 9 year old to play games on. It worked for one day and then screen just stop responding. I was going to return it but my son was upset because he just got it for his birthday. So I dropped it off to get screen repaired and was out 75.00 on screen replacement."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not great, battery expanded and broke the phone.",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "Ok, so the fact that it's an iPhone is great. The fact that it only has 80% battery becomes a problem. Not just battery life, but that the battery itself is near end of life. Basically, get it switched out before it pushes the screen right of the phone. ie - you should consider doing this immediately!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Impressed",
      "date": "Reviewed in the United States on October 3, 2022",
      "body": "Took it out of the package about an hour ago and I was initially impressed.  Then when I went to charge it, I noticed the bottom side is banged up pretty bad and most of the speaker holes are significantly clogged up with dirt.  Why wouldn’t these be cleaned during a refurbish?The charge port also has plenty of dirt in it and looks in worse condition than the charge port on my six year old IPhone 6s.  It’s not only dirty, but I’m questioning if it might fail to charge/connect in the future.Then I noticed the Battery Health says “Service” with a maximum capacity of 78%.  My six year old 6S with the original battery currently shows a maximum capacity of 77%.I understand it’s refurbished, but my concerns are more than just cosmetic.  This refurb was supposed to be “excellent” condition.  I am leaning towards returning it.  Maybe I just had bad luck with a specific seller contracted by Amazon.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "While the phone seems in excellent shape, physically,  I'm disappointed with the battery capacity at only 79%. (Supposedly guaranteed to at least 80 percent)  Apple dropped a message saying \"battery is significantly degraded and should be replaced \". A trip to the Apple store and an additional $70 plus bucks is required.  Additionally T-mobile dropped a message that the phone is functionally limited and will only perform limited activities. New to iPhone, so not sure what all that means.Think I'll return it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad Microphone",
      "date": "Reviewed in the United States on June 27, 2024",
      "body": "The iphone SE I received is in good condition overall but the microphone works so poorly that I can't be heard when I make phone calls.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works for about 90 days",
      "date": "Reviewed in the United States on July 11, 2024",
      "body": "Device started showing defects as soon as the return window expired. Expect a product that works for about 90 days and then you're on your own.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "Im sorry this phone wasn’t the battery life I expected to get. I decided to repair the port on my old phone and keep it. Thanks",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not “Good condition”",
      "date": "Reviewed in the United States on April 7, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I bought this phone in “good condition” but this isn’t good. It’s poor. The camera is broken and makes a weird noise and shakes like crazy when I turn it on. Also it came with a ton of dents and scratches and the speakers have seen better days. The package it came in looked beat up too so keep that in mind.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in new condition.",
      "date": "Reviewed in the United States on December 10, 2023",
      "body": "The phone was advertised as \"new condition\". There were scratches on the display and the battery was at 81% capacity. Apple recommends replacing the battery at 80%. They offered a full refund return, but I needed a phone right away, so I accepted a refund of the price difference between this and an \"acceptable condition\" item (about $31). Within a few weeks the battery was down to 74% and mobile hotspot wasn't working very well. I had to take the time to go to an apple store and pay $59 for a new battery. I like the phone, but wouldn't buy refurbished again.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Honest Review",
      "date": "Reviewed in the United States on July 20, 2024",
      "body": "I've been having problems with this phone and it's been less than a year of owning it. The battery life has been a problem.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life wasn’t good",
      "date": "Reviewed in the United States on June 4, 2024",
      "body": "I need to charge it several times a day. It was a present for my sister who lives out of the country so I don’t have a chance to return it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quick",
      "date": "Reviewed in the United States on July 4, 2024",
      "body": "These phones are cheap in price. Basically, they are a throwaway phone for me. However, the batteries do not last long at all.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I’d go with a newer model",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "Mine arrived a little chipped on the edges and the keyboard function is slow af, it’s like every key is a sticky one it’s slowing me down so much"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not considered good quality",
      "date": "Reviewed in the United States on February 6, 2024",
      "body": "When I bought it, I chose used renewed good. The scratches on this screen are too obvious and they are on the screen, not to the phone film. There are no problems in other aspects, but due to USPS delivery, the phone was delayed and was shown to be returned to the seller for re-shipment. To be honest it's a bit of a waste of time, USPS's delivery service can have problems even if they deliver in the same area.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but speakers are blown.",
      "date": "Reviewed in the United States on December 21, 2023",
      "body": "The phone came with %96 battery health.The phone works will but the speakers on top are blown. You cant really hear people while on the phone with them. Quality control must have missed it.Also the speaker was dirty and haven’t been clean good. There are some places on the phone where dirt and nasty stuff hasn’t been clean.For premium renewal I expect better.I thought I would keep it but I watch a lot of YouTube and the sound quality is horrible because of the blown speakers. So I am returning it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Completely died",
      "date": "Reviewed in the United States on March 8, 2024",
      "body": "At first we were so impressed, looked brand new, and then, within a week the phone just completely died. Wouldn't charge, wouldn't turn on no matter what. And then contacted amazon & the 'seller' & got the total run around. At least they said we will get refunded, but I got so many different answers in how to deal with this. At first amazon said it's a 3rd party seller and a replacement isn't available, so I should just go the return &refund route. But then the seller asked me to send pictures of proof of the issue which is just silly when it won't turn on. Then they said just contact amazon and they will replace it. Mind you while I checked if it was out of stock since they said they couldn't replace and low and behold it's still in stock and available for purchase. Long story short, I know it is refurbished, but it still costs a pretty penny. At least a refund will be coming. But the run around was crazy. Oh! And I spoke with amazon again today about it and they said I should've just gone through them first and it would've been replaced faster, but I did and here we are. Super sad because it was a birthday gift for child & she needs to have it for emergency issues just in case. Now God knows how long it's going to take for them to issue the refund. Still waiting for a refund the was returned on the 12th of February.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Needs battery",
      "date": "Reviewed in the United States on August 3, 2024",
      "body": "Phone seems ok  … I don’t appreciate the battery needing service and under 70% capacity and claiming is renewed."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Completely unsuccessful purchase",
      "date": "Reviewed in the United States on November 11, 2022",
      "body": "Let me start by saying that I not only wanted this to work, I NEEDED this to work. A new phone was out of my budget so I bought this phone and the iPhone XR refurbished by Amazon.They showed up and looked great. The SE looked brand new, it was packaged beautifully.  It had a battery life of 85%. Ok, decent start. Over the first day I started trying to set up the phone, but it was so difficult. I kept giving up and walking away. It was so frustrating. Majority of the touchscreen was unresponsive and it was so slow. I figured maybe I'm spoiled from my last, incredibly fast android. But the more I used it I wanted to just throw it.After hours of attempting to set a password, i got locked out because my four pin code didn't work. It had 2 numbers in it that would not respond no matter what I did. My child figured out a way to put his finger just so and got it through, but everything I tried to do on the phone took painfully long and many spots just didn't work on the screen.It went back. The 2 XRs I tried from here went back as well. The first ear piece didn't work, only speaker. Battery was 80%. The second came and looked amazing, had 90% battery life, but the screen died at the start of the second week of owning it.I wish I could even explain the hassle this has been. I wish I could say it was a fluke. But this is the third Amazon refurbished device in a row.Please save yourself the headache. Stay far away.",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    La batería no dura nada!!!",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "El teléfono en si se ve muy bien.  Funciona bien pero la batería no sirve. Se descarga rapidisimo"
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone SE 2nd Generation, US Version, 64GB, Black - Unlocked (Renewed)",
    "asin": "B088NQXD8T",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).",
      "Tested for battery health and guaranteed to have a minimum battery capacity of 80%.",
      "Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.",
      "The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable.",
      "Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length."
    ],
    "boughtCount": "2K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$97.95",
    "url": "/gp/offer-listing/B088NQXD8T/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B088NQXD8T",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone and Charging Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$106.45",
    "listPrice": "$156.86$156.86",
    "savingsPercentage": "-32%",
    "standardDeliveryDate": "March 21 - 24",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}