{
  "asin": "B08PP5MSVB",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Refurbished iPhone!",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Great renewed phone! I got this phone when it told me it was coming in, when I received the phone it had minimal scratches on the chassis and a slight scuff on the bottom right which is no problem for me as I use a case. The screen was in almost perfect condition I see little to no scratches and no cracks or anything. It is also the original screen, the battery is great I got mine with 79% which isn’t great but it lasts me the whole day and more which is more than enough. If you don’t know which color to get the blue is great I love this blue, also the cameras are amazing especially at night. It came with a power cord which works, but the power brick it came with doesn’t work which isn’t the end of the world for me as I have others. In the end I say that this phone refurbished is great and I would definitely recommend.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Product and Service",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "I usually don’t leave reviews. I also have never purchased a refurbished item and was super wary on doing so. When the phone arrived, I was impressed that it truly was in excellent condition as stated. No scratches nowhere and the battery life is incredible. My old phone I’d have to keep it plugged in because it would die within an hour after using it. I went almost the ENTIRE day with Spotify playing in the background while I worked and my battery life remained strong and full where I didn’t need to plug in my phone for a recharge. Incredible!! I’m over the moon with happiness over this phone.When I received my phone and my husband helped me set it up, I couldn’t get it to accept calls and SOS remained on. It was showing it wasn’t compatible with my carrier so I reached out to the seller and received a response immediately. He helped me look into it and it turns out I inputted an incorrect number into the compatibility section on the website of my carrier. The seller walked me through next steps and told me to connect with my carrier. We did so and got everything taken care of. The seller had even said to let him know how it goes. He went ABOVE and BEYOND what I’d anticipated I’d get as a response. Truly remarkable service. We have more phones to buy for my family (my husband & our teenage kids). My in laws plan to do the same and but refurbished. We will only go through this seller because I trust him and trust I get what is listed as far as the condition goes. I also trust that if there’s an issue he will make it rightThe phone was unlocked as well as stated in the description.Overall - This was a great experience and I received the quality phone as described.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value for the price",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "I needed a quick, reliable phone to replace my XR. The product arrived in good condition, some minor scratches on the edges, but nothing unexpected. The screen looks great, the back is decent, and the charging works well. The battery seems average; I haven't used it enough to fully assess, but it went from 97% to 90% overnight. Functionality is solid, the camera is excellent, and the shipping was fast, it arrived earlier than expected.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value for a Like-New iPhone!",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "I recently purchased the renewed Apple iPhone 12, 128GB, Black, and I am thoroughly impressed with the quality and performance of this device.  First off, the phone arrived in pristine condition with no visible scratches or marks—it truly looks and feels brand-new. The packaging was secure, and all accessories included were functional and clean. Setting up the phone was a breeze, and it worked perfectly with my carrier, thanks to it being fully unlocked.  Performance-wise, the iPhone 12 is as fast and reliable as expected. Apps run smoothly, the camera quality is stunning, and the battery life is impressive for a renewed device. The 128GB storage is more than enough for my apps, photos, and videos.  This purchase offers excellent value for anyone looking to upgrade without paying the full price for a new model. I highly recommend this renewed iPhone to anyone wanting quality, reliability, and savings in one package!",
      "helpfulVotes": 28
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone.",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "The phone I received is in great condition, hardly a mark on it. I was worried about that, because it's like a roll of the dice not seeing the actual item you are purchasing. The battery life is at 86%, which is okay with me, I am used to that, I dealt with that with my older phone. So overall, I am very pleased with this seller. It was totally worth it for me.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth every penny :)",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "This phone is nearly perfect! No scratches or cracks, came with a charger but no brick for it, and super easy to set up! Came in shiny and looks brand new. The battery life is even at 100% which I know some people in the reviews say otherwise. I would highly recommend getting one from amazon because i think it’s worth it.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Generic battery, ended up needing to replace faceplate within 2 months",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I bought my iPhone 12 here in about Oct 15 2024. Then on December 14, almost exactly 2 months later, the audio on the phone app stopped working.  Suddenly I was like a mime with a phone.  If I did a video call, I'd have to perform interpretive dance.I'm a pretty fair tech geek.  After running complete diagnostics at home and at the Apple store, both on the software and hardware, it turned out to be a $250 hardware problem. This was most likely because when the the vendor swapped in a new (non-Apple) battery, they did not seat it correctly.To be fair, iPhone 12's are also known for having phone audio problems (muting audio weirdly.)  But after extensive diagnostics, as I said, it did turn out to be a hardware problem.  It seems to me that a refurbished phone should work longer than 2 months.  And usually, they do. Just not this one.Now, maybe I could have gone to the trouble of returning and replacing this phone, But even if they let me do that, who among us can be phone-less for a week?  Even if you bought the insurance coverage, you'd still be out the phone for that long.  Normally, I don't mind unplugging on nights or weekends, but I need my phone for work.  So, I paid the $250 to Apple to fix it in a couple of hours.You do you, but honestly, until the vendor addresses that problem, I would steer clear, especially if it's an iPhone 12. Good luck, and may the odds be ever in your favor.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone but plenty of food for thought!",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "It appeared to be in decent condition.  One small scratch on the screen and a chip of black off the side.  I paid the price for the phone to be in excellent condition and to me it didn’t justify that.  The frustrating part was the packaging, no iPhone box at all and no power plug.  The most frustrating past was that the phone was restored to factory settings which I expected, but the phone was in accessibility mode when I first booted up.  I did a little research to correct that being none of the on screen menus were responding.  Any regular person would have returned the phone.  Just giving my honest opinion in hopes that they can improve on the quality and starting condition of the phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality, and customer service!",
      "date": "Reviewed in the United States on February 10, 2024",
      "body": "For starters; the price on these phones is great. Between having the reassurance of Amazon buyer protection, and the benefit of knowing the device has been tested for performance, it’s well worth it.I needed a new phone fast after my cat knocked mine  into the sink ☹️ Rice fixed it for a while, but it was only temporary before it died altogether.I hate buying phones and avoid it whenever possible. 99% of mine belonged to someone in my family first. And i was good with that. Needless to say, my cat didn’t wait for someone in my family to upgrade. I was on my own this time.Okay.... that’s not entirely true. My grandma had an iPhone 7 sitting around so that held me over in the meantime. Going from an iPhone 11 Pro Max to an iPhone 7 was….bad. It was too dam small, in every possible way.  32 gigs of memory!! I needed an upgrade. Fast. My 11 year old was bullying me relentlessly. And that’s on me. They had my old XR (formerly my dad’s)I scoured FB marketplace. I’d decided upgrade a little, so I could feel better about the switch.  I didn’t want to feel backed me into a corner by my cat’s recklessness. I would get a slightly newer model in a fun colour.Marketplace had plenty.  Sending message after message from my iPhone 7, I worried. “This person seems too eager”, “this one has been posted so long”, “I want a purple, but the only purple one listed has less storage space” and “the pretty green one has a small crack”, “this guy lives 2 hours from me” and “Battery life? Errr last time I checked it was like 74%?….no, I can’t take a screenshot of it, it’s turned off”…. “cash only please” Etc.So much pressure. What happens if the thing doesn’t work? That’s $300+ down the drain. I knew I couldn’t afford new. But I hated the idea of buying something used from a stranger on Facebook. I didn’t want to get scammed, and I also didn’t want to settle.That’s when I remembered good ol’ Amazon. Maybe I’d check there. Just for funsies. Probably out of my budget, but it couldn’t hurt.Sure enough, refurbished devices selling “like new!” Mostly same cost or less than what I’d found so far. Surely there was a catch? I read through everything, tested by Amazon, includes all the specs, unlocked, I can pick the colour, the storage size, the condition, etc. AND I could have it delivered to me tomorrow??! With a warranty?!!I recovered from my brief stint of disappointment after learning the 12’s don’t come in yellow. Then fought hard to decide between mint and lavender. The lavender would take an extra day to arrive. Mint it was!! As promised, it arrived the next day. It was in beautiful shape. 128g’s, mint green, not a single scratch, 86% battery life. All for less than I would have paid to some stranger for a 64g with some “small scratches”Once my case and screen protector arrived I excitedly set it up and synced my data.Oh no.The FACE ID DIDNT WORK 😭After becoming used to facial recognition, having that yanked away, and dealing with a 7 for over 2 weeks—  I was desperate for the convenience of Face ID. I had been using my fingerprint. Like a *caveman*.Not to mention I have Blink 182 tickets, and it specifically states facial recognition is required to access the mobile tickets. Idk if that’s true, but I needed Face ID!!I googled, I contacted apple support. Fixing it could be upwards of $300. That’s almost what I paid for the whole phone!!I realllllly didn’t want to be stuck without a phone again. But I also wanted one fully functioning.So I reached out to Amazon support and explained. The rep was incredibly helpful (as most Amazon reps are) and after bts failed, she advised the ship was a 3rd party seller, and she  send a message to them. “If they don’t fix it by (insert date) contact us back and we’ll make this right” she encouraged.I’m ngl. I was nervous. I didn’t have high hopes, having dealt with 3p sellers on Amazon in the past. At least Amazon had my back, ig. The concert wasn’t till July. Even without facial recognition, it was loads better than the  7. I could make do in the meantime.The seller came in clutch though, and my worry was unwarranted. They responded within minutes. They were receptive, apologetic, and more than willing to help.As I’d anticipated, they offered a refund or exchange, as soon as they received the return. I explained my concern with not having a phone for several days or more; and the merchant offered to overnight a replacement as soon as the return was dropped off.I could deal with one day without a phone! I gratefully accepted. That was Saturday night, we made plans to catch up Monday for the return instructions and for them to overnight it.Monday I reached back out; and they were ready to ship, BUT they *had no more green….* 🫢 SHOCK“…do you have purple”No. :( just blue, white, and black.THIS WAS A HUGE BUMMER.It’s silly I know, and the definition of *first world problems “.. but I mean…. My change of heart about this whole phone thing HINGED ON THE FUN COLOUR. Without it, I was just a person…out $350… because my cat was thirsty while I was watching YouTube while washing dishes. I needed a cool colour. Plus,  I’d already gotten the matching case! Clear with mint green borders.It wasn’t even a fun blue… it was a dark, serious, navy blue. It was pretty and classy, but I wanted something fun. I even asked if he had any older models in yellow 😭😭 no luck,They told me they’d be restocking in a day or so. Still, no greens or purples came in.Ugh. Reality was setting in. I was going to have to settle. It was fine, I thought. At least it would be a fully functioning phone.No. I wasn’t ready to let go. They assured me I could take my time to decide, and I asked if we could wait another week in case one came in. If it didn’t, *then* I would choose from the options available.I messaged them Wednesday afternoon, bracing myself for the answer…. THEY GOT IN PURPLE! YAY.They sent a label, I dropped it off, sent a photo, and had my new phone the next morning.they’d said overnight shipping… but wow! I’d dropped off the return around 3pm, and had the replacement by noon the next day. I didn’t even have my new case yet 😅Despite the Barney-Esque colour scheme my mint green case created, the lavender is GORGEOUS and I’m actually sort of glad the green didn’t work out.Don’t get me wrong, the green is also  gorgeous.. but in the end I’m glad I ended up with the lavender. I was overjoyed when I was prompted to set Face ID during setup. Worked brilliantly, as did everything else.Great packaging, no cosmetic flaws, amazing battery life, customer service was great, and best of all… ITS PURPLE!Can’t wait to pair it with the new case. I’m so glad I went this route where I have some peace of mind as a buyer.I’m grateful to the seller for being so helpful and patient with me as insufferable as I must have seemed making such a fuss over colour preferenceIf you’re nervous buying a phone used or refurbished too, hopefully you can take comfort in knowing- this seller is legit. You receive a good quality product, and, speaking from experience, they’ll gladly help resolve any issues you may run into.",
      "helpfulVotes": 490
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely worth the money!",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "I waited a full 8 days before writing a review. I ordered premium refurbished. And honestly, the phone is basically brand new.I purchased an iPhone 12 back in 2021. It has lasted me up until now actually. Front and back screen are both busted, speakers are sucky but they are probably just dirty. I put a tempered glass protector on it and gave it to my 6 year old to play Minecraft on. My point in saying that is the iPhone 12 has served me so well that I purchased pretty much the same phone. Just purple. I see no point in buying the newest number iPhone. I needed to replace my busted on after 4 years of owning it and was confused enough to not stray far at all from the trusty 12.I would recommend getting this. If you are like me and frugal, want your moneys worth etc, just get the premium version that way you know for sure it’ll be in very good shape! I was too worried I’d get scammed buying from FB marketplace and too cheap to buy brand new. And I’m glad I went with this option!Oh and I see many people complain about the battery life but this one’s battery max capacity is at 93%. Whereas my old iPhone 12 that I bought 4 years ago brand new was at 80%. Full charge lasts me pretty much all day! Speakers are VERY loud that I can’t watch any videos at max volume, and the screen brightness is perfect! Also it’s purple. And as Bella says in Twilight, “Purples cool.”I’d post photos and videos but I’m writing this review from the phone. Not a single scratch, dent, or crack on this!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    OLED Flicker is Very Annoying",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "I've grown to like this device a lot despite the absence of a physical home button. I transition to this one from an iPhone 8 Plus (only because that one is like, not receiving updates anymore), and it was a bit jarring at first, but I got used to using this new one after like a month. right out of the box the screen and metal shell were in really good condition with only one scratch on the upper right of the casing. The screen is perfectly responsive even through a protective screen and all the haptics/gestures work perfectly. One thing that this device does that I really don't like, is that it has had this weird flicker whenever the screen is very dark or black. this iPhone has been doing this since the day I received it, and initially I thought nothing of it; then I remembered that my old iPhone doesnt do this at all.. I don't know what it is, but it's very odd and at times interferes with some of the ways I use the device.  I opted not to return it because other people I know who have this version of iPhone said their phone did that at some point too and they either ignored it or they updated their device and the problem resolved itself. I had to remember that this is a used handset and this issue with how it handles black is literally one of two faults that the item has. The vender was pretty meticulous with support, packaging, instructions, and they even included a new charger in the box that works very well and is a bit thicker than the OEM parts so it's still in good shape too.I think it was worth keeping overall, but will still wonder about this flicker for the duration of the time that I use this iPhone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall fine, but battery health not as promised",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "I’ve only just finished set up and tested some features. So far camera works, keypad works, I’m satisfied with the physical appearance and the shipping was fast as promised. HOWEVER, in both the item description (as a premium condition phone) and on the certified premium checklist card included in the box with phone, it is promised to have a phone battery capacity of “over 90%” though the battery health measurement in the phone settings states 83%. I’m not dissatisfied enough with that alone to return, but I would hope anyone reading reviews sees this and knows that the promise of anything close to 90% is not a valid promise. In hindsight, I’d likely take my chances with the standard quality option and not spend the extra money on premium. I have a feeling it’s the same phone quality standard either way and you’re just paying more for verbiage with premium."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good to Go!",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "minus one star only because the charging cord described in the listing was not included.  however, my ipad cord and plug worked just fine.Like others, I was a little hesitant.  But hey, it's covered by the same Amazon return policy for 30 days.I got a testing app to do all the tests, I did the home tests of the camera(s).  All good!I got a little freaked out when I looked at the battery and it said 75%.  But that was the current charge.  When I plugged it in overnight, it went up to 100%.UPDATE:  okay, i found the real way to check the absolute battery health.  it was 81%.There was a sticker plonked on the back that I was worried wouldn't come off without a fight.  Nope, once I got the edge pulled up, it came right off, no residue or anything.The unlocked phone did the whole eSIM thing with USMobile no problem.  Good to go!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I was skeptical about ordering a phone on Amazon but glad I did. My old phone was outdated, unsupported, and just done but the price of new ones is insane. I wanted a replacement at reasonable cost so did some research. iPhone 12 was on a lot of “best used iphone” lists and some YouTube channels highly recommended it so I finally ordered one on Amazon, also recommended by a YouTube channel BTW. To say the least I’m pleasantly surprised. The phone is flawless and works perfectly. Transferred everything from the old phone effortlessly. Called my carrier and transferred my number, also effortlessly. I’ve been testing it out for a while now and there’s absolutely nothing wrong with this phone. It might as well be brand new at 1/5 the cost! Now I know where to get my replacement phones from now on."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sound is muffled not good quality sound",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "The phone was in really good shape no scratches or anything! The only thing that I didn’t like was the sound quality it’s not loud and sounds muffled like the phone has had water in it but other the that issue the phone is good"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente en físico - me bajó 1% capacidad máxima de batería en 1 día",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Lo compré en Amazon Renewed - Condición ExcelenteLa verdad se ve como nuevo, solo con dos muy pequeños detalles que no son gran cosa y no se ven con un forro puesto.Algo que no me agradó mucho es que me llegó con 82% capacidad máxima de batería y al día siguiente ya era 81%, espero no baje así de rápido.En términos generales todo perfecto y cumple con lo de “excelente” con 80% capacidad máxima de batería o superior, la verdad esperaba un poco más. Estaré informando."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Customer Service !",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "The iPhone was fully functional and in beautiful condition, however, the battery, supposedly healthy at 90%, would not hold a charge. The seller was most prompt and helpful in getting back to me, offering several good options, and quickly issued a full refund when I decided to returned the item.  So, five stars for the seller review and three stars for the phone; giving it average rating of four stars. I would not hesitate to purchase from this seller again, feeling like the phone I got was a fluke, and the return  /exchange options were prompt and efficient."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First iPhone 12",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "My phone battery was very low when I first took my IPhone 12 out of its box. I had to charge my phone at a local Metro by T-Mobile store.  The battery life isn’t that great either. I just activated my phone yesterday and I’m having to charge her after to hours of use. I’ll order a portable IPhone 12 charger. I do like my phone and I love my camera quality."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Delivery issue",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "The product it's self was fine how ever I left specific instructions that if no one was home to leave it INSIDE the porch, it was left out in the rain and luckily the dogs did not destroy it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Working Condition",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    This product is an Apple iPhone 12 with 256 GB of storage, fully unlocked and tested to work seamlessly on both Verizon and T-Mobile/Metro networks. The phone boasts an improved camera system with AI-driven enhancements, capturing stunning 4K video. Compared to my previous iPhone SE, the iPhone 12 delivers noticeably sharper and superior video quality.Although the phone arrived later than expected, I'm pleased with the purchase overall. This is the third phone I've bought through Amazon, and the first one that worked as expected. The first two were not authorized for service in the USA. Based on my experience, I recommend Amazon’s Renewed cell phone program for those looking to reduce waste by recycling and reusing electronics. However, the phone arrived with a few dents and messy adhesive, which took some effort to clean off using rubbing alcohol.Shipping could have been faster, and I experienced a delay of about a week and a half before receiving the phone. I also wish Amazon would disclose the seller associated with your purchase before you buy, as some sellers provide better products than others. Fortunately, this particular seller did a great job renewing the phone.The 256 GB of storage is a huge plus, leaving me with about 64 GB free after setup. It also came with a charger cable, but unfortunately, there was no official product manual, AirPods, or original box included.If you don’t mind waiting and a bit of uncertainty, Amazon’s renewed phones tend to work out well thanks to their generous guarantee and return policy. It would be great, however, if refunds for defective purchases were processed more quickly. Lastly, Siri on this model feels different compared to my iPhone SE, likely because I don’t have the hardware needed to take full advantage of the new Apple Intelligence features on this device.This product meets my expectations and hardware tests thus far. The battery life is good, and I was able to use it for about all day without needing to plug it in.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works and looks great",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "We purchased this for our daughter and it works great and is in great condition.The charger that came with it doesn't work and I was told a new charger couldn't be sent, the phone would have to be returned as well. We didn't want to do that because the phone is fine so we just bought a new charger.We had purchased another  iPhone 12 and that one didn't work well and the screen wasn't very responsive to touch so this one is a replacement for the original one.While our daughter was disappointed to have her Christmas gift not working properly the return and refund was a simple process",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Gave 4 stars because it had a scratch on the screen. Memory capacity is normal-ish for me, Apple quality, light,"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen proveedor",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Casi todo perfecto con el equipo, sin piezas cambiadas y esteticamente muy bien, el único detalle fue el procentaje de batería :("
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    perfect purchase!",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Let me start off by saying I ordered this phone for my grandfather who was still using an iphone 7 before receiving this one. HE IS IN HEAVEN! this phone exceeded his expectations! it looks brand new, the packaging was great, & it came with a charger! great price for this item & the happiness on my grandpa’s face was well worth the money!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome seller!",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "Awesome seller, went above and beyond!  iPhone was flawless, looked brand new.  Only issue was battery was at 75%and would not hold charge.  I reached out to seller he said get battery replaced and he would refund!  He did!!!!  Customer service phenomenal, product awesome.  You can’t go wrong with them.  HIGHLY recommend!!!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IMEI number is not able to validate",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "the device is in good condition, but I am not sure why the IMEI number is not validating"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for an old phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "I had switched from an old iPhone X to this since its what I can afford, even so, its an old phone. But for an older generation phone its fantastic. The battery is 10 times better than other older phones, but will need to be replaced in a year or so. With apple, old phones are going to be a bit out of date even if its refurbished but its still fantastic if you arent able to drop a thousand bucks on a brand new phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "It was a gift for my mother, she loves it. Color is beautiful"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Very good Phone I've had absolutely no issues so far. I would say I am satisfied for the cost."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life at 80 percent",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Battery life was already at 80 percent which means my phone dies pretty quickly but over all phones been fantastic"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like a new phone",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "It's clean, scratch free, and functions as it should. I had hopes that it would be \"pretty nice\", but I'm actually quite surprised at the quality of a used phone at this price. It does however have a service message for the battery and reads as \"highly degraded\" with a battery health of 79%. Hopefully it lasts."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the money!",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "This phone has been amazing. I was hesitant to buy a refurbished phone but I’m glad I did. Very happy with the battery life and quality of the phone! Would recommend. I was upgrading from iPhone 8! 💕💜 I got the purple color and it is so cute"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Happy",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "I’m on the phone that I ordered so I don’t have any pics or videos LOL but it came in great condition. Better than I expected for sure. Just put my SIM card in and it was ready to go! Was on 75% battery life. Everything works as expected. It looked brand new, hardly any scratches for being refurbished. Feels like a brand new phone Camera quality is phenomenal. Back in the game with my iPhone 12. Until I can upgrade LOL  Thanks!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life below 90%",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Phone is good, I expected better battery health for it being in excellent condition."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but decent sound quality",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Almost looks new , has. A simple single scratch on the screen and it doesn’t have that of a good sound it also has scratches on the edges"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No box",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Good but it was sent without a box"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a great phone love it",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "It was a gift for Christmas from my great-grandson who is autistic.He is very intelligent.He has a high IQ, he is considered a genius, but he loves this phone.He can use it on his own without any help. It is great for him. If I was buying for him again, I would get him another one.  Great phone. I also love the color. Charging ability is good. The phone feels fine in his little hand. It doesn't take up much room.Just put it away where they keep them and it's very durable",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "Sure, the sound could be better, and no headphone plug... My Motorola Android was unusable -- all popups, not even affected by the antivirus program.  This is a quality upgrade to the Androids I've had. It was worth it to embark on a new learning curve even with all the Apple accounts to deal with. The fact that it's a refurbished phone seems irrelevant. (Addendum 2/11/25: I found that you can buy an inexpensive adaptor for headphones and that the sound quality is better than the speaker.)"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s GOOD ASF",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "It’s good guys i needed a new phone because my 11 broke and at first i wasn’t for sure but i just got it today and everything is good my battery was at 87% capacity but overall its good and should last a long time PERIODD🫶🏼"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    first team",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "The device came as advertised and is brand new, just like the factory. The bad thing is that the box was missing the SIM remover and the phone's battery was empty. The rest was fine."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived quickly",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Phone is great only thing I see is tiny scratches on screen. Nothing else. It works great like new."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    defective phone on call volume",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "fast shipping but the call volume on phone was too low and could not get it any louder. tried numerous remedies but no help."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good?",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Everything’s perfect just wished it would say something about how many scratches there areThere’s a lot of them and there’s no heads up I’d don’t expect a perfect one but cmon"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Totally worth it",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Great Phone, had no issues, works well, worth the spending, durability is fantastic, was thrown against the  wall, still works flawlessly. beautiful screen, all features work great. it was originally meant for me, but turns out I'm not an Iphone user, so i gave it to my husband, and he absolutely loves it!! better than his old one that didn't connect to blue-tooth or Wi-Fi and had other issues. highly recommend."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I phone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "Phone scraped on the side, only complaint."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unbelievably satisfied.",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "I’ve had my iPhone 7 for many years and it’s been very reliable. I was very skeptical. Also about buying a used phone but found out in the long run. This is an extremely dependable phone and I am so happy that I purchased it. I haven’t tried the charger yet and read a few reviews that theirs don’t work, but that’s not a big problem since I have my old charger and it works just fine. I would definitely recommend this phone because mine came to me with no scratches at all. I charged mine up for the first time and it is at 100%. I can’t say enough about this phone because it looks and works just like a brand new phone. Very, very satisfied!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall a good phone",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Overall a great phone. No scratches, scrapes. Good condition, works well. Saw that the phone had a battery health of 86%, which is ok. Wish it had new battery. Overall a good phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it ❤️",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I love it. Love the purple color, came a bit scuffed on the back of the bottom but it’s not like i can see it cause there will be a case on my phone most of the time. Came a day early and i was happy about that. Met most of my expectations."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Love the phone came in great condition came fast to the only thing is no instructions on how to use it but i love it",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Works well enough for the savings! The battery doesn’t hold a charge as long as I think it should, but still happy enough with it."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Had chips on edges and too much work to wait needed a phone. Works fine."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Minor Flaws, but Worth It!",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "I purchased a refurbished iPhone 12, and overall, I’m quite satisfied with my experience. Here’s a breakdown of my thoughts:Performance: The A14 Bionic chip delivers impressive performance. Everything from browsing to gaming has been smooth and responsive. I’m glad I chose this model—I can easily multitask without any noticeable lag.Condition: The phone arrived in good condition overall, with minimal signs of wear. However, I did notice a few light scratches on the screen that weren’t mentioned in the description. While they don’t impact functionality, it was a bit disappointing.Camera Quality: The camera takes fantastic photos, and the Night Mode feature is a game-changer. I love capturing memories, and this phone does an excellent job, even in tricky lighting situations.Battery Life: The battery life is decent but could be better. I find myself needing to charge it by the end of the day, especially with heavy usage. It’s not a dealbreaker, but I was expecting a bit more endurance.Value for Money: Considering the savings compared to a brand-new device, this refurbished iPhone 12 offers great value. For anyone on a budget, it’s a solid option.In summary, I highly recommend the refurbished iPhone 12 for anyone looking for a reliable smartphone. Just be sure to check the condition carefully beforehand. Happy with my purchase overall!",
      "helpfulVotes": 42
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Highly Recommend",
      "date": "Reviewed in the United States on February 27, 2024",
      "body": "I am a 19 year old broke college student, but I have had the Iphone XR since my freshman year of highschool... I am a rising junior now. Though my XR did my well over the years,  she recently started shutting off on me at random times, would die after 30 minutes of use after being charged fully. I was just wayyyy past due for a new phone, so I got this one. This was one of my first big girl purchases, so I was a little worried that something was going to be wrong with the phone, seeing as I saw quite a few reviews complaining of issues with their phones, but I haven't had any problems yet. Face ID works perfectly, extremely minor scratches (so unnoticeable I was only able to tell because I was strictly looking for them), easy to switch over to my carrier (literally just inserted the old sim card, and 30 minutes later EVERYTHING transferred over with no issues). Honestly, this is a REALLY good deal if you're looking for a more cheap route than having to buy a phone straight from Apple.Now, the only issue, which I dont fully see as an issue and youll understand why but the battery. The biggest issue with my old phone was how quickly it died. It was impossible to go out for longer than 3 hours without  my phone dying. The first setting I checked on the new phone was the battery capacity, and although I was really really upset when I saw it was also at 80% like my last phone, I dont really know if that number is fully true. I recieved my phone yesterday, and havent charged it since the afternoon of that day, and it is still on 49% which would NEVER happen with my old phone. SO, I put the rating down one star because it does still say that the battery capacity is 80%, but I just havent really seen that as of yet!Hope you guys found my review useful, and I highly HIGHLY recommend buying this product. Just make sure to double-check the ratings of the seller you're buying from. For me, the black color of the iPhone 12 came from a different buyer than the blue color. The black phone color seller has 3.2-star ratings while the blue phone seller has a 4.5-star rating, so I went with a color I wouldn't have usually gone with to higher my chances of receiving a phone in better condition!",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scratches on the sides rims",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "The phone is great besides the fact theirs scratches all on the sides and chipped paint"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I believe I received a brand new unit with zero battery cycles and battery was 100%",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "The battery was 100% and no cycles so this appeared to be a new phone.  I set it up for my mother and she is very much enjoying it.  It appears to be a new unit.  It came with a screen protector and a clear case as well.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Satisfied",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "Had some issues with the first phone I bought with them had to do a return and refund but this phone wow 10/10 very impressed and very thankful"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WOW",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Excellent, doesn't even looked used at all. Came early by 4 days and I couldn't be anymore satisfied with this purchase. Works amazing lookes awesome, not a flaw."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "The phone is working well, the only thing is the battery dies pretty quickly. I got this to replace an iPhone 11 because it was only 64gb of storage so that was full so I couldn’t use the phone anymore. My iPhone 11 had way better battery life than the iPhone 12 that I just bought. And I had the iPhone 11 for more than two years. But this was a good deal for the 128gb so I might just need to get a portable charger"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks brand new",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "I was super nervous about ordering a refurbished phone. I was mainly worried the battery life would be low, but to my surprise, the battery life is at 100%!!! And the phone looks brand new. I’m super pleased, and the shipping was quick!!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I would need a USB-C connector not a USB-A connector",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "The product works great. Although I have received a sync cable and charge cable that is not compatible with the phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Phone came brand new with full battery health if I didn’t know this was used I would have thought it was new highly recommend this one if you are on a budget and need a new phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Iphone!!",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Very nicely delivered! I got the phone setup last night and thus far everything is in good order. Thank you so much for a good experience."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Highly recommend anybody to order an iPhone unlocked from Amazon!!!",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "For the price and how it came I was very satisfied! Everything exceeded my expectations and I would highly recommend anybody to order one from here!!!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great for gifting",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I bought the excellent condition one and it turned to be a perfect gift for my kid. Phone has a 100 battery health too."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    20",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Bueno"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    WOW 100% Battery Health & FLAWLESS",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "WOW! Amazon Renewed is amazing!! I received a phone with 100% battery health! This phone is absolutely flawless and shiny and not a scratch on it! I am so happy. Other than not coming in the apple retail box I would swear this phone was brand new!!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    It’s been a few months since I purchased this phone and it has been working really well since. I think it’s definitely worth the purchase alc is very durable."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "We got this for my son and it is great. Had had it for a couple of months and all good."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean phone",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Arrived quickly and was in great condition.  Had slight scuff on screen but hardly noticeable. Unlocked and ready to setup."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "Great phone, I got the red iPhone 12 64gb. Great condition, minor flaws definitely worth it I think. If you’re reading this and second thinking it, it’s worth it. Hope that helps someone thinking about purchasing this product."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "It works ok.Not as clean as I thought it would be but gets the job done."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price for a great phone.",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Nice clean iphone 12. My iphone 7 died so I went for an upgrade to a 5G phone and this one has been great. Transferring data from the old phone was a breeze, the phone walked me through it. Battery seems good, lasted 3 days before needing a charge. Good price for a great phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Arrived in great condition.  Gave to my grandson.  He is in paradise."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great price and phone",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "The phone was in great condition when I got it and a charger was included too."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything you want in an iPhone",
      "date": "Reviewed in the United States on September 9, 2024",
      "body": "I took very seriously my approach to buying an iPhone i researched all the different refurbished models on Amazon and I went online to various search engines looking for other reviews on potential iPhones.I even weighed the benefits of buying used versus new. I made my choice with this iPhone 12 and even paid an extra $10 to have it delivered sooner. When it got here I was very impressed as it had 100% battery life left. The transfer from my old iPhone took a while due to the fact it first had to be updated to the latest iOS version. After the update everything else was simple.But here's the problem. The Wi-Fi icon grayed out after 2 days leaving the phone unable to connect to the internet. I did hours of research looking at 10 different fixes and tried them all three or four different times. None of them worked and most reviewers who addressed this problem said if the fixes don't work it is probably a hardware problem with probably the internal antenna and that needed to be fixed by an authorized iPhone repair shop or someone else who knows what they're doing.That wasn't going to happen so I unfortunately had to send the phone back.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Make sure new phone is UNLOCKED !",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Got this in an it was so easy to switch from iPhone7 to this iPhone 12. Took out sims card from 7 placed it in 12, followed directions on screen and Boom i was up and running. Reminder if you are switching 1. You must back up iCloud first on old phone.  2. Sim's card must be inserted upside-down into new phone. 3. Must sign into to iCloud on new phone an allow time to update and transfer all data from old to new. This took about 30 minutes, and I was up ready to use my iPhone 12, Love it!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wonderful",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Beautiful. I am so grateful to be able to have a phone like this that works so quickly and came with an 86% battery health. The appearance of the exterior is immaculate. And didn’t have to pay the price of a brand new phone but it feels brand new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleased with my Amazon refurbished iPhone",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I was nervous spending a couple hundred dollars on a used phone. I did a lot of research, read tons of reviews and was nervous about the refurbished phone mixed reviews where some people reported scratches, battery issues and receiving phones still locked to certain carriers. I don’t like cell phone contracts, and this phone was a fraction of the cost of a new model, with a nice return window, I decided I would give it a try. The phone came in like new condition, with a screen protector already installed. The phone had ZERO scratches and no indication of prior use, other than it arriving in a generic box. The setup process was seamless and with the phone completely unlocked, activating service with my cell phone carrier was a cinch. I have been using the phone for 3 weeks with no battery issues. When I’m in the market for a new cell phone, I’m definitely looking at Amazon refurbished phones first!",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Legitimately good phone",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "This product is excellent I purchased directly from Amazon instead of using a 3rd party seller and to make a long story short the phone is perfect and came the next day after I ordered it. Very very happy :)"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good condition",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Good condition phone. Came with a charger just had to get a base. For the price its great and works perfectly fine."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iphone 12",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "I am a “Real Person” from Nashville TN, The phone came witn a 90% battery, no scratches fr , and was charged. The packaging is a little iffy, but the phone was ok"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPhone 12",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Gave my son this iPhone 12 he was super excited he loved it  great picture quality high storage capacity long durability and UT functions well"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Okayyy thank you phone wasn’t cracked and it was a quick replacement for me and came right on time # team iPhone I couldn’t dare use a android lol"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life stinks",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "I suppose I shouldn’t be surprised by purchasing a refurbished phone that I wouldn’t be 100% satisfied. This is the second refurbished phone. I purchased through Amazon. My last one I purchased was a pixel and I missed having an iPhone so I gifted that to my daughter to purchase another iPhone. Unfortunately the battery life is not the greatest. The pixel I could use for two days without charging. This iPhone, I end up having to charge after dinner time. And I don’t use it that much. Like I said you take your chances when getting a refurbished item. So I will be taking a rechargeable device with me when going on longer trips..Otherwise it’s bigger then my SE I had before, which is nice but don’t like I have to OPEN my eyes to turn off my alarm, as every External button only puts your alarm on snooze",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good but was at 80% battery health",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "Solid iPhone although it was at 80% battery health everything works so amazing discount"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good, except for a slightly broken volume key",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "When I received it -- straight from the package -- the volume down button was kinda janky. It works, but kind of sticks a little, and it doesn't *feel* like it works. It makes zero audible clicking noise - which I, personally, think the clicking noise is helpful because I can tell I've pressed the button - and I don't feel it click either. However everything else has been just fine. (It also would have been helpful if the box it shipped in was labelled \"Unlocked\", which was how I ordered it, and not \"AT&T\", which was how it was *actually* labelled. However I was able to figure that out.)If thr volume key didn't have issues, I would give this product 5 out of 5.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phones",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "Great deal for the price, the phones look very good and my kids are happy!!!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent condition phone with scratches",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "I just purchased 2 Iphones 12s- the first one came and was perfect. no scratches or marks and sound was great and quality was great. so I purchased another for my son and that one came yesterday and was all scratched up on every corner, even though it said excellent. if i wanted a scratched phone i would of bought a “acceptable one” so I def don’t think that was okay and should be refunded about $50 for the price difference but what we not gonna do is just send it back after waiting for it. my son is a teenager and is okay with the scratches, but me the one who paid for it isn’t okay with the scratches…. BE TRUE TO THE CONDITION OF THE PHONE!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly as stated, actually better than expected.",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "I ordered this phone to replace my 12 yr old daughters phone. She absolutely loved it. It was purple, and actually looked brand new in the box. There wasn't a scratch on it. Everything works perfectly and I received it in 2 days. She's happy, I'm happy. Thank you!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "I like this phone and so far it has been working and the battery is lasting a while. I do not use it a lot but for its use it’s doing good.Touch screen works well, the phone is like new, couldn’t find defects at all.Plenty of storage. So far so good. I had it for 1 month, will update if anything changes but am satisfied with it!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works perfectly",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Works great. Very happy with purchase"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    simplemente conforme",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "Es mi primer iPhone, y lo recomiendo un montón solo que esperaba al menos un 95 de salud de vida pero estoy feliz, con el producto."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing.",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Battery is at 87% which is fine. Screen and casing are perfect.  Eats paying 800-1000 for a phone.Came in less tha  25 hours. Buy the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen, flashes, and issue with the speakers",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "I’ve had this phone for almost 3 months now and the day that I got it the speakers were acting so weird. When the battery gets low, the phone is almost whispering. But now I’m starting to have issues with the screen.The screen flashes, the LED screen (green blue stripes) , I have to click the power button and restart it for that to stop. Apple won’t fix it because they said it’s an aftermarket screen they put on. Contacted the seller about the speaker and they told me to send it back, but then I would be out of a phone for a while having to ship it through the mail(as a mother, I need to have a phone on me at all times)…. I paid the extra money to get the highest quality of refurbishment…. Also When I received the phone, I had noticed a couple of dents around the back, but I didn’t mind since I put OtterBox on it. But on the back, you can see the back screen  was replaced before because it’s not closed all the way…. I’m assuming that means my phones not water resistant , But like I said, I just keep it heavy duty case on it… I had to save up for a while to get this phone, so I was kind of disappointing that it has a couple of issues. But unfortunately, with my situation, I just have to deal with it. I’m grateful that the phone can work When I need it, But I should’ve just got the basic refurbishment and not the excellent one…",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Happy I Decided to Buy",
      "date": "Reviewed in the United States on February 8, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    This is my own review of my own purchase.I did not purchase this through any other seller besides Amazon Itself.I bought the Apple iPhone 12, 256GB in the color Purple.It is Unlocked and Amazon Renewed.I paid $ 304 plus taxes ( and extra $25 tax to be collected.. wt- ok. )So in all, I paid around $329 and some change..My phone is flawless.It doesn't have a scratch, a dent, the screen is completely perfect and my phone turned on with 85% battery percentage.  This phone looks and performs as though its brand new.I bought a clear case and screen protector bundle and the phone is currently charging right now.I'm very happy and im glad I took the leap to buy renewed just to see for myself.There were so many sellers selling the same model for $40 & $50 dollars more.. and it wasn't a guarantee that it would be as good as it should.. but I'm lucky compared to the other reviews I'm seeing.I took a chance and I have exactly what i wanted to get.Good luck and do your research..",
      "helpfulVotes": 26
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Glad I bought it",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I bought this phone for a relative, great price and great condition, no issues.Will update this review if anything changes"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Shipped really fast and had no problem connecting to AT&T. If you have a problem just restart the phone after you have changed the sim."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "Easy set up. Nice and sleek phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great backup phone",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "My delivery was on time. Packaged correctly and it's perfect. Most definitely recommend! Only thing is of course purchase with case."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished Iphone 12",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Very pleased with purchase, working great. Battery life a little over 80%."
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Generic battery, ended up needing to replace faceplate within 2 months",
      "date": "Reviewed in the United States on December 17, 2024",
      "body": "I bought my iPhone 12 here in about Oct 15 2024. Then on December 14, almost exactly 2 months later, the audio on the phone app stopped working.  Suddenly I was like a mime with a phone.  If I did a video call, I'd have to perform interpretive dance.I'm a pretty fair tech geek.  After running complete diagnostics at home and at the Apple store, both on the software and hardware, it turned out to be a $250 hardware problem. This was most likely because when the the vendor swapped in a new (non-Apple) battery, they did not seat it correctly.To be fair, iPhone 12's are also known for having phone audio problems (muting audio weirdly.)  But after extensive diagnostics, as I said, it did turn out to be a hardware problem.  It seems to me that a refurbished phone should work longer than 2 months.  And usually, they do. Just not this one.Now, maybe I could have gone to the trouble of returning and replacing this phone, But even if they let me do that, who among us can be phone-less for a week?  Even if you bought the insurance coverage, you'd still be out the phone for that long.  Normally, I don't mind unplugging on nights or weekends, but I need my phone for work.  So, I paid the $250 to Apple to fix it in a couple of hours.You do you, but honestly, until the vendor addresses that problem, I would steer clear, especially if it's an iPhone 12. Good luck, and may the odds be ever in your favor.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent condition phone with scratches",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "I just purchased 2 Iphones 12s- the first one came and was perfect. no scratches or marks and sound was great and quality was great. so I purchased another for my son and that one came yesterday and was all scratched up on every corner, even though it said excellent. if i wanted a scratched phone i would of bought a “acceptable one” so I def don’t think that was okay and should be refunded about $50 for the price difference but what we not gonna do is just send it back after waiting for it. my son is a teenager and is okay with the scratches, but me the one who paid for it isn’t okay with the scratches…. BE TRUE TO THE CONDITION OF THE PHONE!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen, flashes, and issue with the speakers",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "I’ve had this phone for almost 3 months now and the day that I got it the speakers were acting so weird. When the battery gets low, the phone is almost whispering. But now I’m starting to have issues with the screen.The screen flashes, the LED screen (green blue stripes) , I have to click the power button and restart it for that to stop. Apple won’t fix it because they said it’s an aftermarket screen they put on. Contacted the seller about the speaker and they told me to send it back, but then I would be out of a phone for a while having to ship it through the mail(as a mother, I need to have a phone on me at all times)…. I paid the extra money to get the highest quality of refurbishment…. Also When I received the phone, I had noticed a couple of dents around the back, but I didn’t mind since I put OtterBox on it. But on the back, you can see the back screen  was replaced before because it’s not closed all the way…. I’m assuming that means my phones not water resistant , But like I said, I just keep it heavy duty case on it… I had to save up for a while to get this phone, so I was kind of disappointing that it has a couple of issues. But unfortunately, with my situation, I just have to deal with it. I’m grateful that the phone can work When I need it, But I should’ve just got the basic refurbishment and not the excellent one…",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    UPDATE: Battery Won’t Charge to 100",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "UPDATE: I researched and this charging issue is weirdly not uncommon with iPhone 12s. I did a hard shutdown for 10 minutes twice while the phone was plugged into the charger and it went up to 100%. I still think battery life is way too short, but it is now charging all the way up.I’ve already been through the massive headache of setting up this phone and logging into everything. I charged it first and I waited until I knew the phone would power on. I thought the battery went down quickly for a newly refurbished phone. This morning, I plugged it in to charge back-up from 20% and it tops out at 96% and will go no higher.I’m also not thrilled about chipping on the metal around the camera lenses of this phone.I picked a refurbished phone in the highest quality condition available (excellent) and from a seller with good reviews.If I return it, I have to go through all of the setup again. Plus go without a phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall Nice Phone, But Renewed Premium Condition Should Have Been Better.",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "I purchased an iPhone 12 and spent over $100 for the Amazon Renewed Premium grade over basic Renewed, and overall I'm pleased with the phone itself, with a couple exceptions.The mute switch was filled with what I'm assuming was dead skin, enough to obscure the red marking. It should have been cleaned before being sold at this grade.The battery capacity should exceed 90% and this phone just clocks in at 90%. Not a big deal at 1% difference, but not what's listed for the renewed premium grade.The screen and body were overall blemish and scratch free although there was a residue around the camera lenses that should have been cleaned.I considered returning the phone, but I don't have time to go without one and the hassle of swapping data from my old phone. Unfortunately it didn't meet Amazon's stated condition and quality control should have been better for the price point.",
      "helpfulVotes": 20
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    several issues with phone",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "First of all I bought the phone and the description said EVERYTHING IS FUNTIONAL and keep in mind i bought the one that said EXCELLENT condition. Even so, the phone upon arrival smelled weird firstly llike as if it had mold on it. Secondly the phonewas dirty near teh ringer and alot of cracks and crevices. I used a needle and alcohol to clean everything. That being the speakers and teh microphones were SUPER low and so I figured maybe it was dirty so I cleaned it well and after that speaker was perfect. BUT the earspeaker STILL didnt work and was completely useless. In addition I charged teh phone while transferring all th detailas and what not and after that I left the phone to charge up. I waited until a hundred percent and used it for an hour and THE BATTERY DRAINED 40 PERCENT IN ONE HOUR unbelievable as this was supposed to be a \"EXCELLENT\" condition phone clearly not and reading other reviews other people have had similar issues. Other then that the phone is great no scratches or whatnot everything software wise functioned great so a three star for that.",
      "helpfulVotes": 87
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fragile screen",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "I have bought this phone twice once in blue and another in white, and I must admit I’m not sure whether or not it was worth my money. Overall I adore the functionality of the phone considering it has more storage and is able to run games which my old iPhone 6s couldn’t do, though I feel like the screens on the phones this seller sells are incredibly fragile! First phone arrived with a broken screen which had the corners sticking up ever so slightly from the edges of the phone, and the white phone I bought after getting my refund (which was the first return I had ever done and took overly too long) now has a crack in the screen from falling about a foot into the floor even with a case.The thing that really bothers me about this is the fact my iPhone 6s, which I’ve had much longer than this new yet refurbished iPhone 12, doesn’t have anything broken on it externally at all even though I have similar cases on both phones! Battery health was also significantly degraded at 77%. I didn’t mind the battery health, though it doesn’t quite make the feeling of the crack in my screen any better considering I haven’t had this phone very long. My old iPhone 6s is also refurbished and bought from Walmart, though it honestly feels more durable than what this seller sells.I can’t tell if I just got unlucky twice with Amazon or if there’s something wrong with the phones sold by this seller. Either way, I don’t recommend buying a phone from here and would instead suggest buying directly from Apple. I really wanted to give this a second chance but I’m not sure it was worth the stress of having a phone screen broken twice especially when I could’ve bought something nice for my cats instead. :("
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unresponsive Customer Service and 83% battery life",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "The iPhone was in very nice cosmetic condition and came with a screen guard.  The reason I'm giving three stars is because the battery life is at 83%.  I've never had one of my prior brand new phones run down to 83% and I had an iPhone X that I used A LOT for 6 years (and I have a 6s that still has 100%).  The second reason I'm giving three stars is because I wrote to the seller to ask if there was something they could do (swap out or give a partial refund) and they never responded and it's been several weeks now.  Other than worrying how much life this phone has left in it, it's a good phone.  I'd just have expected an Amazon renewed product to come with a decent battery life.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sound doesn’t work on speaker",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "The phone when I got it was in good condition. However people can’t hear me since I got it on speaker. I can only talk on this phone if I hold it up to my ear..bc of bc this I’ll probably have to send it back. Other than that issue the phone does work great."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Willy",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "So far everything is fine, I just took them out of the box and turned them on and they look like new without any scratches, I bought them to give to my brothers so I still don't have an opinion on how they work, but they are look very good, like new."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product is fine, the delivery was the problem",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "The phone has no visible damage and works great! Customer service was fine too. The issue is that we initially ordered it back in january, and it then got delayed twice. We cancelled the order and never got the refund, so we tried again; it finally got here today, february 22nd."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't really constitute as \"Excellent.\"",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "I got the \"Renewed – Excellent\" condition iPhone and came with all these scuffs and dents on the top and bottom of the iPhone. I've gotten \"renewed – excellent\" iPhones in the past and the quality was like new so I'm not sure what happened here."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health decreasing too fast.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I got this with a 95% battery health. It has only been a month and the battery decreased by 7% and it is now at 88%. Everything works fine it also has little to no scratches it is just the battery I have a problem with.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cosmetic issues but if you need it to just work it's fine",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "Battery is at 95% it arrived  dead so it needed to charge but works with my carrier. Has scratches along the screen and a slight scratch in the corner of the screen this is day one we'll see."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Issues",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Bought this refurbished phone for a back up after my screen was shattered.The phone is in ok shape. It has multiple scratches mainly near the back camera.The Face ID will NOT work!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It may freeze on you.",
      "date": "Reviewed in the United States on June 13, 2024",
      "body": "It is a personal phone.  I bought the used iPhone 12 unlocked  but I finally had to go to the Boost mobile store and they spent over an hour setting it up.After about a week, the screen froze in the super magnification mode.  The phone wouldn't open.  It wouldn't recognize my face and it wouldn't recognize the lock code numbers.  This happened 2 times and it worked after I let the battery run down and recharged it and I was able to restart it and open it. However the third time, I couldn't seem to run it down.  It doesn't help that the iPhone battery level is unreadable.  There was an Apple store at a nearby mall.  It had a half dozen technicians.  The one I got had me do the recommended things like pressing the side buttons and all and it didn't work.  So I had to reset it.  I noticed that at the other stations, all of the other techs were telling people to reset their phones, too.  Resetting loses your unbackedup data like contacts.  The apps have to be reloaded too.  Fortunately my phone was new and I didn't have many of those.Too bad LG doesn't make a 5G phone.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    OK but not great",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "This is my first \"renewed\" phone but I would not buy another. Finding a really nice specific case was difficult since I was told \"It is too old\" by Best Buy and Verizon. Generic case at Wal Mart was the choice. The volume seems to be not up to par and is a little difficult to hear. Overall, it is OK but not good enough to rebuy a \"renewed\" phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not meet advertised specifications",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "My first refurbished phone purchased through Amazon.Condition is advertised as excellent battery is to be better than 80%.Update screen is not original, scratches easily…Phone delivered is lower than 78% out of the box and asking for service.If a premium price is asked for excellent quality and the phone is delivered was  less than listedInitial disappointment…However screed appears not to be distorted. No real signs of scratches but most phones live in cases.Up dateScreen is soft and scratches easily.  I have been an iPhone user for many years. This screen scratches like an after market mall brand replacement."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s okay I guess",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "When I first got this phone I LOVED it but since then I’ve had problems left and right with it. I would return it but unfortunately the serious problems didn’t start until after the return/refund date passed. The screen glitches so bad and sometimes the screen doesn’t work at all. Overall I guess you get what you pay for even though I did pay over $300 for this phone when I could’ve just got one brand new (I didn’t buy a new one because I couldn’t find the purple one so I bought it from here extremely overpriced)"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not excellent condition like described, also no battery life AT ALL",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Got an iPhone 12 (blue). iPhone was absolutely not in excellent condition(which is what i ordered). Has scratches all over and blue color missing in several places. Battery life is about 25-35 minutes. Pretty much has to stay on the charger 24/7. Left the phone on the charger for about 3 hours and it only went up about 40%.. requested a refund."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen estado",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "El teléfono estaba en muy buen estado tanto físico como interno, sin embargo el botón de volumen no funcionaba, y al ser el botón con el que tomas una captura de pantalla, es primordial su uso. He procedido a devolver el artículo y solicitar uno nuevo, apenas hice la devolución, se actualizará en cuanto se cumpla el proceso con el vendedor."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is good, Battery life bad",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I really wanted to give it 4 stars, but after continued use, it deserves 3 stars due to the poor battery life and quality that will soon need to be replaced. So the total cost of this iPhone 12 is not 230, more 330 when factoring in a new battery. Other than that, all parts of the phone seem good… so far.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Phone in perfect shape only problem the speaker cracks a bit have to talk on speaker phone or with air pods"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "the phone gets hot really fast and the mic is bad but maybe that’s because i got the “acceptable” refurbished instead of the good one and the screen was a little messed but you can’t tell by looking but it would tap things by its own so i had to get the screen fixed."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bad battery quality",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "Battery quality is 80%. What ... I have to change this battery at the service shop myself. And it's $100.Plus when I compare the camera with real new one, the quality is totally different. I think it looks clean on the outside, but it's broken on the inside."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery Life Sucks",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Overall the phone is good, however, the battery life sucks. Be sure to have a charger with you at all times."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    smudge ruined it for me",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "the phone works great, but there is an obvious black smudge prominent on the screen."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "The phone is fully functional. A couple dots of paint missing but nothing too crazy. Battery health was 100% and came with charger. However, Apple keeps issuing a warning that the screen can’t be detected. That it was replaced by someone other than Apple."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't unlock later...",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Product is good with ok battery. Device can't be unlocked. Buyer beware."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor Battery life",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Easy setup. Small scratch on screen. Battery life is terrible."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works and looks great",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "The battery doesn’t last much other than that it’s great"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El color my lindo",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Muy liso y todo pero salió como bien usado bien sucio del parlante estaba bien sucio del parlante en donde escucha está bien sucio",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 12 128gb unlocked (excellent?)",
      "date": "Reviewed in the United States on November 28, 2023",
      "body": "I ordered an excellent condition iPhone 12 128gb unlocked device and received a product that more than matches that of an acceptable device. there are clear dents and scratches on all 4 corners with the glass having deep scratches that can be seen from 36 inches away. This is 3 times the distance of their \"acceptable condition.\"  Normally there is a small gap between the glass and the frame, but you can clearly see the glass is up against the frame where the dents are located and you can easily feel the damage to the glass and frame. Nowhere near what i purchased.ORDERED THIS-Excellent condition- Cosmetic condition: Excellent (Screen: no scratches. Body: no signs of cosmetic damage (scratches, dents, etc.) will be visible when the product is held 12 inches away).- Functional condition: Fully Functional (exceeds 80% of original battery life, generic or OEM accessories and packaging provided).GOT SOMETHING CONSIDERED AS THIS (if you would call it that)Acceptable condition- Cosmetic condition: Acceptable (Screen: may have a small number of shallow scratches, invisible when the screen is turned on. Body: light scratches, clearly visible when holding the device 12 inches away and perceptible to touch).- Functional condition: Fully Functional (exceeds 80% of original battery life, generic or OEM accessories and packaging provided).UPDATE -These phones will go through a 3rd party even though it says “Amazon Renewed.” The 3rd party seller took the old phone back and exchanged it for a phone better suited for excellent condition. Battery was, also, at 100% condition which I find odd considering it’s an IPhone 12 and 15s are the new phone. Time will tell of how well this phone works. I’m glad they jumped to fix the original issue though with the wrong quality phone sent. I’ve moved them from 1 to 3 stars at the moment.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks New However",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "We purchased the phone as a gift for the mother in law.  The phone was received nicely boxed and free of any cosmetic defects, looks new.However, I tried to put a screen protector (tempered glass) on the phone, and the defects were found.  There are indentations in the screen.  These indentations seem to have no affect on the operation (yet to be noticed) but prevent the glass from laying flat with no bubbles.  The screen protectors came in a 3 pack so I tried 3 times, same locations.  I know doing the same thing multiple time and expecting a different outcome kinda means I’m insane, but oh well.There is not enough time to return and retry before her birthday so we are going to go with this one without a screen protector at risk.So much for renewed “premium”.Would I purchase again, probably but give us more time to swap it out, my bad for not checking earlier.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Premium Renewed\" not quite premium",
      "date": "Reviewed in the United States on July 26, 2023",
      "body": "Pricing lower than Swappa or Backmarket, with Amazon's return policy another plus.  Shipping delayed a few days, then delivered to an Amazon \"hub\" rather than my home.  I never had anything delivered elsewhere, but maybe that's a new option and I missed it when ordering.  Packed in a nice 'Amazon renewed' box that held contents securely, but that box was then just tossed into a much larger generic Amazon box for shipping--no padding, no airbags, etc.  Flimsy generic lightning cable included, along with a generic and obviously well used 5w charger (these accessories match what the listing indicated, so no problem).  Phone is in generally good cosmetic condition--back and sides seem very good, so was probably in a case; screen though has two distinct scratches toward the bottom.  Both are about a half inch long and both are visible at arm's length.  The plastic protective sticky sheet over the screen was fine, but the one over the camera lens was too sticky and left residue on the lens that I am unable to get off totally.  Phone booted up fine, and Battery Health & Charging in settings says the battery is at 92%.  However, the Battery Stats shortcut which pulls info from Apple Analytics has more accurate and detailed info.  It shows the phone has gone through 320 complete charging cycles and the actual capacity is currently 88.9%.  This is slightly below the 90% battery life that Renewed Premium is supposed to have.  Overall, with the screen scratches, sticky residue and slightly below advertised battery life, I'd give this iPhone 12 about a 7 out of 10.  If I can resolve the camera lens residue, it'd be an 8 or 8.5.  If I can't find a way to safely get the sticky residue off the camera lens, I'll have to return the phone.  :-)",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You pay for what you get",
      "date": "Reviewed in the United States on November 5, 2024",
      "body": "The phone is awesome and everything it’s worth it just understand you do have some technical issue . Mine is as slow as I am. We both show our age. Also, he gets tired as much as I do. His battery drains a lot faster, but after a good charge, he’s good to go for a couple hours so he needs to be charged. I have to charge them at least twice a day unlike a new phone you don’t have to do once a day if that. I don’t regret getting my phone. I love my phone the more I work with it the more I love them I would do this again because I do not want to pay the price of a brand new phone, especially when it’s bought two of them so it is worth it. Luv~n~Peace",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can't text or make calls after 1 month",
      "date": "Reviewed in the United States on November 12, 2024",
      "body": "A month or so after we received the phone, we could no longer text or make calls from it. We took it to the Apple store for inspection and the 4G receiver was found to be inoperable. Of course it was going to cost as much to replace the phone as to fix it. The phone was not dropped or submerged in the time that we owned it. We returned it without issue and are going to give this seller another chance. This time we're springing for \"Premium\" renewed and if this phone stops working inexplicably, I'll be back to downgrade this review for sure.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Always read the reviews. I took a gamble and it's not terrible.",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "If you want a flawless iphone 12. Do not order this one. If you want a phone with chips, scratches and bumbs. Order this one. The screen was replaced. That is why I'll give this 3 stars. Phone is functional for the time being. I will have to update review after Christmas. My fingers are crossed but my eyes crossed when I saw the back of the phone was slightly damaged. I guess that's what you get now-a-days for a $235 + tax iphone. It'll have to do. Please read before getting your hopes up. 3 stars. I would have given it 4 if there wasn't dents and chips on the side. Thanks."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not use Apple components for phone",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "This is my second time buying a refurbished phone from Amazon.The first one was perfect with no problems and lasted a good three years!This one took about three hours, just to switch the apps and get everything onto the phone and a pop-up kept coming up that it didn’t have certified Apple components.Did not have a certified battery,And felt very warm like my old phone while I was working on itDoes not have a certified Apple displayI was told by Apple support that it would cost $263 just to fix the displayWe didn’t even get to the batteryseems a little wonky just trying to type things inThey put a screensaver over the screenI don’t know how long this is gonna last meAnd I would not recommend this productNever wrote a bad review before…Very disappointed🙁"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Some glitches",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "Some glitches"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too fragile. Case obligatory.",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "I dropped it from about 4 feet & it cracked so severely I had to plug it into my computer to regain the pictures on it."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Good"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I mostly concerned about the battery health",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Haven't had any other problems with the phone just the battery"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not excellent, good if you are balling on a budget!",
      "date": "Reviewed in the United States on July 26, 2024",
      "body": "I thought I was getting a refurbished phone in excellent condition? Well I would say that it is not in excellent condition but in okay condition. It is definitely refurbished. Cons: It came in dead, with scuffs and chips all over the paint, a weird little black spot in the screen, and the battery is only at 77% capacity. Pros: Functions fine, holds an alright charge, easy to use, no problems setting up carrier. This phone physically is beat up, and functions as it should. I’m not satisfied with the price I paid for the sheer quality of this phone, somebody definitely over exaggerated its greatness, because it’s PHYSICALLY not in excellent condition. But for now it will do! So if you want a phone for short money that functions fine and don’t care about the physical appearance, this phone is for you! But if you expect a fairly new, barely scratched phone, look elsewhere my friend! 3/5 phone.",
      "helpfulVotes": 35
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My iPhone was still locked!",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "Love the quality of the phone. It had something on the phone but we cleaned it. My daughter loves her phone. Only downside is that it was locked. But I got it unlocked, mine was locked under AT&T and it took literally like 5mins to unlock. Definitely worth looking into instead of sending it back."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impressive return/exchange response",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "At first I was a little disappointed that the initial phone I received was unusable as the wifi connection became disabled with no option to reconnect.  I requested an exchange and was pleasantly surprised that a replacement came within five days.  Second phone was in excellent condition works great so far."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine.",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Phone works fine and screen is fine but rest of body is pretty beat up for being described at excellent condition. I have purchased other items renewed or refurbished in excellent condition and were near flawless this time was borderline good to fair condition. Just have to be waste of that."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not waste your coins",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "Don’t try to save your money from ordering from amazon iPhone sellers. They never sell an ACTUAL  renewed phone in “excellent condition “ basically I received a phone that appeared in great condition, but then I opened the camera app and the phone started glitching and over heating & making a click sound. Thought it was about to explode in my hand…. So yea if you want a renewed phone, get it from a phone carrier company or Apple Store. Don’t waste your time or money on amazon. It will never be great condition unless you get lucky . But I did get my full refund . So that is good to know about the seller :) I ended up getting a great renewed phone from boost mobile store",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Stopped Working After 2 Months",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "Worked beautifully for two months, then got stuck on SOS mode. Was informed it was a faulty product. Great news was that the return was very easy. Apparently this may happen with refurbished phones. If I were to buy again refurbished, I would consider getting extended insurance. Was lucky my phone showed its issues under 90 days."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bateria en mala condicion.",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "Amazon Renewed asegura que la bateria estara al menos en 80% de condicion en los dispositivos con condicion Excelente. Mi telefono llegó supuestamente con 91% pero era una bateria reprogramada. Su condicion real era 76%. Lamentablemente me di cuenta tarde y ya no pude reclamar un reembolso."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought excellent condition - battery less than 80%",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Received iPhone 12 and battery was at 76% and not the guaranteed 80%"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with scratches on screen and backside",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "The phone had a scratch on the screen and on the back"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No desbloquea",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Buena calidad y estado, solo que el SIM está bloqueado."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall, it’s pretty good.",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "Overall, the phone works great. The main downside is some cosmetic wear and tear. There are some scratches on the screen as well. If it wasn’t for that I would give this phone a 5star rating.Update: Now I’m having issues with the touch screen not always working….."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lines in the screen & gets hot.",
      "date": "Reviewed in the United States on October 8, 2024",
      "body": "I understand I purchased a refurbished phone. I paid a bit extra for a device that was described to be in excellent condition, however. This seemed to be the case until I turned it on & moved from the very busy background of the home & lock screens to connect to my WiFi. I keep my devices on dark mode, so when I got to my settings I noticed there are lines in the screen. I also took note that there was a slight lag in touch sensitivity. The phone also gets hot quickly & I don’t even have a case on it yet. This was all noticed a day after receiving the device. Otherwise, I haven’t had any issues. Not sure how long it will last me, though.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blue Vs Purple (electronic deals vs Verizon)",
      "date": "Reviewed in the United States on May 5, 2023",
      "body": "For the blue one from electronic deals-Well first I paid for minimal ware and got a phone with multiple scratches all around the phone paint gone each camera has scratches all over them and paint gone looks like the person changed their cases and lens protecters a lot!! The phone freezes up even on newest update I have to force stop multiple times even google it just won’t load and it’s not a wifi issue cause I have a 14 n my other daughter has a 12 both bought same time but this  one came from this seller n one came from Verizon the Verizon one came like brand new and has not one issue! Also this phone only has a 84% battery life and at 75% it will tell you to get a new one! So won’t last long…so long story short I think I will be returning it and buying from another seller unfortunately my daughter isn’t happy with it..For the purple one from Verizon!! I bought it with minimal ware so not new condition but the one down just as I did the blue one idk why it’s putting the review for both together but they are anyways this phone omg looks brand new out the box!!! Not one scratch scuff no issues what so ever we r so happy with it! My daughter is happy it looks n works amazing! Battery life is 92% and that’s really good for a 12 in used condition! Thank u Verizon!  I highly recommend! You could even go with the cheapest option and still get a new phone!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is alright",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "I recently ordered one and I ordered it on excellent condition. It arrived and everything was included in the package (charger, and the phone) but to my surprise the phone was a bit damaged and it’s looking like in Fair condition, but other than that great phone! All I ask if they’re could be a solution to prevent future customers to face this type of problem in the future."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    touch screen",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "the phone scared me a lot.The touch screen does not work well and sometimes the whole phone blacked out.Expected a lot from iphone 12 but it's wore"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health and audio are bad",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "I purchased an iPhone 12 labeled as excellent condition but was disappointed. The phone has minor scratches on the top and bottom, battery health is around 82-84%, and the earpiece audio is very low, likely requiring deep cleaning. For the price, I expected near-perfect quality, but this device feels closer to acceptable. Overall, not worth the premium price for “excellent” condition—I’d recommend looking for a better deal elsewhere.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    POOR CUSTOMER SERVICE AND DEFECTIVE PHONE WITHOUT ANY RECOURSE",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "I recently purchased Renewed iphone 12 from SYNERGY TM. I understood that renewed was no indication of perfect but that it was in excellent condition and that it was diagnostically tested. However upon receiving the product and without much use, I realize that it was overheating. I contacted the SYNERGY about this issue and they said I should return which is reasonable on their part. However, this was not reasonable for me, I am an international customer and as such I had to pay over $200 dollars in additional shipping and handling. I communicated the financial disadvantages to SYNERGY and suggest that it would be more economically viable to fix the phone locally and then they could refund me the cost of the repairs. They insisted that I should return but with further insistence they offered me a $25 refund, which would not cover the Technician's fees. By this time, the phone was now not charging all together. I took me about 3 hours before I could get it back to remove my data and reset the phone. I did my research and I was able to get DHL to attempt return the product. New problem is, they were unable to deliver  to SYNERGY because their location was closed on a Monday at 12:52 pm and no one sees it fit to respond to my request. I am urging Amazon to look into this matter ASAP. A phone that I bought for $310 is now costing me upwards of $800 and I still don't have a phone to use."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks good no scratches BUT!",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Receive the phone.Good time, no scratches look good.However, the back camera does not work at all Therefore, I had two choices return,  it after I had already put all my information in it or go to apple and get it fixed.Which is what I choose and it cost me a additional $160. Other than that the phone was good so just be aware."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SIM Locked by the carrier you chose",
      "date": "Reviewed in the United States on August 13, 2024",
      "body": "CAUTION: I chose this refurbished iPhone 12 with T-Mobile as my carrier, which makes changing carriers downstream very difficult as the SIM is locked by that carrier. I just changed from T-Mobile to Mint Mobile (lowered my monthly from $80 down to $30). Had great difficulty getting the SIM lock removed. Visited T-Mobile store, repeated phone calls to incompetent associates at T-Mobile call centers, placed on hold for over 20 minutes, etc. Highly recommend you think it through before you chose a refurbished phone with a specific carrier. You might be better to get one unlocked, and pay the up charge to Amazon Refurb. It is a royal PIA to get the carrier lock removed, as the carrier really doesn’t care - as long as they get their $$$ (that goes for ALL carriers)!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Good condition, but no charging adapter included and battery loses life quickly.",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "We had high hopes because out of the box the phone looked very good/excellent.  However the battery seems to drain much quicker than my wife's identical phone.  Her phone battery life is 82%.  This phone came in just above the 80% threshold at only 81%.  To be rated as excellent we had hoped for at least 85% or better.  On a full charge by 2/2:30PM PM the battery is in the red with average use.  My wife's phone will go until about 7/8PM with the same usage before hitting red.  Deciding whether to return and try another.  Also it came with a charging chord but no adapter.  This is disappointing ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This Is My Last Renewed Purchase",
      "date": "Reviewed in the United States on December 31, 2022",
      "body": "I have purchased 5 renewed phones over the last couple of years. This one was for my grand-daughter for Christmas. I had originally purchased a red version Iphone 12 but had to return it due to weak screen at full brightness it was only half as bright as her current Iphone 10Xxr which implies to me of heavy usage from previous owner and weak battery.  Still waiting on refund for that phone. I have come to understand that you must wait on the suppliers of the phones to refund your purchase however I think Amazon implies they are guaranteeing your purchase and like all other amazon returns they will refund your money this is not what happens..  I also find Amazon is beginning to slip in customer service areas that were once routinely always taken care of, takes a week to get a package now refunds get the run around etc.  Its a Christmas present so I have to get her another one quickly so I try again with the white Iphone 12 . After getting it  I immediately notice marks on the screen and slight dents on the side of the phone. It slightly  has dull screen too not as bad as the red iphone but not as bright as her current iphone 10.  She is satisfied with it shes 12... If it was for me it would go back too... I will not be purchasing any more renewed phones...  Took five attempts with customer service being told different processes to finally get a refund.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone looks good but is sooo slow",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "The phone looks great but the software is so slow.  It freezes up a lot.  The camera is the worst culprit for causing the freezing.  The battery, even though it was at 100% capacity, doesn't last half the day with normal use.  I ended up going back to my Samsung.  This was pretty much unusable."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not “Excellent Quality”",
      "date": "Reviewed in the United States on April 5, 2024",
      "body": "Refurbished-backed and supported by Amazon, reviews of Amazon renewed products highly positive. Bought iPhone 12 renewed, received and appeared in excellent condition. Transferred info from my phone, working well except on day 1, after completing a call, screen went black, completely unresponsive to all attempts of changing (unable to turn on, off, or get anything else). But, only lasted 1-2 minutes and suddenly came on.Day 4 same black screen occurred after a call, but not resolving. Just sent old phone in as trade-in, obviously unable to call customer svc, went to online chat on my computer, not an easy task but typing all symptoms then waiting for responses, 1st with assistant, then transferred to someone, repeating some of conversation, transferred to someone else;  all close to 2 hrs just explaining my issue.  During the end of this, the phone suddenly came on, after 4+ hrs of black screen.  Have not tried calling anyone but using text and internet options. If happens again, I could lose all phone data - contacts, photos, subscriptions, invoices, - so much we have on there!My options, per emails with customer service, were to contact seller and see what was proposed but no automatic replacement. Main recommendation was to return phone to Amazon and refund expected usually about 30 days, maybe more.I have already sent in my old phone.  Before returning this new phone I need to purchase another so I can hopefully still get data transferred.  So much for a safe inexpensive option of buying renewed.  Will have to spend another several hundred bucks for yet another phone, hoping this damaged one will last long enough to transfer data, And what does that mean as to my trade in?  Still don’t have all answers from customer svc.This has not been a great experience, especially since I don’t have a phone I can trust to make any calls, and don’t know what the issue is so am nervous I may lose all data in the phone at any point.In Limbo and very disappointed",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen goes on and off on and off",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "I don't know how he's the number one seller the farm we got by the time we transferred everything because we didn't get one with our carrier so half of the stuff worked on my wife's phone her old phone and half of the items worked on her new phone so the phone screen started blacking out just turning black and shutting off the phone didn't shut off the screen did is keeps doing it over and over and over again now all of the stuff is transferred back to her old phone not all of it she does not know which phone to pick up when she gets phone call that is an error inside the refurbished phone that is an error I rebuilt my iPhone 6 plus 2 times by myself I put a brand new battery in it I put brand new speakers I put a brand new board in it by myself and I'm a carpenter with big ass hands and I weigh 230 lb and I'm 6'1. These are probably little tiny Chinese people working on a little dinky hands and a little dinky tools and magnifying glasses I use my reading glasses and my big ass hands and my eyeglass kit a matter of fact I got the screws on the bottom of my iPhone 6 with a razor knife because I didn't have a screwdriver that fit the kit that I bought on scam Amazon did not send the screwdrivers so I had to use my razor knife to get the bottom screws out and I repaired it two times the battery was a b**** to get out I had to put a lot of heat on the back of the iPhone 6 to get the old battery out and it came out bent though I put the new battery in and that phone works meticulously it just does not get five dream I bought a 14-promax iPhone from Apple I'd rather have my six pack f*** 5G",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    renewed excellent condition",
      "date": "Reviewed in the United States on September 19, 2024",
      "body": "I paid extra for a renewed phone in excellent condition rather than settling for a good or acceptable condition for less. as described by you excellent condition has No scratches or cracks in the screen and  No signs of cosmetic damage (scratches, dents, and other) yet the device i received has multiple scratches and scuffs around the sides of the phone! totally disappointing! waste of money to pay extra because why did i pay extra if I still got a scratched and scuffed phone. otherwise phone seems to be in good working order no issues noticed yet but we literally just got it last night and got it set up on our line."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was at 80% battery health. Scratch on screen to.",
      "date": "Reviewed in the United States on December 27, 2024",
      "body": "I didn’t expect a new one but I did expect a better battery phone already needs replaced and just got it …Bs"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone but missing SIM tray",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "Phone is in good condition, but arrived without a SIM card tray. I had to visit the Apple Store and wait several days for the part to come in. Phone should come completely in tact without the need for the purchaser to buy extra essentials in order to make it operational."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not sold on refurbished phones",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "The set up process was not as easy as a new phone. Eventually, I had to reset the device in order to transfer my apps and data from my old phone.  During the initial transfer out of the box, my phone number did not transfer to the new phone, but it was removed from my old phone.The battery’s health was ‘significantly degraded’ per the settings. I was expecting the device would be in Excellent condition.I realize this is a refurbished product and may have had higher expectations than experienced.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its okay",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "My iPhone 12 has one good thing and one bad thing. The good thing is that aesthetically the iPhone 12 is fine, the operating system is impressive but that is a matter of the good phones that Apple makes. The bad thing is that it has a small scratch on the screen but it is not a problem, the worst thing is that the maximum capacity of the battery seems disrespectful to me, I spent 350 dollars because it is supposed to be excellent quality. That's an issue I'll have to fix."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not excellent",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "Pros:  The phone is great for what I need.  The battery health was very good.Cons:  For an \"Excellent\" rated phone, there should be no scratches on the front glass.  There was one on mine.  Power and volume buttons also had scratches and wear on them as well.  I don't know who the previous owner was, but it was as if they used a metal object on these buttons.  Seller should know better than to grade a phone in this condition and sell it at a higher price.  This indicates that they are not trustworthy and have lacking QAQC."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Volume goes off and on",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "saw this phone and choose it because of price and rated excellent condition. Received it when said and was happy with the really nice condition it was in. Went to transfer and set it up, then realized the sound kept going in and out. Went through all settings and nothing helped. Really really bummed because I really need a new phone. Also purchased a nice case that I can’t use. Now i gotta return it and wait for a refund,ugh. Still in need of a phone and case."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is nonexistent",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I paid for a phone in excellent condition, and the phone came with no cracks or scratches, however the battery life is absolutely terrible. It will not keep a charge, and in the settings it says the battery and display are both non genuine Apple parts, so it can’t tell me what the battery life is actually at. I had my phone on the charger from 9p-5a, and it only went from 10% to 25%. Not to mention that it loses battery life as soon as I take it off of the charger."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Can only make calls on speaker phone",
      "date": "Reviewed in the United States on July 12, 2024",
      "body": "Product seemed to be in excellent condition when I received it, but shortly after getting it set up I discovered I cannot make or receive calls unless I use speaker phone; the people on the other end can hear me but I cannot hear them through the speaker at the top. Sound quality is poor but I’m attributing that to “downgrading” from a 13 Pro Max.  I’ve contacted the seller and plan to adjust my review if they can offer some assistance, but I’m frustrated as my old phone is non-functional so if I have to send this one back without a replacement in hand, I have to go without a phone unless I want to pay more out of pocket."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beware if not buying the premium renewed.",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "Bought back on July 2024 and had no problems with it during this time, not to many dents, and the screen was perfect. But suddenly 2 days ago the phone shut down and I've been unable to turn it on back again. Took it to a repair shop and the fix is $466 which makes no sense as it's pricier than the phone. Also the renew option only has a 3 months warranty, which pales in comparison to the premium option which is a year.I don't think a phone like this should stop working at before 6 month mark, that is definitely a faulty unit, and well the warranty being that short makes no sense for a renewed product I guess..."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Meh",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "I got it quickly. However, has some blemishes. Overheats a little bit and the charger it came with didn’t work. Used my old one and works fine. Randomly did something during a video call I’ve never seen before."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Purchased for a friend new to the iPhone world",
      "date": "Reviewed in the United States on December 31, 2023",
      "body": "I've had iPhones for over a decade. This one the sound doesn't seem to be as loud as I'd expect, even when you put it on speaker phone.Touchscreen works really well. We got a protector for it to prevent scratches, as well as a phone cover. I consider those standard accessories for any phone.Overall battery life is fair. It is a reconditioned phone, and for a price you can get a new battery installed by someone else, or do it yourself. I've done both. Thankfully Apple has a way for you to tell if the battery is shot. This one was about 20% used, and won't go above that.Easy enough to have an external battery with you.As my friend is new to the iPhone world, he had some questions. Most things he figured out himself, even though he's not technically apt. At all.Facial recognition works really well. I like that it allows you to put in (2) faces. Either one of you without a mask, and one with ... or another person. It doesn't really care.I also like that Apple doesn't send that facial data anywhere. It stays in the phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Acceptable I guess",
      "date": "Reviewed in the United States on October 2, 2024",
      "body": "Shipping was fast from Mobile Supply. Phone screen had ~5 small scratches. Not a problem when viewing content. Arrived with 79% battery life, which was disappointing. Appears to hold a charge ok, but unknown how long we can go with that battery. If the battery came with more life, would have rated higher. Now that it's all loaded and in operation, hate to go through the bother of sending it back. Live and learn..."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone looks great but battery at 86%",
      "date": "Reviewed in the United States on October 30, 2023",
      "body": "I bought this refurbished phone from Amazon as part of their Renewed Premium plan because they insist in the product description that the max battery will be over 90%. I've had bad experiences with used phones in the past so I thought this would be a good way to guarantee a quality product. The phone arrived last night and I set it up this morning. It looks well-maintained and works pretty well so far, but the battery's max capacity is 86%. This is blatantly the opposite of the product description; when I contacted Amazon customer service, they apologized profusely and offered $50 in \"credit.\" I said that was fine, I just wanted the difference between a Renewed and Renewed Premium item (or close enough) but I realized quickly that this promotional credit was not gift card money. I still haven't even received notification that I have the $50, and it's not showing anywhere in my account. I would strongly, strongly avoid Renewed or Renewed Premium products unless you're really strapped and looking to save a few bucks OR you don't mind rolling the dice with a maybe-fine product. Again, phone seems to work OK but it's Renewed at best, nothing Premium about it.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its actually really amazing, But as time goes on it gets bad.",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "This is a great purchase honestly the screen has minor scratches only visible if you shine a light on it i wouldve given it 5 stars but to my dismay the bottom right speaker didnt work. I was hoping for 100% batter life but i got 90% which is great in itself.Edit: Its january 31st and the phone has overheated many times for the simplest things or for no reason at all. The battery capacity fell fast and is now at 80%. The microphone is horrible and others hear it as pixilated audio most of the time.Update March 3rd: I do not recommend this phone. I bought excellent refurbished and 128gb and it overheats horribly"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is locked.",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Not able to use this LOCKED phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hot Phone",
      "date": "Reviewed in the United States on June 23, 2024",
      "body": "When the phone was delivered I opened the package to discover the phone itself, not the packaging or even the box containing the phone, but the phone itself was hot to the touch! I contacted them and was directed to Apple. I found it odd that the phone itself was literally hot. I took the phone to my carrier and once the data was transferred and the customer service worker picked it up to give to me, she immediately said this phone is hot, o suggest you take it to the Apple Store. I immediately went to the Apple Store and after diagnostics were ran it was determined I needed a new battery, which after taxes ran close to $100. My advice, never keep a hot phone, especially if you just bought it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Device is acceptable",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Purchased as excellent condition, received device that was acceptable but not excellent. Battery life was only 78% and had visible scratches around camera and sides of device. Charging port does not work, tried multiple cords besides one that came with phone. Good thing it can be charged with mag charger. Have purchased multiple renewed devices before and this one was by far in the worst condition for being sold as “excellent”."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker Issue",
      "date": "Reviewed in the United States on June 29, 2024",
      "body": "I bought this phone for a Father’s Day gift to my husband. Setup and everything went well, but when a call was made or received the callers could not be heard. If you used speaker or headphones you could have 2 way communication but not hear f you put it to the ear. Took it to Apple and confirmed it had a speaker issue. The cost to repair was quoted as $279 if no warranty. The phone was bought refurbished. Add the repair cost to the cost paid here would have been almost the cost of a new phone.  We ended up trading it in to Apple. Will never make this type of purchase again on Amazon. Would have been better to go straight to Apple. Lesson learned.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A scam",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Buyer Beware! Today March 15th 2025 i received my iphone 12 and it came in bad condition it looks good BUT when ever you buy a used or in this case a renewed premium iphone it comes with a check list telling you what they did to the iphone and battery is 1 of them and the iphone came dead and it should have some charge to it so i plugged it in and at 3% the screen came on so i checked the battery and it said 83% battery so i called Apple support and they told me that when your battery gets down to 80% on the battery life you need to have a new battery put in your iphone and that was not done but Hybrid said the battery was at 90%+ it was not PLUS Apple did a diagnostic and found that the Mid,Rear system compatibility issues for display. Hybrid Did NOTHING to this phone it was NOT renewed in anyway and they are getting it back. So if you have bought one from them you better check your battery from the settings and call Apple support and have them check your phone for problems because Hybrid does not do what they say they do to the iphone's they sell. I will never buy from them again."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone does work with no issues.",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "The phone does work, seems to drain the battery pretty fast though. My iPhone 11 would last all day and I have to charge this one at least 2x a day. Also had a little cosmetic damage, scratches around the edges top right corner as well as the bottom of it. I don’t feel it was worth the $300+ dollars tho. Shop around find it cheaper and get moneys worth."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    a bit disappointed",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "i paid for excellent quality and the battery health came like this and the phone heats up pretty quick sometimes, otherwise good condition no scratches or cracks.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Physically excellent, Internally not so good",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "The phone came in physically excellent condition, you could not see a scratch on it. However, internally there was an issue. On occasion, the screens would jump back and forth to other screens, games would stop and the keyboard would malfunction. I am not sure if the seller would be able to tell if there were these issues before they sold the phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iphone 12",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "package came damaged but my phone was fine, says minimum battery compacity 80% but mines 77.. idk, its a little slow but overall everything works"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    issues with microphone",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "The phone is in great condition but the microphone isn’t working when making calls, facetimes, or recording video on anything but the camera app. when taking a video on the camera app or recording a voice memo it works but anywhere else it doesn’t work. other than that the phone works great speakers sound good battery doesn’t die fast."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Add 100 dollars to purchasing price",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Buy from them if you only plan on using your device for a year. Battery was bad, underneath the frame the device was put together terribly. Apple had a fun time putting my device together the way it should have been. Hmmm, might be worth it if you’re willing to add a hundred+ of dollars of repairs to your purchasing price. Consider it wisely."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging problems",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "Phone came in decent condition, however the charging cord doesn’t fit.  I’ve asked for a replacement with no luck"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not what I expected for “Good” quality.",
      "date": "Reviewed in the United States on November 15, 2024",
      "body": "I ordered this iPhone when my old phone broke. I was excited to be getting a new phone for the first time in a few years. I was upset upon first even receiving the package, because I could feel the phone loose with other items in the package. It was packed loosely in a zip-loc bag with a bubble wrap pocket, and too much room in the box. There was, loose, a charger and sim tool, which the sim tool had ripped the small plastic sleeve it was in and arrived loose in the box. The camera upon inspection has a scratch in the lens going right over the center of the camera. The other camera has gouges around the lens. Around the edges of the phone, it appears to have been dropped multiple times, with gouges out of the corners, not just scratches. There is also a spot on the back where the glass appears to have been chemically etched by a spill of some sort. The spot around the cameras upon arrival was filthy and covered in what appeared to be grime left behind from the previous owners case, since this is a refurbished, “Renewed” phone. There side walls of the phone are flecked with spots of missing paint as if it came into contact with some kind of acetone or paint thinner, which would explain the etched spill mark on the back glass. The protective screen around the microphone also was missing from one of three holes on the bottom, meaning dirt, grime, dust, etc. can all freely blow into the phone. There are also minor scratch marks in and around the charging port, and the charger feels loose inside the port as well. For a refurbished product listed as “Good” quality, I am highly disappointed, as this is not just cosmetic damage. I haven’t even set it up yet, as I will most likely be returning it.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent",
      "date": "Reviewed in the United States on August 27, 2024",
      "body": "Arrived today, overall looks great except several groups of scratches on the screen. They look like razor blade marks in clusters. The battery is at 100% health so that’s nice. I haven’t activated it yet so I will update when I do. I have noticed the battery drops significantly randomly while charging which leads me to believe this has a faulty battery or a cheap one installed considering its 100% health. The last two phones I have ordered from this seller were the same way. Bad batteries."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Little disappointed",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "I purchased 2 phones renewed in excellent condition. I waited 4 days for them to arrive. When I opened the box I could tell just from the condition of one of the phones boxes that something was going to be wrong with it. The one phone was exactly as it said renewed in excellent condition absolutely like new. The other one as soon as I took it out of the box I immediately noticed a small crack right on top of the facial recognition censor. However it still works. The charging port is worn unless I’m using a new charging cable it will not charge. And the volume down button is so week that I barely touch it and the volume turns down super fast. Somehow under the screen is a thumb print size circle which you don’t notice unless the screen is off. So to whom ever reads this be sure to buy the warranty with this from this seller. Chances are your going to need it.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DISAPPOINTED…Speakers don’t work",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "UPDATE… the speakers are terrible. I can barely hear notifications, I’ve adjusted my settings several times, powered off and on several times and still nothing. I researched on YouTube and followed the suggestions and still nothing.I read all of the reviews and decided to take a chance in purchasing this refurbished iPhone. I’ve never bought a used phone before and didn’t want to spend a mortgage payment on one. Price was amazing.No scratches, had a screen protector already on it and 93% battery health. The only issue was the charging cable and port that came with it wasn’t an iPhone product so it caused the phone to heat up… I replaced it with my charger and it’s charging perfectly with no heat up at all.I transferred everything myself which was so easy and saved a $35 activation fee from my carrier. I definitely would recommend this product… it came with a 90 day warranty and a personal message/email from the seller.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be safe",
      "date": "Reviewed in the United States on August 7, 2024",
      "body": "I wish I would have did a review sooner.. but the battery dies kinda fast and charges slow the screen gives me problems sometimes with the touch like I have to touch a lil harder or something. If the phone not in my hand n I try n use it it won’t work or again I have to touch it really hard I wish I would of did a review sooner but I didn’t use the phone for 2 weeks after I got it",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Look like a brand new phone",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "I bought two phone from the same seller and the red iPhone 12 is beautiful with 89% battery life and no flaws. The other one, a blue iPhone 12, have 85% battery life and dirt in the charging port. Everything is fine but the phone won’t charge and the lighting wiggle back and forth. I cleaned the port and now everything works fine but the quality control is pretty terrible. It comes with “Ashley” charger and cable theyre work but not great."
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone 12, 64GB, Black - Fully Unlocked (Renewed)",
    "asin": "B08PP5MSVB",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Fully unlocked and compatible with any carrier of choice (e.g. AT&T, T-Mobile, Sprint, Verizon, US-Cellular, Cricket, Metro, etc.).",
      "Inspected and guaranteed to have minimal cosmetic damage, which is not noticeable when the device is held at arm's length.",
      "Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.",
      "The device does not come with headphones or a SIM card. It does include a charging cable that may be generic.",
      "Tested for battery health and guaranteed to have a minimum battery capacity of 80%."
    ],
    "boughtCount": "4K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$198.00",
    "url": "/gp/offer-listing/B08PP5MSVB/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B08PP5MSVB",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "Apple iPhone, USB Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$200.00",
    "listPrice": "$253.80$253.80",
    "savingsPercentage": "-21%",
    "standardDeliveryDate": "Friday, March 28",
    "primeDeliveryDate": "Monday, March 24",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}