{
  "asin": "B0CP6DDN1H",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing! Great price, speed, cam quality (kinda), and everything else!",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "I learned about this phone in a youtube review, which claimed it was one of the best phones in 2024 for such a low price range. I'll admit, I was skeptical at first, but when I bought this it changed my mind. I had a Samsung Galaxy a10 previously, and it kind of sucked. This phone fixed all the issues I had with my old one.  The camera quality is nicer, it has more storage (55 GB), it can run/load any app a lot faster, the battery is AMAZING (I lost 20% in an entire day (however I'm not as active as other people with their phones so take that in mind)), and has a lot of nifty features that you only realize when you actually have the phone. It alerts you when it reaches your normal bedtime, the brightness changes automatically to fit your schedule, it has fingerprint unlock, and you can customize the phone any way you want. The company could've charged any price they wanted, and I'm glad they didn't. This is an amazing phone when it is your first one or when you're upgrading from a trashy one, and the price gives you a lot of bang for your buck.",
      "helpfulVotes": 39
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    VOLTE equipped Moto 3 is a quality product at a low price",
      "date": "Reviewed in the United States on March 29, 2024",
      "body": "The Moto G Play 2023 (unlocked) cost me $100  and serves as a great replacement for my UlePhone  P13 with Andriod version 11. The Ulephone had failed due to a leaky battery.The Moto G was easy to set up. First, I opened up the box and noted that the user manual had a \"quick start\" manual that was too brief.  As per the quick start leaflet I put in the memory card and the sim card from my old phone. The battery showed a 60% charge so I immediately shut down the phone and charged it up to 100%.  Meanwhile I did a search for \"Moto G Play 2023 User Manual\" and downloaded the 62 page  (very useful) \"User Guide.\"  Be sure to get this manual (is is a pdf file) and it is full of  information.  The old SDcard needed to be reformatted and this manual tells how to do this. The Moto G has an Andriod 12 operating system and has \"VOLTE\" which is a requirement in our area for using the local AT&T cell towers.VOLTE give you more range and greater clarity than the old communications protocol. After about 90 minutes of charging I was at 100% and I did the initial; startup procedure  described in the downloaded manual.  The phone connected to the AT&T tower with no problems.  I made my first phone call and the sound level was more than adequate.  I have a hearing disability so I expect most people would say that the phone is 'loud.\"  I also downloaded a Kindle book  ($2.99)  that told me details about using Android 12. If you want the book  do a search on the Amazon site for \"Android 12 user manual\".  Most people will not get this manual but I am happy to have the extra information provided in this well-written book about the Android 12 OS.  I bought the Moto play because I needed a phone and did not care about playing games, reading kindle books, or \"living on the phone.\"  The Moto G can do all of that but you would be better off to buy a much more advanced unit that costs several time as much as the Moto G.  I much prefer using a separate (large) Kindle for reading, a  dedicated gaming computer,  and  desktop computer with multiple screens for other activities.  Overall, the Moto G does exactly what I wanted (a good phone)  at a reasonable price.  I also downloaded a few apps from the app store and they worked properly.  I rate this phone as being better than expected and well worth the low price.",
      "helpfulVotes": 95
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's alright",
      "date": "Reviewed in the United States on July 10, 2024",
      "body": "It has very limited storage space. (I mean Facebook and Snapchat almost take up the majority of space) it also can get a bit glitchy and laggy.The camera is very nice.The sound quality is very good and loud, calls are also very loud and audible.The responsiveness time is right as long as you don't have an abundance of things on it, as I said about the limited storage.I have yet to test the scratch resistance on it because obviously, I bought a phone case and rarely drop my phone.The value for money is pretty good, not perfect but it's good if you have a budget.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impressive, Quality Device - Unbearable Bloatware Ruins IT!!",
      "date": "Reviewed in the United States on May 8, 2024",
      "body": "How many apps do you think you have on your phone? 40? 50? how about your phone from 2 or 3 years ago? 15-20 tops? LOL  ah, yes the days when we got excited to get a few free apps or games on our new phones... alas those days are OVER bro! get you a variation of the moto g device family. Out of the box, she is pretty amazing. I didn't have a single complaint really. Super fast, tons of storage, great camera, new updated apps, lots of customizing, etc. JUST WONDERFUL. After a few months it happened, the dreaded update in April I think it was, maybe March, I now have 400+ apps. (I will attach a pic, it shows 399, there have been about 30-40 more that have trickled in since the initial dump, which took about 5-7 days to finish up... and 75-80% are \"system apps\" (bloatware from any and every carrier in fact.... ALL. OF. THEM.) For example, a bluetooth app for t-mobile, & verizon, & sprint, & metro, && cricket. Before you say, \"just uninstall them and move on!\" - I did. I have. I've factory reset twice and they're just BUILT INTO THE phones disk memory. There simply is no \"delete\" them. Some of them, as duplicatory as they are, messing around with them can still brick up your jawn within a few clicks... and before you even start, you are not a dev... so chill, I mean neither am I... but you just stay out of that menu, that app, and that folder. Really, who knows why they name everything in tech sketchy stuff like \"com.sys.IM-WATCHING-YOU-PAM.000\" and \"<%real/secret/23-LISTENER999>... but anyways... JUST PROMISE ME, YOU WON'T GET INTO THAT APP, OR FOLDER.... okay?So Motorola should reimburse me for having to put myself through IT school to teach myself to operate on this phones guts and remove all these garbage apps manually to create the phone I thought I purchased. All you can do is force stop and disable them. Buuut I still feel like they are gathering data, bc, why wound't they be. Its not just this model either, my partner has the moto g stylus 5g and its even worse on theirs. the play store basically never gets a break from constant updates (and then theres the transferring of precious data to the mother ship)yeaaaa we also had to upgrade our home internet plan and router because of all this. We couldn't both use the wifi at the same time doing anything at all. it was crazy. allllllso the apps are gathering intense amounts of data and ALL WANT crazy permissions that have nothing to do with the app itself. like the calculator wants camera permissions... nuts. The sheer number of apps that require making system changes or having total device control... it was too much. I would almost ask for a refund, but from what I see these days most phones are leaning that direction, making money off our god given ones and zeros.... and then still try and look at us in the eyes while they sputter out the retail price of the next generation of your favorite device. can't even hold it down on a free case or something..THEN - - when you finally get a break from force quitting and removing permissions that, somehow keep TURNING BACK on... you might have a few minutes to enjoy a quick photoshoot. NOPE. the camera app it comes with stinks, it just soooo basic.. so then you think, oh, i'll download a cool camera app off play store... NOPE. theres a fricking governor on the camera. That makes it so NO 3rd party camera app will get full usage of ALL THE MEGA PIXELS YOU PAID YOUR HARD EARNED MONEY FOR (48 megs to be precise, which is overkill, but still, you will be lucky to get to use 10 or 12 MP!!)Seriously. And JUST as google starts conveniently implementing the awesome 2 step verification, and authentication keys.... JUST in time for you to have to answer to your wife about why you don't have as much info in your google takeout as she does... yikes... oh and squeeze on some more of that exact same conversation about your FB activity as well.. yaaaaay.So, let me get this straight... I now have to REMEMBER ALL MY UNIQUE PASSWORDS && double log in, && verify 3 ways, all to check a notification thats just a promotional email about the new apps GEWG will put out next week. AND then FINALLY the google security come forward to say they don't trust my log in (bc i've got a VPN) - - - (from guess who - G1 - duh!) and they really cant tell the difference between MY REAL actual login on my trusted device from what it must assume is a HAKKr logging in 3 states away. . . . . . E.V.E.R.Y. LOG - INNNN!at this point i am thinking about a jitterbug and some stress eating of sour worms to relax.but yeah the phones cool, other than that.",
      "helpfulVotes": 307
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product, great price",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "I am very happy with my purchase. The main deficiency is the limited storage (64GB) which is easily remedied by adding a micro sd chip.  I added a 1 TB chip plus an official moto case and screen protector.  It looks great and works great with my Consumer Cellular subscription, which runs over AT&T or T-Mobile towers.  Joe Forgeng",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best bang for your buck",
      "date": "Reviewed in the United States on June 15, 2024",
      "body": "I have hated almost every phone I have ever had. While I recognize the need to have a smartphone today, they are overpriced and underperforming and full of useless features that make them less useful and only look good on the spec sheet. That being said, I actually like this phone. It is not perfect. It has a little bit of lag and its camera does not compete with the average flagship model, but at $130, its value far outshines phones that are more expensive. I think what I really like about this phone is that it performs more than adequately and I don't feel like I'm being fleeced by the manufacturer. If you are a conspicuous consumer, by all means give your hard earned money to Samsung or Apple or Google. If you want good value for your money though, give this phone a shot.",
      "helpfulVotes": 86
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Basic phone for basic needs.",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "So, I picked up the Moto G Play 2024 after seeing some buzz online about it being a solid budget phone - and honestly, for the price, it's not bad - the display is decent enough for watching videos , and the sound is surprisingly loud and clear. The battery life is a real plus – it easily lasts me through a two days. The cameras are okay. The main camera takes pretty decent pictures in good lighting, but nothing spectacular. Storage is a bit of a squeeze, especially with all the photos and videos and I've noticed a bit of lag from time to time, which can be frustrating. What also bugs me is all the pre-installed bloatware, a bit of a pain, some can’t be removed and it slows things down. But, for daily stuff like browsing, calls, and basic apps, quick photo snaps it gets the job done. I did like the fingerprint unlock and a few other handy features, which makes life a bit easier. But, if you're a heavy gamer or need a top-notch camera, this probably isn't the phone for you. It's more of a reliable, basic, no-frills option.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great for our needs.",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Can’t beat the functionality for the price.  This phone is pretty durable and works well using Wi-Fi.  If you mostly stream and don’t need a crazy amount of memory or fancy apps this should work well for most people. Bought this for my special needs on its doing great a few months in.  Battery charges quickly and does last long for his uses.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    For $100, it's hard to find a better phone",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "If all you want is a phone that can make calls, watch videos, and use basic apps like banking and messaging, it's perfect. As for the reviews for this product, they're all over the place. People giving it 1 star because their delivery was late, the package was damaged, the phone lags, the camera is \"bad\", or complaining that it's not unlocked. Delivery issues shouldn't be used to rate the product itself. Phone lag can occur for a billion reasons, and I've personally not experienced any. The camera seems fine to me, but I'm not looking for studio quality. I'm not a phone power user, so maybe these are real issues, but I just don't notice them? Regardless, the phone was $100."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is... insane",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "I got this for a whopping $110. Are you kidding me??I bought this as a replacement phone while I was going to get my Google Pixel repaired. It ended up being more than I expected to repair, so now this is my new, permanent, phone. Because I don't see a need to buy a different one.There is a little lag, yes. But honestly, it's not an issue, and not constant.The camera is pretty awful. The battery holds ok, but the charging is slow, very slow.I like to play emulators; it's more difficult with this phone.But beyond that? For $110? Insane. I love some of the features, like the fingerprint unlock on the power button. Shaking the phone to turn on flash. Three fingers to screenshot. The gestures that were on my Pixel (swipe left/right for the back button, etc).It doesn't have the text search function like the Pixel. I do miss the convenience of automatically highlighting text the way you can with the Pixel.But again... for $110?? I don't know why you'd get any other phone, honestly. I could not recommend this phone enough. Spent $110 here, and spend the other $$$ on a real camera. I carry a power bank with me, so even though the charging is not ideal, it doesn't affect me. If I really wanted to play emulators, I could just buy an android tablet. Most phones these days are like $700. All that, for what? A nicer camera? Not worth it.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Doesn't stay dark at night, otherwise decent phone",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "It's a good phone. Affordable, easy to use. Battery life is meh, but not abysmal.My only issue (and maybe it's a me thing), it doesn't stay dark at night. Push the button, a few seconds or minutes later it lights back up. Same song and dance all night long. I have no idea what I'm doing wrong. I turn it over, but can still see the light coming through. It doesn't do that during the day. I turn it \"off\" and it stays, even on the charger. No clue what the problem is at night"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great, highly customizable phone with modern features. beautiful sleek design",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Below are some photos of the settings of the phone, the different wallpapers available, the front and back of the phone, and some of the apps included. I had some that I erased, like temu, but the majority is still there. Block Blast game is pretty fun😁.  The phone quality is great, but it is quite slippery. The screen sensitivity is good, it doesn't overheat and comes with a charger. It's not a fast charger, but it's average. It has many advanced features as well, as it did come out is 2024. The phone is kinda large, still fits in pocket but not all the way. It's pretty customizable, but not as much as I would like. Also it hounds you so much about signing in and Google stuff every 5 seconds during setup. It automatically buzzes with each key, but that can be changed which I did. It had cool features, such as picking it up to silence it, turning it upside down to turn on Do Not Disturb, and much more. There is so much to this phone, you'll definitely need a users guide video to help you out on YouTube. The manual isn't very helpful. Great phone, great price! Definitely recommend, especially for kids!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Good Budget Phone",
      "date": "Reviewed in the United States on July 14, 2024",
      "body": "I received this yesterday and have tried it out for nearly 24 hours now. I will be using this as a back up phone.The pluses.Nice big clear and bright screen.I like the case and the color. It looks and feel quite decent,Good, responsive touchscreen with good colors.Good wifi and bluetooth. On screen keyboard is also easy to use.Large battery, I charged it to 100 % last night and its still at 70%Good sound quality and fairly loud speakers.Negatives.There is some lag but that is in comparison to my “high end” main phone but I consider it to be more than acceptable.The cameras have great colors are appear to be over processed.If this was for use as my main shooter, it  would not be acceptable but for the bargain price, and considering that this is  budget phone, both front and rear cameras will suffice.Not too keen on the side finger print reader, it does work and actually responds quite fast, I don’t care for the location.So as a budget back up phone, there are some negatives but I can live with them all.Not; the first two photos were taken with the rear came at high resolution. The third was taken with the front facing camera. The last two were taken indoors in a restaurant setting on high resolution.I quite like this phone. I had been considering a 5 year old phone for a back up…. It still had really good specs but I was concerned about the battery and how much longer it would work. Also there would not be any security updates on an older phone but this is from 2024 and has already done several updates since I first powered it on, and it is due to be upgraded to Android 14 later this summer. ( I mention this because there are surely other folks looking for a budget back up phone.)Also, since I don’t play any games, I cant offer any opinions in that respect.For a back up phone, its ideal and I recommend it!",
      "helpfulVotes": 84
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Price but...Phones these days are less about the user and more about being used.",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "The unbelievable amount of configuring and disabling to get this intrusive garbage from constantly nagging you is a nightmare. I can't recommend this phone simply because so much of this device is geared toward monetizing you, this is definitely how they make their money back. I was really irritated that the Screensaver app called \"Glance\" doesn't even have a [X] to close the nag window that kept popping up, I had to use the navigation buttons on the phone to bypass it and then eventually had to find a way to force stop this app. Its just one of the many horribly intrusive programs that's preloaded and impossible to avoid. Just look up how to remove \"Glance\" Lock Screen. It's unbelievable that not even your lock screen is safe from advertising. GROSSLY PATHETIC. And all the Google settings you have to disable to keep your apps from sending info to google to send you \"SUGGESTIONS\" What a load of crap. I've used cell phones, just like so many people on the planet without google telling me how to use it. I know what a browser is, I know how to use one to find stuff I want, that's where it ends. NO I DON'T NEED OR WANT YOU GOOGLE. F the F OFF. I try not to even use the G-Play Store, I use F-Droid for Open Source Alternatives. And Android makes sure it's difficult to install unapproved apps, but you can still do it with most free software on F-Droid. Honestly if you want to be free of these intrusions you really have to work hard at it. Another thing I found out about this phone is that there is a tiny IR LED that blinks constantly in the upper right hand of the screen, I have still yet to find out for sure why it's blinking constantly, but from what I have read it might have to do with something related to detecting if the phone is near your face or if the phone is in your pocket, but it blinks ALL THE TIME, look at your Moto G Play 2024 phone with another camera and you will see it blinking too. It's disturbing knowing this device is constantly blinking a light. It's strange because it's not a patterned blink it's like a data signal, so would be interesting to find out if this is actually trying to communicate with other IR devices. No clue but interesting. Aside from my paranoia regarding the light, the phone functions for the most part as intended, as a phone and browser and I use it for multiple apps that seam to operate well on this platform. I just don't see myself owning another Android based phone after this experience, it's just more and more obvious that you have less and less control over what your phone is doing. In my ideal world there would be an open source phone where there is nothing hidden from the user. That's not the case here, so many agreements to click through, who knows what this thing is actually doing half the time. I can be certain it's trying to find ways to analyze my usage so it can predict ways of emptying my wallet. Just a shameful digital world we've entered, it would be nice to see an alternative to all this garbage. I'm already looking into rooting and installing a degoogled mobile OS, but I've done stuff like that before and it's just as much a headache but one with less worry regarding apps spying on you. I needed a new phone and the price was right but that is about as far as the compliments can be extended from me. Phones these days are less about the user and more about being used.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Love this phone and the price, it does everything i want from a phone without breaking the bankPlus i love the ring toneHello Motto😂"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    M G play",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "Great phone simple to use. It’s made out of metal and very durable."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Why I picked this Phone",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "I must say I was pleasantly surprised with this phone, after watching a number of video reviews about it being good but not the greatest. Most of the complaints were about the display, not coming with 5G, and being android 13 without knowing if there will be updates for later years to 14 or above. Starting with the display, I had no problem seeing what I was doing while outside in the sunlight, as for the glare, all of my phones had the same mirror effect, I checked just to be sure, I took a picture to see if I could see pixels, and didn't notice anything worth mentioning, as for 5G, to my knowledge its still technically in beta and won't be actually true 5G until at least 2027 or much later. As for being android 13 they are still making apps that work on android kitkat, so I don't really see a problem there and when I checked it showed I was on android 14. The price for this phone is awesome and the quality is much better than I expected in my opinion. The fact this comes with snapdragon makes this phone, well, snappy. I do wish they made it in black but I just bought a black case and I'm super happy with this phone and can seen myself using it for a long time to come.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good value for a phone",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "Very happy with the purchase and the value I got for it . Not sure how long the support on Android and security updates I will get . But I like it so far"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's a fantastic phone for less",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "I love the Motorolla phones!  Why pay more?  It does what I need it to do, anyways.  Great feel.  Fantastic color and resolution, fantastic photos.  Much less blurry than on other phones, I would say top notch.  Everything else in the phone is smooth and fast.  It's beautiful, comfortable, and comes with good stuff.  Good enough battery life, though it does need a charge every day, or every other at best.  I use this unlocked phone with a 30 buck month plan with some data which is more than enough for me, and I wouldn't want to pay more.  Very pleased with the moto g power 5g!  I don't know why anyone would rate it less than 5 star - especially for 150!",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good choice for simple smartphone",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Arrived exactly as described.  Easy to set up.  Sound quality, speed, battery life, screen quality are all good.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Indestructible and quality phone",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I bought this phone back in June after replacing the first one because I lost it out in the woods.Again, I am out in the woods using this phone as a flashlight, I shut out van hatch on it forgetting it was up in the slot.How in the world does this phone continue to be usable??? I have no idea I am shocked!It has been a great ohine, decent pictures, does the job you want a phone to do.If you need a cheap phone that is basically indestructible, this is the phone to get!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I ordered a NEW phone, NOT a \"Used - Like new\"",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "I was very disappointed when I opened my Amazon package only to see the phone box had been already open! The box seal sticker had been ripped and resealed over with a transparent sticker for resale. Even so, I was curious and carefully opened the phone box to see it had clearly been used due to the finger strokes/scratches on the phone's peelable screen cover! (Nothing else in the box appeared as if it had been touched though, such as nothing else was ripped or peeled and the charging cord was still neatly rolled up.) I had bought a NEW phone, NOT a used one, so why was I given a visibly used phone?? At this point though, I didn't have the time, patience or luxury to buy a new one, because I was in desperate need of a working phone and didn't wish to go through the hassle of returning it. It must have been luck, but thankfully, apart from how the phone appeared, it worked like a new product; no slow battery, had to set it up, etc. I do like it now after about a week of usage; I'm impressed with how well it performed for such an inexpensive phone and it's also unlocked for any phone service. This is a great phone if you're on a budget or  a nice starting phone for your kid(s).Anyway, I'm still pretty certain the phone given to me was a returned item and I would be sure not to buy again from here.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "A great buy  Feels good in my hand would buy again",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly as expected :)",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "This is my daughter’s first phone. We had issues finding an unlocked phone that would work with our carrier but this one did just the trick, and it was actually unlocked too (some comments said theirs wasn’t) .it came in good condition, not broke. No scratches or cracks.. it all works.  This was absolutely worth the price!! It works perfect for a first phone. The camera quality is not the best but you get what you pay for. She can call, text, play her games.. it has all she needs and it works with the parental controls through google family link.  100% recommend.It came with a usb charging cord but not the outlet box.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'll never go back to that fruit",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "I have been a diehard iOS user since about 2009 and would never even look at Android. I was put in a position that I needed an unlocked device and between paying $1000 for one of those others and about $100 for this Moto, I couldn't pass it up. I seriously have not been disappointed nor have I regretted my decision. I don't think I'll ever go back. It even connects to my air pods via Bluetooth. It's taken a little bit of play and experimenting to get it exactly how I like it but it's so easy to try it out. I think the only thing I wish were different would be the notifications sounds and the ringtones. That was frustrating and annoying. But still $1k or $100.... I'll deal with that while I'm spending that other $900.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seems like a downgrade ...",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "... from previous G Plays.  The aOs is solid."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nothing Spectacular",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Phone is mediocre.  I gave it to my 90 yr old dad and works just fine for him.. excpet the battery does n't last 10 days like it did with his flip phone.  He will just have to get with the times I suppose.  Bloatware wasn't excessive if YOU DO NOT ADD IT WHEN YOU ARE SETTING IT UP.  It asks you if you want tic toc and a bunch of games, IF YOU DON'T SAY NO, well then YOU are the reason its full of bloatware.  Don't expect a speed demon.  Patience Patience Patience.. but better than the moto g I had in 2004 and about the same price.  If you want top notch.. then pay for it.  If you want to spend a hundred bucks, this phone is that hundred dollar phone."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I can't give a review on something I haven't use yet.",
      "date": "Reviewed in the United States on December 11, 2024",
      "body": "I wanted one phone some how I ended up with 2 phone all I need is 1 please take back 1.thank you. And I like it, looks like it can do what I want it to do."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works with my phone carrier",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Its NOT a Samsung."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great kid phone",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "My son broke his phone and needed another one fast. This one was our third pick as the first two phones that claimed to be unlocked werent. This was unlocked and in real good condition. Not works great and is cheap enough to replace if the boys mistreat it."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheaper Than The Phone Stores!",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Absolutely never pay for big name carrier mark ups again. I was sceptical as most of us are buying online sight unseen, but I can completely attest that this phone works with Verizon prepaid network, for me it did anyways. Got as a gift for my son who so happened to conveniently crack his screen badly on the current phone, a few weeks shy of Christmas no less haha. I wanted to make sure the phone worked and didn't want to wait till Christmas morning to find out or for him to be disappointed. Wait until he went to bed turned his phone off swapped out the Sims and simply turned it on follow the prompts for normal phone setup simple as that phone calls worked text messages worked and emails worked as well as the internet 100% recommend buying unlocked phones of quality.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Been usen. For a few months now",
      "date": "Reviewed in the United States on November 27, 2024",
      "body": "Battery lasts longer then I thought almost but not quite 3 days being carried every day  wish it had a lil more space I got it for my kiddo that started  middle school this year he's been carrying it pretty much every day  dose lag a bit  but I think it's mainly cuz he's out of space lol still works tho still lagged when I first got it a lil but not like it dose with no space  , I charged it  and kept it up for the first week  till I got his sim card Battery barely moves if it's not being used id dare say it might last close to a month just sitting  idle  would be a good phone for an older guy or gal that don't play on there phones like the younger generations  itd last quite a while without needing charged  looks like the photos and theres a few cases on here to choose from to put on it too",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The best phone I have had in years",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I purchased this exact phone for my mother and loved setting it up. Well the next week my phone died and I'm glad it usually takes me a week to decide on a phone but I need I loved this one and so does my mom. Love the camera!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sufficient.  Speaker volume good. Good visibility in bright sunlight.  Camera fair.",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I wanted an inexpensive phone and had the Moto g-play 2021.  The security features (except PIN) aren't reliable at all (touch sensor, face ID, and \"safe places\").  So if you rely on those features, this isn't the phone for you.  It has plenty of memory for the apps I use and I installed a SIM card for photo storage.  I think the 2021 screen features (esp the clock) were more aesthetically pleasing.  One plus - I can SEE THE SCREEN in bright sunlight.  It was nearly impossible on the 2021 model.  Volume control is good (I have a deaf ear), but the phone external speaker quality doesn't seem as crisp as the 2021 model either.  Voice pick-up from across the room is good and the phone receiver is good. I often need to turn the volume down when listening to help improve the clarity.  Camera is fair but I don't take a lot of photos.  Not at all bad for a less expensive phone (but was considerably more expensive than the 2021 version... Like everything else is today).",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is meh",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "I've been using this phone for about nearly a year now, the fingerprint sensor stopped working and resigering my fingerprint within 6 months of having this phone and the camera is Honestly pretty blurry in general unless you get very close and personal with what your photographing. The phone turns on and works fine for calls and scrolling Instagram. However with games, streaming music, watching YouTube and or texting or typing, it lacks a bit. The keyboard is either slow to react, doesn't type at all, or \"ghost types\" (Registers your typing but you can't see what your typing) or all three. It can freeze up and be stuck on one page for a while too, it can take up to a solid 2 minutes and a half for it to start working again. It's terrible with games that require more then tapping and can crash really easily, same with streaming music and watching YouTube. It can also crash uploading photos to other websites (like profile pictures, things like that) it's a very buggy and finiky phone. The phone works as a phone but it lacks on so many aspects besides calling and speakers. I'll also give it that It holds a charge for at least the full day. But with all the bugginess of it, it's just irritating to deal with to say the least. This phone is quite literally meh. It's a pick your poison situationship with this phone. Not bad but also not good, buy at your own risk I guess. I'm going back to Apple once I'm able to.",
      "helpfulVotes": 36
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I can’t think of anything",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Hello, I love the phone was it supposed to come with a plug, what came with it was the cord. I was wondering because I never had one without the plug. Thank you!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone. But some issues.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "For the most part I love the phone. It works pretty well, the battery does last three days without needing a charge for me. The only issue that I have  with this phone is when I try to use lyft and uber the app freezes my phone and then it shuts off and won't turn back on or do anything for a few minutes normally but last night it was off for 8 hours. Other than that issue I do like the phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent for the price.",
      "date": "Reviewed in the United States on October 26, 2023",
      "body": "Good phone, all is good once you figure out what bogs it down. I know this phone doesn't have much ram and I wasn't wanting to pay a huge price for a phone with huge amounts of ram. Onboard storage I'm not crazy about, it is a bit short in that area, but even that can be controlled by using a SD card for all other storage and is fairly easy to change where any downloads or pictures go. This phone does bog down some but it's not so much a phone issue as it is a android issue, app ram hogs. I would highly recommend going to app settings and eliminating as much app permissions as possible and force stop apps you more likely won't use. It's what I did and once I did it, it made a huge difference. This is a Android 12 issue, not a phone problem. Today's apps love that memory, once you reduce the apps usage you spare more ram for loading apps you do use. Phone is nice, works great, finger print reader works really well and side buttons are easy. It doesn't have all the bells I'd like to have but it's also not expensive so I can deal with it for the price. One thing I don't like that it should have is a charging light, so to check it the screen must be on. I can't give it 5 stars as I just got it, but 4 should work as it's a Motorola, a brand that has a good reputation so at least it's worth 4 stars anyways, and hopefully I can keep it at 4 at minimum.",
      "helpfulVotes": 67
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Well worth the purchase!",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "I bought this phone for my mom and I'm so glad I did. She had an older phone and it was time for her to upgrade. Very high quality and well worth the money! The speed of the functions and the internet are exceptional and the phone was extremely easy to set up. She has AT&T and it has worked perfectly for her with her carrier. Sound quality is great and call quality is great as well. Very easy phone to pick up and use. No learning curve if you've already used an Android. She has really enjoyed this phone and I would recommend it to anyone. (For further reference she is 72 years old.)",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad for the price",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "Got this moto g play. To replace a Samsung g14 which I greatly disliked.  The battery life seems pretty good. The speaker phone is nice and loud Which is very important.  The screen brightness colors and clarity is not bad at all. The reception seems good and the Google Android UI is a bit cleaner less cluttered than Samsung. The only drawback I can notice is phone could be a bit smoother when browsing or turning on phone screen some lag at times. Overall not bad for the price. But definitely not a super smooth rocket. Perhaps motorola could do some updates for it to smooth those things out. Over all seems decent",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Durable",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Love it"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone for the price ...",
      "date": "Reviewed in the United States on May 7, 2024",
      "body": "A great phone actually - has fantastic battery life - I don't know what other people are doing ? that say it doesn't ?The size is just right and it's sturdy with good appearance and the camera works fine for me, but I'm a dinosaur in my 50's - and I don't know, I guess today's kids want HD or something ? Takes good photos as far as I'm concerned.The only reason I gave it 4 stars is that it's not as fast as my Motorola G Power was which finally died after 5 years.; but it's fast enough for me.In my opinion, Motorola has the best sound quality during phone calls and excellent battery life on everyone I've bought for the last 20 years.I would buy this again ! especially for the good price and current Android version updates.",
      "helpfulVotes": 31
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "For the price this phone rocks.  Battery lasts about a week on standby.  Has all the features of a good smart phone.  Looks and feels nice and works perfect on Redpocket network.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wonderful for the price!",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Excellent phone for the price. Huge update from the last two years models."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    best phone Ive ever had.",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Ive never had a better phone. This thing is fast. The thing I like the most is the size. Its not massive like most phones today. This thing is awesome."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like it",
      "date": "Reviewed in the United States on November 11, 2024",
      "body": "It's very similar to another device I have so change over should be easier than most."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great! Works with Tello.",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "We bought this phone early in the AM and Prime delivered by the afternoon that same day. It's perfect for what our dad needed in his first phone — yup, it took this long, but he finally did it. Just something simple for calls, texts, and some apps like Google Maps. We needed an unlocked phone to set up a brand new Tello line and the SIM card became active within minutes. No issues. Once there was an active cell signal, we could call and text. Apps and phone updates installed without issue too. Bonus features, this phone still has an SD card slot and headphone jack.Super happy with the purchase so far. This isn't our first moto phone, so we know what to expect in terms of build quality and support. Great phone for someone who isn't a power user or expecting flagship quality.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phones for the price.",
      "date": "Reviewed in the United States on August 21, 2024",
      "body": "I bought these 2024 motorola phones for my wife and I. Great Phones that work and don't cost a fortune. I am not on my phone all the time and I charge it once every 5 to 6 days. If you buy a phone like this and have to charge it every day, well, you need to get a life, you are on your phone too much, there is life out there. I have been using Motorola phones now for over 4 years, my last one was a G-fast. It was still working great but was not receiving security updates. I have to say, this phone is even better then the G-fast, better camera, 64 gb memory over the 32gb the g-fast has. I like the screen set up and function better then my old phone so buying this phone for us was a no brainer. Buy this phone, put some money back in your pocket.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good option for a budget phone, although a bit on the large side",
      "date": "Reviewed in the United States on March 1, 2024",
      "body": "I would give this phone 4.5 stars if allowed, but, as I'm not able to, and it isn't fair to round down, I've given it five. In addition, I bought it on sale for $99, and don't use it as my main phone (instead, it's a device to carry when hiking, etc, as well as for some side business stuff), both of which factor into my review.First of all, this phone is very affordable. In addition, the battery life seems to be great so far. Furthermore, unlike other budget devices I've used in the past, such as those from Blu, this doesn't feel slow, outdated, or anything like that. The screen, camera, and everything else are decent, and for the price, they're great.The phone is very, very large, which for some people will be a good thing, and for others a bad thing. Personally, I don't think I could carry this around on a day-to-day basis, as I'm not sure I could fit it in some of my pockets. For my purposes though, it's not a deal-breaker.The only real, objective negatives that I've encountered so far are some software quirks: initially, the time zone defaulted to China, and I had to manually change it, although after a few days I was able to set it back to automatically update without it switching back to China; the alarm does not consistently sound or go off at all; and the UI for Motorola doesn't seem to be as good as Samsung, or even stock Android.Overall, if you're looking for a budget phone, this is a great option, especially if it's on sale. It's not going to be the same quality as a Samsung Series S or Z device, a Google Pixel, etc, but it isn't really meant to directly compete with those.",
      "helpfulVotes": 65
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good to  go",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Love the color the size , the fact its unlocked, the Price  was fantastic. MotoZilla junior here fits right in.  I'll stick with Motorola, they were , after all, the first mobile out there since September 21,1983. crazy but true. Love the brand and the phones!!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Storage and Wifi calling",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "The device states it's been built with Wi-Fi calling, well this isn't the case. I had too many dropped calls, or the person couldn't hear me. To add insult, it also states that the memory is expandable from the 32GB (or upgradeable)), this is not the case. Although I was able to add an SD card that storage memory is NOT meant for apps or anything that requires phone function (only pictures, music, etc.) and with more than 60% of the memory already filled by factory installed items, that memory runs out with first few apps installed and the fact that the system MUST update itself taking even more space.This is great for a young person or teen that doesn't need to acquire apps, but for a those that almost have to this is not the right equipment."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product ruined by out-of date software",
      "date": "Reviewed in the United States on February 1, 2024",
      "body": "This phone loses a full 3 stars for the absolutely stupid double-line lock screen clock issue.To be fair the issue originated with Google when they made such a horrible idea default without a way to change it in the initial release of Android 12. In Google's defense however they quickly came out with a update that solved the issue within a matter of weeks. Motorola however is choosing to stick with the old version without a fix around a year and a half later.Honestly, I wouldn't have bought this if I was aware of it beforehand. It would have been worth an extra $50-100 not I be faced with this every time I pick up my phone.EDIT: As of Jun 1 2024 Motorola has upgraded to Android 13 which provides the option to turn off the double line clock. Brought my rating up to 4 stars from 2. Motorola still loses a star for taking such a long time to fix this.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Excellent"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Where is my charger?",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "There was no charger in the box."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great option , to not get hit hard on your wallet.",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "Obviously the price was great, does not feel like a low budget phone.  Pretty speedy, and response full.OS got the upgrade 1 month in. The camera is decent, the audio speakers sound very good.  I can't complain about the display either.Great value/performance.Ok there is one thing, but honestly, I can live with our itUnlock other moto phones, this is missing the twist feature that opens up the camera.And that's it, that my only gripe...ha ha a software feature because the gyroscope hardware is not present.  Also does not have two features that have never used, but at the price I bought this for, would not expect.  NFC and wireless charging.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    In a few words, good value but sometimes slow to act . . .",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "The Moto G Play 2023 has impressive features making it a good value. But the value is compromised by the speed. It sometimes has sluggish response to screen refresh and taps. Sometimes response to a tap is so slow a 2nd tap is delivered thinking the first went unnoticed. But it didn't. Now there are two taps registered and both are executed. I placed an unwanted online order because of this glitch. It uses a 10 year old ARM Cortex-A53 processor which was announced on October 30, 2012. Old and slow I guess. Sometimes frustrating  but a good value for an entry level phone, backup phone or for smart home apps.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like it",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Like it"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing features, great camera, amazing battery life",
      "date": "Reviewed in the United States on July 24, 2024",
      "body": "I have only had apple phones for the last 8 years, but I needed a back up phone for day to day use to separate my work and private life whilst on holiday. I have been using my Moto G Play 2024 exclusively for a few days now and I am obsessed. I love it. The battery is amazing compared to my Iphone. My iphone lasts one day at most, this Moto G Play lasts for 3 days easily.  The graphics are crystal clear and I love the features : I can turn the torch on and off simply by shaking it twice. I can take screenshots by putting 3 fingers on the screen. It has the option to shuffle the numerical screen so that no one can copy my log in code by looking over my shoulder. It is lightweight, and slim, and looks amazing.  I have become an android convert overnight. This is a lovely phone, and I highly recommend it.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fantastic Phone",
      "date": "Reviewed in the United States on December 23, 2024",
      "body": "This is my 3rd moto g phone.  I've been buying them since 2015 and each one has lasted 4 years of major traveling and climate differences.  The quality of this phone just gets better and better especially the camera.  The price makes it the perfect phone for traveling because should something happen to it or it gets stolen you won't feel too badly.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Was exactly as it said it was",
      "date": "Reviewed in the United States on January 20, 2025",
      "body": "Did exactly what it was supposed to do. Was unlocked and I was able in my test to get it to connect to at&t network."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NOT eSIM COMPATIBLE",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "If you search on Amazon for an eSIM compatible unlocked Android device, this phone is the top hit. It’s a decent budget phone, but you can’t take advantage of Mint’s eSIM option, which was 75% of the reason I wanted it. I should have asked first. Hopefully this review saves someone the time I wasted myself.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Good Quality Phone",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "Mobile Phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incredible phone for the price",
      "date": "Reviewed in the United States on September 10, 2024",
      "body": "I am 100% Android and only buy unlocked phones under $100. My needs are simple and I tend to break the glass screen easily. Among all the budget phones I have used over the years, Moto phones have remained intact with almost no functional glitches at all. (Except a Moto E4 stopped recognizing sim cards after one year.)G Play 2023 came with OS 12 but was updated to 13 during the initial setup process. Not all phones update your OS automatically.The unit I got was from Amazon Resale for under $80 but looks brand-new in every way. Big thank-you to the person who returned this one in good condition and for the inspection team to repackage it perfectly.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I purchased this for $99 👍",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Unbelievably low price, and works great 👍As long as you don't need high gb'sThis is a perfect all around mobile phone"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad but not great either",
      "date": "Reviewed in the United States on August 19, 2024",
      "body": "Not the greatest of phones but it shouldn't be expected to be at the less than $100 I paid for it.  There is a noticeable bit of lag at times with scrolling up or down the screen and I have to say even my old Android 7 phone is still smoother than this, a lot of bloatware (of the 32GB you'll end up with about 18GB usable depending on what you remove), and many app notifications that need to be shut off.This still isn't a bad phone.  It's also not particularly great either and leaves a lot to be desired, and also probably not the phone for any power users out there.  The phone is not worth the $180 that it retails for but it might be if you can get it for significantly less.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Affordable and totally functional",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "First off, I'm more of a tablet user than a cell phone user. I use phones for basic internet access when I'm away from home, occasional tethering for light productivity stuff on my tablet,  and as a music/podcast/audio book player. This phone does all that and more. Calls are clear with no drops. For 149.99 I couldn't ask for more. Expandable memory is a huge plus since I live in a remote area, so I can download all the audio I could possibly want on my 512mb SD card. Sure, it doesn't have 5g, but there's little 5g coverage where I live anyway. And since it's so inexpensive I am totally comfortable using for a year or two and then getting something else. For me, this has been a great phone for the month or so that I have owned it.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product! Fast shipping.",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "This phone didn't have enough memory and seller took back on return without any issues."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone does work!",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "The phone came in good condition free from scratches or damages and the battery lasts all day."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything was good",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Good phone at a good price"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "no issues, good battery life, overall decent phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for price",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "The phone is great as backup for travel or daily use..  Unlocked for changing SIM cards.  Long battery life."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great gift for my daughter",
      "date": "Reviewed in the United States on September 5, 2024",
      "body": "This has turned out to be a great gift for my daughter. It has been working great so far and when I added a micro sd card now doubled the memory size for the phone which is wonderful for a young person as one could imagine.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone has been great",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "I purchased this phone for my kids first phone. It's been great for him. The battery life is great for him, who only texts, messages and plays games. It looks top notch and the screen display is great. The camera is fine for him, but won't compare to my Pixel.At the price you can get it, it's a great value! He's been using it daily for about 2 months now.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap enough",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Not as good as the 2023"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks Nice",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Needed a new Sims card and having some problems with the alarm clock and opening the phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Value",
      "date": "Reviewed in the United States on August 23, 2024",
      "body": "Had to replace my phone in a hurry, and I was delighted to find that cellphone carriers are now allowing phones from other retailers. Once I started looking on Amazon, I was pleased to find a number of fairly new phones at reasonable prices. I picked this phone for the price and long-lasting battery charge. I been using this phone for two weeks now, and am quite pleased with the quality. There are a few Motorola-specific quirks that I'm getting used to (e.g., can't disable screen lock/pin), but nothing has been a dealbreaker. I'm a bit disappointed that the battery is sealed, but that appears to be the case on all newer phones, so that isn't counting against Motorola.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Touch senstivity remains a problem",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Performance of this phone is mediocre. Touch sensitivity is also mediocre. While the cost of the phone is low, it could be a lot better if they'd improve the touch sensitivity."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Some good stuffs",
      "date": "Reviewed in the United States on September 14, 2024",
      "body": "The back -pack bag is soo puffy and as a back-pack the immigration complains about it, as for the phones, they are just perfect 👌"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    America's phone",
      "date": "Reviewed in the United States on September 18, 2024",
      "body": "It's a good phone. Does what I need it to do, but it is pretty slow from what I'm used to",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "Does 85% of what a $1000 phone will.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente opción de regalo",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Compre este celular como regalo para mi mami y es muy funcional y práctico de manejar para ella 😊El celular llegó en excelentes condiciones."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not enough storage and battery isnt all the hype to me- returning",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "ran out of storage within a few days and also screen was glitching at times being a bit slow; going to switch to the moto g 5g with more storage",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "Good phone good battery life",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "My husband got him a new phone like mine because I love mine. Under 100.00"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone at great price",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "Love that it works and great pics but setup is still going on cuz it has way to many control options."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good phone",
      "date": "Reviewed in the United States on December 4, 2024",
      "body": "I like everything about this phone, the main reason I bought this phone was because I needed a phone with a strong processor / and with good reviewsI have zero complaints. I mean for Facebook / YouTube and online shopping it's perfect, of course I use it for texting and calling I just switched in my SIM card"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Update...",
      "date": "Reviewed in the United States on August 22, 2023",
      "body": "The two biggest downsides with this phone is the sluggish processor and minimal memory. DO NOT buy a phone with only 35GB of system storage. I was getting storage warnings within a month and I don't use that many apps.The next big issue is how it doesn't respond to touches! Initially I thought the phone was froze but it turned out, the slow processor was the culprit. My wife's G Power 2021 with 64GB of system storage has absolutely no issues. I was thinking, \"Well this is a G Play 2023 with the large battery so it should perform at least as well...\". I was wrong. I now have it in a drawer as a backup.I replaced it with a Moto Edge 2021 which has 256GB of system storage and a faster processer. It also has a 144Hz display. Granted, it's a $250 phone but at least it's useable.",
      "helpfulVotes": 29
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looking for an unlocked phone for a good value?",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "The Moto G Play 2024 4G LTE is a very good phone that is unlocked that you can use for any carrier and has a great price attached to it. I use it all the time as my additional phone (I normally use iOS). I honestly really like the color of this phone so I use a clear case. The camera is actually very excellent for the price so as the screen and the charging capabilities."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    glad to have this",
      "date": "Reviewed in the United States on October 10, 2024",
      "body": "I needed a new android device/phone. I wanted something 2024 with Android 13/14.  Did not need a lot of built in storage. So this became available on Amazon prime days.  Cheaper than my old nearly dead android phone when it was new.Set up was very easy and quick.  Much easier than with apple.Transferred my old files.  No complaints no issues no problems.  Easy to use.I'm not using a SIM.  This device only needs wifi for my needs.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't get this phone if you have ever had another piece of technology in your life!",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "This is the worst phone I have ever gotten and I have only had it for three days.If your thinking of getting this phone I advise you to look at other options.Firstly, this phone has been designed by someone trying to meet a deadline. At first it looks good l, but if you at any point dig any deeper you will find a ton of errors.  If you try to change the button orientation you will have go on a reddit deep dive because your not given an option in your settings,if you try to change the wallpaper to something you like that's too bad it will go back to the default the next time you close your phone.If you like listening to music on your earbuds that's to bad, it sounds like trash.If you try listening on a speaker that horrible screeching sound plays when you try to adjust your wired headphones that should have been replaced 3 years ago happens. Oh, and another thing if you idk like your apps to stay open when you use your phone this is not the phone for you.I hope you don't have a time sensitive task because you phone will close right out of it. This phone is also stupidly slow.it will process about half of everything thing you do if you try to type in any that was not made by google.Oh and I forgot to mention that your phone will have every product Google has ever made download on to your phone as well. In addition to that, if you idk use wyze it is not compatible with this phone. And btw, if some says that is is happeing because you need to clear your storage, I have over 6g left of storage.So don't get it if you don't want to put up with any of these problems.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Simple",
      "date": "Reviewed in the United States on September 24, 2024",
      "body": "Great phone. The screens larger than I like but easy to use"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "Bought it for someone and he seems to like ot"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be prepared to receive a phone that has another account attached to it",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "I ordered this phone cuz it said brand new unlocked along with a so-called new SIM card well as they're trying multiple times to activate it on metropcs's app and being told that there's another account to this phone and that the SIM card was no good and if I wanted to get it activated I would have to pay another $38 for a new SIM card and the activation fee so it appears I'm stuck with a useless phone huh but I'm in a tough spot right now , a good return it and wait for a refund but I have to wait 30 days Plus however long it takes to get the money back on my card I'm not going to do that again I don't know what I'm going to do I spent over $100 on junk I can't use unless I hook up to my hotspot with use my other phone and that makes me have to dish out more money I guess that would be the last time I buy a cell phone from Amazon if I had known that there was another account attached to my phone I would have never bought it like I said be prepared"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone... but with some minor bloatware.",
      "date": "Reviewed in the United States on November 5, 2023",
      "body": "For the price, I didn't expect much.  I just bought this phone for taking photos for security report writing, in case anything goes to court, and a lawyer subpoenas my phone that took the photos.  So far, it seems to be decent, and the camera produces legible photos that I can use.  Only one small detail... it comes with some bloatware preinstalled.  I would have rated it 3 stars, but gave it 4, because you can uninstall them.  Apps like TikTok, Snapchat, Home Depot, Booking.com to name a few.  But no Outlook?  All the useless apps, but no Outlook for my work email.  C'mon, Motorola, you used to produce flagship cellphones.  What happened?  Well, that's my review.  Subject to change upon extenuating circumstances.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Avoid Tello",
      "date": "Reviewed in the United States on May 11, 2024",
      "body": "Phone is relatively slow, but given the price, size, and battery life (2+ days) it is not bad on sale under $100.  Beware that with Android 12 in the USA, Tello doesn't work for Wifi Calling, but other providers are fine (at least Mint).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    CLEARLY USED AND NOT NEW!",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "I used to have this exact model phone and it was great. Amazon sold me this phone saying it was new. IT'S NOT! It's clearly poorly refurbished and barely worked. The return process is a pain in ass, and I might not even get any money back because of how they do business. Amazon, you suck!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Long Lasting Battery",
      "date": "Reviewed in the United States on May 5, 2024",
      "body": "The Moto 6 has an excellent, long lasting battery, which is important to me. The phone does everything I need it to do, and, overall, I'm happy with the purchase. The only reason I didn't give it five stars is that, while the volume is more than loud enough, the voice/sound quality on the speaker is a somewhat harsh and tinny. That's the only thing I'd fix.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice low end phone",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "My battery doesn’t last as long as expected. Easy to move data from the old phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone I've ever owned",
      "date": "Reviewed in the United States on October 20, 2024",
      "body": "This phone is great after being a loyal iPhone user for many years I've finally went over to Android and this phone is the best everybody likes Google or Samsung but after trying this I'm hooked moto has a lot of good add ons like Gemini for free plus ezz of use is amazing.I know that's not how you spell was trying to be funny",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    That it does what it needs to do that's all it's important to me",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "Since I bought it for my wife I don't use it much but it appears to work fine and for the money it does everything that it should do for one of this price range",
      "helpfulVotes": 1
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impressive, Quality Device - Unbearable Bloatware Ruins IT!!",
      "date": "Reviewed in the United States on May 8, 2024",
      "body": "How many apps do you think you have on your phone? 40? 50? how about your phone from 2 or 3 years ago? 15-20 tops? LOL  ah, yes the days when we got excited to get a few free apps or games on our new phones... alas those days are OVER bro! get you a variation of the moto g device family. Out of the box, she is pretty amazing. I didn't have a single complaint really. Super fast, tons of storage, great camera, new updated apps, lots of customizing, etc. JUST WONDERFUL. After a few months it happened, the dreaded update in April I think it was, maybe March, I now have 400+ apps. (I will attach a pic, it shows 399, there have been about 30-40 more that have trickled in since the initial dump, which took about 5-7 days to finish up... and 75-80% are \"system apps\" (bloatware from any and every carrier in fact.... ALL. OF. THEM.) For example, a bluetooth app for t-mobile, & verizon, & sprint, & metro, && cricket. Before you say, \"just uninstall them and move on!\" - I did. I have. I've factory reset twice and they're just BUILT INTO THE phones disk memory. There simply is no \"delete\" them. Some of them, as duplicatory as they are, messing around with them can still brick up your jawn within a few clicks... and before you even start, you are not a dev... so chill, I mean neither am I... but you just stay out of that menu, that app, and that folder. Really, who knows why they name everything in tech sketchy stuff like \"com.sys.IM-WATCHING-YOU-PAM.000\" and \"<%real/secret/23-LISTENER999>... but anyways... JUST PROMISE ME, YOU WON'T GET INTO THAT APP, OR FOLDER.... okay?So Motorola should reimburse me for having to put myself through IT school to teach myself to operate on this phones guts and remove all these garbage apps manually to create the phone I thought I purchased. All you can do is force stop and disable them. Buuut I still feel like they are gathering data, bc, why wound't they be. Its not just this model either, my partner has the moto g stylus 5g and its even worse on theirs. the play store basically never gets a break from constant updates (and then theres the transferring of precious data to the mother ship)yeaaaa we also had to upgrade our home internet plan and router because of all this. We couldn't both use the wifi at the same time doing anything at all. it was crazy. allllllso the apps are gathering intense amounts of data and ALL WANT crazy permissions that have nothing to do with the app itself. like the calculator wants camera permissions... nuts. The sheer number of apps that require making system changes or having total device control... it was too much. I would almost ask for a refund, but from what I see these days most phones are leaning that direction, making money off our god given ones and zeros.... and then still try and look at us in the eyes while they sputter out the retail price of the next generation of your favorite device. can't even hold it down on a free case or something..THEN - - when you finally get a break from force quitting and removing permissions that, somehow keep TURNING BACK on... you might have a few minutes to enjoy a quick photoshoot. NOPE. the camera app it comes with stinks, it just soooo basic.. so then you think, oh, i'll download a cool camera app off play store... NOPE. theres a fricking governor on the camera. That makes it so NO 3rd party camera app will get full usage of ALL THE MEGA PIXELS YOU PAID YOUR HARD EARNED MONEY FOR (48 megs to be precise, which is overkill, but still, you will be lucky to get to use 10 or 12 MP!!)Seriously. And JUST as google starts conveniently implementing the awesome 2 step verification, and authentication keys.... JUST in time for you to have to answer to your wife about why you don't have as much info in your google takeout as she does... yikes... oh and squeeze on some more of that exact same conversation about your FB activity as well.. yaaaaay.So, let me get this straight... I now have to REMEMBER ALL MY UNIQUE PASSWORDS && double log in, && verify 3 ways, all to check a notification thats just a promotional email about the new apps GEWG will put out next week. AND then FINALLY the google security come forward to say they don't trust my log in (bc i've got a VPN) - - - (from guess who - G1 - duh!) and they really cant tell the difference between MY REAL actual login on my trusted device from what it must assume is a HAKKr logging in 3 states away. . . . . . E.V.E.R.Y. LOG - INNNN!at this point i am thinking about a jitterbug and some stress eating of sour worms to relax.but yeah the phones cool, other than that.",
      "helpfulVotes": 307
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Basic phone for basic needs.",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "So, I picked up the Moto G Play 2024 after seeing some buzz online about it being a solid budget phone - and honestly, for the price, it's not bad - the display is decent enough for watching videos , and the sound is surprisingly loud and clear. The battery life is a real plus – it easily lasts me through a two days. The cameras are okay. The main camera takes pretty decent pictures in good lighting, but nothing spectacular. Storage is a bit of a squeeze, especially with all the photos and videos and I've noticed a bit of lag from time to time, which can be frustrating. What also bugs me is all the pre-installed bloatware, a bit of a pain, some can’t be removed and it slows things down. But, for daily stuff like browsing, calls, and basic apps, quick photo snaps it gets the job done. I did like the fingerprint unlock and a few other handy features, which makes life a bit easier. But, if you're a heavy gamer or need a top-notch camera, this probably isn't the phone for you. It's more of a reliable, basic, no-frills option.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Price but...Phones these days are less about the user and more about being used.",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "The unbelievable amount of configuring and disabling to get this intrusive garbage from constantly nagging you is a nightmare. I can't recommend this phone simply because so much of this device is geared toward monetizing you, this is definitely how they make their money back. I was really irritated that the Screensaver app called \"Glance\" doesn't even have a [X] to close the nag window that kept popping up, I had to use the navigation buttons on the phone to bypass it and then eventually had to find a way to force stop this app. Its just one of the many horribly intrusive programs that's preloaded and impossible to avoid. Just look up how to remove \"Glance\" Lock Screen. It's unbelievable that not even your lock screen is safe from advertising. GROSSLY PATHETIC. And all the Google settings you have to disable to keep your apps from sending info to google to send you \"SUGGESTIONS\" What a load of crap. I've used cell phones, just like so many people on the planet without google telling me how to use it. I know what a browser is, I know how to use one to find stuff I want, that's where it ends. NO I DON'T NEED OR WANT YOU GOOGLE. F the F OFF. I try not to even use the G-Play Store, I use F-Droid for Open Source Alternatives. And Android makes sure it's difficult to install unapproved apps, but you can still do it with most free software on F-Droid. Honestly if you want to be free of these intrusions you really have to work hard at it. Another thing I found out about this phone is that there is a tiny IR LED that blinks constantly in the upper right hand of the screen, I have still yet to find out for sure why it's blinking constantly, but from what I have read it might have to do with something related to detecting if the phone is near your face or if the phone is in your pocket, but it blinks ALL THE TIME, look at your Moto G Play 2024 phone with another camera and you will see it blinking too. It's disturbing knowing this device is constantly blinking a light. It's strange because it's not a patterned blink it's like a data signal, so would be interesting to find out if this is actually trying to communicate with other IR devices. No clue but interesting. Aside from my paranoia regarding the light, the phone functions for the most part as intended, as a phone and browser and I use it for multiple apps that seam to operate well on this platform. I just don't see myself owning another Android based phone after this experience, it's just more and more obvious that you have less and less control over what your phone is doing. In my ideal world there would be an open source phone where there is nothing hidden from the user. That's not the case here, so many agreements to click through, who knows what this thing is actually doing half the time. I can be certain it's trying to find ways to analyze my usage so it can predict ways of emptying my wallet. Just a shameful digital world we've entered, it would be nice to see an alternative to all this garbage. I'm already looking into rooting and installing a degoogled mobile OS, but I've done stuff like that before and it's just as much a headache but one with less worry regarding apps spying on you. I needed a new phone and the price was right but that is about as far as the compliments can be extended from me. Phones these days are less about the user and more about being used.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I ordered a NEW phone, NOT a \"Used - Like new\"",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "I was very disappointed when I opened my Amazon package only to see the phone box had been already open! The box seal sticker had been ripped and resealed over with a transparent sticker for resale. Even so, I was curious and carefully opened the phone box to see it had clearly been used due to the finger strokes/scratches on the phone's peelable screen cover! (Nothing else in the box appeared as if it had been touched though, such as nothing else was ripped or peeled and the charging cord was still neatly rolled up.) I had bought a NEW phone, NOT a used one, so why was I given a visibly used phone?? At this point though, I didn't have the time, patience or luxury to buy a new one, because I was in desperate need of a working phone and didn't wish to go through the hassle of returning it. It must have been luck, but thankfully, apart from how the phone appeared, it worked like a new product; no slow battery, had to set it up, etc. I do like it now after about a week of usage; I'm impressed with how well it performed for such an inexpensive phone and it's also unlocked for any phone service. This is a great phone if you're on a budget or  a nice starting phone for your kid(s).Anyway, I'm still pretty certain the phone given to me was a returned item and I would be sure not to buy again from here.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nothing Spectacular",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Phone is mediocre.  I gave it to my 90 yr old dad and works just fine for him.. excpet the battery does n't last 10 days like it did with his flip phone.  He will just have to get with the times I suppose.  Bloatware wasn't excessive if YOU DO NOT ADD IT WHEN YOU ARE SETTING IT UP.  It asks you if you want tic toc and a bunch of games, IF YOU DON'T SAY NO, well then YOU are the reason its full of bloatware.  Don't expect a speed demon.  Patience Patience Patience.. but better than the moto g I had in 2004 and about the same price.  If you want top notch.. then pay for it.  If you want to spend a hundred bucks, this phone is that hundred dollar phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sufficient.  Speaker volume good. Good visibility in bright sunlight.  Camera fair.",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I wanted an inexpensive phone and had the Moto g-play 2021.  The security features (except PIN) aren't reliable at all (touch sensor, face ID, and \"safe places\").  So if you rely on those features, this isn't the phone for you.  It has plenty of memory for the apps I use and I installed a SIM card for photo storage.  I think the 2021 screen features (esp the clock) were more aesthetically pleasing.  One plus - I can SEE THE SCREEN in bright sunlight.  It was nearly impossible on the 2021 model.  Volume control is good (I have a deaf ear), but the phone external speaker quality doesn't seem as crisp as the 2021 model either.  Voice pick-up from across the room is good and the phone receiver is good. I often need to turn the volume down when listening to help improve the clarity.  Camera is fair but I don't take a lot of photos.  Not at all bad for a less expensive phone (but was considerably more expensive than the 2021 version... Like everything else is today).",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is meh",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "I've been using this phone for about nearly a year now, the fingerprint sensor stopped working and resigering my fingerprint within 6 months of having this phone and the camera is Honestly pretty blurry in general unless you get very close and personal with what your photographing. The phone turns on and works fine for calls and scrolling Instagram. However with games, streaming music, watching YouTube and or texting or typing, it lacks a bit. The keyboard is either slow to react, doesn't type at all, or \"ghost types\" (Registers your typing but you can't see what your typing) or all three. It can freeze up and be stuck on one page for a while too, it can take up to a solid 2 minutes and a half for it to start working again. It's terrible with games that require more then tapping and can crash really easily, same with streaming music and watching YouTube. It can also crash uploading photos to other websites (like profile pictures, things like that) it's a very buggy and finiky phone. The phone works as a phone but it lacks on so many aspects besides calling and speakers. I'll also give it that It holds a charge for at least the full day. But with all the bugginess of it, it's just irritating to deal with to say the least. This phone is quite literally meh. It's a pick your poison situationship with this phone. Not bad but also not good, buy at your own risk I guess. I'm going back to Apple once I'm able to.",
      "helpfulVotes": 36
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone. But some issues.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "For the most part I love the phone. It works pretty well, the battery does last three days without needing a charge for me. The only issue that I have  with this phone is when I try to use lyft and uber the app freezes my phone and then it shuts off and won't turn back on or do anything for a few minutes normally but last night it was off for 8 hours. Other than that issue I do like the phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Storage and Wifi calling",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "The device states it's been built with Wi-Fi calling, well this isn't the case. I had too many dropped calls, or the person couldn't hear me. To add insult, it also states that the memory is expandable from the 32GB (or upgradeable)), this is not the case. Although I was able to add an SD card that storage memory is NOT meant for apps or anything that requires phone function (only pictures, music, etc.) and with more than 60% of the memory already filled by factory installed items, that memory runs out with first few apps installed and the fact that the system MUST update itself taking even more space.This is great for a young person or teen that doesn't need to acquire apps, but for a those that almost have to this is not the right equipment."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Where is my charger?",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "There was no charger in the box."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    In a few words, good value but sometimes slow to act . . .",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "The Moto G Play 2023 has impressive features making it a good value. But the value is compromised by the speed. It sometimes has sluggish response to screen refresh and taps. Sometimes response to a tap is so slow a 2nd tap is delivered thinking the first went unnoticed. But it didn't. Now there are two taps registered and both are executed. I placed an unwanted online order because of this glitch. It uses a 10 year old ARM Cortex-A53 processor which was announced on October 30, 2012. Old and slow I guess. Sometimes frustrating  but a good value for an entry level phone, backup phone or for smart home apps.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not bad but not great either",
      "date": "Reviewed in the United States on August 19, 2024",
      "body": "Not the greatest of phones but it shouldn't be expected to be at the less than $100 I paid for it.  There is a noticeable bit of lag at times with scrolling up or down the screen and I have to say even my old Android 7 phone is still smoother than this, a lot of bloatware (of the 32GB you'll end up with about 18GB usable depending on what you remove), and many app notifications that need to be shut off.This still isn't a bad phone.  It's also not particularly great either and leaves a lot to be desired, and also probably not the phone for any power users out there.  The phone is not worth the $180 that it retails for but it might be if you can get it for significantly less.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap enough",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Not as good as the 2023"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks Nice",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "Needed a new Sims card and having some problems with the alarm clock and opening the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Touch senstivity remains a problem",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Performance of this phone is mediocre. Touch sensitivity is also mediocre. While the cost of the phone is low, it could be a lot better if they'd improve the touch sensitivity."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't get this phone if you have ever had another piece of technology in your life!",
      "date": "Reviewed in the United States on November 16, 2024",
      "body": "This is the worst phone I have ever gotten and I have only had it for three days.If your thinking of getting this phone I advise you to look at other options.Firstly, this phone has been designed by someone trying to meet a deadline. At first it looks good l, but if you at any point dig any deeper you will find a ton of errors.  If you try to change the button orientation you will have go on a reddit deep dive because your not given an option in your settings,if you try to change the wallpaper to something you like that's too bad it will go back to the default the next time you close your phone.If you like listening to music on your earbuds that's to bad, it sounds like trash.If you try listening on a speaker that horrible screeching sound plays when you try to adjust your wired headphones that should have been replaced 3 years ago happens. Oh, and another thing if you idk like your apps to stay open when you use your phone this is not the phone for you.I hope you don't have a time sensitive task because you phone will close right out of it. This phone is also stupidly slow.it will process about half of everything thing you do if you try to type in any that was not made by google.Oh and I forgot to mention that your phone will have every product Google has ever made download on to your phone as well. In addition to that, if you idk use wyze it is not compatible with this phone. And btw, if some says that is is happeing because you need to clear your storage, I have over 6g left of storage.So don't get it if you don't want to put up with any of these problems.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "Bought it for someone and he seems to like ot"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Be prepared to receive a phone that has another account attached to it",
      "date": "Reviewed in the United States on September 12, 2024",
      "body": "I ordered this phone cuz it said brand new unlocked along with a so-called new SIM card well as they're trying multiple times to activate it on metropcs's app and being told that there's another account to this phone and that the SIM card was no good and if I wanted to get it activated I would have to pay another $38 for a new SIM card and the activation fee so it appears I'm stuck with a useless phone huh but I'm in a tough spot right now , a good return it and wait for a refund but I have to wait 30 days Plus however long it takes to get the money back on my card I'm not going to do that again I don't know what I'm going to do I spent over $100 on junk I can't use unless I hook up to my hotspot with use my other phone and that makes me have to dish out more money I guess that would be the last time I buy a cell phone from Amazon if I had known that there was another account attached to my phone I would have never bought it like I said be prepared"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    CLEARLY USED AND NOT NEW!",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "I used to have this exact model phone and it was great. Amazon sold me this phone saying it was new. IT'S NOT! It's clearly poorly refurbished and barely worked. The return process is a pain in ass, and I might not even get any money back because of how they do business. Amazon, you suck!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    missing information.",
      "date": "Reviewed in the United States on September 30, 2024",
      "body": "Being a senior citizen, I am not totally on top of all things in the phone world. It would have been much better if the fact that the SIM card was not included and the fact that if you have an existing Android phone, your current SIM may work.  Very disconcerting to someone my age!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The quality isn't good",
      "date": "Reviewed in the United States on March 14, 2025",
      "body": "I purchased about 7 months, now the phone always disconnect with call, game, and the music. Not recommended. If you are looking for the cheapest phone at least for 2 years. Go grab the other one"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's ok",
      "date": "Reviewed in the United States on April 24, 2024",
      "body": "Samsung has been my number one love.  Motorola is a close second but this phone though it's okay and it does the job, it's very slow and once I added the apps I needed on my phone it has taken up a lot of the memory and very quickly I'm already needing to expand it. I'm hoping that when I do it will add more speed. Otherwise this phone will be replaced as soon as it is feasible and possible. For now it will do and I do like it but it has a few drawbacks that has me a little frustrated which again is in regards to the speed.For what I paid for it which was on sale for $99 I can't ask for more.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow, but cheap",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "Coming from a high-end phone ( Pixel 8 Pro) it is dirt slow, but I am able to adjust. 5G isnt very impressive in the US anyway, WiFi Performance is fine and I use that 90% of the time."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow and laggy",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "I don't know how this modern processor is this laggy but is agitating and can't smoothly run modern Android.  I would only use this phone if it was sub $50."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awful device, slower than any phone ive ever owned.",
      "date": "Reviewed in the United States on February 6, 2025",
      "body": "The only good thing about this phone is the battery life. Not quite the \"3 days\" they say, but i have no problems when its fully charged lasting me all day. Im giving one star cause this is the SLOWEST phone ive ever used. It is awful and very frustrating to use, full of bloatware, and cant do basic web browsing without freezing up constantly. I cant even watch a 1080p youtube video without the audio and video going out of sync since it lags so much. Apps constantly crash, it takes a good 5+ seconds after hitting the power button on/off for it to actually register. I want to throw this phone off a cliff cause its a terrible smart phone. If you need a basic calling and texting device, this will work. Want an actual smartphone you can use for games, apps, videos and things like that, youre better off saving your money and getting something better. Wouldn't even bother giving this thing away to save others of the frustration of this terrible device. My new phone will be here in a few days, after that this is going in the garbage.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality, low price, bad camera",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "100 dollar camera. Don't expect it to do things, like shoot video, well... or photos... etc..."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone but false advertising",
      "date": "Reviewed in the United States on August 6, 2024",
      "body": "Bought for daughter, phone works fine but it was not a new phone out of box. Had issues because it was linked to someone else's number. Luckily our phone company was able to resolve, but it was sold as new",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A decent phone for beginners of Smartphone or for basic use with minimal applications",
      "date": "Reviewed in the United States on April 1, 2024",
      "body": "Moto G Play 2023This phone is sleek and handy. Good to use. It's pure stock android. Display is nice and camera is pretty decent.The phone is for basic use and for smartphone beginners.This isn't capable to handle multiple tasks and it becomes slow while you switch or swap between 3-4 applications simultaneously.I tried using Whatsapp, Spotify and chrome browser in parallel and it becomes slow and starts lagging on speed.The camera is nice for daylight photos (attached).Front camera is good enough for video calls.Doesn't support 5G.Doesn't have dual sim compatibility.Doesn't have wireless charging.Doesn't have fast charging.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Step Backward; Screen Too Small",
      "date": "Reviewed in the United States on July 21, 2024",
      "body": "Screen is a full inch smaller than the prior years for the same model.  An inexplicable backward step.We ended up purchasing a refurb 2022 Moto Stylus model from Amazon instead, for roughly half the price.  (Seems to be new, in box, etc.)Love the Moto Gestures and Moto G line pricing, but they make some really questionable design decisions.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functioning Disappointed 😔",
      "date": "Reviewed in the United States on June 22, 2024",
      "body": "The price was good but I expected more than what I paid for. I think. From the time I first used the phone it was slow running when it came to the internet as well as the touch screen seems to run slow it takes three times me touching the screen for it to finally respond I'm not sure if that is because of the phone or because of the extra glass that got put onto it by me through a recommendation by Google for a phone case it came with the glass. The phone how everything to be running slow and be delayed quite a bit before I even put the new glass on so I believe something's wrong with the phone I'm not sure. I went from having a stylus 5 Moto g 4G/5G to this phone and there's a too much of a big difference between the two I should have got the same phone I had last time then I would be happy with it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The storage is only available as portable storage, not internal storage",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "I know that the content of the title seems like a nitpick, but it's not. This is a missing feature that makes the phone unpractical for anything other than true burner phone use. The phone only has 64GB of storage which is not enough for messengers much less as a practical phone. The SD Card should solve that, but because it's only available for portable storage (and not as internal storage), it can only be used to store files, not to store apps or app data. It can only store app content for apps which support sd card storage to portable sd card storage. afaik that list includes, Youtube, Netflix and the camera app. So it's a total waste of the sd card slot. And as a result, my phone can only hold apps up to to the 64GB, not including the sd card. So there's a lot of apps that I can't install on the phone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very slow and unresponsive",
      "date": "Reviewed in the United States on July 22, 2024",
      "body": "If you are looking for a phone that take an entire minute to open Facebook messenger, or if you’re looking to wait 10 seconds for your phone to respond to a tap; then this is the phone for you! It is so bad that old apps like Pokémon go crash, and don’t bother trying to get it to track your movement or open up AR features. (Ar doesn’t work, and the motion tracking lags then crashes.) I can not express how terrible this phone is, the UI crashes about every time I attempt to send or respond to a text. When I’m reading articles and things like that it freezes and won’t let me scroll down. It will eventually scroll down super rapidly and crash my browser after about 15 seconds of waiting. I have never left a bad review before, but this phone isn’t even worthy of a single star it is terrible. If you want a faster phone I’d look for something like an original black berry phone or the original flip Motorola razor. I’m telling you this thing performs about as well as the old school smart phones before 4g connections. It is very very slow, and I wouldn’t recommend it to anyone unless they were insanely patient and don’t mind waiting 15 seconds for your phone to respond to a tap. In case your wondering I had to put the phone down, and use my iPad because it would probably take around an hour and a half to type out this simple review.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Budget Phone with Decent Performance for Basic Needs",
      "date": "Reviewed in the United States on September 13, 2023",
      "body": "Pros:Affordable priceUnlocked and works with most carriersUSB-C charger includedDecent screenFast and accurate fingerprint sensorCons:Comes with a lot of bloatwareFront camera is just okayRear camera is poor, with no image stabilizationMic sounds robotic and tinnyCan struggle with modern appsOverall:This phone is a good option for budget-minded users who need a basic phone for calling, texting, and browsing the web. However, the camera and performance are not great, so it is not suitable for users who need a phone for more demanding tasks.If you are willing to spend some time uninstalling the bloatware, this phone can be a decent option for the price. However, if you are looking for a phone with a better camera and app performance, you may want to consider the Samsung Galaxy A14 5G.",
      "helpfulVotes": 22
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good starter phone but misleading description",
      "date": "Reviewed in the United States on May 15, 2024",
      "body": "This is a decent starter phone but the description is misleading... The section that states:\"32GB built-in storage. Get plenty of room for photos, movies, songs, and apps—and add up to 512GB more with a microSD card\"You CANNOT run apps from the SD card. With all of the bloatware and the addition of 4 or 5 apps, that 32GB built-in storage vanishes very quickly. So although the phone has decent features and, yes, you can store \"up to 512GB\" of photos and video (not apps) on a SD Card, it becomes useless very quickly."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trash software.",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "If this had Motorola software, it would be nice. Immediately out of the package it’s downloading 56 (56!!??) google apps, that I have 0 use for. Another phone that is purchased and used to “advertise” to me, things I do not want to see, and “keep track” of things un-necessary, with a “google” overlay on EVERY SINGLE FEATURE, including my calls and texts!?? This will be returned, or given away. It seems impossible to find a device without “google’s” software overlapping everything. At this point why not just label ALL cell phones “google phones” because you can’t use the actual phone.. Samsung, Motorola, lg, ect ect. They’re all exactly the same. When google is no longer installed ruining these devices and their capabilities, burning up all the memory, and constantly downloading garbage (without request) I will be satisfied.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No nfc",
      "date": "Reviewed in the United States on September 16, 2024",
      "body": "Phone works good. But this phone does not support nfc so I can't use it to tap for payments"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easy to use",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "I did not like that you had to tap twice and it keep talking. It would not stop talking and I cannot switch it over to my company"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    thank you",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "no"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good buy if you like SLOW processing",
      "date": "Reviewed in the United States on February 4, 2024",
      "body": "Good price comes with side effects.... such as slow processing features. You can touch the icon for an app and it's like hmmmm the phone is thinking if it should open the app. Takes like 4-5 seconds to open then about the same time when using the app. Another issue is with Facebook, when I see something that I want to take a screen shot of, I will minimize the screen to activate the screen shot app. Then when I return to Facebook, it refreshes and what I wanted to take a screen of then disappears :-(  I am currently searching for another better and more responsive phone without all the bad issues. Good luck shopping!!!"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Ya the battery lasts long but all apps and content run slow"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slow and steady",
      "date": "Reviewed in the United States on July 2, 2024",
      "body": "I was looking for an inexpensive unlocked smartphone to use for social media live audios. This one for the bill but boy howdy is the performance slow when switching apps or typing in the keyboard. I guess that's what you get for the price.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life is laughable",
      "date": "Reviewed in the United States on March 6, 2024",
      "body": "I haven't even had this phone for a full two months and it will not last a full day. My past two moto phones took years of use to get to that point. The storage is awful. There are a ton of unused apps and processes that I don't know of or want, but I also can't fit the apps that actually plan on using everyday. Let alone storage for photos and the like. My last two phones I was capable of continuously running multiple apps at a time with no issue. Not the case on this one at all. As soon as my phone shuts off, I have to wait for whatever app I'm using to reload every time I come back to my phone. And forget about going back and forth between apps. As you can imagine this makes it very difficult to listen to music or podcasts because they crash as soon as my phone turns off. Very upset with this phone. What a waist of my Christmas Amazon gift card.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A quality cheap phone.",
      "date": "Reviewed in the United States on December 4, 2023",
      "body": "It is well worth the price and does everything I desire a phone to do.  The only negative I have is the screen is somewhat difficult.  I have had to touch an icon as many as a dozen times before it reacts.  I have not installed a screen protector.  Otherwise it is fine.  I have had prior issues with this brand  delaminating most likely overheating when recharging.  I am now trying to only charge 80% or less (which it does quickly).  I have yet to have a problem but it is likely too early to know.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    VERY basic smartphone",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Don't expect much and you won't be disappointed."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Súper lento",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Le dura mucho la batería pero después de unos meses de uso, es desesperante es un teléfono súper lento, no lo recomiendo a menos que solo quieras llamar o enviar un mensaje normal"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned phone",
      "date": "Reviewed in the United States on January 19, 2024",
      "body": "So I had to return this phone because it wasn't compatible. The received the phone back. But I've been waiting over a month now for Amazon to issue the refund. The phone was brand new. All I did was turn it on and stick my sim in it. Then when it didn't connect. I took it out. Put it back in the box and returned it. Soo what is taking so long.Other than that the phone seems like it would be such a nice phone. I wish it would have worked out like it said it would in the description.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Honest Opinion as a Motorola Fan",
      "date": "Reviewed in the United States on February 12, 2024",
      "body": "My favorite phone was the motorola ecruise. I loved that phone. Sadly phone phone died and I had to replace it. I bought the moto g play and I expected it to be similar. I paid 60$ for the ecruise in 2018 and 120$ for the moto g play in 2023. I figured that this updated one should be slightly better even though it was still at the bottom. It is not better. Now in Feburary of 2024 (~6 months later), the phone is impossible to use. I don't have that many apps on this phone but it is running so slow I can't use it. It takes minutes for the keyboard to pop up so that I can simply send a Text! It's glitchy and slow and slow and slow. I have a lot of patience for phone since I typically just buy the cheapest one but my 5 year old e cruise is  space ship fast compared to this 6 motnh old moto g play.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    NO storage.",
      "date": "Reviewed in the United States on July 23, 2024",
      "body": "A great phone, no issues. Does not have enough storage, I can only have a few apps on phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice..but",
      "date": "Reviewed in the United States on August 14, 2024",
      "body": "Phone is nice...however most websites load very slowly"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Advertising a locked phone as unlocked is false advertising!",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "it's not an unlocked phone. it's a trac phone and you need to buy a subscription to trac phone services. Since it can not be activated until scanned at a register designed to record the device. I'd say it has zero value for me even if I wanted to change providers. I simply wanted another phone exactly like what I am already using (got from Best Buy)  only newer and then  reboot the settings. That's not going to happen. What a lengthy hassle for a big disappointment."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Lento y muy poca memoria interna",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "Un poco lento para ver y grabar videos cortos y muy poca memoria interna."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Do not recommend",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "It showed up which was nice. But it's crazy slow and super glitchy."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low end phone. Ok for a backup phone that only sees occasional use.",
      "date": "Reviewed in the United States on January 8, 2024",
      "body": "For $79-99... to be frank its a decent value, just don't expect high end performance from it for modern apps/games/etc.I misplaced my mainline apple iPhone 14 on a trip and needed an urgent temporary business phone until I could get my replacement original phone. This phone fit the bill for less than $100.Some pluses:+long battery life+good for general purpose usage, playing music, chat apps, tik tok, phone, text, email.+headphone jack+big screen+cheap \"brand name\" phone++ oddly enough the best finger print scanner I've used, the little motorola logo on the back instantly picks up my finger print every time immediately unlocking the phone.I recommend getting a otterbox defender basic case with this unit.The bad:-Old processor in a new package, it's a 3-4 year old processor in the unit.-Motorola shovelware installed on the phone.-Setup took a long time to patch even on a fiber connection. Took 2-3 hours before the phone was really ready.-I think there's only going to be another year of OS updates for this phone and then it will be abandoned, maybe some android super tech guys can figure out how to patch this to remove the motorola shovelware and get vanilla android on it and extend support, but its a sub $100 phone so I wouldn't expect that much.-Some lag/delay on UI on some apps",
      "helpfulVotes": 34
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for general use",
      "date": "Reviewed in the United States on August 25, 2024",
      "body": "Lags. Don't press too many function buttons right after one another..."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Angry",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "I ordered this because my phone was about to no longer work. The device is not unlocked. I cannot use it. Canned customer service on my current phone that doesn't work much if the time. They requested a picture. It was sent. Still giving a hard time. I just need a weighing device. I need what was claimed to be sold to me. I bought it in preparation for this. I can't return it after three end of the week and they are dragging their feet."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone with software problems",
      "date": "Reviewed in the United States on February 16, 2024",
      "body": "I ordered this phone for my dad, the phone is perfect for a old person, just the problem is with the software.he just want to call and see videos, the thing is the HBO, Netflix and Pluto is not connecting to Internet over WiFi, just over data, but he always are in home. I expect this problem get fixed for moto.",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    DO NOT PURCHASE",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "This is the worst phone I have ever purchased. I will never buy from Motorola again. I made a HUGE mistake ignoring everyone who said this phone lags. It is a pain in the BUTT just to check messages or do the simplest internet browsing. I cannot even add contacts without waiting forever for it to load. I CONSTANTLY have to restart the phone in order for it to play videos. Overall THE WORST PHONE EVER."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery plug issues",
      "date": "Reviewed in the United States on April 23, 2024",
      "body": "Phone doesn't always charge due to broke and missing prongs in the charger port. Happened not long after purchasing but haven't had a chance to write a review"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery doesn't last long",
      "date": "Reviewed in the United States on April 4, 2024",
      "body": "I accidently ordered the 32 gb and not the 64. Totally my fault. I decided to keep the phone anyways, but now have found the battery takes forever to charge and then barely lasts the day. I will be upgrading soon."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horribly under-powered",
      "date": "Reviewed in the United States on November 2, 2024",
      "body": "I only use this phone for the basics: phone, messaging, navigation.  Even with no other apps installed/running, it is incredibly slow responding.  This is simply because it doesn't have enough processing power to run the Android OS.  It is cheap and solidly built, however."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Temporary phone",
      "date": "Reviewed in the United States on April 1, 2024",
      "body": "It works for a temporary phone but definitely slow and vattery last like 2 days with me playing on it all the time so if u left it alone it would probably last 3 days"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not compatible with spectrum wireless",
      "date": "Reviewed in the United States on February 8, 2024",
      "body": "I purchased this phone to use with spectrum wireless. when I attempted to activate the phone it told me it would not work with spectrum. Issue a side, the phone quality seems in line with cost of phone. Definitely not a premium phone feel."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Miserable",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "Sold me a phone that does nothing but have adds constantly. The phone had a virus so bad that my son can’t even use Facebook messenger to talk to me without adds interrupting our calls. I bought this phone for me and him to communicate. He’s only six. Now I have to go buy another one. Terrible. Smh.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not good for me",
      "date": "Reviewed in the United States on April 22, 2024",
      "body": "The phone drops calls,slow opening apps, have used this brand for years,am looking for replacement after 1 month"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is great, except it is TOO GLITCHY and needs to be rebooted about once a week average",
      "date": "Reviewed in the United States on August 1, 2024",
      "body": "I bought this phone for myself and have used it as my primary phone.Its honestly great in nearly all waysits light, pretty, and plenty fast.HOWEVERit seems to be MORE glitchy than the older Motorola g power 2021 phone it replaced.Maybe this is android's fault?I don't knowAll I know is that when I'm using Maps or Messages, about once a week it will freeze up and I have to reboot it.Technology is so helpful :)**possible sarcasm",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No charger or USB with product.",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "I made a mistake when rating this product as good , it don't come with a charger or USB plugs , you will not be able to use it on the spot not unless you purchase the charger or USB separate. In my opinion buying cell phones from some companies on line is not worth it."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The worst article I have ever received",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "It was a gift for my mother, the first week it worked decently, it started to heat up when I was charging it, then the heating got worse because when my mother used it it felt very hot, it was a gift when my mother came to visit me she left and I couldn't change the phone, test it well before charging it all day and using it all day constantly, it's a new phone so I trusted that it would work well ☹️☹️☹️",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Much better to choose Moto g power",
      "date": "Reviewed in the United States on October 26, 2024",
      "body": "Compared to the g Power, and other phones for that matter perhaps, it functions slowly, and eventually may irritate you. I replaced it with the g Power. Also a pretty weak battery, needing to recharge throughout the day."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horrible service",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "I returned the phone literally right after trying it as i faced issue with volume not being loud on a call.  I didn't get a full refund, $20 was taken out of my refund, even though there was no damage on the phone, $20 was taken away stating it's damaged.  Horrible service",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Only good for basic needs",
      "date": "Reviewed in the United States on November 6, 2023",
      "body": "I am not picky when it comes to phones, but I will say this is my most disliked phone. I'm too lazy to want to set up a new phone right now, and this phone at least takes care of my basic needs. I knew the storage wouldn't be great from the description, but I didn't realize how bad it actually would be haha. I try deleting so many things but haven't been able to get the \"storage running out\" notification gone since 2 weeks after I got it (that was 4 months ago, even with an SD card for photos). I am sure it is a reason contributing to why the phone runs slow. The keyboard is also super glitchy. Not super impressed, but I guess you get what you pay for. I hope to get a different phone in the near future.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would be acceptable if it weren't worse than phones it replaced",
      "date": "Reviewed in the United States on January 9, 2024",
      "body": "My Moto G has been a frustrating experience. It's performance is below expectations. Slow loading, slow response, often it takes multiple taps for the phone to acknowledge what you tapped on. Very bad at switching between tasks. \"Smooth\" will never correlate with this phone experience. Realistically, how high could I set my expectations for a cheap phone? My expectation was for it to be equal to or better than the Moto G7, the phone it replaces, which I think is reasonable. It is comprehensively markedly worse. In my experience with several G7's (both Play and Power models), the G7 had better performance, smoother experience, and even a better camera. Ouch. I would buy another G7 if I could, but there are no reasonably priced new ones available since they've been discontinued. I will not be using the Moto G for long."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone performs fine, except battery life is disappointing.",
      "date": "Reviewed in the United States on March 19, 2024",
      "body": "I did like that this phone is close to what I had, so no learning curve.  The sound is very good also.  But it has been a big disappointment in the battery department.  I have charged it several times, in 3 different ways to make sure it wasn't something I was doing or my charging methods were bad.  But it has performed the same in all 3 methods of charging. I did a test, started the charging process at 9am at 58% battery life, by 9pm it had only risen to 62%.  That's 12 hrs. of charging and it will not charge to 100%. Not sure how long this phone will last me.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Albums",
      "date": "Reviewed in the United States on April 15, 2024",
      "body": "Cannot create folders for albums - got to rely on GOOGLE - my SAMSUNG A71 can"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Out of the box, any video you try to view is glitchy.",
      "date": "Reviewed in the United States on September 23, 2024",
      "body": "I had put off switching out my old phone. I didn't think this new phone would be glitchy with video. I can't really enjoy video on youtube or any app because it starts to turn green with the video and glitch out. I'll never buy a phone off Amazon again. Bait and switch on quality."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk",
      "date": "Reviewed in the United States on May 21, 2024",
      "body": "75% of of the memory is used by unremovable bloateare and operating system apps.  Due to the low memory, it does not operate well.  Of course, when you get a customer service ( that term is used with prejudice) you get a body in another country.  Horrible connection every time while talking to them overseas.Phone drops calls and will not work with WiFi calling.  The touch screen is frequently unresponsive.Called and got the worst customer service.  3 reps, 30 minutes, 0 help and finally just no response by the last representative."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mislead",
      "date": "Reviewed in the United States on September 8, 2024",
      "body": "I paid the price for a new phone and instead received a refurbished phone with someone else's videos and apps installed. Very misleading, if I wanted the refurbished phone I would have chose that option for the lower price. Instead I paid more only to receive a used product. Very disappointed."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not worth its weight in pot metal!",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "They took away this devices ability to move apps to the memory card but kept the memory card capability but nixed the reason people still used memory cards To.store the crazy number of apps that we use these days on a daily basis! Dont waste your hard earned money on this unless you are just getting a kid an emergency phone that is reasonably durable. This version is not for smart phone using people!",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No charger. I mean who needs a charger for their NEW phone?",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "No charger? I did not see that in any description. Why would an electronic device come with EVERYTHING needed to work for more than a day? It's silly to think that a phone would come with everything needed! Buy another brand! The CHEAPEST phones come with chargers!"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very convenient interface, but not durable",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I just started using a Pixel 7 Pro, to replace the Moto G Play that stopped working properly. The interface on the Motorola runs rings around the Pixel -- try activating the camera flash or the self-timer on both phones; simple and easy on the Motorola. Many things are easier on the Motorola: three-finger screen captures. Unfortunately, a good phone should also last longer than five months. The G Play stopped holding a charge for more than a few hours of use, and took longer and longer to charge, making it unusable. The money saved from buying a G Play isn't really any saving when the phone is only working correctly for a short time. My phone previous to the G Play was a G Power and it still works fine, even though it's now a bit slow.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love this phone! Where is a battery charging block though? Wait, it doesnt charge?",
      "date": "Reviewed in the United States on March 6, 2024",
      "body": "I absolutely love this phone. The other reviews complain about battery, it last like 2 weeks for me lol. And complaints about prop 65. But that is any phone. My only complaint is that it doesn't come with a battery charging block. Just the usb-c cable. They used to come with that block but now they don't. I have been buying all motog phones for years. And I must say this is the best one yet. Thanks!I still love the phone. but the major issue is that if the battery drops below 70%, it wont charge unless you restart it. Everytime. not just once. Every time it drops below that percentage, I have to reset phone to charge it.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cell phone",
      "date": "Reviewed in the United States on February 17, 2024",
      "body": "The only thing that I dislike about the phone so far, is that it freezes up and I have to restart it again, because the other person on the other end  can't hear me."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    About phone",
      "date": "Reviewed in the United States on March 13, 2024",
      "body": "It's ok but the storage space is bad and it takes all day to charge. Plus it is only a 3/4 day charge, not a 3 day."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Expandable storage is broken",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "Phone manufacturers have once more decided to boldly go backwards! Making products worse than they did two years ago!I got a motorola phone a couple years ago and it served me well, but it was slowing down and finally got finished off by some water damage. So I decided to replace it. Turns out the newest model doesn't have expandable storage. It says it does, but it doesn't actually expand anything. You cannot put apps on the expandable storage, so the tiny internal storage is all you get. I thought 32 gigs was fine because expandable storage would make up for the shortfall - NOPE! Because motorola decided to make an \"upgrade\" worse than the previous model.Way to ruin a good thing.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    not what it claims",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "I purchased an UNLOCKED phone............ unfortunately for me it is LOCKED!!!! I can't use it and I can't use my old phone either due to my needing a code that is sent via text to the NEW phone...",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Immense amounts of spam built-in",
      "date": "Reviewed in the United States on September 28, 2023",
      "body": "I bought this for my work phone, and was getting numerous alerts about shoe sales and postings on how to \"mindfully\" do this or that.  IMO one key to being mindful is to shut down all the alerts.  Once I shut down the built-in shopping alert app, another app stepped up and started delivering the same junk alerts.  I had to disable alerts from 5 or 6 apps just to get the noise to stop!Also, YouTube is continually running, and you can't shut it down. (I wonder how much Google paid for that feature.)  Just swipe to the right, and YouTube is already pre-loaded for you (and any active app can track you as well).  The Recent Apps list doesn't list YouTube, so you can never shut down the app!If you want to be a tik-tok-head and spend all your days watching how everyone else ties their shoes, then you'll love this phone.  Especially if you want perpetual distractions to give your life some meaning.  However, if you want a phone to assist you in living your day the way you choose to, then stay away from this junk.",
      "helpfulVotes": 37
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good",
      "date": "Reviewed in the United States on November 29, 2024",
      "body": "good"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Horribly cheap phone",
      "date": "Reviewed in the United States on December 21, 2024",
      "body": "This is what I get for being android curious and trying to get away from iPhone literally as soon as I powered this phone up and got past the set up I went straight to the camera and immediately I knew I messed up and shortly after realizing that the quality is horrible the camera app crashed and kept crashing and wouldn’t stay on so immediately powered the phone off and threw it back in the box and back to Amazon it goes even during the set up it was a bit glitchy",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too big, unresponsive",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "This phone has very poor design.  it's too big and heavy.  It does not respond well and frustrating to use.  Touch screen has serious issues in terms of responsiveness and getting you to right destination"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Failed",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "This phone failed less than a month after purchase.  It seemed it was a software failure rather than mechanical failure.  I was severely surprised and disappointed since I've had excellent results with Motorola phones in the. Past.  Oh well, that's why amazon offers money back guarantee. Returned for refund no  problem.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It has been a great disappointment",
      "date": "Reviewed in the United States on May 11, 2024",
      "body": "I have bought Motorola phones for years, but unfortunately Motorola has lost its way by flooding the market with different models. Although this one in particular has memory and space, in other aspects it is even worse than the entry-level Moto E models. Its camera is terribly slow and when it comes to moving images they come out blurry. After taking a few pictures, the camera freezes. It does not have NFC, something that is essential to incorporate these days."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Genuinely bad product",
      "date": "Reviewed in the United States on November 14, 2024",
      "body": "Genuinely bad product, extremely slow, and does not include enough ram to perform basic internet operations like keeping a webpage open and submitting a captured image to it without hitting an out of memory errorHonestly. Be better motorola. I've been using Motorola for over 7 years, and I'm baffled they could release this garbage heap labeled as a 2023 model when it doesn't have enough ram or power to perform light non gaming internet business and workloads that phones 9 years ago crushed just fine.Motorola you deserve to be punished for even creating this option and selling it under a 2023 label.Shame on you.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone for the money, but lacks.",
      "date": "Reviewed in the United States on November 22, 2023",
      "body": "I like the new G6s features and controls but the older versions snapdragon processor is much better for my aspects. It doesn't pause when you want response like the octagon processor in the newer version."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery just last 1 day, with low usage. Photos are not that great",
      "date": "Reviewed in the United States on August 13, 2024",
      "body": "Not at all pleased with this phone. I use the phone a whole lot less than anyone I know or see others who use theirs alot. This makes it just thru 24 hrs then have to charge. THe picture quality is not wonderful it will just do for average picture taking."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worse than the ten year old phone I was replacing",
      "date": "Reviewed in the United States on September 20, 2024",
      "body": "Phone is slower than the speed of smell. Lags freezes unlocks half way. Aggravatingly slow trying to load a GPS or download files. What kind of phone comes with only 30 gigs of memory? Just the operating system on the phone takes a third of the phones memory. 5 apps and and 200 pictures the memory is full already. Didn't even bother with the fingerprint reader because the screen can't figure out where your pressing anyways. Battery last 3 days if you don't open the phone for 3 days. If you actually use the phone it won't even last a day. Camera is ok I guess it takes pictures but you will have no memory left to save the pictures. Sound quality is ok which it should be it's 2024",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with out SIM card",
      "date": "Reviewed in the United States on March 15, 2024",
      "body": "Ok I guess but it arrived without a SIM card"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wish I could return it now",
      "date": "Reviewed in the United States on April 12, 2024",
      "body": "I liked it at first but after a few months (3 1/2) it has become very slow. have to delete apps for updates as it has extremely low storage. I want my money back as now I am seeing options a million times better for $50 more. My major complaints is the storage and freezing. Battery life is fine. Difficult when you are outside doing side gigs and it starts freezing up. Happened to me the other night and I was in the WORST NEIGHBORHOOD. I need to check the warranty if there is even one.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's an alright phone I guess",
      "date": "Reviewed in the United States on October 23, 2023",
      "body": "It crashes randomly while playing higher intensity games like guardian tales, sometimes glitches when using simple apps like YouTube and Google chrome, and god forbid you have auto-rotate enabled. Overall, this phone isn't the one for you",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Junk",
      "date": "Reviewed in the United States on March 30, 2024",
      "body": "The phone is the 2023 model.  You would think Near Field Communication would be standard. Nope. Without NFC you can't tap to pay. You can't tap to ride on the subway. You can't get Bluetooth and WiFi settings from another device.  It may be a 2023 model but it uses 2013 technology.  Complete with 2013 bloatware. Certainly a case of buyer's remorse.  Now, after several months of ownership, it randomly decides I have no cell coverage.  I will be sitting in a cafe or wherever scrolling away when suddenly, no service.  I haven't moved an inch, my wife is at the same table using the same wireless account and she is connected?  Oh, and time for an update -- delete apps and files to make room for that -- and it takes forever!  The brand name was bought out and the product is worthless. Stay away!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    cheap phone",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "Will not work if you have more than 3 things open. Extremely slow."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    lock screen",
      "date": "Reviewed in the United States on August 4, 2024",
      "body": "As far as I can see, there is nowhere to adjust the timing of when the lock screen activates.  It is set to one minute and it can be pretty frustrating at times."
    }
  ],
  "productDetails": {
    "productTitle": "Moto G Play | 2024 | Unlocked | Made for US 4/64GB | 50MP Camera | Sapphire Blue",
    "asin": "B0CP6DDN1H",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "Blazing-fast Qualcomm performance. Get the speed you need for great entertainment with a Snapdragon 680 processor and 4GB* of RAM.",
      "Fluid display + immersive stereo sound. Bring your entertainment to life with an ultrawide 6.5\" 90Hz* HD+ display plus stereo speakers, Dolby Atmos, and Hi-Res Audio*.",
      "50MP* Quad Pixel camera. Capture sharper, more vibrant photos day or night with 4x the light sensitivity.",
      "64GB* built-in storage. Get plenty of room for photos, movies, songs, and apps—and add up to 1TB more with a microSD card*.",
      "Unbelievable battery life. Work and play nonstop with a long-lasting 5000mAh battery.*",
      "Sleek and stylish design. Thoughtfully crafted from premium materials, featuring a streamlined look, durable matte finish, and splash protection*.",
      "*Auto mode has a minimum device refresh rate of 60Hz and a maximum refresh rate of 90Hz; actual refresh rate may be less and will vary based on app/content limitations and requirements, device mode settings, and other factors. *May be used with Hi-Res compatible wired headphones and apps only. Check applicable devices and apps to determine compatibility.",
      "*The 50MP sensor combines 4 pixels into 1, for an effective photo resolution of 12.5MP.",
      "*Available user storage and internal memory is less due to operating system, software and other functions which utilize part of this capacity. Available capacity may change with software updates.",
      "*Battery life claims are approximate and based on optimal network conditions. Actual battery performance will vary and depends on many factors including signal strength, network and device settings, temperature, battery condition, and usage patterns. *Water-repellent design creates a barrier to help protect against moderate exposure to water such as accidental spills, splashes or light rain. Not designed to be submersed in water, or exposed to pressurized water, or other liquids; may diminish over time. Not waterproof."
    ],
    "boughtCount": "2K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Motorola",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$109.99$109.99$109.99",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$74.00$109.99$109.99",
    "buyUsedAvailability": "Only 2 left in stock - order soon.",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "BlueChip Wireless",
    "soldByUsed": "BlueChip Wireless",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 16,
    "startingPrice": "$74.00",
    "url": "/gp/offer-listing/B0CP6DDN1H/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0CP6DDN1H",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "USB Cable",
        "SIM Tray Ejector"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$109.99",
    "listPrice": "$149.99$149.99",
    "savingsPercentage": "-27%",
    "standardDeliveryDate": "Monday, March 24",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}