{
  "asin": "B0D1ZFS9GH",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    New phones for us!",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "We've had our phones about 7 weeks now, and are very happy with their functionality, features and they were at a great price.  Takes a while to acclimate to any new phone, but these were great phones and easy to learn.  Stylus is very handy to use and has a storage slot.  Photos come out very sharp, even in low light. Touch screen sensitivity can be an issue for me because I often have very dry hands.Order the Motorola case made for this model  as it fits perfectly. I ordered Motorola fast charger adapters & longer cords for our bedside tables, but our previous charging cords & adapters (Samsung fast chargers \"C\" type) also work fine with the new phones.  (Extr chargers & cords are fine with me, especially for travel and use elsewhere.)",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Motorola Phone!",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "Tonssss of storage. It would take tonsss of apps and pics to slow it down as I've loaded it and it's still doing great. I bought a memory card but haven't put it in the phone yet, lol. That speaks volumes tho. All the functions are great. Keeps a nice charge and I'm constantly on my phone all hours....The camera quesity is pretty good and people have commented on the quality when developing pictures from it! I would most definitely purchase it again. I was super sad when LG quit making phone and dreaded buying another brand. This phone more than takes the place of the LG phones I've owned. From business to just using on the web, this phone has great speed and is effortless to use! Cool extra features and a stylus built in too.",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything most people could possibly want except for waterproofing / IP68",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "For a phone often on sale for $250 or less, this is THE budget / midrange phone to beat in my opinion. It does everything well except for a lack of waterproofing, and the bluetooth range is probably a little bit below average too.That said, the Camera is great, the POLED screen is amazing and a smooth 120 FPS (probably 30 more than it needs honestly), the stereo speakers are nice, it has an in-screen fingerprint reader which is accurate, a headphone jack and a stylus... microSD card expansion, just about everything you can think of really. NFC, e-sim, dual sim if you don't need a microSD, it has it all and 8gb of ram and 256 gb of storage, along with a Snapdragon 6 Gen 1 which is \"good enough\" for gaming, and much better than a Snapdragon 4.If you don't need waterproofing, aren't a gamer, and don't need long bluetooth range (both this and my previous Moto G6 had disappointing bluetooth range) this is a great phone, and in my opinion, better than most of its competitors in its price range.I will note that 2025's Moto G Power is pretty close to this phone (except for its non-amoled IPS LCD screen) and DOES have IP 68 / 69 and that the 2025 G Stylus will probably be slightly better than 2024's G Stylus and also will likely have an IP 68 / 69 rating. So if you can wait, it's probably better to get the 2025 G Stylus.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really good phone. .......but",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Overall this phone is very good for the average user. It has a more powerful processer, more ram, more storage and a better screen than most phones that are in its price range. It feels like it's more expensive and it's overall design is modern  and clean. It is a larger phone but if you have big hands it shouldn't be a problem. The Operating system is clean and focused on helping the user get acclimated to the phone and it's features, although if you are an experienced user it can get annoying.  With normal use like web browsing, watching videos, listening to music and maybe some light gaming it performs without any issues and is smooth and fast. There is one major issue that I have consistently been unable to resolve, the camera app, despite how amazingly Crisp and clear the images are constantly stutters and crashes, there are times when the screen goes black or has white or red lines across it. The app will crash several times in a row before being stable enough to take one picture. I love the cameras on this phone but the app on my phone is not reliable enough for me to give it 5 stars. Everything else works fine. It charges fast, has plenty of ram and onboard storage, it has a gorgeous screen, and enough processer to handle it all. I hope Lenovo/Motorola can improve the camera software because this phone is almost excellent.  Also this phone is fully compatible with t mobiles network and it was fully unlocked when I received it. The screen is responsive.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love the phone. It is great value for money device!",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "I bought this phone a few days ago. Delivery was 2 days with Prime.Got Used one in very good condition. for only 218 USD!!!It came with the original box and cable no single scratch on the phone or display.I am very satisfied with the buy.For this money it has Good Camera, Big battery with Wireless Charge and Fast Charge( charger has to be bought separate but for 218 USD only 20 bucks for fast charger was not a problem)Screen is very beautiful and colorful.The stylus is just a bonus. And also managed to connect it to monitor for desktop experience!256GB of Storage and 8GB.this phone can easily last me for 3 years.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So much better than 2021 version",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "My hands shake! It's a genetic thing and I can't do much about it. I say this, because when I realized the battery in my 2021 Moto Stylus G is not staying charged, I needed to get a replacement that preferably had a nice camera with stabilizing ability. I almost got a high-end phone, but then I realized that almost none of them has expandable memory. I am not okay with that. I did some research on the latest Moto Stylus phone and I liked what I read. Now that, I've had a few days to test it out, I like it a lot. I'll lay out a few reasons. by the way, I took the two pictures above with the Moto Stylus 2021 and Moto Stylus 2024. I'll let you guess which picture is from which.#1 Camera -- my favorite feature of this phone is the camera. I don't know if the camera has a physical or software stabilizer, or both; to me it doesn't matter, because my pictures turn out so much better!#2 Speed -- I'm used to turning on my phone and waiting a bit for it to load up after a reset. This new stylus phone loads up really quickly and I'm surprised at how quickly I can use it.#3 -- The Stylus -- The stylus has a newer design to it. To me it feels more sturdy and easier to use than my old stylus#4 -- Software -- The software seems improved overall. I am enjoying all the minor tweaks that Android has made since version 11.#5A -- Finger sensor -- I'm not a fan of the change. The finger sensor is now on the screen. I like having the sensor on the back of the device. I realize they did this, to allow for wireless charging; so most will prefer this. Also, I don't really need the finger sensor anymore, because of facial unlocking; nevertheless, I still prefer the finger sensor to be on the back of the device.#5B -- Facial sensor -- A new feature for me, this works great; I have a beard, and the phone has no problem recognizing me.#6 -- Screen -- The LED screen on the old Moto, was pretty good; however, the OLED screen on the new phone is really nice.#7 -- I reused the SD card from my old device, however, it works well and I have no lag in performance using it. I also look forward to upgrading it in the future, should I run out of room... 2 TB is an insane amount of space.Pros:Excellent cameraProcessor and ram are fastStylus feels goodSoftware has good improvements over allThe new OLED screen is a good leap forwardCan hold up to 2 TB of add on storageCon:Finger sensor now on the screen instead of the back of the device.",
      "helpfulVotes": 92
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really Great Android Phone",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "I needed a new phone - my old phone was over 6 years old, didn't have 5G and the battery was starting to wane. I prefer Android phones but wanted to avoid Samsung because of the bloatware.  I was going to get a Google Pixel, but this phone was on sale for Black Friday.  It is perfect for me.It doesn't have a lot of bloatware - it ships mostly Google apps.  It was all sorts of built in tutorials that make it easy to learn about the phone's unique features - like a double chop to turn the flashlight on and off, and a twist of the wrist will open the camera.  To put it in Do Not Disturb mood, simply put it face down on a table.It has really great battery life and it is plenty fast using 5G.  (Caveat - I don't do any gaming and not much streaming on my phone, so your mileage may vary.)The only negative so far is the quality of the camera, but I don't use my camera that much anyway.I do use NFC a lot and it was nice to see an economical phone that offers that. It also lets me customize the size of icons and text to make is easier to use without my glasses.The phone seems to be sturdy and the screen is large and easy to read.This is a great phone to give to the seniors on your gift list.",
      "helpfulVotes": 27
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent 👍",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Coming from a Samsung Z Flip 5, this phone is great for all my needs. I was on my THIRD! ZF5 Replacement and locked into a Verizon contract and I can't keep replacing this phone until 2 years are up. The second replacement lasted less than 5 months!!! After spending a $99 deductible, I needed to find a new phone fast to use until I get rid of that one.My favorite thing about this device so far is the headphone jack and the quick gestures. I can shake my phone to turn on the flashlight which makes it a delight to navigate around the house or to find something.The battery lasts a long time for my usage. 5G works great. Perfect to watch videos on. The screen is really good. I haven't tried gaming on it yet but eventually.Overall it's a solid phone. I just need more phone cases to be made for it! The faux leather on the back feels nice. The Motorola sign in the middle is a little bit weird but its to be expected since you switch from texture to texture.Thanks Moto. You saved me the trouble for the next 2 years.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lovely Phone, But It Badly Needs Debloating.",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "It has been more than 4 years since my last new device, and I was really wanting to depart from Samsung, since they are getting too big for their breeches --as the old saying goes. I purchased this delightful model after a recommendation from a trusted friend, and loads of research into the device (from reviews and videos --to using both the manufacturer pages, GSM Arena and Phone Scoop to verify all specs).. This device is approximately 87% comparable to the Samsung Galaxy A71 5G with a few nice additions (Especially the stylus). I am thrilled to finally have a built in stylus and all the abilities that go with it. (Samsung only includes this on their ridiculously overpriced flagship top-end models.) I am also very pleased to finally have eSim capability, and have also just learned about the new android feature called \"Seamless Updates\". This feature means the OS is kept in a doubled state between Partition A and Partition B. Your phone is thus updated by modifying the inactive Partition B and then the Partitions are swapped at next boot to complete the upgrade. This feature was started to not only make updates faster, but also to reduce the possibility of update errors.. Simply Brilliant!.. This also eliminates the need over all years past to clear the system cache after every update.The display on this phone is 85% brighter and more vibrant than my old A71, and I have twice the room as well, and a significantly a faster processor, more ram, and the ability to designate up to 8GB more of virtual memory with a feature common now to many phones called \"Ram Boost\" (or something similar). I also purchased a new 280W Type-C charging station due to the rather high 30W Turbo Charge (BTW.. In the case of this phone, that means anything from 15W(Wireless Charging) to 30W will activate fast charging). I also purchased a delightful 240W data/charging cable to go with it and of course, a decent heavy duty case, camera protectors, and proper tempered glass screen protectors. This 30W Turbo Charging is so fast you can virtually watch it increment the numbers.. It took no time at all to reach 100% from the out of the box 53% charge. I also side comment that the box was nicely packed, and I liked how they didn't even use twist ties on the USB cable.. They used paper cuffs instead, and only bound it in an oval to avoid unnecessary kinking... *Really Nice* The so-called *Chuckles* \"Vegan Leather\" on the back is not my style, or definitely --my color. (You may use Neatsfoot Oil on it to help avoid stains and to preserve the leather. It works both on natural and artificial leathers and is the classic treatment for such.) I prefer Black or Blue --or even perchance a lovely sexy purple, but they only offer this phone atm in a fire engine sort of Christmas type red *shudders* or that weird creamed tea blondish beige. It really doesn't matter that much since I put it in a purple case anyway, but STILL!! I am over all totally pleased with this device, but let's get to the meat of the matter..Motorola has gone a bit NVTS Nuts with this phone concerning bloatware.. I completely understand why they loaded both the necessary and or critical software for the various carriers out there, but they could very easily do the same via a delivery app that automatically asks you WHICH CARRIER YOU HAVE, and then installs the necessary soft for said carrier during initial setup. They instead just loaded everything in as \"System Software\" instead of \"USER APPS\" so you can't remove anything you don't need save via ADB. They also need to let us choose with more options which bundled software we want and don't want during setup. (I never root my phones anymore.. just don't have to.. and I don't advise it for many reasons. The ADB method of removal is legit and doesn't break the phone or void the warranty when done properly.) Root your phone???, and you lose your ability to update automatically???, and you also lose your coverage??? NO WAY! So just... Don't!... Then there is all the rest of the junkware/bloatware.. Gone Gone Gone. A few apps won't remove.. Oh Well.. *disables them* Android 14 finally implements a block on older apps.. If you have any you want and or need to keep, you will have to sideload them via ADB and a windows PC. (Word to the wise... There are reasons for blocking them.. so take care of what you keep.. some old apps are vulnerable to security breaches.)The finger print scanner is WoNDeRfUL!! It was a BRILLIANT idea to put a flash behind it to even be able to capture hard to scan prints like mine and a few others I know. It is fast and seamless and can hold up to five prints. I don't use Face ID, so I can't attest to that at this time without another trying it. I normally don't use a games app either, but it looks like there are some nice little games inside, so I am keeping it. My Aunt purchased the device as well and T-Mobile activation was seamless and expedient. Let's see... what else... I at first was dubious about the feature that lights up the display when you pick it up, but find it it quite useful. I also like the double tap to wake option. There are many other useful gestures as well. I also like the \"Dolby Atmos\" app in there that neatly rearranges the spatial displacement of the the audio when you rotate the phone to keep the stereo working like it ought to. This device also comes with screen-casting services built in. I will be testing this in future. There are separate ringtones for regular Sim and eSim, so be sure to check in \"Sound & Vibration\" in Settings if your ringtone does not apply correctly. There is also a neat little feature that keeps the phone awake while you are looking at it (you have to manually turn this on).. What a nice Idea!! They really put a lot of thought and effort into this phone.Another point of which I would like to make note is the way Motorola updates the device. They offer only one major android upgrade beyond that which is installed, but they do... apparently push security updates each month. I had to update several times out of the box to account for each monthly security update from July of 2024 till now. I was fortunate to receive 3-4 updates of this kind per year for my old A71.. I REALLY appreciate these regular updates that will apparently continue to be regular..In conclusion I would like to say, Motorola has always made good products, and this phone is no exception. You will definitely need to customize it to suit your tastes and needs of course, but I heartily recommend this device. You may also purchase the extended and most generous 2 extra years of warranty through the \"Device Help\" app so long as you are within the first year of warranty, for a reasonable price. As the old saying goes.. This phone \"Is Firm, and Fully Packed.\" I love having a stylus at long last, and not having to give my first born to get it. The price point is excellent and the device is solid and well made. It still needs a better battery, but I can definitely work with it, and will thoroughly enjoy this phone. I hope more folks buy it. I will be glad to continue to recommend it to my friends, family, and my clients.Namaste...",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really good phone, minimal gimmicks",
      "date": "Reviewed in the United States on October 9, 2024",
      "body": "I bought this recently to replace an aging Moto G7 Power (circa 2018?).  I needed this to be my go-to main device to do most things on.  I didn't want a top-of-the-line flagship phone, because they usually have gimmicks that are of limited use to me (like folding screens).  But I still needed a fairly decent spec'd phone to handle everything that I wanted.Having had Motorola and Samsung phones before, I knew that the Motorola would likely closer to pure Android, since Samsung likes to push its One UI on top of everything.  There is still some pre-installed 'bloatware' that Motorola packages with it, but it's really straightforward to remove/uninstall the majority.  A few Moto apps could only be disable, but that's just as good.The main specs for me is that it needed to have storage capacity (my old Moto had long hit its limit), needed to be 5G, needed to be unlocked, and needed good battery life.My past experience with Moto has been that their batteries tend to be better than average life.  This one is no exception - I went 3 days without a charge and light use, and on a day of heavy use I still had ~60% at the end of the day.Back to the storage capacity, the 256GB is plenty of room for apps.  AND, Motorola still includes a microSD slot to add up to 1TB.  That built-in storage has the option to enhance memory performance too by allowing up 8GB to be used as RAM.  That's adjustable too in 2GB increments.One real nice to have is that Motorola finally came around to including NFC and wireless charging in its devices.  That was the final kicker for me that pushed me to get this.  Part of the problem with my old phone is that the charging port was worn and wouldn't always charge unless positioned a certain way.  So, wireless charging is a nicer, more durable feature for me.It's running the latest Android 14 and immediately asked to update to the latest patch after initializing.As for that initializing, Google has really gotten Android to be nearly seamless when migrating devices.  When it came up the first time, it told me what to do with the old phone - basically just turn on bluetooth and scan a QR code.  It asked a few questions of what I wanted to carry over, then it took it all from there.  When it was done and up and running, it had my wallpapers and ringtones and a bunch of other settings that came from my old phone.  It made adjusting to a new device pretty easy.  The only thing I did have to do is remove the unwanted apps that are included, like I mentioned before.  It's now a smoother, more capable version of what my old phone no longer was.The display is nice, clear, and bright.  It's actually really good resolution, I had to get a magnifying glass just to see what is the pixel size.  It's bright enough to still see in the sun, and goes dim enough for at night.The camera is good for a phone camera.  I'm still a dedicated DSLR guy for high quality images.  But this does a fairly good job for the usual everyday photos.  The one rear camera is rated at 50MP, but there is is small caveat to that.  It uses all those pixels in groups to generate a combined 'better' pixel.  This comes out to an effective resolution of around 13MP, which is still more than enough for most needs.  And with that pixel arrangement, the image processing can do things like better digital zoom, and image stabilization.  There is optical image stabilization too.  All-in-all, this does make for fewer blurry picture.  The camera app itself covers all the bases for different needs, include night and action shots.  A nice-to-have in the app is the option to go full manual control, which the photog in me really appreciates.  It's not a full standalone camera, but I can get it to do what I want rather easily.Lastly, there is one thing about this particular phone that I would categorize as a slight gimmick, and that's the stylus.  Don't get me wrong, it is nicely integrated into the body so it's out of the way.  I just have never had the need for a stylus on a phone.  For someone needing the finer point of a stylus, I can see it having a purpose for them.  Who knows, I'll give it a try now and then, and see if I pick up to it.Overall, I am extremely happy with this.  I does what I need, and then some.  It's not a flagship phone, but it's definitely on the higher side of the mid-level category.",
      "helpfulVotes": 103
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Initial Thoughts",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "Upgrading from a Galaxy 10e and deciding between this and a Samsung s24 and s24 ultra. I don't want a giant phone...but want a stylus. Factor in the price of the moto G and perhaps it's a sweet spot. Larger than the S24 but smaller and lighter than the Ultra. It's performing well with just the smallest hint of lag in places, including the stylus when drawing at times. It's all fine and minor but the only concern is longevity and if performance were to decrease over time. Using the S24 side by side, the S24 is snappier. Based on 5 years with the 10e, id expect the performance of the s24 to stay the same. Not sure about the moto.But if it does, then it's a great phone. I like the UI and the camera is actually pretty good ( I'm an enthusiast/ semi pro photography person). I might be behind the curve on modern phone camera expectations, but it's good imo with fine processing (not too overcooked, though perhaps a bit with enhanced sky outdoors and some other color saturation issues). No cutting edge AI features like the Samsung has. Which I'm fine with. A stronger zoom lens would be pretty nice actually. This feels on par with my 10e though with a higher mp sensor. So it should be able to zoom/crop a bit better.Speakers on the phone are ok but the speakers on the s24 are way way better. You can actually hear most of the frequency range for music, including bass, which blew my mind. Much less bass is audible on the moto. So while one might not use phone speakers to enjoy music, you actually can on the Samsung or Galaxy phones to some degree. Less so on the moto.I slapped a matte screen protector on it after reading it has mediocre glass for the screen (how mediocre or less than the Galaxy phones? I don't know).The UI has some novel shortcuts and gestures that are cool. Double shake for flashlight, twisty twist for camera, double tap back panel for quick access to custom app etc.Battery is good but I don't know what's considered great. Plus I'm streaming audio via Bluetooth all day while working so I'm not sure what's normal usage. I definitely need to recharge it every night if not well before during heavier usage. Casual usage and it'll last into a second day, easily.$250 on sale vs $670 s24 on sale. 1k for s24 ultra (didn't test). This results in both pros and cons when comparing phones-- with the moto being pretty darned good overall. Excellent to amazing if performance doesn't take a hit over 4 years.Maybe  Ishouldn't be burying this, but I DO have some questions about both bluetooth and the phone signal itself (including texts) compared to my previous Samsung. I have T-mobile and I frequent an area with poor reception. The Samsung struggled there as well. With the Moto I'm not getting texts quite as easily. For example photos from senders don't arrive as easy and texts get delayed. When I'm in a \"normal\" service area, it's all fine and perfect. Regarding bluetooth, I am noticing the connection for my earbuds is more easily disrupted for various reasons (distance; movement like jogging). Frankly, it's hard to fully measure or assess these things...but I do notice some differences.Pros:cost, size, stylus, weight (lighter than Samsung ultra), good features and decent UI. 8 gb Ram. Micros SD slot and headphone jack.Cons:Not fully waterproof, speaker is mediocre, no 3rd camera zoom lens. No AI features if you care which I don't. Older gen chip with a hair less snappiness compared to Samsung S24. Moto's limited OS and security updates. Some potential issues with bluetooth and cell service around the margins.Regarding security updates, my 10e was two years past the last updates. Was fine. Just a bad charging port. If the moto is getting something like 3 years of security updates, then one if not two years past that is no problem for me. Though longer support would be ideal and a boost for moto since everyone cites that as a major negative.For the price, this is really more than a five star phone. But objectively speaking, it's not perfect either.Edit: Regarding the S24, I ended up returning it, kept the Moto, and have now had it for several weeks.",
      "helpfulVotes": 42
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A step up for a budget phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "I've used lower end Motorola phones for 7 or 8 years now, all variants of the Moto G. As my last one began to die, I researched various Motorola and non-Motorola options on sale for the holidays and wound up facing a choice between this, the Moto G Stylus 5g, and the latest Moto G Power. I'm happy I spent the extra $50 on the Stylus; although its processor is a slightly older design, the higher resolution screen was a big plus. The camera is also a major upgrade. The 5,000 mA battery has very good endurance. I also enjoy having NFC, and wireless charging has been an interesting gimmick. As with my other Motorola phones, I appreciate the micro SD slot (though I did have to reformat the card I had in my old phone). I also appreciate the fairly vanilla version of Android that does not include all the carrier bloatware. For me, the stylus was fun to play around with, but I haven't found a use for it that makes it worth taking the stylus out very often. Of note, however, the stylus can pop out when the phone is dropped, and it can then be a challenge to find where it has landed. Otherwise, I can recommend this phone to anyone who wants a phone that offers an excellent screen and camera, along with some conveniences making their way down product stacks, as long as said person does not need to do heavy-duty processing or 3D graphics/gaming, Performance is passable for casual gaming."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything you need without the cost!",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "I have been a Samsung Note user since the series was launched, but after the Note 9, I struggled with justifying the cost of upgrading for so little that was new and useful.  I stayed on the Note 9 for many years, and finally, when my provider could no longer replace my Note 9 under extended warranty, I was forced to look at another brand.Enter the Moto G Stylus 5G 2024!  Amazon was running a promotion on this brand new release from Motorola, and at $317.95 for a brand new unlocked Moto flagship, I was absolutely down for that.  I got so used to paying $1,300 to $1,500 for the latest Samsung flagship phone release, I almost forgot what bang for the buck value looked like! :)As I walked through the Specs of this phone, I couldn't help but feel like, wow, I've been overpaying for a large screen and stylus forever....need to try something new.  And I wasn't dissapointed!  I had been considering the Pixel 8 Pro for several months, but I couldn't get one from my mobile provider, and I couldn't get a good deal for an unlocked version ($799 to $999) so I started looking at Motorola.Low and behold, their latest flagship Stylus 5G (just launched in May 2024) was on Promo :)  The big draw for me with both the Pixel and the Moto Stylus was that they were Google phones...literally.  Everything about them was Google centric.  And better yet, no bloatware or stupid useless skins over the Android experience.  Just pure Google/Android and great Apps.The new phone transfer process was seamless and super easy!  I just took my Sim Card out of my old handset, and threw it into the Moto G Stylus, and immediately Google's phone transfer process kicked in.  Step by step, device to device, in about 45 minutes I was done.  That's it, easy peezy.My initial few days with the new Moto, man, a $1,000 less in cost for very good performance, 120Hz refresh rate, Google centric Android experience, 8GB of RAM and 256GB of Flash Storage, Nice Aluminum stylus, good Apps for Notes, Art/Drawing, Editing, etc.  WiFi performance is excellent, Cellular reception is much better than my previous $1,400 Note 9, Bluetooth range is excellent, Camera is solid, with Pro features and capabilities if you wanna get all high end with your cameras, camera software is way better than the 2023 version, MP is up(50), camera quality is way up (software improvements), embedded storage is more than adequate for on device storage needs (256GB's is a lot of local storage, when you store everything to Google Drive), and the performance of the SnapDragon SOC, while not the latest and greatest, it powers through moderate gaming, is awesome for media consumption (streaming video) UI is super fluid, no jittery transitions, swipe is butter, couldn't be happier with the overall performance.It comes loaded with Android 14, it has an Audio Jack port! and it supports Micro SD card storage up to 2TB (although I haven't physically confirmed that) and Dolby ATMOS with two very capable speakers integrated for excellent sound performance.  The 6.7\" pOLED screen is outstanding, Refresh Rate is awesome (120Hz), SnapDragon 6 SOC is solid, all that and the all day 5,000mAh battery + rapid charging (35W wired, 15W wireless)  you've got as complete a package as I've ever seen.In short, I'm done paying an arm and a leg for technology I don't really need.  Give me rock solid value every day.  The Moto G Stylus 2024 is just that, Maximum bang for the buck on every front, and I don't have to take out a 24 month loan to buy it!!!  I would highly recommend trying this handset out!8/29/24 Quick update for everyone on adding MSD storage to the phone. 2TB's is overkill for me because I use Google Drive for backup and Amazon Photo's as well, so I don't need ton's of onboard storage, but for the sake of checking out the Micro SD card capability, I dropped $35 on a 1TB SanDisk High Speed MSD, dropped it in, and instantly recognized as external (not embedded) storage, and the only choice you need to make is whether you want to format it such that you can move the card to any device as external storage, or leave it as phone dedicated storage and you're done.  Once again, seamless experience, no hassles, no incompatibility problems, nothing.  Plug and Play.  Having used the handset now for several weeks, it's more awesome than I originally thought.  It just does soooo much for so little cash, I'm giving it a 10 out of 10.  Lesson learned, don't be a slave to specs.  This phone is boss, hands down the best stylus enabled large handset for the buck.  I can't wait to see the next gen of this handset......all smiles friends :) :) :)",
      "helpfulVotes": 124
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Top Shelf Phone",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "I've been extremely happy with this phone so far.I initially had bought a TCL Stylus 5G, which is basically the knock off of the Moto G Stylus 5G. Not only did the TCL not support eSIM, but it would constantly run out of RAM and lose data when trying to do very light multitasking, and the Dimensity 700 chipset is absolute certified garbage.Night and day difference, the Moto has a drastically superior display, full eSIM support, and a much better CPU/GPU. It also has an adaptive VRAM feature, which can effectively double the available memory from 8gb to 16gb. It's not quite the same as actual RAM, but it makes a big difference.The listing makes it super unclear so if anyone is wondering like I was when comparing phones, this phone's model/SKU is XT2419-1. Snapdragon 6 (gen 1) chipset, Adreno 710 GPU.I would recommend this phone to anyone who tends to do a lot of multitasking or gaming, or running extremely demanding apps. For casual users who aren't really going to do anything but send texts and scroll on social media, this is probably overkill, get the TCL Stylus 5G instead and save some money."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but ultimately decided to return it",
      "date": "Reviewed in the United States on November 23, 2024",
      "body": "There were a few major problems that made me send it back. And these might be minor to other people. One thing that bothered me most was that it got very very hot when on a wireless charger. So uncomfortably hot it felt unsafe leaving it unattended while charging. And I didn't have a proper wired charger at the time to do fast charging as this requires a higher wattage than a typical charger to get fast charging through USB-C port, it took a very very long time to charge on a typical USB-C charger. I got an official 5V 3A Motorola Charger after returning this to use with the much cheaper Moto G Play 2024 model. And to fast-charge the Stylus model I think also requires higher Amperage to fast-charge. So add another $20-$40 to the price just to get the right charger for this. The last thing I didn't like was the fake leather texture. It would have been fine if I put a case on it, but I didn't want to use a case for this phone and it just didn't feel right. I like the G Play phone texture better, it just feels better in the hand. And price wise these are both affordable phones for their features but the G Play 2024 just felt better value for the money and is as of this review about $150 cheaper. They have similar specs, the added benefit of the Stylus 2024 model is the better screen which should have better dynamic range in colors. I also do miss the stylus, I was using it far more than I thought I would, it's a really great tool and fun if you like to draw or be creative. The handwriting to text was rather impressive as my scribbles were being well translated into text, so being able to write into text fields was an interesting and enjoyable experience. If they styled this without the oddly textured back and or had better color options I'd probably have kept this phone, but even though it was about $270 I still feel like I would have been far too careful using it, I want a phone that I don't have to be so cautious using, the G Play model just seams less of a budget buster if I drop it and destroy it because I could just buy another as a replacement without feeling too bad about it. If I ruined the Stylus model I might as well have just purchased a higher end phone from a couple years ago and got better value for my money. I do recommend this phone still if you want to have the stylus experience, it's truly enjoyable if you're into that sort of thing. And if you put a case on it then my other complaint is irrelevant.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BANG for the Buck!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "If you want or need a phone with a built-in stylus and you don't have deep pockets, then this is your phone! There are some really excellent technical breakdowns on the Pros and Cons of this phone here in the comments as well as on YouTube. The battery has excellent life and charges quickly, call quality is excellent, the screen is nice, it doesn't feel cheap (but get a case and screen protector for it anyway) and it has the stylus! While the stylus has basic functions compared to a Samsung, it does the job. The phone can do way more things than I will ever use. In fact, it almost has too many functions for most people except the true \"power users\"..."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good update for a basic phone person",
      "date": "Reviewed in the United States on March 18, 2025",
      "body": "I need to explain 1 thing first.  I am a basic phone person.  I am a no frills kinda of girl.  I do not use my phone for anything but calls and texts.  Once in a while I will take a picture. I don't use the stylus, I tested it and it works, but that is all I can say.This phone is an upgrade from what I had.  It is sturdy, well built and unlocked. I can set alarms with different sounds.  It's great.  The screen is clear and a good size. Hope you enjoy it as much as I do.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Motorola Android phone",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Big fan of Motorola phones.  There's no better value for the money on the market than a Motorola smart phone with Android OS.  This is my 4th Motorola phone since 2018.  I started out with a Moto E4 in 2018... my first real smart phone and only paid $160 for it.  That phone performed admirably until I wanted an upgrade in battery performance during the pandemic year.  In March of '20.... I bought a Moto G Power (2020 version) costing $263.... and it performed great until I wanted more storage space at 256GB.  So in May of 2022... I bought a Moto G Stylus 5G (2021 version) at $367.  Now I have the Moto G Stylus 5G (2024 version) with expanded RAM the '21 version didn't have, along with Android version 14.  I can add up all 4 of these phones purchased since 2018.... and it's less than the current new iPhone 16 Plus ($1,029) with the same specs as this 2024 Moto G Stylus 5G... costing me much less than the '21 version with gift card.  Bottom line is.... Motorola Android phones can do everything iPhones can do at a much lower price.  More bang for the buck with Motorola phones.  Motorolas also cost less than Samsumg and Google phones with same specs.  Highly recommended, reliable performance time and time again.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    By far, best phone I've ever had!!",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I love this phone so much!! It's fast, has tons of storage, does more stuff than any phone I've had!! And the battery lasts me all day and I use my phone for everything!!! Especially for the price of this phone, it's completely worth it!! Thankyou!! I have a cover but the back of the phone is really really nice and I don't use the stylus much but it's very convenient and the little push in, push out makes it super easy to keep in and get out when needed!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone with annoying camera issue",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Works well overall in 2025. The stylus is fun but after a while I stopped using it, it's more of a gimmick than actually useful. Camera loads fast and takes decent to good photos depending on the lighting. Biggest issue I'm having with it: I use this phone to work for Amazon Flex and Instacart. Both apps require using the camera at times to scan bar codes, and every so often the camera will freeze after opening in the app. When this happens I have to go back to close the camera and try again, but usually it's very likely to happen again after it happens the first time. Honestly have no idea what's causing this issue, I can't find any info about it online. I haven't had any problems when using the regular camera app though, the issue is only on the Instacart and Amazon Flex apps.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, great quality and well built.",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Impressive phone for the price tag of $250. It is fast, plenty of storage, excellent sharp display for a phone in this price range, I find no fault with this phone, I had the Motorola 2022 Stylus 5g which work very well also. This 2024 model is even better. The only downside with this this phone like many Motorola phones is it has a rather short update period and only updates it once to the next Android version. But with that said, the price point for this phone is a very good value. I highly. recommend this phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid budget phone",
      "date": "Reviewed in the United States on January 19, 2025",
      "body": "My Pixel 6A's battery was expanding after an update and on borrowed time, I needed to switch phones quickly. This came in far cheaper than a Pixel or Samsung in the same class and the build quality is excellent, it's really well made. Yes there is some Moto bloatware, which does make me miss the cleanliness of GrapheneOS, but it's not nearly as egregious as Samsung or even stock Pixel imo.At $250 this was a steal - wireless charging and microSD can't easily be found elsewhere, especially for sub-$300. Battery life lasts a while as well. I'm normally a very cynical person but I can't really knock this thing dude. Just be sure that when you buy a case that it supports wireless charging thru the case - only one of them does.For those who venture in custom ROMs it's evidently friendly with that too, there's already a small community for this phone. These days though, I just want my phone to work man, and this fit the bill nicely"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No brainer..just buy it!",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "No brainer! It's comparable to a flagship phone without the hefty price! The features are amazing! Camera is good enough! The response is super fast. Esim and regular sim..Unlocked for all major three phone carriers and for Mint mobile..tello etc....the display colors are amazing..sound Dolby Atmos and equalizer!.. my experience is I Ann quite happy with this phone!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing Information",
      "date": "Reviewed in the United States on June 8, 2024",
      "body": "What this phone's little bit of information that you get and see here does not tell you that being unlocked means you get no Sim Card.  You have to go and buy separately a BYOP TRACPHONE/VERIZON Compatible Kit for a Sim Card.  It's just a Sim Card.  Very cheap! That can be bought at several stores.  I also have a feeling the monthly cost for the plan is going to go up since Tracfone is now part of Verizon.  I have an auto pay plan monthly unlimited talk and text and a limited data but the data is plenty for me.  I don't have a contract though. I guess everything else is going up!  I'll see when I get the phone set up finally what happens to my cost and I may change my rating here. UPDATE: I received my phone and am happy with it but the Sim Card Kit cost me about $10.00.  Be sure you buy the correct kit like I posted above or the Tracfone package actually says Keep Your Own Smartphone Sim Kit.  NANO/ MICRO/STANDARD.  It has a Sim Card A and Sim Car B in the kit.  For this exact phone you need Sim Card A and the Sim Card A card number is on the card package that holds the Sim Card itself.  You have to take the little Sim Card A off and out of the little square that's holding it onto the card and put it into the slot that is the farthest inside of the phone Sim Card holder close it and go from there and the phone will work.  This is the best I can explain it to you for those who don't know what to do to make this phone work since it doesn't come with a Sim Card.  The guy at Tracfone told me I could not use the Sim Card from my old phone.  I didn't try to.  I believed him because he didn't try to sell me a kit, as he told me where to buy the kit.  You can buy the kit he said at Walmart, Best Buy, or Dollar General. Prices will probably vary.  I had to go to Walmart so that's where I got mine. Be sure to restart phone. You can download a Moto 5G 24 Manual for this phone from the Motorola site for free and save to your computer.  To download everything from your old phone to your new phone by just putting the two phones next to each other while they are fully charged and are on, (at least I was able to as I was going from a Moto 5G 21 to the 24.)  That was so easy.  All contacts, photos and programs moved over.  I was staying with Tracfone so my cost per month isn't going up. I've made one error in messing with the set up LOL so I have to figure out how to fix that but that's my fault.  Gotta get the manual out and figure out what I did wrong.  All in all it's a nice phone, and I think you will like it too!",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Purchase!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "I love this Cell Phone.  Takes great photos, classic look, screen responsive, loaded with lots of perks.I highly recommend this item.  I did a lot of cell phone shopping and I feel the price is right for the quality and reward.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great battery life.",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "I've always been a fan of Motorola cell phones going way back to when the first flip phones came out and our choices were Cellular One or Cellular 2000. The one this one replaced was going on 5 years and it's nice to be able to get almost 1 1/2 weeks out of a charge again. I'm a very light user and aren't staring at mine most of the day like the majority of people these days and I don't play games on it either. Yes, it comes with a lot of preloaded apps like all phones and computers do nowadays but uninstall the ones you can and ignore the rest by sliding to a screen you never see. The phone has plenty of space for garbage apps and memory for my uses anyway."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, pretty great.",
      "date": "Reviewed in the United States on August 22, 2024",
      "body": "I'm not your normal phone user.  Prior to this, I was using a LG V50 (which I still love, but the software support isn't there anymore.  RIP LG) and am picky about a couple of things.1.  Expandable storage:  You can put up to a 1 TB microSD card into this guy, which is a wonderful thing.  Being beholden to cloud storage is stupid when you can have all of the removal storage you need right there.  I listen to a ton of audio books, so not having to sacrifice storage space on the device itself rules.2.  A headphone jack:  I don't always have a pair of bluetooth headphones with me, and sometimes it's nice having the superior quality that a wired connection gets you.  This doesn't have the absolutely stellar DAC that the V50 has on it, but the audio from the headphone jack is just fine, and the fact that it's there at all is a nod to long term usability that a lot of the other more expensive phone providers should really stop and think about.  You're saving pennies as a manufacturer for a feature that a lot of people love.3:  Battery life.  This was actually a surprise to me, since I didn't have stellar expectations for the battery, but this thing really does pretty well holding a charge for a while.  I'd estimate that I get a good solid 30 or so hours out of a single charge, although I haven't ran it from 100% to 0% as a true test yet.The level of pros outweigh the cons by a good bit.  I will say that the camera is kind of mediocre, but since I use my phone more as an actual phone and not as a replacement for a camera, I'm okay with it.  It's functional and does what it needs to do at an acceptable level.Overall, I would say that if you need a pretty great phone that punches way above its weight, don't even hesitate.  I do wish the stylus had some of the cool stylus functionality that Samsung includes (using the stylus as a remote shutter trigger is brilliant), but the fact that it has even the stylus that it does is honestly more than I ever expected.Also, I use this phone with MetroPCS service, and the enrollment process on the website was absolutely seamless.  I think they're using this model as sort of a budget flagship, although if I remember right the carrier based one only has 128 GB of internal storage.  Keep that in mind if you're looking at this phone without getting the unlocked version.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value for price",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Love the phone, good value for price, the pen that comes with it, is virtually pointless, it's hard to use, doesn't really work when you want it to. Also the picture quality could be better. Otherwise it's a good phone for the price."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Near perfect phone",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "Near perfect smartphone.ProsOLED screen120hzSnappy CPU (plenty for 99% of the world)8gb ramSD card slot3.5 jackStylusConsOnly 2x zoom on cameraCamera software which takes like 3 burst photos and merges them doesn't work great with moving objects.1 os upgrade3 years security.Lack of real water resistant",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    What a phone - love this",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "I had the 2020 Moto G Stylus, lice phone but a couple issues.  Frustrating finger pad being one.  Well, they fixed that in a big way and pretty much anything else.  It's a huge upgrade to this year's phone, it just feels nicer.  Quality phone!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT PHONE!",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "I'm really glad I bought this phone. I like everything about it. It's fast, powerful and good looking with a vegan leather back. It has 8GB RAM, 256GB of internal storage, 1200-nit peak brightness, and a refresh rate of 120Hz which is good for gaming. The screen is easy to see outdoors even in direct sunlight. For security there's an under-display fingerprint sensor and facial recognition, as well as NFC for easy mobile payments. It has a 50MP Ultra Pixel camera + OIS, an amazing 6.7\" pOLED display, loud Dolby Atmos sound, a 2-day 5000mAh battery and 30W TurboPower - 15W wireless charging. It has a 3.5mm headphone jack, a stylus and up to 2TB expandable storage, features missing from other midrange Android phones. The headphone jack is great for listening to the included Motorola FM radio app. The phone runs on Android 14, but an upgrade to Android 15 plus three years of security patches is included. What's not to like?",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    easy to handle, good price",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "so far so good.  It's a learning curve for me from my last out dated cell.  The screen quality is good and the sound and camera are a far better quality then my previous cell.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Great Price, and unlocked.",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Moved from my Moto G 2021 to this phone, Android 10 to 14 (with an upgrade when 15 makes it out.  Transferring everything from my old phone to this was a breeze, replacing the phone on my account with this one took longer.  50megapixle camera, sharp clear photos, NFC finally (although i may never use it) and a lot of other features you're probably paying too much for.  And unlocked, so the choice is yours who you deal with or when you can change providers. I love that.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Funciona bien en Ecuador",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Llegó bien a Ecuador con envío directo de Amazon, no cobró nada más que el precio indicado en la publicación. Funciona bien hasta ahora con la operadora Tuenti, lo único malo es que es para una sola sim, pero es compatible con e-sim. Muy bonito, es rápido"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Android 14 Prevents alot of older apps from being installed.",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "I bought this during Prime Deal Days and at 250 it was pretty cheap price.  I owned the 2023 version.  Now unless you need the new features or just want the new version there is very little reason to upgrade from the 2022 or 2023 5g stylus.The 2024 vers 20231) OLED vs LTPS they say OLED is better but to my eyes a = b2) Ram 8G vs 6G3) Added wireless charging but have only now ordered a charger to see if it works well.4) Added eSIM Support (why would anyone want an eSim)  With a sim you just take it out of the old phone and put it in new phone.  With eSim not sure how that would ever work.  You would have to go into carrier and have them put a new one on the new phone (and charge you for upgrade vs normal sim move being  free).5) Camera is different but have not seen better or worse.  I do not buy a phone to be a camera.6) There are issues loading older apps onto Android 14 as it refuses to install them when they work perfectly fine on Android 14.  They installed under 13 and work fine under 14 but wont install under 14.  You have to side load them using adb and USB debugging.7) On screen finger print and then face recognition vs power button finger print.8) Bluetooth, Wifi, NFC, SD Support are the same on both phones.Overall the phone is a good buy for price to features.  It is a true midrange phone vs a low end yet the price is closer to the low end especially if on sale.  The phone is pretty much like the 2023 version.  If you are looking for an inexpensive phone or have a non 5G version  then phone is worth getting.  If you have the 2022 g5 or 2023 5g then you might sit this one out.  I would recommend it to anyone needing a new inexpensive phone that wants some higher end features but does not want to pay 700 up to 1500 for a phone.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Bang for the Buck!",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Good phone at a good price. I've gotten several years from my last one. The price allows for more frequent replacement if you prefer that route. 1 flagship Samsung or Apple will get you 3-4 of these. You could upgrade every twelve months if you wanted but like I'd mentioned I get years of use from them."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm satisfied",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "I love this phone cheaper on Amazon then at metro pcs also takes pretty pictures and videos I also love the neutral color and texture on the phone",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Upgrade of older Moto G Stylus w/5G is much improved",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "I owned an Original Moto Stylus 4G LTE phone before, iPhone and other Samsung and LG models as well.This Moto G Stylus 5G is a much better phone than the previous model and it has a greatly improved set of camera features and PRO like settings.Both it and the iPhone take good photos, better than many other Android versions (never had a Google Pixel phone though, which is also feature packed).This phone comes in at a price point well below both Apple and Pixel phones with a lot to offer.A big plus is the wireless charging and I can use the same iPhone charging pad to charge the phone, the only thing is it does not have a magnet to center the charger in the exact spot. It does tell you if it's not in optimal charge position on the screen and you can then move it a bit but no indication other than the slow charging message disappears.Great screen size and resolution, stylus is a plus for quick notes or updates even if you don't use it on a daily basis. Only hope I don't loose the stylus as that was an issue with the prior model, this seems to latch in place better than the older versionOnly had it a short time, will update later as I use it more, but having owned the earlier model I can see a lot of improvements have been made.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than paying 1200.00",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "It's not a bad phone at for the price...the stylus pen is nice, but I really don't use it...Mine had 256 gigs of storage and the one at metro only had 128 and it was 10.00 more...Better then sucking it up with apple of Samsung"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Impressive value!",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "Came to this phone from a Pixel 5. Was surprised how big it was, lol! Features-wise, it is a great phone. Be sure to turn off the Motorola bloatware when setting it up. If you do that, it provides a near stock android experience. The stylus is nice, but I'm surprised I don't use it more than I thought I would. Very happy with this purchase.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Back to Motorola again!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "After 3 Motorola phones, then 1 Samsung, I'm back to this Motorola.  Happy with purchase."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value, Great screen display",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "I have own a few Moto 5g phones. This one is very good and responsive!  Iam glad I bought it.  My last one was working well but it fell onto the concrete as few too many times,  oops.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is amazing!",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "You can't beat the Motorola Phone, I have been buying these prepaid phones since Verizon started prepaid. I use them for 2 years then upgrade. I will never spend insane money on a phone. I abuse these phones I'm on all social media and I use the stylus for work and it runs great! Best bang for the buck. I didn't buy the 2023 stylus cause I didn't think it was worth it in features. As soon as I seen the features on this phone and it went on sale I scoffed it up. 💯👌🏻"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value for money",
      "date": "Reviewed in the United States on March 2, 2025",
      "body": "This phone is so good......... It's a great value for money. Battery life, photos, ease of use, connectivity, eSIM and so many amazing features."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as Good as the Preceding Model.",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "No, no, not as good as previous 2023 model, this 2024 is kinky and has a mind of its own."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone and good price",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Works great.  Don't miss my Samsung at all at this point, this phone works just as good and has little extras in program that I like ,  good purchase"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Basic phone",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "I bought this to replace the older,same  model. I loved the old phone. This one is smaller and not as good. It doesn't have as many quality details. It also likes to turn off on its own. It's basic, it works.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Moto g 5",
      "date": "Reviewed in the United States on March 7, 2025",
      "body": "No problem so far"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "What an improvement over my 5 year old Moto G Play!  The storage and RAM are more than enough for me, plus a RAM boost feature.  The phone feels good, but with a cover that really doesn't matter much.  The stylus works well, but I didn't buy it for that.  I bought it for its processing ability.  Two weeks and I'm glad I got it.  It is the top of the G series phones and has a headset jack and external storage.  These two items are why I got this one over the Edge."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Everything I need at a reasonable price",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "This replaced the 2022 version that I owned and liked.  This has an improved screen and speed.  I was not attracted to using fingerprint security on the prior one, but enjoy it on this updated model.  The battery life is great - I seldom use 25% in a day - and the charging is fast.  So far I have not used the stylus for drawing, but I find it most useful to select the correct link on a crowded screen.  As far as accessories goes I could not find an Otterbox case, so I purchased the Motorola Essentials case and Supershieldz glass  screen protector.My only annoyance is, on my prior phone, I could answer incoming calls without entering a PIN.  I understand this is a convenience vs security issue; however, I have not found a way I can allow that on this phone.  Than again, I am still discovering new useful settings.I use Consumer Cellular as my carrier and all network functions have worked well in the USA and Canada.  ( I did need to setup roaming with the carrier for service in Canada, but calls, text, and internet all worked.)Yes, I would buy it again without hesitating.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Speaker is muffled",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Bought this in August of 2024 and worked great then all of a sudden the microphone sounds all muffled unless it's on speaker phone. Hopefully can get it fixed!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Surprisingly satisfied",
      "date": "Reviewed in the United States on February 18, 2025",
      "body": "It's a functional phone. Surprised at the battery life, lasting nearly 2 days on one charge (heavy use). No need to have 2 accounts, like that of Sam****. One account (your Google) and this thing is very manageable! You'll love it!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I bought the moto g stylus 5g 8/256.And boy am I glad I did.It has a SD card slot, headphone jack, Dolby audio built in, wireless charging it's factory unlocked, esim compatible, GREAT battery life, super fast charging, POLED display,(and the display is gorgeous), what's not to like? There isn't anything I have found about this phone that I can say I dislike. It doesn't get hot no matter what I am doing with it, it never seems laggy, I am honestly impressed with this phone, for the price, it just can't be beat. Definitely recommend this phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great, was unlocked just as stated",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "This phone was replacing a motorola that was a few years old. The camera on this works really well and takes good pictures. The phone came unlocked and I had no problem getting it set up. The stylus is not something I use often but is a nice touch for some phone games that have smaller buttons.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on March 6, 2025",
      "body": "For the price these phones are great. Will definitely continue to but this brand and model",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone with outstanding battery life",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Had a G Stylus first gen since 2020. It still works but started to slow down some. This one has NFC and still has the fingerprint security but it's in the front now. Can't beat the price and the phone looks great.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast and good camera.",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Incrediblely good phone for the price. I recommend over Samsung or Apple.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    UI and overall ease of use!",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "Great phones!  Easy setup and functions were familiar to us due to having Motorola in the past.  Fast and easy to use.  There are some features that are newer and some that are platform specific.  Learning curve isn't difficult.  Love the UI and display!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 23, 2025",
      "body": "Like the phone a lot.  Does what I want it to do.  I would buy again."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Working as expected. Really pleased with my purchase. One of the best phones you can get for $250 if you don't really mind about major android updates",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2 days since arrived - updates to follow",
      "date": "Reviewed in the United States on November 25, 2024",
      "body": "Replacing my 35 month old Samsung Flip 5G that died due to very poor design (I learnt from the repair shop that 50% die by age 2), I returned to a flat screen Motorola.It was quite easy to add ringtones to the meager selection already on the phone.  Finger print readeris equally easy to program (multiple fingers can be added) and use.  The stylus hides securely inside the case.The single problem is finding a folding case (wallet?) that is actually designed for the Stylus 5g  2024  model.  Motorola has made too many changes and the case for the 2023 will NOT fit the 2024, despite the claims of  con artist sellers.  When I find one,  I'll post again.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blown away!",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "I was on the lookout for a budget-friendly Android phone and decided to give this one a try, especially since I was tired of using Samsung phones. To be honest, I didn’t have high expectations going in, but I was completely blown away!This phone is incredibly fast and responsive, handling multiple apps and tasks seamlessly. The storage space is fantastic, easily accommodating all my apps, photos, and videos without any issues. The design is sleek and modern, and the battery life has been impressive—it easily lasts me through a full day of use. If you’re looking for an affordable Android option without compromising on performance and features, I highly recommend giving this one a shot.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Mid-level Phone",
      "date": "Reviewed in the United States on January 25, 2025",
      "body": "This is a great mid-level phone. Similar to a lower end Samsung S series phone. I am enjoying taking pictures with this phone. The stylus is a nice accessory. It does not function as a camera remote, however. If it did then this phone would almost beat a Samsung."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great phone!",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "great phone with awesome battery life! I always been a huge fan of Motorola and this phone is good..",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente equipo",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "Muy bueno, el celular cumple con mis requerimiento, es muy completo y funciona muy bien."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MOTO G STYLUS 5G 2024 is the BEST",
      "date": "Reviewed in the United States on November 7, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    This MOTO G STYLUS 5G 2024 is the BEST phone to get as an affordable mid-range phone for the year 2024. Bought this moto phone here on amazon on sale for like two hundred fifty bucks. Therefore For Me This Is Now My Must Get Phone. And this moto phone has my Must-Have Features including: (1) NFC to use Google Pay, (2) screen fingerprint Touch ID, (3) fast Face ID, (4) Android 14 with at least an eventual upgrade to Android 15, (5) several years of android & google security updates, (6) beautiful OLED display screen, (7) great battery life, (8) wireless charging, (9) microsd slot, and (10) fast speedy processing for the typical stuff I do on my phone including reading news, email, reddit, watching youtube & steaming media, playing my solitaire, etc. This has all that plus more -- including the writing stylus. I'm basically upgrading from an Oneplus Nord N20 (previously bought here & still available here on amazon) but I did not want to get the N30 (available here on amazon) but in the meantime strayed over to get the Umidigi G5 & the Umidigi G6 5G (both umi's bought & available here on amazon) but for me the umi phones ended up being lesser phones particularly the G6's non-working NFC. HOWEVER, I can personally say in comparison for me this MOTO G STYLUS 5G 2024 is the absolute best quality phone to get. Number one for me was the NFC must work to allow me to pay using Google Pay -- and this moto's NFC does work & I can therefore pay using my Google Pay. And all my other must-have features are a bonus. And easily transferred most of my stuff from my other android phone + also transferred my nova launcher as my preferred home screen launcher. So A Big Yay! Very Very Happy! Some reviewers on the internet are saying this is the BEST affordable mid-range phone for the year 2024. And I agree. Definitely give this absolutely BEAUTIFUL phone a good looksee. Thanks so much to Amazon & Motorola.",
      "helpfulVotes": 60
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Motorola 5G Stylus",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I love the Motorola 5g stylus phone! Shockingly for the price, it's very robust and stands up to some of bigger well know brands. I've always liked Motorola products since their first Razer phones from way back when. Happy with this unit for my business use. Definitely recommend if you don't need all the extra bells and whistles. 👍"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does everything it's supposed to",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "This phone is working great, the only thing I would have concern about is the sensitivity of the screen, (have to tap it many times) but in all honesty I haven't messed around with its settings very much"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good for the money",
      "date": "Reviewed in the United States on January 23, 2025",
      "body": "I don't change phones often but needed more modern features for practical purposes. NFC was essential as virtual bank cards become more common. 120hz OLED screen works great at night or day and feels responsive. Not a photo or video person but serves it purpose when required. Best part is value for money as the build quality is great. Reviewed after 3 months use"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My favorite phone ever",
      "date": "Reviewed in the United States on February 28, 2025",
      "body": "Absolutely love this phone"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrific features for this price. As all the reviews say, s/w updates are the only real problem.",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Echo'ing reviews on the phone, there is so much to like, especially at this price point: great display, zippy performance, stereo speakers, headphone jack, 256 GB storage, headphone jack, wireless charging, etc. Biggest challenge is finding a good case. Am I really the only one buying this phone that is excited to be able to wirelessly charge? Could some phone case maker that wants to sell a lot of cases please make a case that supports wireless charging (w/o having to remove the case) AND that includes a kick-stand?! I guess it's too much to hope for... Case reviews for this phone are ATROCIOUSLY bad in regards to talking about wireless charging abilities.",
      "helpfulVotes": 19
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the FM radio",
      "date": "Reviewed in the United States on November 18, 2024",
      "body": "This phone supports FM radio, using an attached 3.5mm headphone as an antenna. You can listen using the headphones, or it can play the sound on the loudspeaker. It doesn't need Internet. The Moto FM app provides this. This is a fantastic feature on this phone and I have no idea why other manufacturers can't do this.When the zombie apocalypse strikes, and the Internet is down, I'll be getting civil safety information from the FM radio and I'll head to safety. Meanwhile, you will be stuck with your \"fancy\" iPhone trying to connect to TikTok. Good luck.Overall, there is very little crapware preinstalled on this phone. I recommend turning Memory Boost off, or least researching it a bit.I don't like Google Photos so I installed some app called \"Gallery\".Whites on the phone look slightly yellow to me but I think it's because I'm used to an older phone that was incorrectly blueish.This phone does not come with a charger and the double-headed USB-C cable is short. I don't want to buy an expensive 30W charger so I used an old 15W charger I had lying around.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I recommend for you to set up one program at a time prog itr.",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "This particular Moto phone has so much on it in terms of programs and also features that you're really better know a lot about phones before you try to use this."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for general use.",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "This phone would get 5 stars if it were not for Motorola's policy of limiting buyers to just one Android update and 3 years of security updates. The screen is bright with a much-improved font and user interface from earlier releases. Battery life is excellent. For the price paid  - excellent value.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Performance, excellent value!",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "I'm thoroughly impressed with this phone and am coming off the Pixel 6a. The battery life is perfect for all day use and it recharges faster than any phone I've had in the past.  I have yet to buy a wireless charger but it's nice to have that as an option now as well.It pairs nicely with all of the Bluetooth devices I have and I'll start loading more music to listen to for those times I'm out of cell service range(hiking, camping). Hooray for Expandable memory! I was surprised to find a headphone jack on this phone and have since ordered a new wired earbud set to have as an option.Phone fits in my hand nicely and feels well balanced for one hand use. Screen is bright and built in sound is plenty loud. Camera quality so far is excellent though I have yet to try it in differing light conditions.I'm very happy overall with my new Moto.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Good phone, excellent photos, not expensive"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great",
      "date": "Reviewed in the United States on February 13, 2025",
      "body": "I'm very happy with this new phone ."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Performance is great, uploads are soooo much faster than the 2021 model",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Performance is very good. The case I bought is pretty good, dropped phone about 2ft onto tiled floor a couple of times, once the Stylus came flying out. No damage to the phone.  I have numerous Apps for work on phone. I had to do transfer 3 times before they all transferred (blame Google). Also, getting Bluetooth and Flashlight to be on pull-down took a search and several steps.  Wish it was possible to reorder the Settings items - would like Location to be closer to start.Worth the price.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Customer Service",
      "date": "Reviewed in the United States on September 3, 2024",
      "body": "Purchase this phone and within 2 weeks the clicker button on the stylus stop working so you couldn't get it out of the phone without using a little exacto blade to pry it out. I called Motorola they had their heads up there but. Their tech came back and said please insert the pen and reboot your phone. I told them it's a spring issue in the stylus itself they said they call me back and never did. I called Amazon explain what was going on and without even questioning it or asking to get my old phone returned they sent me a new one and left it up the me to return the other one so I was out no money waiting for a replacement phone. Once again Amazon rules when it comes to customer satisfaction and returns thank you very much Amazon. On a side note I still can't find a screen protector that will work with the stylus without smashing it into the screen to make it work but other than that thumbs up to this phone it's a great phone.",
      "helpfulVotes": 12
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "Muy bueno, anda muy rápido y fluido. El lápiz es muy cómodo y el venir insertado dentro del celular lo hace muy práctico.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Friggin sweet",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "Love that this phone has all of the specs comparable to $1000+ phone at a fraction of the price... Very fast, no issues running on straight talk mobile just inserted the sim and she was ready to go.. file transfer from my previous phone took awhile but other than that no issues with the phone whatsoever"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MOTO magnifico!",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I am an Android guy and love this much less expensive MOTO. WORKS GREAT ! Long battery life and did I say MUCH LESS EXPENSIVE THAN IPHONES!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "I'm very pleasantly surprised with this phone I normally get one plus phones and I decided to give this one a try I figured for $250 it's not a terrible loss if it's not great. Again I was very surprised of what a nice phone is actually is. It's extremely light, It operates and runs all my business software apps just fine. The battery lasts. Pretty much all day. The rapid charging is an excellent feature as well. You honestly can't go wrong especially for the price.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone Review",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Love the dual SIM and camera features"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, awful camera",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Ok I had a Samsung Galaxy S23 ultra that cracked and went to this.  I honestly don't think this phone has skipped a beat in almost everything except....the camera is awful unless you are taking close up pictures.  I tried taking a photo from the sidelines of my kid playing soccer and he looks like Mario Brothers it is so pixelated.  With just a bit better camera I would have no problem buying this phone again, but now have to carry another phone or camera anytime I might want to take pictures of something more than about 15 feet away."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone",
      "date": "Reviewed in the United States on February 11, 2025",
      "body": "this phone when over my expectations for the price recommended.!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice Phone. solid Battery",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Solid Phone that Seems Well built and Plenty fast. Battery is Solid.  Screen looks very Nice Happy With Purchase",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Try it out!!",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I recently bought this phone in replacement of an iPhone 15. The phone quality is perfect, I use the fingerprint unlock feature and it’s spot on also. Pretty easy to use!Pros: it stays charged for about 48 hrs before I have to charge it. If I’m constantly on it though it tends to die faster (which is understandable). I really enjoy the lay out method of this device also.Cons: I have watched many reviews on this phone before purchasing so I knew what I was getting into. The sound quality can definitely be improved. It’s not terrible but it’s not the greatest either.Overall: for $240.00 this phone is a steal! I was a little hesitant as the price but I’m so happy I bought this device. I’m going on a week+ with this device and I’m happy with my results so far!",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone works!",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "I gave up on a Samsung A 54 5g after two years. We live in the country where phones shift between 4 and 5G service. We do have fiber optic so I use WiFi calling in the house. The Samsung phone would constantly miss and drop calls. It would also drop my radio shows I was streaming while walking around outside. Apparantly, it just could not transition from WiFi to cell and back very well.I have always liked Samsung and my wife's S 22 has been expensive to maintain but OK. However, this Moto has made me enjoy using a cell phone again and given me peace of mind so far. It even recognizes me over 90% of the time and if not the fingerprint works! Phone link works better with it and so far I can't tell any difference in photo quality. I guess you have to pay $1000 if you want a Samsung phone that works and takes great pictures!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    mostly good - keeping it",
      "date": "Reviewed in the United States on December 26, 2024",
      "body": "potential cons to consider:- can't do usb-c to hdmi screen mirroring, thought all new phones would be able to do it- taller than needed for hd aspect ratio full screen"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Acceptable with differences",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Battery excellent. Space excellent. Wi-Fi is the issue drops frequently compared to old phone on same wifi in same area of house. It's annoying but I needed a new phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    good",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "good"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the price",
      "date": "Reviewed in the United States on December 20, 2024",
      "body": "I've always been a Motorola fan and owned many of their phones. It works just as well as any phone costing over $1000. This one: fast loading, great pictures, light weight, loaded with features and security, good battery life, great picture /video quality; just great all around phone. I also had an Iphone 15, which I sold, and this Moto G works just as well and only cost a few hundred bucks.I mostly use it for talk, text, and taking pictures/videos. I don't do a lot of streaming. When I do streaming, it works great!Note to other reviewers. I read a lot of reviews complaining about service, delivery, wrong color, no refund, etc. and giving the phone a poor review. These issues has NOTHING TO DO WITH THE PHONE. You are reviewing the phone itself. Keep this in mind.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well as a phone. Speakers, camera and storage space are very good.",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "My provider is Tracfone and once I received the new sim card from Tracfone I was able to set it up.Moving data from the old phone was not difficult. I backed up to Google first.Between Google and Motorola there are bloatware apps that are not useful to me.Layout is different than my previous Motorola Stylus so there was a little learning curve.More storage and more RAM makes it very fast and I am able to keep more documents and pictures on my phone. The speaker is very good so I can hear it ring in the next room if the volume is up and also good to listen to music when I am away from home. The screen resolution is very good. Camera takes very good pictures. It's always a pain when the photo software wants to make changes that I don't want to make.All-in-all, happy with this phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Switched from iPhone - love it",
      "date": "Reviewed in the United States on December 7, 2024",
      "body": "My iPhone was giving out after less than 3 years so I got this on an early Black Friday deal to avoid spending a ton on a new phone. So far, everything has been great! I love the battery life, size, and speed of the phone. I had been a loyal iPhone user for over a decade and the transition to this has been easier than I anticipated. I love all of the gestures and features and feel like I can do more with this phone than my iPhone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is great!",
      "date": "Reviewed in the United States on January 5, 2025",
      "body": "Replaced my Pixel 5a 5G, with Moto.  I love it!  Battery is great, lasts way more then one day.  Screen is awesome.  Processor is very fast!  And it's a real bargain at $250!!!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone!",
      "date": "Reviewed in the United States on December 19, 2024",
      "body": "This 2024 Moto Stylus 5G is so much better than my old 2020 Stylus. It is significantly more responsive and the OLED display is beautiful. The camera is also improved. They also finally added wireless charging and NFC support. I've been waiting for those two features before upgrading. And they kept the micro SD card slot and 3.5mm audio jack as icing on the cake. As far as I'm concerned, this phone is the best bang for the buck on the smart phone market, hands down. Nothing can beat it for the price.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    what can i say",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "really loving this phone one of the best i have had in years  love it very much"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice cell phone",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "Used this phone for the last couple of months and I've got no complaints, battery is larger than my old phone, so it stays charged longer, that's nice.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Deal!",
      "date": "Reviewed in the United States on January 14, 2025",
      "body": "Got this one for my wife, I have the 2022 model but love the features and SD slot!Excellent buy for the money!"
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, awful camera",
      "date": "Reviewed in the United States on March 8, 2025",
      "body": "Ok I had a Samsung Galaxy S23 ultra that cracked and went to this.  I honestly don't think this phone has skipped a beat in almost everything except....the camera is awful unless you are taking close up pictures.  I tried taking a photo from the sidelines of my kid playing soccer and he looks like Mario Brothers it is so pixelated.  With just a bit better camera I would have no problem buying this phone again, but now have to carry another phone or camera anytime I might want to take pictures of something more than about 15 feet away."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Average. Short life",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "It was okay until it wasn't. When I try typing in, it took awhile for the keyboard to appear. I got annoyed and changed phones. Moto."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works OK; can't turn off.  Bluetooth issues with a BedJet",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "Nice big screen, great battery life.  Seems to be rugged.Can't figure out how to just turn it off; can only reboot it.  So if I need to turn it off to save the battery, I don't see a way to do that.Major annoyance:  every other cell I've had connected easily with my BedJet bed heater / cooler; this one (though I'm certain part of the issue is with the BedJet) requires EVERY DAY unplugging the BedJet, waiting 3+ minutes for a full reset, reboot my phone and hope it connects.  If it doesn't, dozens of 20 second retries.  If it connect , it does so ONCE before needing the resets.  My wifeçs Pixel 7a doesn't have the same issue.This always connects to my Bluetooth sleep mask, so it's likely something at the edges of the Bluetooth specs.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great, but....",
      "date": "Reviewed in the United States on January 11, 2025",
      "body": "I like everything about it, even its camera which Motorola has not been famous for. However, I have had two of them and they would lose both Wi-Fi and cellular signal a couple of times while traveling in the U.K. and two more times back back in the states. Resetting or turning the phone off and on would re-establish signal but we are older with health concerns and do not want to be diddling and fiddling if we have to call emergency services. I am sending my second one back."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Google controlled this particular phone",
      "date": "Reviewed in the United States on January 7, 2025",
      "body": "I love the moto g stylus but this phone was possessed. Every time I removed an app or changed setting to turn off Google would put it back on. NO, no one controls my phone except me. And apparently some phones are recording what you say with the camera and that is how they are constantly putting ads of something you just were discussing with a friend. NO!!! And why does Google have an E-Sim on the phone? Sending the phone back"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too complicated for to operate.",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Too complicated for me to operate.  Had to return for refund."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the phone but...",
      "date": "Reviewed in the United States on January 22, 2025",
      "body": "I have had two previous models of this phone and loved them both. never a problem. So when I bought this one i never took out the insurance, bad move. The stylus pop out feature guit popping out. Now I can't get the stylus out without prying out. SOL"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok for price",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "It not a bad. Phone , the main and important thing is the keyboard ,, you have to hit it very hard for it to your . And when you know it hit the letters it comes out wrong word , and that using finger or stylus . Other than the man thing , not bad phone . But rather Samsung Note !!!!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    G Stylus 2024",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "I own the Motorola G styles 2022 and I can say it has better battery life than this model. Seems like I'm always charging this phone and I've done everything as far as putting on the battery saver and lowering brightness. Otherwise, the phone is quick, lightweight and overall a nice phone.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "Nice phone but battery life is terrible"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone great, charger cord, not good",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Love the phone, but the cord that came with it didn't fit to plug in phone! Also was small plugs on both ends instead of small side and USB side. Had to buy a new one separately"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Happy !",
      "date": "Reviewed in the United States on July 31, 2024",
      "body": "I bought 2, Red for the Wife, Cream for me. I like to put Direct Dial buttons to call specific contacts on my Home Screen. Can't successfully achieve it with this phone. When I select the \"Direct Dial\" Contacts Widget place it on the Home Screen, select the specific contact of my choice, it looks okay, it's on the Home Screen and it has the correct Contact picture. However : when I call the contact it's okay, they get the call, but when the call ends the Contact Picture disappears, and the \"Direct Dial: contact has change to a random person from my Contacts list.Secondly, whenever I assign specific Ringtones, to specific Contacts, it continues to use the Stock Ringtone.In regard both of the above situations I have tried every possible option to try to fix them. Without any success.Disappointed.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It didn't last long",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "It started it great. Long battery life. I installed a gorilla shield glass protector the 1st day. No problems. All of a sudden I'm tapping the bottom of the screen on a browser app and nothing is happening!! I though maybe it was the browser and updated, restarted, all that crap. No Joy. Same problem, same spot. .... Wait maybe, IT'S THE PHONE! it's not 30 days old!Closed the browser, opened settings, opens the gallery app .. Nothing on the bottom of the screen (power port edge) is reliable when tapping. Can't find a touch sensitivity setting and it was fine until yesterday! Tried using the stylus too but sometimes it works sometimes it doesn't! @#!!$:! Cheap crap!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does NOT come with the wall charger!",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "Have to order one separately.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone",
      "date": "Reviewed in the United States on December 22, 2024",
      "body": "Surprisingly good Motorola phone for a change. Every other Motorola phone I bought has been garbage.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a bad budget phone",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "This phone isn't bad for a budget phone. The stylus works well without any lag. The phone is light and the screen brightness is more than enough for light sun shine use. The amoled screen is not as good as Samsung that you can get renewed on Amazon for the same price. It can game at medium settings. Feels too plastic IMO. Not a premium feel. Very mid tier. Not for the gaming or entertainment enthusiast.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok but not great",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Can't see any major improvements from 2022"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Camera is pretty good",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "Got this phone at a nice discount,and it works pretty well.nice camera for sure. The only Odd thing is that you can't set auto power on/off,but over all it worth it.Update: after using this phone for almost 3 months found out the battery is so disappointed,as a 2024 new phone  it it worse than my old phone which I used for 5 years.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not for me",
      "date": "Reviewed in the United States on July 2, 2024",
      "body": "This is my first Motorola in years (think Razer flip phone) and it will be my last. What an absolutely obnoxious amount of bloatware. I can't even count how many apps came pre-installed, Google being the main offender. I refuse to believe anybody actually needs 16 Google apps, I uninstalled what I could but not everything can be uninstalled and Moto apps - six of them, none of which are necessary or able to uninstalled. A whole app for Device Help that you can't uninstall?My old Pixel had 60 apps total on it, 33 of which I installed. After transferring my data and uninstalling everything I could on this one, there are 90. Ninety! That means there are almost 60 stock apps you can't uninstall. Now some of them are necessary, Camera, Messages, Phone, etc but others? YouTube and YT Music should be optional.As for the practicals, I actually think the camera is pretty decent. Unlocking it is a pain in the ass. The fingerprint sensor sucks. It doesn't read through the screen protector and if you try to set it up with the screen protector on, it repeatedly says it can't read the print. The facial recognition is hit or miss, especially if (like me) you switch between contacts and glasses. The screen is responsive and switches between screens easily.",
      "helpfulVotes": 43
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not even 3 months and it broke",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "I'm totally disappointed with this phone, I bought it in december,been taking great care of it, bought a nice and thick armor but still, I dropped it from my hand ,it landed completely flat to the floor and it broke on one of the corners like if I hit it with a hammer. Definitely not buying again a Chinese Motorola. So disappointed!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing charger base",
      "date": "Reviewed in the United States on November 22, 2024",
      "body": "The package did not come with the charger base. Not too happy about that.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value Budget phone",
      "date": "Reviewed in the United States on August 9, 2024",
      "body": "I like the leather backing but the phone performance is sluggish. Still a good value buy. Battery life is ok",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of money, time with much aggravation in store",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Purchase Motorola products again:  NEVER!!Reason:  NONE TO EXTREMELY POOR CUSTOMER SERVICE.  CALLS ARE IMMEDIATELY  DISCONNECTED BY UNINTERESTED EMPLOYEES.  Buy these products at your own risk and with the understanding that when you encounter problems (and you will) there will be no-one to help you to fix them. Really, what is the point of owning one of these phones if there is no reliable way of obtaining help when it is needed?  I have two new Motorola phones which are useless because they cannot be updated and there's no help from Motorola in which to do it. Save yourselves money, time and much, much aggravation and purchase a different brand. You'll be grateful you did. I CANNOT RECOMMEND this brand of phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    😕",
      "date": "Reviewed in the United States on August 17, 2024",
      "body": "Great phone. Screen is kinda touchy. Not good for games. The stylist doesn't work."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very disappointed!",
      "date": "Reviewed in the United States on July 29, 2024",
      "body": "Some of the functions didn't work for example, split screen, never could get it to let me use it. The screen saver option to use photos that you can customize doesn't let you customize. And the sidebar puts apps on it that you didn't want on the sidebar. Very disappointed! I've always enjoyed the Motorola phones and after this one, I don't know which phone I would want now.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My Review",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "I want to give my review, everything is fine with the phone but I didn't receive the charger.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crashed after 7 minutes",
      "date": "Reviewed in the United States on January 18, 2025",
      "body": "I just started setting this up, with minimal settings, and it was crashing when I was trying to add my second email account. Worked again after 5 minutes, but that's a bad sign to me.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not good",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "Keeps shutting off"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Return not timely processed",
      "date": "Reviewed in the United States on September 11, 2024",
      "body": "I purchased this phone based on the description and reviews and the phone did not live up to the expectations for many reasons.  I returned the phone and the supplier has sat in my phone for 5 days without refunding my money to my Amazon account.  Very disappointing.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought one and it was locked to AT&T service. Sold as unlocked",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Bought one and it was locked to AT&T service. Sold as unlocked",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Missing charger .. bad purchase",
      "date": "Reviewed in the United States on December 5, 2024",
      "body": "Got the phone but with no charger...",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Horrible",
      "date": "Reviewed in the United States on October 5, 2024",
      "body": "No sé pueden abrir las apps, se frisa la pantalla, no entrea la señal ni con wifi, no lo recomiendo",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great specs, bad UI.",
      "date": "Reviewed in the United States on January 12, 2025",
      "body": "The stylus truly is delightful. Unfortunately the experience is ruined by Hello UI. Incomprehensible & unfinished.I enjoy using the stylus for additional touch precision, as well as NDS game emulation. But I would switch to a OnePlus phone (without a stylus) just for a better UI/OxygenOS 15.I've only had this Moto for a couple months, I could not imagine a full year of Hello UI by Motorola.I was curious to try different variants of Android OS, after using iPhone iOS for a decade... Motorola Hello UI is not something I could recommend to friends or family (& neither is Pixel UI).Although this Moto does get \"value points\" for being the only eSIM capable >6.5-in OLED device, under $300 from popular retailers.A stylus can be nice, though in every way Motoroala decided to alter stock Android OS via Hello UI, it is a dettriment.The lock screen, the control center, the app switcher, the settings, the pre-installed apps, the camera gestures... Really was not developed with much thought.Both the vibration motor, and the loudspeaker, are noticeably lower quality than in high-end flagships. Which is entirely expected, at this price range, but it's worth mentioning anyways.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    will not keep apps open in background",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "this phone will close ANY app that is left in background for more than 10 seconds which is unproductive and unhelpful and barely makes any difference to battery life (the entire reason it does that) and this can not be disabledthe camera is decent and the stylus works",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Comfortable build, poor camera",
      "date": "Reviewed in the United States on June 9, 2024",
      "body": "I bought this from the Motorola store, not Amazon. It is lightweight, thin, and the textured back is grippy. (By the way, vegan leather is a marketing term for plastic leather). I have  long fingers soeven though it's large, it works for me.  The specs are fine for the price. But the camera is awful. The resolution is low...very blurry and ugly. My first digital camera 20 years ago (3mp) took better photos. And I just take simple photos around the house. The stylus is a nice addition.Overall, I'm pleased except for the camera. It's that bad. Something to consider.",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wow this sucks",
      "date": "Reviewed in the United States on January 10, 2025",
      "body": "I really do like this phone, it is an upgrade from my old phone, but the microphone quality was very quiet, meaning when you would make a call or record audios your voice would sound quiet as if you were far away from the phone. I contacted customer support and they didn't do much to help, they said I could have a new phone sent out and they would put a hold on my bank account for almost $200 until they got this phone... It just really sucks, instead I'm just gonna buy an external microphone and hope someone knows how to fix this",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone overall but missing a critical feature - NO CALL SCREEN",
      "date": "Reviewed in the United States on August 2, 2024",
      "body": "(written from my account but for my wife's phone) Overall, this phone is what we've come to expect from Motorola products.  The quality is good but not great.  The features are acceptable but not spectacular.  The expandable storage works well and is a plus.  It's, in general, much like my experience with previous generations.However, and I can't seem to find this listed anywhere, CALL SCREEN IS NOT AVAILABLE (as of 2024-08-02)!This feature is the whole reason I've been sticking with Motorola phones thus far.  I'm still using my One 5g Ace because of the call screen feature.  If this isn't an important feature to you, you could reliably (as much as one can expect with a Motorola) use this phone.  She likes the stylus support and the phone isn't too heavy and doesn't break the bank.But with call screen being missing, it's a deal-breaker for me.As a result of my wife's experience, I won't be switching over to to this phone.Note to manufacturer: If this feature were to suddenly appear in an update or something like that, I would order this phone today.  For now, we're mulling over the inconvenience of returning her phone.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Podría ser mejor, el stylus del 21 no se calentaba tanto",
      "date": "Reviewed in the United States on August 20, 2024",
      "body": "The screen is good, the cameras are decent, the battery is excellent, but it gets much hotter than normal, too much. I have a Samsung A35 and it has the same problem. We need to work to resolve this.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Moto g STYLUS 5G",
      "date": "Reviewed in the United States on February 1, 2025",
      "body": "I'm not a techie and hoping it will work better. My neighbor commented it was overpriced and recommended I return it. It saddens me  to think this is a bad purchase. The phone did not include a charger nor a sim card. I am very impressed of the features but lack the knowledge of how to use it. The instruction booklet is very small print. I plan on doing more research with someone who knows how to use this devise. I would like to raise my review from a two star to a five star."
    }
  ],
  "productDetails": {
    "productTitle": "Moto G Stylus 5G | 2024 | Unlocked | Made for US 8/256GB | 50MP Camera | Caramel Latte",
    "asin": "B0D1ZFS9GH",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "NEW built-in stylus. Jot notes, edit photos, sketch artwork, and navigate effortlessly with an improved stylus and updated software.",
      "6.7\" pOLED display and Dolby Atmos. Experience cinema-quality entertainment with over a billion shades of color and multidimensional sound*.",
      "50MP Ultra Pixel camera + OIS. Capture sharper low-light photos and smoother videos with an unshakable camera system featuring Optical Image Stabilization.",
      "30W TurboPower charging + over a day battery. Get hours of power in just minutes of charging, then work and play with unbelievable battery life*.",
      "Standout design. Make a statement with its stunning look, modern color, and soft, vegan leather finish.",
      "256GB storage + RAM Boost. Hold your everyday inspirations along with photos, songs, and movies—you can even use extra storage to boost performance*.",
      "*Dolby, Dolby Atmos, and the double-D symbol are registered trademarks of Dolby Laboratories Licensing Corporation. Manufactured under license from Dolby Laboratories.",
      "*Median users can get up to 30 hours of battery life. Battery must be substantially depleted; charging rate slows as charging progresses. All battery life claims are approximate and based on the median user tested across a mixed use profile (which includes both usage and standby time) under optimal network conditions. Actual battery performance will vary and depends on many factors including signal strength, network and device settings, temperature, battery condition, and usage patterns.",
      "*Available user storage is less due to many factors, including operating system, software and functions utilizing part of this capacity; may change with software updates. RAM Boost extended RAM requires use of phone’s internal storage as virtual memory, decreasing storage capacity; available user storage is less while in use. Available RAM is less due to operating system, software and other functions; may change with software updates. Features vary by market."
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Motorola",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": "$249.99$249.99$249.99",
    "buyNewAvailability": "In Stock",
    "buyUsedPrice": "$210.75$249.99$249.99",
    "buyUsedAvailability": "In Stock",
    "shipsFromNew": "Amazon.com",
    "soldByNew": "Amazon.com",
    "shipsFromUsed": "Amazon",
    "soldByUsed": "Gadgets-Deal",
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "numOffers": 18,
    "startingPrice": "$184.99",
    "url": "/gp/offer-listing/B0D1ZFS9GH/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0D1ZFS9GH",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "USB Cable",
        "SIM Tray Ejector",
        "Stylus",
        "Guides",
        "moto g stylus 5G Device"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$249.99",
    "listPrice": "$399.99$399.99",
    "savingsPercentage": "-38%",
    "standardDeliveryDate": "Sunday, March 23",
    "primeDeliveryDate": "Thursday, March 20",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}