{
  "asin": "B0BDY71GRG",
  "allReviews": [
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great value for price!",
      "date": "Reviewed in the United States on January 26, 2025",
      "body": "I purchased the refurbished iPhone SE, and I’m genuinely impressed! The phone arrived in excellent condition, with no visible scratches or dents. It works just as smoothly as a brand-new phone. The battery health was at 90%, which is great for a refurbished device, and it holds a charge well throughout the day.The compact size is perfect for one-handed use, and the performance is surprisingly good for such a budget-friendly option. Apps run smoothly, and the camera quality is decent for casual photography.Overall, this refurbished iPhone SE is an excellent choice for anyone looking for a reliable phone without spending too much. I would definitely recommend it to others!",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Took a chance on a refurb iphone SE 3rd gen. Was in excellent condition, battery life 100%, Just a very small blemish on face, can't notice unless held at an angle. Really almost like new. Sides and back are perfect. Saved close to $300. Replaced my 10 y/o iphone 6s. Called my carrier, switched out the sim card, eezzy peezzy. Got a new otterbox case and good to go! Really a nice phone, very happy with it! Choose this seller because of their high rating, well deserved.",
      "helpfulVotes": 11
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Overall good except the battery. This price can't complain",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Overall good. BUT the battery health is ONLY 80%, barely meeting the standard for a renewed phone. It could have been better if it's at least 85 or 90%.Minor scratches on the brinks and the back of the phone. Doesn't really matter.Can operate fluently.Good price. Hope it would last for another 4 yrs for me.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the price, good product and no problems",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "My wife's previous phone a 1st gen SE began having issues and it had been repaired a few times.  She doesn't use it much so it's not like we needed to get anything expensive and new.  This has done the job.  After having it for a couple of months, I'm pleased with the purchase, the quality of the phone, and the parts or work that went into refurbishing it.  The battery life has been exceptional, the wifi speed is great, there is no lag, the camera works great, and I've not had any regrets.All that said, you should not expect this to have the same performance as a new phone out of the box.  It's overall what I expected, but neither was there anything that gave it a higher-than-expected rate.  The battery performance remains high but the capacity has diminished a little more than I'd hoped.  Probably an aftermarket rather than a OEM batter. Very satisfied but nothing to wow me either.",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasant Surprise",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "The phone is in excellent condition. No visible scratches on the phone or screen. Everything works great, and there's been no issues so far. It's been about 1 month into having the phone. The battery was at 84%, so not the greatest, but it's a roulette for getting higher battery life phone. It is still within the limits as advertised. Will likely have to buy a new battery and change it out, but it will still be cheaper than a brand new phone.I had an SE2 (that I bought new from apple) with touch screen issues before this, and the switch to the SE3 was an affordable option. It was my first time buying a refurbished phone from Amazon, and I am not disappointed. I will likely buy refurbished going forward.",
      "helpfulVotes": 7
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome!!!",
      "date": "Reviewed in the United States on November 21, 2024",
      "body": "I am absolutely thrilled with my Apple iPhone SE 3rd Gen, 64GB, Starlight - Unlocked (Renewed)! As someone who loves Apple products but wanted to save a bit of money, purchasing a renewed iPhone was the perfect choice. The phone arrived in excellent condition, looking practically brand new, and it has been performing flawlessly.The Starlight color is stunning—sleek, modern, and subtle, with a nice shine to it. The 4.7-inch Retina display is clear and vibrant, making everything from browsing social media to watching videos a pleasure. The A15 Bionic chip inside is incredibly fast, making the iPhone SE feel as responsive as any flagship phone. Apps load quickly, multitasking is smooth, and it handles gaming and media consumption effortlessly.The 64GB storage is perfect for my needs, and with iCloud, I have plenty of space for photos, music, and apps. The camera is impressive, especially considering the phone's size and price. The 12MP main camera takes sharp, detailed photos, and the front-facing camera works great for selfies and video calls.What I love the most is the performance. Despite being a more affordable model, the iPhone SE 3rd Gen delivers top-tier speed and features. Face ID works seamlessly, and the Touch ID option is great for quick unlocks. The phone is also unlocked, so I can use it with any carrier, which adds a lot of flexibility.Overall, I couldn’t be happier with this renewed iPhone SE. It offers exceptional value for its price, combining powerful performance, a great camera, and all the features you'd expect from an iPhone. If you're looking for an affordable, high-quality iPhone, I highly recommend the iPhone SE 3rd Gen!",
      "helpfulVotes": 23
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good looking phone with a bum battery.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "I ordered the 3rd iPhone SE and selected excellent renewed condition. The phone has no obvious damage to the exterior with little evidence of use, but the battery health is seriously diminished at 79%. Far lower than I expected when paying extra for the excellent condition renewed phone.Unrelated to the item was the shipping. I needed a phone to replace my failing 2nd gen SE that was turning off every 2 minutes. Ordered trusting the estimated delivery date that would only be a couple of days. Shipping across the country, it took longer than quoted. I would have much rather have known this and paid extra to expedite the delivery.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely a used phone, but in decent shape for the price",
      "date": "Reviewed in the United States on December 14, 2024",
      "body": "There's no doubt this was a heavily used phone. I feel that \"renewed\" is a bit of a marketing ploy, because it's USED, plain and simple. I can see the marks where the previous user must have attached a lens over the camera, and there are faint \"in the pocket\" scratches on the screen. Thankfully these marks and scratches are not visible except in direct sunlight, so they do not interfere with the picture quality. The battery also seems to be in decent shape for a used phone.My theory is these phones are turned in for credit when people upgrade to the next latest-and-greatest phone. I wasn't impressed with how the phone was delivered to me with a totally drained battery. That and the OS was not properly reset. This was definitely not the same experience as buying a new phone from Apple. But again, I'm judging this phone with price in mind.As for the phone itself, I wanted a phone, not a tablet / phablet, and this phone is great in that regard. It fits wonderfully in my pocket, and yet it has all the capabilities of a larger phone. The phone is fast, responsive, runs the latest iOS, has a great camera, and supports the latest 5G cellular protocol. It feels good in the hand, and the signal quality is what I expect in my area. The funny thing is that I didn't want to upgrade to this phone (I was happy with my old Windows phone), but when my old phone stopped working, I had to get a replacement, and I'm kinda glad now because this phone is very good for what I'm interested in - phone, text, photography, mapping, hiking, etc. For everything else, I rather use my iPad.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    fast on time delivery and works great",
      "date": "Reviewed in the United States on February 12, 2025",
      "body": "My iPhone 6S+ was not able to update to iOS16 which is now required by many apps and banks. I bought an iPhone SE second generation from another seller and it looked like new. Unfortunately the WiFi didn't work and I was unable to do the setup. I won't blame the seller for that, it can happen. I read by a reviewer to look for a seller with 99%% reviews and found this one offering this SE 3rd generation for just a little more money. I ordered Sunday and it was delivered this Tuesday afternoon. I was afraid to have again problems but everything wen smooth. The install went fine and when I was done I called the cellular company to refresh the connection over their network because I didn't have internet access over the cellular network. That solved it and my phone is now working perfectly in 5G. The battery health shows 99%.There is a smudge on the left side of the finger print reader but it is below the screen. There is also two very fine scratches on the screen but you really have to look for it. And even then you have to look with the screen off otherwise you don't see it. It doesn't disturb at all.No warning of non genuine parts replaced, which is really good.I am very happy with this purchase, of course it is only the first day but I feel confident.I'll update the review if needed.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for my needs!",
      "date": "Reviewed in the United States on March 11, 2025",
      "body": "Needed a small unlocked emergency phone to use just in case my main one gets lost. It was a lot cheaper buying it renewed compared to brand new which is frankly a rip off due to how “old” this phone is even with the new chip and eSIM compatibility upgrade. The seller that Amazon is fulfilling for did a great job in keeping the phone in operable condition along with a new (not iPhone manufacturer’s) box with a charger and a SIM card extractor included. Overall would recommend. Just be sure to check the quality/condition of the phone before buying! Mine was at “excellent” rating.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Check out voice quality when talking with others.",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "Everything on the phone works fine except the voice quality.  People I talk to say I sound scratchy and voice goes in and out.  I thought maybe I was putting finger over microphone but apparently that's not the reason.  So I will next go into an Apple store to find out what's up."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Are you sure it's not brand new??  Super happy with this phone!",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Replaces a 2nd gen SE, with 126gb storage, that I lost.  I love the SE because it doesn't \"look\" at me to unlock it.  I like the feel of the home button and I like the overall size.  This 3rd gen was absolutely flawless!  They say refurbished and I would assume it was, perhaps, used for a time.  It looks like it came right out of its original packaging. I would have never known it wasn't brand new, off the shelf, were it not for the non-apple packagine.  Its faster than my 2nd gen, the pictures are WAY better thanks to the faster A15 chip and overall, I am very, very satisfied with this purchase.  I'm so pleased, in fact, that I will likely go this same route when it's time to replace another phone (likely my wife's).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent Phone",
      "date": "Reviewed in the United States on March 1, 2025",
      "body": "I got the Iphone SE 2nd gen 64G 5 years ago and had no issues with it except storage wasn't enough for Me anymore; as Apple launched the new 16's models, which I wasn't ready yet $$, I got this renewed SE 3rd gen 128G. I can tell the bionic processor makes a difference. But the real reason I switched was because my Son had my old 6e (10+ years old) which its IOS 12 makes its security more vulnerable, and application limited, so he's getting the SE 2nd gen now. Hopefully Apple will continue supporting these platforms for 5+ years more before our next upgrade ;)",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very affordable but do consider keeping a charger cord & or extra battery booster when out and about",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Awesome affordable I phone. My biggest problem is it seems that refurbished phones ship out with batteries at 85% capacity as a normal standard. Very satisfied with phone overall but it is a bit of a bummer to get the phone with a battery that runs down fairly quickly. Phone battery died on me last night when out to dinner.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    2 out of 3 phones did not work",
      "date": "Reviewed in the United States on February 17, 2025",
      "body": "Thankfully the third time was the charm! The first refurbished se3  phone had a touchscreen that did not respond to touch. The second refurbished se3 phone had a broken microphone- so no phone calls, no siri.  Finally, I received a working SE3 phone from Amazon.My question remains: how weak is the inspection before phones are sold and shipped?",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone good, battery max health is 80%",
      "date": "Reviewed in the United States on February 21, 2025",
      "body": "Had this SE3 for 24hours and seems to be working great, only issue is the Battery Max Health was 80%. So will need to get that replaced fairly soon which will be another $50 on top of what I paid for the phone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good enough. First time iPhone user.",
      "date": "Reviewed in the United States on June 19, 2024",
      "body": "This is my first iPhone after 16 years of Androids (in $50 to $800 range). Got this as a secondary device. The phone is OK. I am not a fanboy of any kind, and it is OK for the secondary use case I need it for, but would not switch to it as my daily driver. I would recommend it to some of my friends who do not like change. They would probably like this more over a lot of Android innovations which are often cool and innovative but when they are not, they are annoying too. But once you have the power to customize your experience, it is hard to accept substandard solutions. The notification center is pure garbage. It is literally worst than it had ever been in android. Other UI/UX solutions are highly questionable too. I had to switch between 3 different places to change something about the sleep app. Lol, it was so stupid it was fun. Cannot quite believe this is a company known for user experience.I do appreciate the ability to remove many stock apps. Not being in apple ecosystem it is great to remove facetime and similar things I will never use.  Google overreaching lock-in is annoying. Though I use custom ROMs to remove Google garbage, but that is not a solution for everyone. I really like that Apple lets me remove their trademark apps. I do not want to not use them. I just want them out. Big bonus points for that.  Also love the ability to disable iMessage. I do not want my few iPhone-owning friends to know I have this device because they will send me social crap (aka videos) and now I have the excuse that when it comes as MMS it is un-viewable and I do not have to engage. They can always send it to me by email but they are to lazy tod o that, hehe. So disabling iMessage is a saver! VERY happy with it. Some people just do not understand you do not care about the latest new trends. Also love the physical button and the small size. Hate not having an aux jack and the non-universal power connector.Overall, I am OK with it for the excellent like-new renewed price of 50% off. If they keep making small, mid-range phones with physical buttons I might stay a customer for a long time. At full price, big screen, no button, it would be a no from me. Cannot see the appeal overall. It is a decent 4 stars for a person not locked to any ecosystem.",
      "helpfulVotes": 9
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nearly new Phone",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": "The phone was in near perfect condition. This was a phone in the excellent category. Glass screen saver installed.  Works like new.  It was packaged well.  I have four stars only because the battery health was at the minimum advertised of 80%.  Was easily updated to IOS 18.  This is the way to avoid the rather substantial cost of an iPhone.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Although listed as excellent, the phone arrived in what I would consider premium condition. The battery life was at 100%.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great customer service!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "I bought this phone to replace an ageing iPhone. So far, it’s a dream.  Layout, colours, screen, etc. are all great. The company, Bayshine Trading, has been very supportive, as I’d bought a previous phone from them, which I had to return as it had a problem. The Company was very responsive, efficient, and knowledgeable about the whole process, so it was no difficulty to return.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Watch out for battery life...",
      "date": "Reviewed in the United States on December 25, 2024",
      "body": "All seems well, it just that it said it should have more than 80% battery life remaining... the one I got has 79%... so was  borderline to return it... however I waited 3 weeks to getvit delivered to begin with and also needed to test a few things I needed the phone for... a better carrier, esim, adapters to use it for recording audio, camera apps, playback on a tv using cable vs wifi, etc.Found on Amazon a battery phone case that could supplement the existing battery so all the tests went well and ended up keeping it.Also looked online and there is a service to replace the battery with a new one for around $80... hope I won't need it soon.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exceed my expectation",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "Didn't buy the most current model (16 series), because I \"lost\" my previoius one to water damage accidentllly, so I'm looking for a budget friendly one.I'm expecting something used but well fucntioned. However, the performance of the phone is near peak/brand new. It's definetly not a brand new, I can see some minor scartch at some parts, and the microhpone is not as clear (almost unoticeable), but the battery performance indicate a short mileage.Very satisfied, proud of the decision.  Granted, the refurbished items is are case by case, but the average review looks good, so you have a good chance",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE 3rd Gen",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Received the iphone on time in excellent condition.  Works great.  I’m 77 and did all the transfer and set up myself - my first time.  Very impressed with quality and prompt on time free delivery."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No scratches and great condition",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "I was nervous getting this phone after reading some reviews but my phone came absolutely free of defects (no scratches dings or dents). Apple has made the set up super slick. The phone was a little warm during transfer, but for 90gb that’s to be expected.This feels very similar to the Apple 8. The red color is as pictured (I personally don’t like it that much but it was cheapest!).No comment on durability."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome price on original apple iPhone",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "Got this phone on a great deal compared to other places like CL. Phone came securely wrapped and in excellent condition as indicated by the listing. Seller was easy to contact and always replied promptly. Super happy with my iPhone purchase"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Came in better condition than I expected! Ordered acceptable condition and it had slight cosmetic flaws but not many and looks very nice. Completely functional and a good refurbished phone"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Rescue phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "My husband is in a nursing home and broke his phone when he dropped it…this replacement was what he needed to keep in contact with family and friends."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!!!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Im OBSESSED with this for the price. Im going into middle school and don't need a super expensive phone and this is perfect. great price and works so good! the battery life is 88% which is perfect! came a day early and in great condition! DON'T HESITATE TO BUY THIS!!!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "After accidentally breaking my 11 pro max and getting the SE3, I love it. It reminds me of the 2016-2018 Iphone era and I love my home button."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    SE iPhone",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "First one came and speaker didn’t work they exchanged it and everything works great."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen and back glass in excellent condition",
      "date": "Reviewed in the United States on March 15, 2025",
      "body": "Like-new appearance and 85% battery capacity. Love the weight and feel of the 4.7 inch iPhone. Highly recommend."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome battery and proce --  Love it!",
      "date": "Reviewed in the United States on January 28, 2025",
      "body": "Had the 8 but needed to upgrade because of work.  Best decision ever.  Phone was clean and like new.  My old 8 had to be charged every night and sometimes during the day.  I had background refresh turned off but it never worked.  Got this, put the latest ISO on it, turned off background refresh and not looking back.  I have gone almost three days with it and still charged.  It was not expensive, I sill have my button and keeps a charge.  Best phone ever.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrific buy",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "The i-phone was in terrific condition, looked like a brand new phone and it works great."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iphone se",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "Phone arrived quickly and is in good condition."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    fast ahead of time delivery, works perfect w/100% battery",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "Working perfectly, including after having full diagnostics check at local Apple store for peace of mind, the results of which indicated no issues and \"new\" battery condition of capacity at 100%"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great deal but teeny tiny phone",
      "date": "Reviewed in the United States on November 4, 2024",
      "body": "My purpose in getting this phone was both to have an iphone for around $200 and also have something that didn't need a separate fanny pack just to fit on my person.  This one fit the bill perfectly but is maybe even smaller than I intended.  You won't be winning any speed typing competitions on this munchkin sized bit of the iphone upper crust but at least you won't be carrying a basketball backboard around in your pocket either.I'm happy with my purchase - perfect condition with apple packing material still on the phone in a condition that could only have come from the factory itself.  Must have been open box.  Not a single mark on it.Great deal.  Would buy again."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cosmetically is 100%, battery health is 89%",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Cosmetically the phone is in excellent condition but when I dig a little deeper the battery health is at 89%. The third generation SE was produced in 2022 so this battery level is expected.I paid $355 for this phone unlocked and refurbished. An unlocked phone with 256 GB of storage memory from Apple is $580.My main concern is that the battery health is 89% so we will see how this purchase works out. I usually keep a phone for 3 to 5 years.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "This phone is exactly what I was looking for. Easy transfer from old phone. Didn’t pay much and the battery life is very good!"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    excelente condición",
      "date": "Reviewed in the United States on February 5, 2025",
      "body": ""
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Condition, But Battery Capacity Was a Letdown",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "The phone arrived in good condition, and I had no issues with the iOS update or transferring my account, which was great. However, the battery capacity was only at 80%, which was disappointing. According to Amazon’s guidelines, an \"Excellent Condition\" device must have \"Battery: >80% of original battery life\", meaning it should be at least 81%. Now I have to order a new battery and spend extra time and money on replacing it. It would have been a five-star experience if the battery capacity was better."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE 3rd Gen, The Best iPhone",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The iPhone SE 3rd Gen is Tops in all respects.Best of all ... it's a phone!Cheers"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Shocked isn’t a strong enough adjective",
      "date": "Reviewed in the United States on December 9, 2023",
      "body": "I received my phone the next day but was thrown for a loop that had a great ending . The phone was very nice looking , cleaning no scratches  I plugged it in and charged it and really just wanted to check the battery percentage , to my surprise it was at 100 . But what nagged me was I thought the IPhone SE 3 used a usb C style cable similar to the one in the switch lite etc . But it took the fire charger I had in my IPhone SE 2 I was immediately distraught. OMG this is the same as my iPhone SE 2 I immediately went to Google to understand what was going on . Google said USB C . So I called Amazon and said there must be some mistake . They contacted Synergy and I was already to send this back . In times like these you can smell a scam everywhere lol, well I didn’t expect to hear from synergy till the 12th hour convinced this was some foolishness when my kid walked over and admired the iPhone well I told him they got me it’s a IPhone 2 not a 3 . He said how do you know that. I said the plug and it looks just like the one I got .He calmly picked up the phone and said look at the top left hand corner if you see a 5 it’s a 3 . I looked and saw the 5 . But me being the parent and hating to be wrong I said well I’m what about the plug? He said IPhones 3 use the same plug as the 2 .I was happy then synergy contacted me saying I could return . All  of this in less than a 3 hour window period!!!!  Well I wasn’t sending this back but I appreciate the speed In which these people provide customer service . The days of customer service and Will call etc are a dated concept that you do not see unless you go into a boutique on 5th ave . I’m very pleased with not only my purchase and the true to the last detail as described in the add but also the level of professionalism that this seller has and you can bet your last dollar when I update my iPad mini 5 to the 6 if this company is selling them and I decide to go refurbished again they will get my Bussiness . If your reading this this was my experience and testimony of my experience I am duly impressed",
      "helpfulVotes": 17
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Compact Travel Companion: Apple iPhone SE 3rd Gen with Google Fi",
      "date": "Reviewed in the United States on May 19, 2023",
      "body": "The Apple iPhone SE 3rd Gen, combined with Google Fi service, offers a reliable and compact travel phone that meets the needs of globetrotters. Here's my review, with an emphasis on its performance as a travel companion:1. Compact Design: The iPhone SE's compact size makes it an ideal travel companion. Its smaller form factor allows for easy handling and effortless portability, fitting comfortably in pockets or small bags. Despite its size, it doesn't compromise on functionality or performance.2. Compatibility with Google Fi: Utilizing the Google Fi service on the iPhone SE enhances its value as a travel phone. Google Fi provides seamless connectivity and coverage across multiple networks, including international roaming options in many countries. This allows travelers to stay connected and avoid excessive roaming charges while exploring different destinations.3. Performance and Software: The iPhone SE 3rd Gen delivers impressive performance with its A13 Bionic chip. It offers a smooth and responsive user experience, enabling swift app launches, multitasking, and smooth browsing. The latest iOS updates ensure that users have access to the latest features and security enhancements, making it a reliable device for travel.4. Camera Quality: The iPhone SE's camera capabilities are noteworthy, especially for travel photography enthusiasts. With a 12 MP rear camera, it captures vibrant and detailed photos, even in challenging lighting conditions. The Portrait mode and Smart HDR features add depth and enhance the overall quality of images. Additionally, the phone's 4K video recording capability allows for capturing memorable moments in high resolution.5. Battery Life and Charging: The battery life of the iPhone SE is decent, allowing for a full day of moderate usage during travel. However, heavy usage or extended periods of navigation and media consumption may require frequent charging. The device supports fast charging, which is beneficial for quickly replenishing the battery when needed.6. Storage Capacity: The 64GB storage capacity may be limiting for some travelers who tend to capture a large number of photos and videos or download extensive offline content. Consideration should be given to managing storage and utilizing cloud-based solutions or external storage options for extended trips.Overall, the Apple iPhone SE 3rd Gen, paired with Google Fi service, offers a reliable and compact travel phone experience. Its small size, powerful performance, compatibility with Google Fi, and impressive camera capabilities make it a great choice for travelers. While battery life and storage capacity could be potential considerations, the overall package of features and functionality make it a solid option for those seeking a travel-friendly device.",
      "helpfulVotes": 43
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got what I needed, decent price.",
      "date": "Reviewed in the United States on March 16, 2025",
      "body": "No complaints"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Highly recommend",
      "date": "Reviewed in the United States on March 13, 2025",
      "body": "Unlocked came like new"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth every penny",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Received in like new condition, works great.  Would recommend to everyone who wants an economical great phone."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent iPhone",
      "date": "Reviewed in the United States on January 30, 2025",
      "body": "I'm very happy with my purchase. While it's a refurbished, I couldn't see any evidence of prior use. There were no scratches, and the battery is at 100%. My only complaint is about pricing, so you have to be patient to buy one of these phones. The price fluctuated by about $50-70, which was very frustrating and annoying. This is the only reason it was not a pleasant buying experience."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone.",
      "date": "Reviewed in the United States on March 10, 2025",
      "body": "iPhone was in excellent condition"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product",
      "date": "Reviewed in the United States on March 3, 2025",
      "body": "Great, efficient product, for texting, calling, pictures, and emails. Not to big and easy to use."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's worth the money",
      "date": "Reviewed in the United States on December 6, 2024",
      "body": "The phone is good. I don't know why it comes with a screen protector, but it doesn't matter. The only concern is the battery lifetime. The seller did not replace it with a new one. So I think it can last for 3 years at most. If you need to use a new phone for more than 3 years, please leave it alone.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition? I don't think so.",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Battery capacity at 85%. Multiple deep scratches and nicks on the screen. Two dead lines down the LCD screen. Crust and crud in the speakers. Knicks in the body as well, though thats the least concerning issue..I love my current SE2, but the screen is pretty smashed up and I am pushing the limit of my 64gb capacity. An minor upgrade for $250 seemed reasonable. Super annoyed that I had to finish setting up the new phone before I could see what all is wrong with it. If it were cheaper I'd consider keeping it, but this is not cool for the top most expensive listing..Also, the red of the SE3 is a bit darker then the red SE2. Thats not a problem, just more information.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Nearly Sufficiently Well Done",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "When a vendor says \"renewed\" one would expect OEM parts, such as the screen on a phone, to be used.  That is not the case with the phone I received.  It has a sort-of \"mini\"  overlay which is noticeably not the same since the resulting phone is thicker and depending upon how one holds the phone when using it as a phone, less comfortable than one might expect or have grown used to experiencing.  One may have the disconcerting experience of having the edge of an earring encountering the edge of the stiff plastic overlay,  The overlay is removable and there were no large scratches,Otherwise, the phone seems to work even if it now uses IOS 18 rather than the original version.  I would have preferred the original version.  IOS 18 has more of the latest IOS nonsense: \"haptics\" that are useless AND annoying, still more intrusion into one's personal life, and I couldn't transfer my music library -- the transfer from ios 17 kept failing in a bizarre manner.  As usual, Apple now wants to know everything.  It's my phone, not theirs.  Actually, an iPhone 6 -- really -- is a better user experience mostly because the applications are smaller and more focused.In summary, the \"renewed\" phone is a disappointment since it doesn't have quite the same look-and-feel as an original.  If you want or need a less-expensive phone capable of running IOS 18, this should suit your needs.  It suits mine.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE, 3rd Gen",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The package arrived on time. The product is in good condition."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone!!",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "The phone was in great condition - no problems getting it set up!  Would definitely recommend!!"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great experience!",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "I ordered a 128 gb iphone SE3 in exellent condition. The phone has next to no cosmetic damage and the method to transfer all of my data from my old iphone 7 to this new phone couldn't have been easier. The phone also arrived a day earlier than stated! Fabulous.My only complaint is the battery health is at 82%. To me, that is low for a phone marketed as refurbished to \"excellent\" condition. However, reading the fine print of the Amazon Renewal store, my phone meets the conditions what they categorize as \"excellent\" condition (battery cutoff is 80% for \"excellent\"). Buyer beware about this, if you want battery life of at least 90% make sure you get a phone labeled as \"premium\". I plan to keep the phone, but am aware I'll likely have to go through replacing the battery in the near future. I already bought a portable battery for the phone. Mea culpa, but FYI for future buyers.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s the real deal",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "Fantastic, the only problem I have is that the sensitivity seem pretty bad, most of the time it doesn’t works. But aye maybe it’s just my phone, good product though!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition",
      "date": "Reviewed in the United States on February 24, 2025",
      "body": "Came in perfect condition. There were no scratches or dents when I got the phone and arrived in time."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value buy if you only have a phone because you have to",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "I only get a new phone when apps force me to. I considered changing banks because they stopped supporting whatever IOS my 6S had. 200 bucks for a phone still in production is not bad at all. I miss the screen size of the 6S and probably should have spent $100 more for the 13 just for legibility and keyboard space :(I can really feel the increased processing power coming from the ancient phone to the SE but that is not really important to me. The battery is unimpressive! It last about 2 days for a guy in the bottom 10% of screen time. The camera is good enough for gov't work. I used it for drum breaks yesterday to make sure I know where all the springs go and in what order.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Buy",
      "date": "Reviewed in the United States on February 19, 2025",
      "body": "First refurbished phone I have purchased and it was a good deal. Phone is like new.  Works great so far!"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Came exactly as specified and in great shape",
      "date": "Reviewed in the United States on February 3, 2025",
      "body": "Product came in great shape, there was an issue with delivery as a password is needed to have the device delivered but driver was confused and wouldn’t believe me and required getting Amazon supervisor on a group call otherwise great product"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Recommend!",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "I ordered 2 of these in excellent condition and both look brand new. Everything works as if they were new, they charge great and the batteries lasts a long time."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    JUST LIKE NEW",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "Working great, just as described and works like a champ."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lint in Charging Port",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The phone itself is great. The size is perfect. But the quality of the refurbishing is not so great. The charger wouldn't fit in the charging port straight out of the box. Had to dig out a whole bunch of lint to get it to fit. Don't understand why there was lint in there if it was refurbished"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A reasonable savings amount versus a new phone",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "Item arrived in a timely manner and looked like it was brand new. The only reason for four stars is there was no manual or  any paperwork whatsoever."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Deal",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Purchased for my 12 yr old. The phone looked brand new- no scratches or scuffs.  It works perfectly."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost perfect",
      "date": "Reviewed in the United States on January 2, 2025",
      "body": "Scratch on screen and no sim tray"
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trusted Seller and Excellent Customer Service, but Came With Broken Charging Block",
      "date": "Reviewed in the United States on September 12, 2023",
      "body": "Overall, I had a good experience and I would give 4.5 stars. The only downside was that the charging block that the phone came with did not work. I emailed TetchyTech asking them to send me a new one and they replied within minutes stating they had sent me a new one! Excellent customer service.Just like the product description said, it came with a SIM card tool, a charging cable and a power block to plug the charger into an electrical outlet. The charging cable appeared to be a third-party cable, ANKER brand, but it fit into the phone’s charging port. Also, the cable seemed brand new! I’m excited about that because it should last a long time. The block was first-party, but had lots of marks and scratches, making it look dirty. The charging cable worked just fine, but the block that came with the phone did not work at all. I tested both the block and cable with multiple other parts and outlets and confirmed that it was the block that was broken. But like I said earlier, I emailed TetchyTech and they immediately responded and shipped me a new block. I was happy about that. If I didn’t already have a backup charger, I would be pretty upset with TetchyTech for giving me a broken charging block. So just be aware of that.The iPhone itself: Like new. Very small signs of use, all barely noticeable, including a tiny scratch on the back. Excellent job on the outside of the phone.Everything worked perfectly except that on 2 different occasions, both in the first week, the phone wouldn’t respond when I tried to unlock it and the screen stayed black for about 15 seconds. Then, it started working again. It hasn’t happened in the last week and a half or so, so I’m not too worried about it.The phone came 95% charged.",
      "helpfulVotes": 25
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone SE3",
      "date": "Reviewed in the United States on December 15, 2024",
      "body": "Almost like new iPhone SE 3rd gen.Case, screen, home button are all excellent. Battery is 82%"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phantom touch issues in Renewed-Excellent phone",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "I was really excited to receive this. It was an upgrade from an iphone 8 that finally got too laggy to tolerate.Unfortunately this phone had phantom touch issues straight out of the package. Right away out of the package, I noticed that the screen felt oddly tacky/sticky. My finger didn't glide over it as smooth as I expected for a touchscreen.Then, during the setup process, I almost couldn't even sign into my apple account, because the screen kept freaking out while I was trying to type. It will randomly think I am pressing somewhere on the bottom left 2 inches of the screen. Depending on the app I'm trying to scroll through, it will randomly click on youtube videos or ads, upvote comments, close the keyboard while I'm trying to type, etc. It's not constant, but does happen frequently, so far about a dozen separate times in the last 12 hours, and it lasts for several minutes when the issue starts.I have wiped off the screen with a screen cleaner spray and a microfiber cloth 4 separate times today to no avail. Several times when the issue happened, the screen looked spotless. I've gone into settings and disabled anything that looked like it could even maybe cause this, including assistive touch.Something I didn't notice until after the issue started: the screen of the phone has no cosmetic damage, however the aluminum on the right side, about an inch above the bottom of the phone, has some very obvious scuffs/gouges, including about a centimeter where the paint is scraped off, right where the screen meets the aluminum. Clearly this is where they pried the old screen off for replacement.Unfortunately this screen is a poor replacement. My iphone 8 was purchased refurbished too, but has not had phantom touch issues in the 6 years I owned it. I'm now going to have to transfer my apple account and cell service back to my old laggy phone, return this one, wait for my return to be received, then wait for a replacement to be shipped and hope it doesn't have the same issue. I was really looking forward to finally having a decent phone again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Un detalle importante..",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "El Dispositivo de pantalla y audio está Muy Bien conservado, Tiene ligeras raspaduras (nada no anticipados por el precio) PERO El MICRÓFONO NO FUNCIONA. Lo mantendré en mi posesión, por que realmente no uso este dispositivo completamente por eso no tengo problema. Pero ojo al recibirlo."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition",
      "date": "Reviewed in the United States on October 18, 2024",
      "body": "We ordered a 'good' phone, but it is in excellent condition.  No marks or scratches, looks brand new.  95% battery health!  I've taken off one star as they sent a c-type charger cord instead of one that actually fits into the phone (that standard Apple type shape).  They won't replace just the cord, I asked.Shipping took ages, even as a Prime member.  It was 12 days from order to arrival.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great replacement",
      "date": "Reviewed in the United States on February 22, 2025",
      "body": "Great product. Works great"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "Came in great condition with a screen protector so awesome thanks il"
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So good!",
      "date": "Reviewed in the United States on February 15, 2025",
      "body": "Very good value, very good quality. Highly satisfied."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not exactly as expected",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "Overall the phone appears to be in the shape described. My only complaint that almost resulted in a return was the following:It is advertised as renewed.. silly me I figured that meant factory reset. In any case the phone is unlocked to use however, all of the settings that populated once turning the phone on were far from default. It took a good long while to go through all the settings to make as factory defaults which usually in my experience are present after reset."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition iphone had screen and body scratches.",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "Ordered an iPhone SE 2022 (256 gb-unlocked) in excellent condition. The phone was delivered within 2 days.Even though there was no scratch over the display, the front glass had some scratches (visible when the product is held 12 inches away); the body also has some scratches (again visible when the product is held 12 inches away); even though according to amazon renewed page, the screen should have no scratches and No signs of cosmetic damage (scratches, dents, and other) are visible when the product is held 12 inches away. It doesn't make sense to buy the excellent condition, whereas by the renewed category definition you can get a similar product with good/acceptable condition (sometimes at a $30-$40 lower price).The device was functional and came with a USB-A to lightning charging cable, and a back screen protector already applied.The battery was at 85% (more than said 80% capacity for the excellent condition).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health",
      "date": "Reviewed in the United States on June 11, 2024",
      "body": "Battery - Being a refurbished premium product I wasn't expecting a battery health below 95, worst case scenario 90. It was 88. For it to be a good condition or acceptable condition that number will have been great, but at the end of the day, little disappointed with battery health.External aspect - Great, front seems brand new, on the back few minor scratches. Im a very detailed person, I think majority of people would not even notice those tiny scratches on the back.Internal - As I mentioned earlier, battery not great. Rest of it seems pretty good with just one day of use. At first, while setting it up it got a little warm, but was expected. Unlocked as expected.Overall good service from the seller, fast shipping, and excellent condition. Will buy again for sure. Battery wasn't as expected",
      "helpfulVotes": 15
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excelente",
      "date": "Reviewed in the United States on February 20, 2025",
      "body": "Excelente"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a strong battery",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Phone is in great shape. It was sold as refurbished excellent condition. My reason for 3 stars is the maximum the battery can charge is 82% fully charged. I bought it for keeping track of airtags. If it was a daily user it wouldn't last long."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product is as advertised",
      "date": "Reviewed in the United States on October 24, 2024",
      "body": "There is a small scratch in upper right hand corner, but you can barely see it. Battery Health at 100%. I did have to update the phone from iOS 17.6 to iOS 18.0.1 in order to restore my iCloud backup. I love the small form factor and Touch ID over Face ID.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Buy!",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Bought one white and one red iPhone SE from Amazon. Both in excellent condition, no issues at all. Battery at 87%, still runs smoothly. No regrets!",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good phone",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "The phone is pretty nice, but I've come to expect only the best when it comes to dealing with any company that Ivan Xiao is running (a long long time ago in Iowa, he used to have a smaller cell phone store that was awesome). I will most definitely buy again because the refurb quality is second to none."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "Loved the refurb quality and high battery capacity."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Like new. 98% battery health. A2782 model number was originally sold in Japan, but I don’t think that matters. Working great on AT&T 5G in the US.I upgraded from a 2nd-gen SE. The 1 extra GB of RAM, faster processor and 5G cellular makes it well worth the low cost to upgrade if you insist on keeping a small screen, home button etc!",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lots of scratches on screen everything seems to work though",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Lots of scratches on screen everything seems to work though",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seems more “acceptable” than “excellent”",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "I had higher expectations based on the reviews and descriptions of the excellent level of refurbished. The phone has light scratches that are clearly visible to me when I hold it 12 inches away without glasses, and I can feel them.Also, the battery is at 87%, which is in published ranges but I had hoped it would be higher given the “excellent” rating. Upon additional review, I see that “premium” is required for a battery life above 90%, bummer there are none available.Unsure if I will return yet since I don’t feel like dealing with the hassle, but bummed I didn’t save the $30 - $40 for the level of phone it seems like I received.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone received battery low",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Wife turned on phone.  Said 59% battery power.  Had to charge it and finally came up at 100%.  I  would think renewed good condition would show up with stronger charge.  Phone seemed to work fine but the color is more like black other than midnight blue.  Unsure really what renewed good means other than to go into settings and select reset to factory settings. .  Possibly just a returned phone to amazon."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Got what I ordered, on time and better condition than expected!",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "I got what I ordered!  I got it ON TIME!  I got one in pristine condition!My old iPhone 7 crapped out on me.  So, I got the iPhone SE 3rd gen.  I got it for 3 reasons.  1 - It is inexpensive.  2 - It still has touch ID.  3 - it has the same physical dimensions as the 7.I did the restore to it, moved the sim to it and updated the OS to latest 17 rev.  I've used it for 2 weeks after moving over to it.I'm happy.  The battery life shows as 100%.  It came with a nice screen protector.  It also is the same size as the iPhone 7 so my leather folio case fits it perfectly.No muss, no fuss.",
      "helpfulVotes": 14
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great value. Saved 80% over most new smartphones.",
      "date": "Reviewed in the United States on February 2, 2025",
      "body": "If you are buying new SE probably best to wait until summer and ge the new 2025 SE"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery performance",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "The phone looks great but battery only charges to 83%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El producto no es como lo describe",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "El equipo no es iagual como lo describe"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crappy battery",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "I bought a renewed iPhone SE to replace my iPhone 8 whose battery is down to 73%. Unfortunately the battery that came with the new phone is already down to 82% maximum charge capacity. I paid for a phone in premium condition but the battery is not premium at all. However the phone cosmetics is perfect and does not disappoint. It looks new.Very disappointed that battery is not up to the description of premium.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone, good price, and perfect size!",
      "date": "Reviewed in the United States on December 28, 2024",
      "body": "A local repair guy recommended this phone as one that is durable.  But if anything ever happens, he said it was easy and affordable to work on, if ever needed.  I have been using if for over a year now and have had no issues at all.  Several of my friends love the size so much that they are getting one when their current phone dies."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I hate swiping so a button is tantamount",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "So far, battery not holding charge.  At 100 at the start of day; at 50 by noon...Screen is perfect, and the button function is great.  Long time \"loading\" anything?  I still have time to decide."
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome phone, perfect condition",
      "date": "Reviewed in the United States on December 9, 2024",
      "body": "I’m so glad I read the reviews and bought this phone. I’ve never bought a refurbished anything in my life, so I was nervous. But the seller was amazing and the product was perfect - not a scratch on it anywhere, exactly as described, and came with a new charger wrapped in plastic. Battery life was 100%. So far so good and I’m enjoying my new phone. I recommend looking to this seller before going out and spending an insane amount of money on a brand new iPhone.",
      "helpfulVotes": 8
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great replacement for the phone my puppy chewed and destroyed",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Decent price.  Appears brand new although it's a refurbished phone.  Fraction of the cost of purchasing a brand new phone which I didn't need."
    },
    {
      "reviewerName": null,
      "rating": 4,
      "title": "4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm pretty happy with my new phone",
      "date": "Reviewed in the United States on October 11, 2024",
      "body": "It's my only phone.  It works, and its better than my 1st gen SE,  (more screen space, still fits in pocket)It took me a while to figure out how to transfer the contents from my old SE."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best but it works",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "I bought this phone to downgrade from my galaxy 22ultra. I love the size of it and it works for my basic things like text/calls, googling things and what not. My issue with the phone is that sometimes the touch on the screen stops working and I have to lock the phone and unlock it to get it to work. The phone is also a little slower than I was expecting, even for a budget phone from 2022. Browsing the internet is a little slow and I sometimes lose service in areas I didn’t before. When I try to use the gps it doesn’t work and has a hard time keeping track of my location. I will say if you really only want a phone for basic things then this is great. I love how compact it is and the battery on it is good. I’m not sure if I would buy one again but for the issues it has I can say I will continue using it as my daily driver.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 5,
      "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great job! The Cellular Resource!",
      "date": "Reviewed in the United States on October 7, 2024",
      "body": "I received the renewed iPhone SE 3 in three days.  I was amazed by the speedy delivery.  The iPhone was well packaged and in excellent shape.I had some problem to activate the phone and the wireless carrier I am using told me while they are escalating the issue, I should contact the phone seller (The Cellular Resource).  The Cellular Resource immediately promised that if the wireless carrier cannot resolve the issue, they will send me a replacement.Eventually, the wireless carrier resolved the issue, and now my phone is working great!  I really appreciate The Cellular Resource’s quick response and comforting reassurance.  I will firmly keep The Cellular Resource on my list when I need another phone.Great job! The Cellular Resource!  Thanks a lot!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seems like luck of the draw",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "5 stars for ease of purchase and ease of return - seller seems honest and easy to work with and approved my return immediately. But overall, even when you pay extra for \"excellent\" condition, seems like what you get is entirely up to luck. I have seen reviews saying they got a phone with 100% battery life left; mine only had 87%, and also had a crack in the glass screen in the top left corner, and the home button (and I am used to home buttons on iPhones) clearly was depressed/not flush with the screen such that it actually hurt my thumb to use because it would press down on the glass outline around the circle when pressing the home button. Overall, I would honestly rather shell out the extra money for a new model of the same phone, so at least I can feel like I'm going to get a few more years out of it. If you don't care about any of that, then this is no doubt a good deal, and this is a way easier process than going through Best Buy, for example.",
      "helpfulVotes": 3
    }
  ],
  "criticalReviews": [
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good looking phone with a bum battery.",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "I ordered the 3rd iPhone SE and selected excellent renewed condition. The phone has no obvious damage to the exterior with little evidence of use, but the battery health is seriously diminished at 79%. Far lower than I expected when paying extra for the excellent condition renewed phone.Unrelated to the item was the shipping. I needed a phone to replace my failing 2nd gen SE that was turning off every 2 minutes. Ordered trusting the estimated delivery date that would only be a couple of days. Shipping across the country, it took longer than quoted. I would have much rather have known this and paid extra to expedite the delivery.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Condition, But Battery Capacity Was a Letdown",
      "date": "Reviewed in the United States on March 17, 2025",
      "body": "The phone arrived in good condition, and I had no issues with the iOS update or transferring my account, which was great. However, the battery capacity was only at 80%, which was disappointing. According to Amazon’s guidelines, an \"Excellent Condition\" device must have \"Battery: >80% of original battery life\", meaning it should be at least 81%. Now I have to order a new battery and spend extra time and money on replacing it. It would have been a five-star experience if the battery capacity was better."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition? I don't think so.",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Battery capacity at 85%. Multiple deep scratches and nicks on the screen. Two dead lines down the LCD screen. Crust and crud in the speakers. Knicks in the body as well, though thats the least concerning issue..I love my current SE2, but the screen is pretty smashed up and I am pushing the limit of my 64gb capacity. An minor upgrade for $250 seemed reasonable. Super annoyed that I had to finish setting up the new phone before I could see what all is wrong with it. If it were cheaper I'd consider keeping it, but this is not cool for the top most expensive listing..Also, the red of the SE3 is a bit darker then the red SE2. Thats not a problem, just more information.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Nearly Sufficiently Well Done",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "When a vendor says \"renewed\" one would expect OEM parts, such as the screen on a phone, to be used.  That is not the case with the phone I received.  It has a sort-of \"mini\"  overlay which is noticeably not the same since the resulting phone is thicker and depending upon how one holds the phone when using it as a phone, less comfortable than one might expect or have grown used to experiencing.  One may have the disconcerting experience of having the edge of an earring encountering the edge of the stiff plastic overlay,  The overlay is removable and there were no large scratches,Otherwise, the phone seems to work even if it now uses IOS 18 rather than the original version.  I would have preferred the original version.  IOS 18 has more of the latest IOS nonsense: \"haptics\" that are useless AND annoying, still more intrusion into one's personal life, and I couldn't transfer my music library -- the transfer from ios 17 kept failing in a bizarre manner.  As usual, Apple now wants to know everything.  It's my phone, not theirs.  Actually, an iPhone 6 -- really -- is a better user experience mostly because the applications are smaller and more focused.In summary, the \"renewed\" phone is a disappointment since it doesn't have quite the same look-and-feel as an original.  If you want or need a less-expensive phone capable of running IOS 18, this should suit your needs.  It suits mine.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great experience!",
      "date": "Reviewed in the United States on January 15, 2025",
      "body": "I ordered a 128 gb iphone SE3 in exellent condition. The phone has next to no cosmetic damage and the method to transfer all of my data from my old iphone 7 to this new phone couldn't have been easier. The phone also arrived a day earlier than stated! Fabulous.My only complaint is the battery health is at 82%. To me, that is low for a phone marketed as refurbished to \"excellent\" condition. However, reading the fine print of the Amazon Renewal store, my phone meets the conditions what they categorize as \"excellent\" condition (battery cutoff is 80% for \"excellent\"). Buyer beware about this, if you want battery life of at least 90% make sure you get a phone labeled as \"premium\". I plan to keep the phone, but am aware I'll likely have to go through replacing the battery in the near future. I already bought a portable battery for the phone. Mea culpa, but FYI for future buyers.",
      "helpfulVotes": 10
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lint in Charging Port",
      "date": "Reviewed in the United States on March 5, 2025",
      "body": "The phone itself is great. The size is perfect. But the quality of the refurbishing is not so great. The charger wouldn't fit in the charging port straight out of the box. Had to dig out a whole bunch of lint to get it to fit. Don't understand why there was lint in there if it was refurbished"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phantom touch issues in Renewed-Excellent phone",
      "date": "Reviewed in the United States on January 6, 2025",
      "body": "I was really excited to receive this. It was an upgrade from an iphone 8 that finally got too laggy to tolerate.Unfortunately this phone had phantom touch issues straight out of the package. Right away out of the package, I noticed that the screen felt oddly tacky/sticky. My finger didn't glide over it as smooth as I expected for a touchscreen.Then, during the setup process, I almost couldn't even sign into my apple account, because the screen kept freaking out while I was trying to type. It will randomly think I am pressing somewhere on the bottom left 2 inches of the screen. Depending on the app I'm trying to scroll through, it will randomly click on youtube videos or ads, upvote comments, close the keyboard while I'm trying to type, etc. It's not constant, but does happen frequently, so far about a dozen separate times in the last 12 hours, and it lasts for several minutes when the issue starts.I have wiped off the screen with a screen cleaner spray and a microfiber cloth 4 separate times today to no avail. Several times when the issue happened, the screen looked spotless. I've gone into settings and disabled anything that looked like it could even maybe cause this, including assistive touch.Something I didn't notice until after the issue started: the screen of the phone has no cosmetic damage, however the aluminum on the right side, about an inch above the bottom of the phone, has some very obvious scuffs/gouges, including about a centimeter where the paint is scraped off, right where the screen meets the aluminum. Clearly this is where they pried the old screen off for replacement.Unfortunately this screen is a poor replacement. My iphone 8 was purchased refurbished too, but has not had phantom touch issues in the 6 years I owned it. I'm now going to have to transfer my apple account and cell service back to my old laggy phone, return this one, wait for my return to be received, then wait for a replacement to be shipped and hope it doesn't have the same issue. I was really looking forward to finally having a decent phone again.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Un detalle importante..",
      "date": "Reviewed in the United States on February 27, 2025",
      "body": "El Dispositivo de pantalla y audio está Muy Bien conservado, Tiene ligeras raspaduras (nada no anticipados por el precio) PERO El MICRÓFONO NO FUNCIONA. Lo mantendré en mi posesión, por que realmente no uso este dispositivo completamente por eso no tengo problema. Pero ojo al recibirlo."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not exactly as expected",
      "date": "Reviewed in the United States on January 21, 2025",
      "body": "Overall the phone appears to be in the shape described. My only complaint that almost resulted in a return was the following:It is advertised as renewed.. silly me I figured that meant factory reset. In any case the phone is unlocked to use however, all of the settings that populated once turning the phone on were far from default. It took a good long while to go through all the settings to make as factory defaults which usually in my experience are present after reset."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition iphone had screen and body scratches.",
      "date": "Reviewed in the United States on November 8, 2024",
      "body": "Ordered an iPhone SE 2022 (256 gb-unlocked) in excellent condition. The phone was delivered within 2 days.Even though there was no scratch over the display, the front glass had some scratches (visible when the product is held 12 inches away); the body also has some scratches (again visible when the product is held 12 inches away); even though according to amazon renewed page, the screen should have no scratches and No signs of cosmetic damage (scratches, dents, and other) are visible when the product is held 12 inches away. It doesn't make sense to buy the excellent condition, whereas by the renewed category definition you can get a similar product with good/acceptable condition (sometimes at a $30-$40 lower price).The device was functional and came with a USB-A to lightning charging cable, and a back screen protector already applied.The battery was at 85% (more than said 80% capacity for the excellent condition).",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a strong battery",
      "date": "Reviewed in the United States on February 9, 2025",
      "body": "Phone is in great shape. It was sold as refurbished excellent condition. My reason for 3 stars is the maximum the battery can charge is 82% fully charged. I bought it for keeping track of airtags. If it was a daily user it wouldn't last long."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seems more “acceptable” than “excellent”",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "I had higher expectations based on the reviews and descriptions of the excellent level of refurbished. The phone has light scratches that are clearly visible to me when I hold it 12 inches away without glasses, and I can feel them.Also, the battery is at 87%, which is in published ranges but I had hoped it would be higher given the “excellent” rating. Upon additional review, I see that “premium” is required for a battery life above 90%, bummer there are none available.Unsure if I will return yet since I don’t feel like dealing with the hassle, but bummed I didn’t save the $30 - $40 for the level of phone it seems like I received.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone received battery low",
      "date": "Reviewed in the United States on January 9, 2025",
      "body": "Wife turned on phone.  Said 59% battery power.  Had to charge it and finally came up at 100%.  I  would think renewed good condition would show up with stronger charge.  Phone seemed to work fine but the color is more like black other than midnight blue.  Unsure really what renewed good means other than to go into settings and select reset to factory settings. .  Possibly just a returned phone to amazon."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Poor battery performance",
      "date": "Reviewed in the United States on February 26, 2025",
      "body": "The phone looks great but battery only charges to 83%."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    El producto no es como lo describe",
      "date": "Reviewed in the United States on March 4, 2025",
      "body": "El equipo no es iagual como lo describe"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Crappy battery",
      "date": "Reviewed in the United States on January 8, 2025",
      "body": "I bought a renewed iPhone SE to replace my iPhone 8 whose battery is down to 73%. Unfortunately the battery that came with the new phone is already down to 82% maximum charge capacity. I paid for a phone in premium condition but the battery is not premium at all. However the phone cosmetics is perfect and does not disappoint. It looks new.Very disappointed that battery is not up to the description of premium.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I hate swiping so a button is tantamount",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "So far, battery not holding charge.  At 100 at the start of day; at 50 by noon...Screen is perfect, and the button function is great.  Long time \"loading\" anything?  I still have time to decide."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best but it works",
      "date": "Reviewed in the United States on September 7, 2024",
      "body": "I bought this phone to downgrade from my galaxy 22ultra. I love the size of it and it works for my basic things like text/calls, googling things and what not. My issue with the phone is that sometimes the touch on the screen stops working and I have to lock the phone and unlock it to get it to work. The phone is also a little slower than I was expecting, even for a budget phone from 2022. Browsing the internet is a little slow and I sometimes lose service in areas I didn’t before. When I try to use the gps it doesn’t work and has a hard time keeping track of my location. I will say if you really only want a phone for basic things then this is great. I love how compact it is and the battery on it is good. I’m not sure if I would buy one again but for the issues it has I can say I will continue using it as my daily driver.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Seems like luck of the draw",
      "date": "Reviewed in the United States on July 9, 2024",
      "body": "5 stars for ease of purchase and ease of return - seller seems honest and easy to work with and approved my return immediately. But overall, even when you pay extra for \"excellent\" condition, seems like what you get is entirely up to luck. I have seen reviews saying they got a phone with 100% battery life left; mine only had 87%, and also had a crack in the glass screen in the top left corner, and the home button (and I am used to home buttons on iPhones) clearly was depressed/not flush with the screen such that it actually hurt my thumb to use because it would press down on the glass outline around the circle when pressing the home button. Overall, I would honestly rather shell out the extra money for a new model of the same phone, so at least I can feel like I'm going to get a few more years out of it. If you don't care about any of that, then this is no doubt a good deal, and this is a way easier process than going through Best Buy, for example.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone, but incorrect carrier.",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "The iPhone arrived and was actually brand new and still had the new apple warranty. I ordered a AT&T phone and this phone says that is an AT&T phone however when I took it to AT&T they were unable to activate and said that it was not an AT&T phone and locked to a different network.  I had to return the phone, I was able to return it however Amazon would not do an even exchange and send me an AT&T one, instead they said I had to return it wait several days for the refund then purchase again. Everything about the phone was other than the fact that it was not for AT&T as advertised.  I was unsatisfied with Amazon and their return process though, even though they messed up and sent the wrong product they wouldn’t do an even exchange."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great except for",
      "date": "Reviewed in the United States on November 9, 2024",
      "body": "Everything is great except for the audible when trying to hear on a call.  Volume is all the way up yet it’s very difficult to hear who you’re talking to.  Sounds like an old school transistor radio speaker. Very poor quality sound, what there is of it anyway.  I have to use speaker to have a conversation as it sounds great that way.  Very inconvenient though.  Heard it before but I’ll say it again.., you get what you pay for.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finally got around to setting them up and one of the touchscreens does not work.",
      "date": "Reviewed in the United States on June 28, 2024",
      "body": "So frustrated right now. We purchased two for different family members. We had worked on setting them up a little with parental controls, but life got in the way and finally getting around to setting them up with cell plans, and one of the touch screens is not working. I can't even unlock the phone with the code we set before since the touch screen is not recognizing anything. And of course outside the return window. I would not buy again since essentially I have a paperweight now.ETA: Reached out to the company and they told me to send it in for repair free of charge, even though outside the return window. We’ll see how it goes.ETA2: phone still didn't work. WDO (seller) told me I was out of luck, 'it worked fine for us'. It worked intermittently for us at best. I ended up having to pay another $90+ to have the screen replaced locally. I would not deal with seller again.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not excellent one bit.",
      "date": "Reviewed in the United States on December 12, 2024",
      "body": "Screen is scratched like crazy, chassis is scuffed camera bump is scuffed, but what’s saving this phone is the battery, 100%; however these things can be reprogrammed.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Arañado",
      "date": "Reviewed in the United States on January 17, 2025",
      "body": "Está todo rayado y arañado pero funciona bien"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    i like having an old style phone, dont like that its small",
      "date": "Reviewed in the United States on November 19, 2024",
      "body": "my hands are too big and i didn't read the dimensions, my bad. phone itself is fine though. definitely slower than it should be, whatever chipset its using is garbage and comparable to my 2015 android"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn't activate",
      "date": "Reviewed in the United States on September 26, 2024",
      "body": "The phone came in good condition. My niece likes it, has no complaints. I on the other hand am disappointed that this phone couldn't be activated through Verizon. Verizon tells me the phone is not compatible with their network even though I chose Verizon and it says Verizon renew next to my order. My brother had to get a different carriers sim card for it.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks pretty good but…",
      "date": "Reviewed in the United States on December 3, 2024",
      "body": "They don’t change a battery.I’ve got 2 years old phone with the battery life 80%"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Condition",
      "date": "Reviewed in the United States on August 16, 2024",
      "body": "When the package arrived, the edge of the box was crumbled. I opened the package and everything was there - the phone, the charging brick, and the cable. Everything for the most part was working, except the charging port. Since the pins in the charging port were bent, the phone couldn't hold the charge - only when you lifted the end of the cable up. As a result, I had to return it. I hope the seller considers this and tests each product slightly more thoroughly before shipping it to the consumer."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Disappointing",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "The phone looked really good...like new... and worked fine for my purposes since I'm not a 'heavy user'. The battery capacity was 89%. I thought this would be okay and I'd get a couple years out of it before the battery dropped below 80%. BUT, after 6 weeks owning it, the battery capacity is now down to 85%...and I don't use it all that much. For a refurbished and renewed phone, this is very disappointing. I would NOT buy again."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well, but….",
      "date": "Reviewed in the United States on November 13, 2024",
      "body": "Not a heavy user, but battery only lasts until late afternoon of intermittent use.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beyond ticked.",
      "date": "Reviewed in the United States on January 16, 2025",
      "body": "I just dropped it for the 3rd time- DO NOT BUY THIS! The screen is cracked in several spots after about a month of use. Now, I wouldn’t have a problem with it being a year. Did I drop it? Yes. However, I had an apple phone BEFORE and that one worked just fine. I call BS. Do not buy these from Amazon- get em new from the phone company."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    screen coming off already",
      "date": "Reviewed in the United States on December 8, 2024",
      "body": "I just got this phone and have barely used it and already I noticed a bubble covering a huge semicircle on the left side of the screen. It went away but there are other bubbles on other parts of the screen. Since this is a refurbished phone just sent to me I don't think this should happen at all let alone so soon. I will likely return it but this will be a pain as it took a lot to get everything moved from my old phone. They must be using cheap replacement screens and doing a shoddy job of installing them."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not a good pgone",
      "date": "Reviewed in the United States on October 6, 2024",
      "body": "After setting up the phone, I noticed that Siri only responded sometimes, not always.  In addition, certain buttons didn’t work no matter how many times you tapped them.  We returned the phone."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery was average",
      "date": "Reviewed in the United States on July 7, 2024",
      "body": "I’ve run my previous 6s (renewed) for a year and the battery at the end of it  would be completely drained before the end of the day… I could play music longer for some reason … this iPhone that I bought was renewed but the battery is only a bit better and drains from full to 0% within 3hrs if playing music …. Better than paying 899$ for a new phone",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Built to break",
      "date": "Reviewed in the United States on February 14, 2025",
      "body": "the cameras ability to focus broke within days of having this phone. Also even with a screen protector and case, the screen cracked from a drop within the first month. Will not be buying again"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low price",
      "date": "Reviewed in the United States on March 9, 2025",
      "body": "The lightening connector opening inner ring fell off and the touch pad is overly sensitive but can’t complain about the price. The camera works fine and no major scratch on screen and body."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too small",
      "date": "Reviewed in the United States on December 1, 2024",
      "body": "Too small"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    pretty good",
      "date": "Reviewed in the United States on October 31, 2024",
      "body": "physically good, but max battery capacity is 86%"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Frustrating Experience with SE iPhone Purchase - Beware of Hidden Fees!",
      "date": "Reviewed in the United States on June 16, 2023",
      "body": "I recently purchased an SE iPhone from this third-party seller on Amazon, hoping for a seamless experience. However, my journey with this phone turned out to be quite disappointing. Initially, the phone seemed fine, but as I started using it, I noticed a few concerning issues. The device intermittently failed to register touches, and it struggled to establish connections with other Apple devices like my AirPods and iPad.Due to these problems, I decided to return the phone. I must acknowledge that the refund process was prompt. However, I was surprised to find that the refunded amount was $20 less than what I originally paid. This discrepancy prompted me to reach out for clarification.To my dismay, they first justified the deduction as a \"shipping fee\" for valuable items. When I questioned this explanation, they quickly changed their stance, claiming it was a \"restocking fee.\" Finally, when I pointed out that the item was labeled as \"free return\" and \"free delivery,\" they resorted to accusing me of not returning the charger and imposed an additional $20 fee.I want to make it explicitly clear that I returned the item within the specified time window, and I included all the original accessories. This unwarranted deduction, accompanied by the seller's inconsistent explanations, left me feeling frustrated and deceived.Writing this review serves as a warning to other potential buyers. Not only did I waste my time setting up and returning a faulty product, but I was also unfairly charged a \"shipping/restocking/charger fee\" despite complying with all return requirements. Please exercise caution when dealing with this seller, as my experience indicates a lack of transparency and integrity.In summary, I regret my decision to purchase this SE iPhone from this third-party seller on Amazon. I hope my review helps others avoid the inconvenience, frustration, and unnecessary fees I encountered throughout this process.",
      "helpfulVotes": 133
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don't buy used from seller: WCell Renewed",
      "date": "Reviewed in the United States on October 12, 2024",
      "body": "I purchased this iPhone SE 3rd Generation under the \"Used-Acceptable\" condition option from reseller WCell Renewed. The phone's physical appearance was 9 out of 10 however, the physical sound on/off toggle switch was non-functional. Even when toggled to the ON position, the phone would recognize it as ON for a split second then switch to silent immediately by itself.  Seems like the previous user either dropped it in water or pocket lint or sticky substance had gotten into that toggle switch area.I feel this doesn't deem the phone \"Used-Acceptable\".  The phone was returned promptly but I haven't received a refund and it's been over a week after I returned it.  The only Amazon return option for the seller \"WCell Renewed\" was UPS pickup.  I hope this helps folks shopping for this iPhone and plan on buying it as used-acceptable.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First phone came broken",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "Our first phone came broken.We are going to return it and try reordering. Hopefully we were just unlucky on this 1."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incorrect Cord",
      "date": "Reviewed in the United States on July 25, 2024",
      "body": "Got it overnight, screen looks great with no scratches, same goes for the rest of the phone too.One issue—good thing I ordered a pack of phone cords because this phone did NOT come with a proper cord (looks like an Android cable) nor a block.When I get it set up and running, I will update this review with performance ratings."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I had problems with starting this IPhone.",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Item arrived on time, in good condition but everything, all descriptions were in Chinese Mainland language impossible to understand. I had big problem with starting this IPhone since I didn’t know Chinese language and it took me quite a time to start it."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is alright",
      "date": "Reviewed in the United States on October 13, 2024",
      "body": "This is my first refurbished iPhone, and the third refurbished Apple product from Amazon (I also have two refurbished iPads from Amazon).The phone itself is fine. It’s just so old that it’s not eligible for AppleCare, which sucks because if something happens to my phone I can’t afford to repair or replace it. If I had known that, I would never have purchased it (my iPads were both within date to be eligible for AppleCare). Took two stars off for that.Also, the seller sent a terrible third party charger that a) takes HOURS to charge the phone, and b) gets dangerously hot. Took another star off for that.Happy to have my phone, just disappointed with the seller."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nothing but problems",
      "date": "Reviewed in the United States on May 16, 2024",
      "body": "This will be the last refurbished phone I purchased on Amazon.I got a very bad refurbish on this phone. The battery has lousy health and it appears that the battery was not replaced which is standard in a refurbished, the lightning plug doesn't seem right and it won't always accept a charge, and it's buggy on the cellular aspect where it sounds like you're underwater on your calls. It drops calls frequently sitting in the exact same room where I can use my mom's iPhone and hers is fine. It gets hot to the touch and stops working every time Apple rolls out of software update. It's a bad refurbish. You guys sold me a lemon.These phones are wonderful when they actually work, but I will no longer trust refurbished phones on Amazon because of this. It has been a headache and nothing but problems since I bought it. Everyone keeps telling me to return it, but I missed the window and deeply regret sticking it out.Love this phone in theory, but only if you get one that actually works.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Will not connect to wi-fi",
      "date": "Reviewed in the United States on January 4, 2025",
      "body": "Only 4 months old and the phone sees or recognizes my router but will not connect. It will not load certain apps on mobile data either.I have both my children’s iPhones connected along with my laptop, no problem. It has to be the phone. I am trying to avoid a factory reset.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived with dead battery.",
      "date": "Reviewed in the United States on January 31, 2025",
      "body": "Arrived quickly with dead battery needing a full charge so I must wait to set up phone. We'll let you know how battery health is once charging is completed."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not impressed",
      "date": "Reviewed in the United States on January 13, 2025",
      "body": "I expected some blemishes on the phone. It came with  6 scratches along side and a small chunk out of glass.Not happy. Won’t buy again"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not 100%",
      "date": "Reviewed in the United States on July 27, 2024",
      "body": "Phone was received in great condition, but it has Wi-Fi connection issues, the home button doesn't always work like it's supposed to and has to be soft reset often."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not in “Excellent” condition as claimed",
      "date": "Reviewed in the United States on May 9, 2024",
      "body": "This iPhone SE 3rd gen was claimed by the seller to be in “Excellent” condition, so I was quite surprised that it was in what I would call fair to poor condition.  There were three major issues:1) The slot that holds the SIM card was badly damaged, and appears that someone was unaware how to remove the holder and instead pried it out.  There was visible damage and sharp edges around the slot.2) The phone diagnostics were unable to determine if the battery was a genuine Apple part, was defective, or not installed correctly.3) The lowest portion of the touch screen had very poor sensitivity, making it difficult to use.I gave the rating two stars instead of just one because the seller was very responsive to my request to return the device for a refund.  However the refund will not be credited until the seller actually receives the returned device.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery capacity at 90%",
      "date": "Reviewed in the United States on July 11, 2024",
      "body": "I purchased one in \"excellent\" condition, but unlike many other who reported here 100% capacity (new battery), mine has a battery capacity at 90%. Otherwise the phone works fine.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Suffered from iPhone Touch Disease!  Returned.",
      "date": "Reviewed in the United States on August 11, 2024",
      "body": "My iPhone 6s works perfectly but could not load latest ios versions, and many of my apps were becoming dependent on ios 16.  I had always had my eye on the iPhone SE since I liked the size of my 6S and the SE is identical in size. So I bought the refurbished SE.  At first this iPhone SE Gen 3 seemed wonderful!  However, after using for only a few hours, the touch screen began not responding to the touched area.  In particular it became impossible to send a text as touching the Send icon on the right side of the screen would \"select\" as if I had touched to the left of that in the text entry area.  Bottom line it was impossible to send a text manually.  I researched online and tried all the fixes.  Rebooting.  Reloading software.  DFU Firmware reload.  Same issue.  So back it went.  It did not feel like a hardware issue.... seems like there is some software glitch that Apple has been powerless to resolve?So I went to the Apple store... bought a brand new iPhone SE Gen 3....  loving it so far!  It would have been nice to get one that worked for half the price... but it was not to be this time.",
      "helpfulVotes": 21
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t buy this phone…",
      "date": "Reviewed in the United States on February 10, 2025",
      "body": "Buyer BEWARE! I purchased this phone August 2024. I did not have a chance to set it up, as two weeks later I had an accident and broke my wrist and my leg. Rehabilitation was all I could focus on. This week, I finally set up my phone and discovered it was DEFECTIVE. The touch screen did not respond to all of the touched areas. It was a horrible nightmare. I took it to an Apple repair shop and they pulled a third party screen protector off the phone. It still did not work, and they advised me to get a new phone. I asked the seller for a refund and it was denied. This phone was clearly NOT INSPECTED for use as per renewed phone policy.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely a used phone",
      "date": "Reviewed in the United States on November 1, 2023",
      "body": "I’ve bought a refurbished phone before and was completely satisfied. I received my new refurbished iPhone SE 3rd gen today and am disappointed with the condition. It is what I ordered, but the seal around the screen are dirty, the speaker is dirty and it arrived at 40% battery. When I plugged it in to charge, it wouldn’t charge. After a mild panic I tried to clean out the charging port myself and it’s charging again. I’m shocked that it wasn’t cleaned properly before being shipped. I’m going to have to contact a local phone shop to see if they can clean the charging port properly.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Extremely disappointed!!",
      "date": "Reviewed in the United States on October 25, 2024",
      "body": "My daughter spent two years saving for her first cell phone. After much study of options available and reading of reviews, she decided to purchase her phone from this retailer. The phone arrived and looked like it was in great condition. However, when she attempted to add her iCloud account, she was told that it was not possible for this phone that the maximum number of iCloud accounts have been used on this phone, she was heartbroken. I reached out to the company who, honestly with a waste of time. They then sent me over to Apple for assistance who informed me that the phone that we received with us useless. There is no way to add an iCloud account to this phone.  I reached out to the company and was informed that I had to go through Amazon which I have done. I dropped it off that same night and I am still waiting for my refund. This is an extreme disappointment and I will never use their service again and highly recommend that others do not either.",
      "helpfulVotes": 13
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not too impressed",
      "date": "Reviewed in the United States on July 28, 2023",
      "body": "I bought the “excellent condition” one believing that it would be in excellent condition given what the term means. But when it arrived it came with scratches all over the screen like deep ones and a ding on the top right of it, not to mention the back is all scratched up too. The only positive is that it came with 100% battery life but that’s the only positive. Everything works well but you’d expect an “excellent condition” phone to not have any cosmetic damage but mine does and it’s infuriating to have something marked as “excellent condition” but have that term used so loosely.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery not at 100% capacity.",
      "date": "Reviewed in the United States on May 22, 2024",
      "body": "Even though the seller says the product is refurbished back to factory specifications, it DOES NOT come with 100% battery health as seen in the photo provided. Every thing else is fine though.",
      "helpfulVotes": 5
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Little Phone",
      "date": "Reviewed in the United States on July 1, 2023",
      "body": "The SE3 packs a lot into a small package. In my opinion it’s great for those who may want a phone more than a tablet as it can fit in shorts and pockets. It is cost friendly and does all of what a cell phone needs to. On the opposite side of the spectrum are phones that are essentially tablets… fun to read on but somewhat impractical to carry. If you’re ok with more phone and less data it’s fine. I ended up with an Iphone 11 at about the same price which sort of does the phone and tablet thing well but is a bit large and just be aware there are tradeoffs",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Your concerns about buying preowned are well-founded",
      "date": "Reviewed in the United States on January 26, 2024",
      "body": "If you're reading these reviews like I was a week ago, you're probably nervous about buying a preowned phone. I'd never done it before and hoped for the best with all the guarantees. I bought a Verizon phone and it came the next day (ultra fast). The phone was, as advertised, in excellent condition and it had perfect battery life--that's where the good ended. I took it to my local verizon store to activate, and, after over an hour of working with their team and phone customer service, I was told that the phone was not compatible with Verizon because it had been reported stolen and sold anyway. Because the phone was flagged in verizon's system, they paused my whole account for suspected fraud. It took another 30 minutes with customer service to get my original phone/phone line functioning again. Verizon told me the phone would not work with them. I very promptly returned the phone. I will not order used again online to save myself from headaches like these--trying to save the money was NOT WORTH IT IN THE END. I will update my review to add a second star once I've received my refund. Naturally given how this has gone so far, I'm concerned about that. UPDATE-- I received my refund but the company did not even respond to my email complaint, so I won't be adding a second star.",
      "helpfulVotes": 51
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I wouldn’t do this again",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "Needed a phone in a rush and found this one with same day delivery, but they pushed it back repeatedly and it ended up being the following business day so I went out of town without a working phone. Just got back in town and phone is giving me issues as it doesn’t want to charge consistently. Apparently it will wirelessly fine but the lightening port fails consistently when I try to charge that way, and wired headphones don’t work at all. I just started using this phone periodically around the house and will likely end up returning this tomorrow its definitely not what I agreed to",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective",
      "date": "Reviewed in the United States on December 24, 2024",
      "body": "You’d think a seller who is selling refurbished phones would check to make sure they’re working properly. We ordered this phone for our non verbal son. Texting with him is our best form of communication after his last phone broke. We were planning on giving him this phone for Christmas. We ordered over 30 days ago so I will eat it’s my fault I didn’t turn it on before the holiday but the screen has lines going down it. Very disappointed in this purchase. If the seller isn’t responsible enough to QA their own products before sending them out I say steer clear of this specific company selling these refurbished phones.Now I have to try to explain to my son how Santa brought  bad phone and we will get him another one.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was not unlocked.",
      "date": "Reviewed in the United States on September 13, 2024",
      "body": "Phone is in great shape but it was not unlocked, Amazon submitted a request to seller to ship me a new one. If that goes well I'll update my review. I am disappointed the seller doesn't verify the phones prior to shipping out.Update:Seller offered me a discount or a return for a refund. All I wanted was a working unlocked phone. Anyhow, I returned the phone and bought from a different vendor.",
      "helpfulVotes": 6
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the greatest",
      "date": "Reviewed in the United States on March 22, 2024",
      "body": "Easy to set up. Refurbished but the screen has places like there is water underneath the glass which is frustrating. Guess I deal with it but the touch screen isn’t as sensitive as it should be and you can literally see it “move”"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery capacity only 84%",
      "date": "Reviewed in the United States on October 29, 2024",
      "body": "Got my renewed gen 3 SE all set up, and looked up the battery life capacity to only find that it's 84%. I was sure that excellent condition phones and better had to have at least 90% capacity. Everything else seems to be fine, though.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value, but some issues with certain refurbishes",
      "date": "Reviewed in the United States on February 17, 2024",
      "body": "So I understand that a renewed product may be subject to some repairs. However, the model I received has a noticeable raised edge all around the screen where it was replaced. The edges of the screen overlap the panel slightly, if you tilt the phone, things on the edge are blocked out. It's an unfinished edge- there's no way I'd trust this thing to be waterproof. It'll be more susceptible to chipping, and the Touch ID button feels sharp. It also comes in at 85% battery health, which isn't terrible, but isn't great either. The obvious screen repair and inattention to detail make me question what else may be replaced inside of this thing that I can't see.I bought from ELECTRONIC DEALS in Brooklyn. This doesn't really feel like it deserves the \"Excellent\" condition modifier it was listed as.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I couldn’t activate the phone because the previous owner didn’t pay their installments",
      "date": "Reviewed in the United States on July 18, 2024",
      "body": "The phone is in great condition, but I wasn’t able to activate the service. I purchased a T-Mobile phone When I received it, and after an hour on customer service with T-Mobile, I found out that it was locked by AT&T. Then I called AT&T customer service and they told me that the previous owner didn’t finish paying their installments on the phone so I can’t unlock it. I paid money for a phone I can’t use. Terrible experience hopefully they can fix it for me"
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Died in less than a month",
      "date": "Reviewed in the United States on November 28, 2024",
      "body": "Phone took several weeks to arrive and then died in less than a month of use. Not much more to say."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sucks",
      "date": "Reviewed in the United States on July 31, 2024",
      "body": "This phone sucks. It’s slow. Doesn’t stay charged for very long and is just an inferior apple product. It’s a phone. It works, but it’s not the phone for someone that requires all the perks of a smartphone yet doesn’t want a flat screen tv in their pocket. My 13 mini got jacked, and I downgraded to this, but this is just an inferior machine all around, and the mini is smaller but this seems so much smaller.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Touchscreen failed in under a year",
      "date": "Reviewed in the United States on May 26, 2024",
      "body": "Nice little device for the price, touchscreen went bad in under a year.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"Refurbished - Excellent\" phone was far from it",
      "date": "Reviewed in the United States on February 7, 2025",
      "body": "iPhone SE3 arrived with battery at 82% capacity, barely above the Apple designated minimum of 80%. Replaced battery and was reimbursed by seller. The screen went bad after two weeks of use - replaced and seller did not reply to request for reimbursement. Guess I should have just returned it. I found out my repair shop also sells used phones at comparable prices and backs the condition 100% - I will be buying phones there in the future.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone",
      "date": "Reviewed in the United States on June 12, 2024",
      "body": "The phone wasn’t unlocked"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked for two days the battery just died",
      "date": "Reviewed in the United States on February 16, 2025",
      "body": "Brought it used to save some  money I'd understand  it's used but it should be disclosed that the battery wasn't good. Wouldn't  hold a charge  anymore. Had to change it phone quality was good for used. But a battery  that doesn't  work 😕 no good !",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Blaclisted carrier phone",
      "date": "Reviewed in the United States on March 12, 2025",
      "body": "Don’t buy an iPhone from because it maybe blacklisted by any of the major carriers. Bought an iPhone SE 3rd gen in August of last year. Had on one carrier, no problems. Moved went to put on my carrier in my area was told it was blacklisted for non payment/stolen."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen issue",
      "date": "Reviewed in the United States on January 3, 2025",
      "body": "frustrating to receive a phone with such noticeable issues, especially when it’s clear the seller didn’t properly inspect it before sending it out. There are two potential causes—screen replacement not done correctly or a swollen battery—are both serious concerns. Either could explain the abnormal edge appearance around the screen.The seller should have tested the device thoroughly before shipment, especially for issues that might affect its performance or safety (like a swollen battery).the Apple Store expert flagged these issues, thy advice me  reaching out to the seller with that information. Bc it is serious.",
      "helpfulVotes": 3
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Defective phone",
      "date": "Reviewed in the United States on February 25, 2025",
      "body": "The touch screen for the iPhone I got is glitchy. I can't press on certain characters on the left side of the keyboard. I bought this phone in excellent condition, and it came with 85% battery capacity. I wouldn't recommend buying anything renewed on amazon."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not unlocked",
      "date": "Reviewed in the United States on December 13, 2024",
      "body": "Product is not inlocked",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very poor purchase",
      "date": "Reviewed in the United States on August 30, 2024",
      "body": "A 👎👎 for this Amazon provider to ship this unit out.  Purchased excellent refurbed level.  Outside appearance meets that.  However,  battery is a very very  LOW 83% capacity !!  almost at the end of it’s life.  Very disappointed.  Will likely be following up with Amazon support."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought for a friend in Africa",
      "date": "Reviewed in the United States on November 1, 2024",
      "body": "Battery was low, he is having mega problems trying to get proper functions. Guess my problem was not checking it out 😞"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks can be Deceiving",
      "date": "Reviewed in the United States on December 10, 2024",
      "body": "I Received the phone and waited about a Month or so to Post a Review. The Phone looked brand new and I was just so happy with my Purchase, BUT two days ago I was on my phone and it just WENT OUT😞! It’s doing some really weird things. And when I google, it tells me it’s something internally gone wrong! In the the lil over 90 days that I’ve had it, I’ve taken really good care of it. So ofcourse it’s nothing that I’ve done. I know from now on to purchase a new phone with Insurance or something cause yea…..",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of money",
      "date": "Reviewed in the United States on April 13, 2024",
      "body": "I purchased this to replace my aging SE2 that was overheating and losing charge very quickly. Unfortunately, this phone does the exact same thing. It arrived in good shape with a 98% battery capacity, which literally immediately dropped to 96% (edit: two months later and it’s already at 89%). The phone constantly gets hot and loses charge really fast, so I still have to carry a battery around everywhere. I’d almost believe I accidentally got another SE2 because it’s just like I still have my previous phone. Total waste of money and a big disappointment based on previous reviews."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    THIS IS NOT A VERIZON PHONE",
      "date": "Reviewed in the United States on November 10, 2024",
      "body": "This is NOT a Verizon phone as listed!!! Therefore it will be returned and is not usable."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The bare minimum",
      "date": "Reviewed in the United States on January 27, 2025",
      "body": "Was HEAVILY scratched, they put on this screen protector to hide the scratches, and there was a lot of them. The battery capacity was at 80%. Worse than the phone I had for 6 years. They tried to sell me a horrible phone but luckily I was smarter than their average consumer. Will never ever be buying from the seller again!!",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not in Excellent Condition",
      "date": "Reviewed in the United States on April 6, 2024",
      "body": "This IPhone that I ordered : Midnight SE 3rd Gen 64GBAt a quick glance looked fine but then my fingernail caughtsomething on the edge of the phone about 1/3 rd up fromthe bottom of the IPhone on the left hand side, it was a small crack.Definitely Not part of an EXCELLENT classification.The Crack is about 1/8 to 3/16 long probragating from the left edgetowards the right edge of the IPhone.It's a Shame that I might have to now pay More for the Replacement Iphoneeven though this situation is NOT MY Fault ..........",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    very bad purchase, returned next day",
      "date": "Reviewed in the United States on January 29, 2025",
      "body": "this phone came in a flimsy cardboard boxthere were no instructions or any documentationthe included charging cable was a c-type to c-type but the phone requires a lightening connectorthree hours  on the phone with my carrier and no success with activation or transfer.not worth the discounted price.  if possible,  get a new one",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"unlocked\" phone was not unlocked",
      "date": "Reviewed in the United States on September 1, 2023",
      "body": "Phone was ordered as unlocked, but was arrived locked, so could not use it. Excellent buy with no visible evidence of being used. I am waiting to hear from Amazon who is waiting for response from company that sold it through Amazon. Difficult to communicate with Amazon support agents. More information once problem is resolved."
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    screen chipped",
      "date": "Reviewed in the United States on October 15, 2024",
      "body": "first one bought was carrier locked, though sold as unlockedsecond was damaged,  picture attached1 out of 3 of these phones was a keeperrma'd the other 2"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Waste of time",
      "date": "Reviewed in the United States on January 24, 2025",
      "body": "Kept on getting phones with issues, on one the camera would shake and glitch so i returned it. And on the other one they exchanged, people on the other side couldn't hear me at all during phone calls.  I ended up getting a refund and just bought a new one directly from apple.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returns are slow ! Aweful! Won’t sync intoMy macbook",
      "date": "Reviewed in the United States on October 30, 2024",
      "body": "Yeah it won’t sink into myMacBook! Won’t even charge"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is my spare",
      "date": "Reviewed in the United States on May 30, 2024",
      "body": "Scratches on the side,"
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is an absolute scam.",
      "date": "Reviewed in the United States on December 29, 2024",
      "body": "This phone is supposed to be in “excellent” condition.There are scratches, gouges, scrapes on every single surface of the phone.  I have probably 15 instances of “visible” cosmetic damage from greater than12 inches away. And quite a few can be felt as well.The battery life is 81%.  Barely “more than 80%” is unacceptable when coupled with the cosmetic damage.This qualifies for “Acceptable” under renewed standards.Don’t waste your time with this.",
      "helpfulVotes": 2
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First one was DOA. Second one seems fine.",
      "date": "Reviewed in the United States on August 11, 2023",
      "body": "Both phones that I received were in great condition. But, the first phone would not connect to cellular. In the settings, General > About > Network said \"Phone not allowed\". Apple and the previous owner's carrier both said the phone was clear of any blocks or blacklist. The second phone connected to cellular right away. Both phones look great and had 100% maximum battery capacity.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 2,
      "title": "2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Excellent",
      "date": "Reviewed in the United States on October 17, 2024",
      "body": "Ordered the “excellent” option for the refurbished phone and it came with many scratches on the screen. I’ll have to return it and try again. Ugh."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A refurbed phone",
      "date": "Reviewed in the United States on July 20, 2023",
      "body": "Overall its a okay phone. The battery life isn't that of a new phone ...so that said it seems to function as I'd expect. There are times that the touch on the screen in the lower 1/3 doesn't seem to be as sensitive as the area on other 2/3 of the screen. On the whole I'd call it an average refurbed phone."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst sellers I've dealt with on Amazon",
      "date": "Reviewed in the United States on July 6, 2024",
      "body": "Bought a refurbished iPhone SE from Bayshine Trading and received it as normal. The screen died on it before the refund period was over so I returned it promptly. These folks refunded me $0 and said they couldn't clear log in and clearmy mother's iCloud account off it. I reminded them the screen was dead and we couldn't clear it from the device using that method. Per their request I sent them the phone pin to which they said they would refund me within 3-5 days. 2 weeks pass and I don't have a refund and when I inquired why they responded they needed her iCloud login. I agreed to have them send the phone to me for clearing once they repaired the screen. Once I  get the phone back and cleared the device of the iCloud account they say the phone is beyond the return window and will not refund me. Worst experience ever with an Amazon third party seller in almost 20 years of purchasing from them. Caveat Emptor!",
      "helpfulVotes": 18
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Completely Misleading Description",
      "date": "Reviewed in the United States on December 2, 2024",
      "body": "This iPhone was described as \"Renewed by Amazon\" and in \"Excellent\" condition. It is neither of those. Immediately after powering on the device the first time, and unfortunately after having already gone through the laborious process of setting it up for my family member, I checked the battery health. It shows a service alert and indicates that the battery is significantly degraded. It has only 77% of its original charge capacity.Items that ship with a service alert indicating that the battery is significantly degraded are neither renewed nor in excellent condition. Run away fast.",
      "helpfulVotes": 4
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    First bricked renewed phone",
      "date": "Reviewed in the United States on June 14, 2023",
      "body": "I have been buying unlocked/renewed phones for years, but this is the first time one has died on me before retirement upgrade. Had a made it to a year I think I would be less disappointed, but here we are. I believe it is just the battery that bricked, but now I have to decide if I want to attempt to repair or buy something new.",
      "helpfulVotes": 1
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Rated Excellent but is not!",
      "date": "Reviewed in the United States on February 17, 2024",
      "body": "Rated excellent but screen has scratches deep enough to catch your fingernail. We will probably return."
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Icons",
      "date": "Reviewed in the United States on April 17, 2024",
      "body": "Sometimes the icons did not work"
    },
    {
      "reviewerName": null,
      "rating": 3,
      "title": "3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    You get what you pay for!",
      "date": "Reviewed in the United States on June 4, 2023",
      "body": "This product arrived sooner than expected which was nice.  However, I ordered the \"midnight\" color and received white.  It was missing the sim card tray, so I couldn't transfer the card from my old phone.  It also had a few small scratches on the screen.  I have ordered a tray and will keep the phone anyway."
    },
    {
      "reviewerName": null,
      "rating": 1,
      "title": "1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone caught on fire",
      "date": "Reviewed in the United States on February 4, 2025",
      "body": "phone caught on fire, burnt my face, fragments of plastic had to be removed from my face, amazon will not help they tell me contact the manufacturer. wont compensate at all and its very disappointing because I love shopping at amazon",
      "helpfulVotes": 2
    }
  ],
  "productDetails": {
    "productTitle": "Apple iPhone SE 3rd Gen, 64GB, Midnight - Unlocked (Renewed)",
    "asin": "B0BDY71GRG",
    "aboutThisItemText": "About this item",
    "featureBullets": [
      "4.7-inch Retina HD display. 5G capable",
      "Advanced single-camera system with 12MP Wide camera; Smart HDR 4, Photographic Styles, Portrait mode, and 4K video up to 60 fps",
      "7MP FaceTime HD camera with Smart HDR 4, Photographic Styles, Portrait mode, and 1080p video recording. Home button with Touch ID for secure authentication",
      "A15 Bionic chip for lightning-fast performance. Durable design and IP67 water resistance",
      "Up to 15 hours of video playback"
    ],
    "boughtCount": "1K+",
    "boughtPeriod": "in past month",
    "brandInsights": {
      "topBrand": "Top Brand: Amazon Renewed",
      "highly_rated": "100K+ customers rate items from this brand highly",
      "trending": "100K+ orders for this brand in past 3 months",
      "low_returns": "Customers usually keep items from this brand"
    },
    "buyNewPrice": null,
    "buyNewAvailability": null,
    "buyUsedPrice": null,
    "buyUsedAvailability": null,
    "shipsFromNew": null,
    "soldByNew": null,
    "shipsFromUsed": null,
    "soldByUsed": null,
    "quantityAvailable": [
      "1",
      "2",
      "3",
      "4",
      "5",
      "6",
      "7",
      "8",
      "9",
      "10",
      "11",
      "12",
      "13",
      "14",
      "15",
      "16",
      "17",
      "18",
      "19",
      "20",
      "21",
      "22",
      "23",
      "24",
      "25",
      "26",
      "27",
      "28",
      "29",
      "30",
      "1",
      "2",
      "3"
    ],
    "subnavData": {
      "category": "Wireless Prepaid",
      "subcategories": [
        "Cell Phones & Accessories",
        "Cell Phones",
        "Accessories",
        "Cases",
        "Wearable Technology",
        "Deals"
      ],
      "mainCategory": null
    },
    "heading": "Other sellers on Amazon",
    "startingPrice": "$129.00",
    "url": "/gp/offer-listing/B0BDY71GRG/ref=dp_olp_ALL_mbc?ie=UTF8&condition=ALL",
    "freeShipping": "FREE Shipping",
    "productDetails": {
      "heading": null
    },
    "overviewAsin": "B0BDY71GRG",
    "overviewProductType": "CELLULAR_PHONE",
    "technicalDetails": {},
    "whatsInTheBox": {
      "heading": "What's in the box",
      "items": [
        "USB Cable"
      ]
    },
    "offers": []
  },
  "aodMainProductDetails": {
    "productName": "N/A",
    "productImageURL": "N/A",
    "ratingCount": "N/A",
    "currentPrice": "$150.00",
    "listPrice": "$169.99$169.99",
    "savingsPercentage": "-12%",
    "standardDeliveryDate": "March 26 - 27",
    "primeDeliveryDate": "N/A",
    "sellerName": "Amazon.com"
  },
  "aodSellerInfo": {
    "offers": []
  }
}