{
  "asin": "",
  "reviews": [
    {
      "helpfulVotes": 5,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "Phone arrived earlier than delivery date, and came in near perfect condition! Screen and back look great! Just small dings on one top corner. Battery life is at 82% Upon opening. Phone is working great so far! Definitely worth the price! Would recommend this seller to anyone looking for an iPhone in good shape! Not sure on other colors but with the pink I would assume mostly females have owned them previously and most women I know keep their phones in cases so that probably contributes to the quality of the specific phone I ordered so keep in mind who would have owned the specific phone you order!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Holly Jackson"
    },
    {
      "helpfulVotes": 35,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 22, 2025",
      "reviewText": "I bought an amazon renewed excellent condition iphone 13 from the seller bayshine trading. My expectations were low and was completely fine with having scratches on the phone and low battery health. But when I received my phone my expectations were beyond exceeded. My phone has no scratches anywhere and has 99% battery health! The phone did come a little 'dirty' on the edges but came off easily with an alcohol wipe. It takes a charge perfectly, camera works and looks good, sound quality is perfect. Everything I've tested so far works like new. Of course everyone will receive a different renewed phone but I think with the extreme discount a renewed phone gives (refurbished off bestbuy is 500, i paid 300 on amazon), as well as guaranteed 30 day refunds and returns, it is 100% worth it. I will be buying renewed iphones off amazon for all my future phones! :)",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kaylee"
    },
    {
      "helpfulVotes": 11,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Only complaint was the delivery, says overnight and took 4 days to arrive.Phone overall is a 5star Works just fine. I upgraded from my 11 to this 13 and im pleased with my purchase. Local stores wanted 600$+ and limited colors. This Came with a screen protector already installed and the charger wire which i was not expecting so that was a plus for me. 2/27/25 is when I receive my phone. if anything changes ill update. for now, Im definitely buying another one for my work phone. Price is right, condition is excellent. Few minor scratches marks from previous phone case but for a used phone no complaints looks new.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Rudy"
    },
    {
      "helpfulVotes": 25,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 6, 2025",
      "reviewText": "I bought this iPhone 13 128GB Starlight, and since it’s a renewed product, I was quite nervous when I first ordered it. However, when it was delivered, it was amazing. The exterior was in good condition, the frame was nice with no scratches, and even the back and camera worked well. After setting up the phone, I checked everything and was very satisfied to find that the screen hadn’t been replaced, it’s the original screen. Overall, everything is great. The reason I gave it 4 stars is because the battery capacity is only at 85%. If it were higher, it would definitely deserve 5 stars. But for a renewed product, this is already excellent",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Dang Nguyen"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "My boyfriend needed a new phone very bad and we were tight on money and didn’t want to spend 1k plus for a new one. I was very skeptical buying a phone online, as of course you could really get anything. But this phone is literally perfect. It took a couple days to get here, and it was perfectly unscathed. No scratches, no cracks, and it functions so perfectly. It’s as if we got a brand new iPhone. I definitely recommend this product. Also for reference we bought the best condition option. 100% worth it!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Dank"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "JJ"
    },
    {
      "helpfulVotes": 32,
      "isCritical": false,
      "rating": 3,
      "reviewDate": "Reviewed in the United States on January 27, 2025",
      "reviewText": "I ordered the iPhone 13 pink, it came today and the phone itself overall is emmaculate condition. There are no scuffs or scratches anywhere or dents. No screen damage or issues. My only complaint is that I ordered this in “excellent” condition and the battery health is 88%. Apple recommends replacing batteries after 85%, so this battery isn’t really that great overall. Anything above 90 would’ve been much preferred but overall this was a great purchase for the price. Color is super cute in person.Update: 3 days later I am updating my stars from 4 to 3. The battery health % has already dropped to 86 from 88 in 3 days. This battery is not good anymore like I mentioned in my previous review. It already needs replacing or the replacement this seller used is garbage.",
      "reviewTitle": "3.0 out of 5 stars",
      "reviewerName": "Carle Todd"
    },
    {
      "helpfulVotes": 6,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 22, 2025",
      "reviewText": "Phone condition is good in general. But it was not up to Amazon “Excellent” rating level, as it was stated in description. The biggest concern and disappointment is maximum remaining battery capacity of 76%, instead of expected 85 and above. Screen, camera and body are fine, couple of light scratches on screen still can be found.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Andrii"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 15, 2025",
      "reviewText": "No I’m not a bot. Even tho it was delayed by a day. Which is fine. The phone came basically brand new. No cracks or scratches or any residue on the front or back, or sides. 100% battery health. The picture quality is super good, feels great, doesn’t lag or anything, battery lasts a long time from one charge to 100% depending on what you do, the brightness of the screen is nice as well, and it’s easy to set up, i transferred my data from my previous iPhone to this one. I basically saved $200-300 on a brand new phone. Nothing about it feels refurbished, it feels and runs like a brand new phone.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Paul Daigle"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 24, 2025",
      "reviewText": "I took a gamble and mine was about 83% battery capacity which is worse off than most, but I don't use it much except next to a charger. its run speed is great, it came in six hours, which is ridiculously fast. there's no cracks or scratches on it anywhere and i had no troubles with service this one's better off than my cracked broken 12 so I'm pretty happy with it.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 10, 2025",
      "reviewText": "Arrived on time. In good condition. Had to charge upon arrival. Device got pretty warm and hoping this won't be an issue. Battery health is 84%. Fingers crossed it will last a few years.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Angela Shafer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 6, 2025",
      "reviewText": "Se debería escribir en las especificaciones el rendimiento de la batería (ej 85%) ya que que el que compre dice 83 % x lo tanto va a tener muy corta duración esa batería, en ese sentido estoy decepcionado)",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Fernando Silva"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "The phone is nice, but was not equipped with a new batterie. The batterie is 80%. It should be 100% in my opinion. Update…… the screen had a flaw and the alarm didn’t work. The phone had to be returned.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Gyotaku"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 31, 2025",
      "reviewText": "Overall, the phone was in good shape externally. Clean & scratch free.However, the battery was at 87% lifespan and apple recommends replacement at 80 so it is near the end and the battery dies rather quickly for an iPhone 13.The screen was replaced with a non-apple screen.* There is a constant pop up that tells me about the non-standard part.* The right side of the screen isn't correctly aligned with the display so typing p or backspace is difficult.* The screen has some halo when displaying certain things.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Jesse Smith"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Bought the phone in good condition. It came close to perfect with minor scratches and the battery health at 89%. The only gripe that I have is that there could've been better packaging and there was no included charging adaptor. Otherwise, I'm happy with my purchase!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Supreme"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 11, 2025",
      "reviewText": "Todo en perfectas condiciones sin ninguna queja, lo único es que no trajo el pin para la bandeja de tarjeta sim, me llegó con 86% de batería.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Angelo Bolívar"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "Phone is in great condition, but did not have 100% battery health came with 87%, but for a used phone works great came through the mail pretty quick, works great.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Alexandria"
    },
    {
      "helpfulVotes": 6,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 28, 2025",
      "reviewText": "This was my first time purchasing a refurbished electronic of any kind so I was nervous. Reviews were great overall and you do get a month to return if it ends up being defective. I upgraded from an iPhone 6 which was still working fine but I wanted to find an upgrade before it actually breaks and I'm without a phone. So the upgrade from a 10 year old phone was massive even though this one is already 3ish years old.I received it with about 87% battery life. For about the first week, I was on it constantly all day every day getting everything set up just the way I want it and trying out new features that weren't available on my old obsolete phone. And everything works perfectly. The only way I can really tell it was used was by the scratches around (not on) the back camera lenses, but since I hardly even look at the back of my phone it doesn't bother me.I'm not someone who always has to have the latest tech, so this has worked really well for me. I think I might always choose to just go through a reputable dealer for a used phone anytime I need to upgrade.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "raly"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 7, 2025",
      "reviewText": "The quality is excellent but the outside is a little scratch but its not that bad. BUT it was dirty, like the little holes and sockets .",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "AXELL"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "I withdrew returning this iPhone as the problems it is having is something with possibly Fb and messenger as I googled it and then my 2 daughters said they had the same issue — that is grey box popping up as you type in messenger or FB.The phone was in great condition and I have been using it now for 4 days and cancelled the refund if it.  It works great and love it.  Thank you to the company for being patient .. they were great!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Debbie Madsen"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "Good cell phone for being used.  A birthday gift for a 13 years of age girl.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "LANCE"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "Phone looks exactly as advertised, in EXCELLENT condition. You would think it was never used. I put 4 stars only because I'm used it for a couple of days. Delivery was on time as well.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Rhea"
    },
    {
      "helpfulVotes": 5,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 29, 2025",
      "reviewText": "It’s a fair deal. Came on time, and transferring data from my old phone was easy. Phone is in good shape, a few minor pin marks on the screen and on the back, near to the cameras, but barely noticeable doesn’t bother me. Phone works great, camera and other functions were working properly, battery has 81% life time. Touchscreen became lazy after protector installation, specially for typing. I’m going to replace the protector and evaluate. But I recommend the product!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "George Xavier De Assis"
    },
    {
      "helpfulVotes": 5,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 7, 2025",
      "reviewText": "i got the phone a day earlier then i was suppose to but the phone battery is at 72. i have prepaid verizon i am going to have to go in the verizon store to try to get it turned on this phone and my old phone have a sim card but when i transferred it messed up i don't know how but i think i disactivated the sim by clicking something that popped up possibly. in other words it isn't as easy as everyone made it seem to transfer the sim card and it automatically turn on. it came wrapped i love this phone and it works great very much needed upgrade.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "samantha"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 8, 2025",
      "reviewText": "At first I was kind of skeptical with this product since it was refurbished, but I really liked it! It’s good for the price. It was like it was brand new! And it is indeed an apple product. Not a scam. My only problem was that I ordered it December 17, 24’ and it didn’t get here until January 7th 25’. Probably because it was Christmas.And don’t forget, your SIM card probably won’t work UNLESS the phone has the same carrier. I had to go in store to purchase me a SIM card for 30$. Overall 10/10. Oh and to take my advice get the EXCELLENT version for less complications.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "foxx Thompson"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "Only have had this a few days, so far, but I am happy with my purchase. I was nervous about buying refurbished (have never done that before) but it feels like a new phone. There was one small scratch/dent on the top of the phone despite the fact that the description said the condition was “Excellent” (which is defined as no scratches). But, it’s not noticeable with a case. Will likely buy refurbished again, in the future.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Heart Smart"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "I have it a 4 star because I ordered a green one but received a pink one, no issue with the phone except the color. Luckily the wife was cool with a pink one.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Donald Wolcott"
    },
    {
      "helpfulVotes": 27,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on August 23, 2024",
      "reviewText": "So let me start out by saying that I am not one to purchased refurbished phones and whenever something would happen to one of mine and I had to turn it into the Phone company and they would send me a refurbished one to replace mine, there was always something wrong with them. So, that has always made me a little bit gunshy regarding that particular situation.With that said, as a full-time caregiver for the last 11 years, I have not been able to work and unfortunately can no longer purchase the best of the best with the flagship phones that I used to get back in the day. Many of my parents doctors do some video visits and some of them actually prefer FaceTime so as a result, having an iPhone was actually partly a necessity for that reason.I have always been an Android girl, )still have that too), so I didn’t quite know what iPhone I needed to get, but after some research, I finally settled on what I thought would be the best choice for me both with regard to the technology inside and with the price as well as the warranty.I had actually considered either an iPhone 11 or an iPhone 13 as my choice. As we are now on the 15 I found the 13 to be the wisest choice of the two.After researching many different sites, some very reputable and actually recommended by people, I decided to land on Amazon‘s renewed program because I’ve always had a nice experience when there have been any issues with a product and I’ve never had any problems with customer service. They’ve always been very helpful and I thought if anything were to happen with the phone, I would be hoping to have the same type of experience.In looking at the options, I chose to actually pay more to have one that was put forth by Amazon themselves because they offered a year warranty as opposed to many of the others who were a bit cheaper and offered maybe 30 days or so etc.And hey, so far, so good! The Phone arrived. It was in perfect cosmetic condition and I have not had any issues with it since. The battery was at 87% and although I would’ve liked to had it higher than that, I was glad to see that it still was pretty snappy when I needed it to be.So I would say that I have been very pleased so far and I would absolutely recommend the renewed program to anyone interested, but can only speak to the actual product provided by Amazon itself, however, I’m sure many of the third-party individuals that sell refurbished items may have some really good product themselves.Ah…there I go again…refurbished…renewed…to-may-toe…to-mah-toe… well you get the jist…",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Najara"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "I bought this phone 2 months ago. the battery is like 85. none of the parts were replaced, the screen is intact, and there are no scratches. I admit I was scared to purchase from amazon, but they did not let me dow.n I recommend.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Natalia Lloyd"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "My previous review about this product was not so good due to my package not being delivered. However, when I contacted them, they sent me a replacement and it was actually delivered this time. I’m happy with my purchase and I would definitely order again.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Bryttnee’ on Film x ZaP’d Beauty PLLC 📸⚡️"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "The product was in great condition but there was two things wrong with it it had bad battery health and had scuffs on the sides other than that it was great",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Jane Elizabeth"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 9, 2025",
      "reviewText": "I decided to purchase a refurbished iphone.  I’d purchased one before for my son who needed a replacement and that experience was fine.  So, not wanting to spend a thousand dollars for a new iphone, I decided to get a refurbished one in excellent condition.  And, it was really excellent condition and provided the bump up in storage, functionality and battery life I wanted without the price.  The plus is buying recycled products is much better for our beautiful earth.  Very satisfied customer",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "annette davis"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 19, 2025",
      "reviewText": "it works perfectly; however, it came with a few scratches on the screen. the battery life seems very durable!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Alani Shockley"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 1, 2025",
      "reviewText": "Phone is great works like it’s brand new! Was easy to set up and had no problems transferring. The only bad thing is the battery percentage. Mine was at 86%. Comes with new charger as well.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "nikayla"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 22, 2025",
      "reviewText": "I loved the price of this phone very affordable for this model. The shipping was amazing fully wrapped. It came with a charger. I’ve been using this phone for over a month and there have been no cracks and that’s good because I drop my phone a lot. The weight is also light but heavy enough that it feels like you're still holding something. I approve and give 10/10",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Brooklyn"
    },
    {
      "helpfulVotes": 3,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 20, 2025",
      "reviewText": "I got thos phone for my teenage son for his birthday. He loves it! However, when we got it, the port wasn't working well and had problems with charging. We went to an apple store and they cleaned out the port. There was a ton of dirt in it!Thankfully it works now!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Dawn Hughes"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "IPhone 13 arrived in less than a day after ordering. 0pened package,  it looked like it had never been used. Not a scratch on it. Battery health was at 89%. I am well pleased. A shout out to the seller and Amazon. For the price of $320. I feel like I got a fantastic deal.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "In perfect condition with 98% battery health what a steal. I was skeptical initially but I’m glad I purchased this. Saved me from having to stick with an android for two years",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Sam943112"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 28, 2025",
      "reviewText": "I bought this phone after wanting it for a while, but the only slight con I have is the battery capacity was at 86% but it lasts through a whole day of school. So it I recommended 👍🏾",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Jayxshino"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 10, 2025",
      "reviewText": "I bought mine in excellent condition. And INDEED it is in excellent condition it looks BRAND SPANKING NEW. Battery at 100 % health. Not even one nick or scratch. I would definitely recommend it for the money.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Tatum"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 13, 2024",
      "reviewText": "So far I’m happy with this phone. I had a few problems when first used it. The talk to text and Siri weren’t working. Once I did the updates and Reset the phone it was fixed. They both are working fine now.I’m not super happy with the screen. It’s either too sensitive or not enough. It skips letters on the front screen and along the edges,Over all it’s a great buy. Much better than spending $1000 on a new phone.The phone looks nice barely noticeable that it’s used. There are a few minor scratches around the camera but that’s all. You wouldn’t notice if you didn’t know to look.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "mtbbetty"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 2, 2025",
      "reviewText": "I was a little hesitant about buying a renewed phone but I’m so glad I did the phone came in perfect condition. Also came with a screen protector already on it. Everything works camera, sound & etc. I will definitely buy phones only from here now, I love it!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Teria"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 19, 2025",
      "reviewText": "Very skeptic about buying a refurbished phone. I’ve always bought new. There were a few reviews that had me worried as some customers weren’t satisfied. I took a chance because the good outweighed the bad.Cosmetically there was one small scratch. Nothing major. Screen was flawless.Functionality smooth, and very responsive!Charging speed is very fast. (Impressive)Durability seems really good so far. I’d definitely shop again.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Otis W."
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 11, 2025",
      "reviewText": "Very great products. I purchased three items and was just trusting the process and you guys didn’t disappoint. I’ll definitely have you in mind whenever purchasing phones. Value for money!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Tashena"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "The phone was even better in person!! It looks brand new & is such a pretty color of pink. I am very pleased with my purchase 😁",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amber05"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 6, 2025",
      "reviewText": "Came with no issues and like new. Very easy to set up with wifi and the installation of the Sim card. Excellent buy and would recommend over upgrading straight from the app of your service provider.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Nelson Portades"
    },
    {
      "helpfulVotes": 3,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 23, 2025",
      "reviewText": "I was initially hesitant to buy a refurbished phone. However, I was very pleased. The phone arrived within 48 hours and was in near mint condition. It was also a whipping $300 less than my carrier wanted to charge me.This will definitely hold me over till upgrading to the 17 is in my budget at the end of the year.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Nick"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 4, 2025",
      "reviewText": "works awesome , easy set up, nice screen. the actual phone part though was very scratched and chipped. super fast shipping",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "sarah"
    },
    {
      "helpfulVotes": 5,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 21, 2025",
      "reviewText": "I got my “new” phone in like 3 days from ordering. It is perfect. No scratches no dents. Looks like the original screen and my battery health is at %100 which I always am worried about when getting refurbished phones. Super satisfied with my purchase. I’ve had my phone for about 2 weeks now. Waited to make sure no issues. Thanks for the good purchase!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Arijo"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 15, 2025",
      "reviewText": "Like new condition.BUT, the battery health 81%",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Gerald Ventura"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "Phone is in great condition looks just like the picture & the battery is awesome holds great charge ! My girls were satisfied & so was I ! I would definitely recommend buying !",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "maysha Myrick"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 7, 2025",
      "reviewText": "I love my new IPhone 13 White. It was easy to set up just by switching my sim card to the new phone. Battery was at 93% & everything looks & works amazing.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Sierra D. Colorado Springs"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 15, 2025",
      "reviewText": "Came with white crusty stuff all over. And it sounds weird when I send voice messages..idk if the white stuff has something to do with it but I cleaned it off and other than that the phone calls sound fine and it works pretty good.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Jay."
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 10, 2024",
      "reviewText": "I received a good price on this iPhone 13 considering I took advantage of the Amazon store card and got 80.00 off the price. I’m very pleased with my renewed iPhone 13. It only had a very small scratch on the screen.  It was cricket locked which I have cricket service. I switched over the  old phones data etc. with no problem. I was able to keep my original phone number. iPhone sold at cricket wireless are very expensive. They wanted 699.00 with keeping my old number. I paid 240.00 for renewed for the same phone.. I would recommend this seller.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Mickie"
    },
    {
      "helpfulVotes": 11,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 10, 2025",
      "reviewText": "FYI if you have an eSIM card on your old iPhone like I did holy crap. So unbelievably simple to transfer service (NOT DATA) to your new phone. Like press a couple buttons on both phones simple. And no getting permission from the account holder if you are on a family plan. Data, ya that’s simple too, as long as you back up your old phone over the cloud or onto a computer. And no bullshit Verizon charges for a “new” SIM card or waiting there! Seriously I’ll never buy a phone another way (yes, I always buy my phones outright, personal preference).Technical details aside, the phone was listed in excellent condition and it is, one or two small dings to the metal sides but otherwise perfect. 80% battery health (which lasts longer than my 2nd generation SE at 92%). I did not realize the seller was sending by FedEx signature required, but luckily it was able to go pick it up at the local shipping center. Packaged securely, no damage in transport.Highly recommend.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kim Schuldt"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 15, 2025",
      "reviewText": "Excellent condition, just as described. Very fair price. Fast shipping. No issues connecting to our service carrier either! Very pleased. Thank you!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amanda J.  Pompa"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "The iPhone 13 has worked like it should. No problems, shipping was fast and iPhone came in perfect condition with no damage.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "iris clark"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Brian"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 6, 2025",
      "reviewText": "This is my first iPhone. I was going to rate the product 5 stars but I noticed 2 scratches on the screen after I had the phone for 2 days.  Will keep the phone as you can only see the scratches under a bright light.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Denise"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "10/10 no dings no scratches looks and feels brand new battery life is great also this was a complete steal go for it i ordered the pink one",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Horrible only YouTube and select YouTube movies immediately sent this thing back"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on October 22, 2024",
      "reviewText": "the phone came in very fast, the delivery said it wouldn't be here until around halloween and it came in yesterday. the phone came in super nice minor scratch on the bottom, speakers work, all 3 microphones work. the problem came in when i started to set up the phone. i went through the entire process and got to the part to transfer everything from my other phone to this one and it told me i had to update it. i could not get the phone to update. i let it sit in the update screen for 2 hours and it did not start to update. i had to set up the phone with no transferring to update it. after that i erased the phone again and was finally able to transfer all of my stuff. it was definitely a struggle but i finally got it and am very happy.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "gracie"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 18, 2025",
      "reviewText": "Phone was excellent condition no complaints battery health could have been a little better than 84% but otherwise I'm satisfied would buy again .",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Tim P"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 6, 2025",
      "reviewText": "Shipment came quickly. Phone is in perfect condition and came with 99% battery life. Very happy with my purchase. Highly recommend",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Mindy Babineaux"
    },
    {
      "helpfulVotes": 33,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on July 28, 2024",
      "reviewText": "This was my first time buying a refurbished phone, so I was nervous about what I might get, but a couple of days in, I have to say I'm pretty satisfied.First, shipping was very fast! I had the phone in my hands within 48 hours of placing the order, which surpassed all my expectations. It came with a charger (both the cable and block). The phone was dead when it arrived, so I needed to charge it first, but no big deal. The first thing I noticed was that there are some small chips and scratches around the edges of the device, most noticeable on the top, but with a case on, the damage will barely be visible. I've been using it without a case the last couple of days while waiting for the one I ordered to arrive, and even uncovered, it doesn't look that bad. Screen and cameras are in perfect condition. The phone was perfectly clean on arrival too, no dirt or dust.The max battery capacity is 85%. Since I paid for excellent quality, this was a bit disappointing to me and is the reason for me rating only 4 stars, especially after seeing other reviews of people who got batteries in the 90s, but it's still a major upgrade over what I had before (a 2020 SE with only 72% capacity). Overall, I've been happy with the performance so far, especially for the price. I would buy from MobileSupply again!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Emilee"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 28, 2025",
      "reviewText": "Little scuff on corner but phone works and shipping was fast.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "T"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 6, 2025",
      "reviewText": "👍",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Nessa"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "Very Happy with purchase. Clean and great battery life left. Would buy from again.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Jeffrey A Richards"
    },
    {
      "helpfulVotes": 20,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 24, 2025",
      "reviewText": "I love this phone. I’m using it to do this review. I had no trouble setting it up. Charged it right away. I was so happy with the condition, I opened it and it looked new. In excellent condition, no dents or scratches that I see. I’m so glad I got this. I will get refurbished for now on. This company sent it right away. MLK day delayed delivery. I’m so happy so far. Now to order a protective cover . The price is almost unbelievable to what one new would cost. I’m very sold on this company and seller.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "karen grimm"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 11, 2025",
      "reviewText": "Phone is amazing' just like NEW! My daughter loves it. Thank you.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "CristaL Rodriguez"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 31, 2025",
      "reviewText": "In love with this phone so far battery life is 85% but everything works great on it delivery was fast just didn’t care for fedex shipping it took for ever for them to deliver it. But over all 10/10. Only thing I didn’t care for is when I got it. It was already on the Home Screen. Only comes with block and cord (not apple). But every thing was 100% for me! Thank you so much!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Terrilyn"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Le pondré 5 estrellas. Lo que estoy puntuando es la honestidad, ya que el producto estaba defectuoso. He recibidos el reembolso luego de reenviar el equipo.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Mariano"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 8, 2025",
      "reviewText": "I love that the phone was in excellent condition the body of the phone is excellent my only dislike is the battery health I thought the battery health will be closer to at least 90-95%",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "verne ajamo campbell"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "honestly when I got in very very good condition it's 89% I can careless came in 3 days so don't worry 🙏🏻",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "kevin"
    },
    {
      "helpfulVotes": 11,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 8, 2025",
      "reviewText": "Hi! I just got my iPhone 13! I bought the Apple iPhone 12, 128BG, Pink - Unlocked Excellent. The phone came earlier than expected which made me super happy because I had to leave for college soon. The iPhone has a couple of scratches on the sides but nothing I really notice much. I got ready to put my screen protector on today but then noticed there was a screen protector already on which was odd but I guess it's a plus. I looked at the battery health, and it's currently at 80% Battery Health. I don't think it's overall a bad deal for a refurbished phone. I usually get refurbished phones from Amazon and always have a positive experience. If you're looking to get a budget friendly phone, this is your sign to get it!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Emoot"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "EXCELLENT QUALITY PHONE, \"PERFECT\" MUCH BETTER THAN EXPECTED",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "iPhone 13 in perfect condition with 100% battery health! Better than expected!Thank you!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Joshua Seeley"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "Me llegó muy bien el equipo",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Excelente compra 10/10"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 23, 2025",
      "reviewText": "Llego en excelente condiciones, solo unos pequeños detalles que ya con cover puesto no se visualizan y que la batería está en 88%, a parte de eso todo muy bien y funciona de maravilla.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Juliana Rodríguez"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 28, 2025",
      "reviewText": "Todo muy bien",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Joel Flores"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "Daughter love it, very nice phone",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "jamie"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "Timely shipping and it works!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "David Dynneson"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 7, 2025",
      "reviewText": "Arrived same day I ordered. No complaints. Looks and works perfect!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 16, 2025",
      "reviewText": "I work as a cell phone rep , battery is at 85 percent. 4/5",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Battery is at 85% purchased excellent condition"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "Came with no defects. SO pretty and after 5 months I don’t regret this purchase one bit.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "oraa"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "Excelente porcentaje de bateria, excelente condicion fisica. Recomendado 100%",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Jesus m."
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "I love my phone and no issues so far",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "AYABeJZb9VKg4Rd29BpT8owQcwsAAAABAAdhd3Mta21zAEthcm46YXdzOmttczp1cy1lYXN0LTE6MjAwMzY3Nzg2MzQyOmtleS9lYmVjYmY1Ny0yOTU1LTRlMzktYmM2YS01N2RiNjU5ZWZjNGYAuAECAwB4t2IZJ7mE4DNdeo+7Hes7L1Du1aTwQyVAkcTkuHJuXnMBuer1+vu6kWWDJpDUs06y2AAAAH4wfAYJKoZIhvcNAQcGoG8wbQIBADBoBgkqhkiG9w0BBwEwHgYJYIZIAWUDBAEuMBEEDFHx0gDFfFMubtVn3AIBEIA7CKBew57kAEF1mTFXJ7FSRV8+DM/QnKbuPJx6cUvJvKQNesBdC38sQ8IKiDQ4cR/5fkPPidoWo86y0d4CAAAAAAwAABAAAAAAAAAAAAAAAAAAhT41v/ot087mNwrhYcHA2/////8AAAABAAAAAAAAAAAAAAABAAAADoyXjmsJRWKPX0bFjH5kGbn3f7pPoPZN5s3FLCaU9A=="
    },
    {
      "helpfulVotes": 17,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on August 21, 2024",
      "reviewText": "Overall, I am happy with this purchase.  The battery reports 100%, and overall the phone is in good condition.  If you keep your phone in a case, you wouldn't notice the small gouge on the top right.  There is additional minor wear and tear around the metal housing (seems like the prior user didn't use a case).  If you prefer to go caseless, expect that you could receive a device with some minor but noticeable wear and tear.  However, the phone was not sold as \"flawless\" so some wear and tear is to be expected.  For my use case, the phone met my needs.  I threw it in a case and don't notice the flaws  The phone came with a glass screen protector which was a nice touch.  I haven't pulled off the screen protector  to see if the underlying screen has scratches.  if there is wear-and-tear on the screen (ex. small scratches from keys, etc.) they are minimal and not noticeable thought the screen protector.  Overall satisfied with this purchase for my use case.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "LarryNATL"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 11, 2025",
      "reviewText": "El teléfono tiene algunos golpes en las orillas, no se encuentra en excelente estado como dice en la descripción del producto",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "El soporte no se ajustó a mi vehículo, mi vehículo está dentro del listado de ajuste en la descripción del producto, ya solicité la devolución pero el vendedor no me ha enviado la etiqueta para devolverle el producto."
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "I was so nervious to be scammed but the phone was in perfect condition to be a second hand. I’m so happy.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Sofia Olivera"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "A month later, and the phone still works like brand new. No issues at all!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "jennifer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 9, 2025",
      "reviewText": "The battery capacity is only at 87%. The package itself was late two times. Other than that not many issues, and no damage.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Ashley"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 5, 2025",
      "reviewText": "This iPhone 13 looks and operates like brand new, which I got refurbished at a fraction of the original cost.  The dealer also expedited shipping to me after i let him know that my older iPhone had died, so I would highly recommend them for anyone else debating using them for their next iPhone purchase.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Darren Seward"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Great conditions! For the price I paid I got 90% battery life which is perfectly fine!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kevin J. Verdugo"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "I’ve had the phone for about 2 weeks now, it came in good condition. Definitely felt like it was brand new. It didn’t come with any scratches or anything, I also tested out the camera and volume and it was GREAT!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Mía"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 17, 2025",
      "reviewText": "Immaculate condition, and 92% battery health! Setup was a breeze and the unit is beautiful :)It's like a brand new phone at half the price, thanks!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Emma"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "Had phone for bout a week now and works great nothing wrong. Great purchase.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kayla Woodard"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 18, 2025",
      "reviewText": "Woks so far",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "I have NO complaints Excellent quailty, battery life is 95%.  overall 5 star purchase Thanks!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kway"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 28, 2025",
      "reviewText": "This phone is amazing it works was super east to set up definitely recommend",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Nina"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 18, 2025",
      "reviewText": "I’ve had this for almost year now nd I honestly never had any issues or anything if you’re thinking about getting do it",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Stephanie"
    },
    {
      "helpfulVotes": 10,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "Really fast shipping option was great because I broke my phone. The phone is in excellent condition as described. The screen has one needle pin scratch (literally a teeny tiny dot that is less than a speck of dust) and one scratch that’s less than a mm, which is incredible. I expect some wear and tear, but it is way better than my expectations and experience buying refurbished phones. I’m very pleased. It’s as described if not better. I will be purchasing from this seller again. Great prices and reviews on their page by the way. Works like brand new and it has 86% battery life. Came with a charger box and a chord, very nice of them to include both with the amazing deal it was already at. I would recommend anyone to buy a phone from here and am eyeing another now for family. Thank you so much seller!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "John Doe"
    },
    {
      "helpfulVotes": 8,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 20, 2025",
      "reviewText": "Great phone in great condition. Battery health was a bit low at 90% but was in great condition and works well. I had a it of trouble setting up the Apple ID, I upgraded from an IPhone 12. I had previously disconnected my previous line so no longer have the number. Unfortunately the old number was still connected, so every time I would try to use the Apple ID connected to the iPhone 12 it would send a confirmation code to the phone number so I had no way of using the phone number. So I had to create a new Apple ID and email. Other than that everything works fine and I purchased the yellow option and love the phone and the color is cute!💛💛💛",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Justin"
    },
    {
      "helpfulVotes": 164,
      "isCritical": false,
      "rating": 1,
      "reviewDate": "Reviewed in the United States on September 19, 2024",
      "reviewText": "I have had this iPhone for 38 days.It has the worst battery life of any iPhone I've ever owned, and I have owned ONLY iPhones since the first version was released 17 years ago.This is the second iPhone 14 that I've bought from the renewed store .The first one I bought on December 4th, 2023, and I could not have been happier with the phone.It arrived in brand new condition, and performed flawlessly.On the recommendation of a friend, I checked the battery health and charging after having it for MONTHS and it was at 100%! I was thrilled!I absolutely loved the phone!I never had a single problem with it.Unfortunately, on July 30 of this year I dropped it, and it was beyond repair.I immediately went back to the Amazon renewed store and purchased another iPhone 14 because my experience with the first one was so fantastic.It arrived in new looking condition, exactly like the one I bought in December 2023.It was not scratched or anything really noticeable, it just seemed to be \"worn\" a little bit, but I fully understood that it was a renewed phone, and any cosmetic issues were not that important to me, including the color, which, when my iPhone is in its case, you cannot tell what color it is anyway.Unfortunately, I DID NOT look at the battery health and charging when I first got the phone 38 days ago, but I did look at it about two weeks ago, and it said 93%.I thought, ok, it's a renewed phone, it's not going to have 100% battery life.I can live with that.Well, I just looked at it today and it's now at 90% battery health and charging.So this phone is dying quickly.After being fully charged it dies within hours.I have it completely set up for optimized battery life.I have lost emails and messages that I was in the middle of composing, and the phone just dies.I've been in the middle of important phone calls when the phone dies, simply because I had just fully charged it a few hours before that, and thought I would be fine for hours to come.I just had a total shoulder replacement surgery a week ago, and I was on the phone with my doctors office yesterday about my first post-op appointment, and my phone died in the middle of it.I thought I had HOURS left before the phone would die.Then I had to plug it in, and wait for it to come back alive, so I could call my doctor back and hopefully not wait a half hour after losing my place in line.On top of that is also has issues with the touchscreen being glitchy, and sometimes I have to tap on things several times to get them to work.As I said, I have been an iPhone owner/user since the very first version came out 17 years ago.I've always loved all my iPhones, and I will continue to be an iPhone user for the rest of my life.This is in no way reflection on Apple iPhones whatsoever.They are an amazing and fantastic piece of technology.I think I just got a bad one for the first time in my life.Luckily, I have just checked and I have until November 6th to return this phone, and I WILL be returning it.The problem is, what do I do in the meantime?Am I expected to buy a new one and get that shipped to me, transfer all my information from this phone to the new one, and then return this one?That is extremely hard to do financially!I am actually still paying for this phone on my Amazon Prime American Express card!Or, do I return this phone and wait until the refund has been issued and then buy another phone? Then wait until that is sent to me.I would not have a phone for at least a week in the interim, and we all know these days that's a practical impossibility.I am also having several medical issues.Like I said, I just had a total shoulder replacement surgery last Monday, September 9th, and have several upcoming follow up appointments, and physical therapy appointments.I also have several other non-related medical issues that definitely require that I have a phone.I just don't know what to do.",
      "reviewTitle": "1.0 out of 5 stars",
      "reviewerName": "Another Amazon Reviewer"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "Awesome product I chose the excellent unlocked version. I had absolutely no issues connecting it. The phone itself is in brand new condition not a blemish scratch or damage of any sort I would recommend this seller to anybody.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Anthony Lyle Demike"
    },
    {
      "helpfulVotes": 4,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "Good so far. Phones battery healt is at 86%. Phone condition is good, no scratches. Phone seems to be working well. The screen looks great. The only thing I would say makes a difference is that the camera has a little visible wear and tear. I was scared to order as the reviews werent great but im glad I did.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Ari"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 25, 2025",
      "reviewText": "Battery life is at 86%, sure the iPhone has defects and some weird dirt/rust on the back of camera but I haven’t had any issues yet as I’m setting it up. I can’t speak for other customers who have had issues but so far so good!Edit after a week: It was some weird junk on the back camera, the phone has to scratches or any dents and has been working properly. Only downside is that the camera doesn’t detect QR codes. That’s not a deal breaker for me. Glad it works and satisfied for a used iPhone 14!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Ren"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "My boyfriend loves his new phone. Looked like new when he got it. He’s never bought used before and I talked him into it having had such a good experience myself with a used phone from Amazon. He’s so glad he did it, saving him over $200 from what the phone store was going to cost him. He loves the features on this phone.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Susie"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 14, 2025",
      "reviewText": "I love the color and besides a few small scratches which are to be expected, the phone works perfectly and has a great battery life. A very affordable and reliable option if your not looking to get a brand new iPhone.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Saffia Sekkat"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 2, 2025",
      "reviewText": "So far so good…the only thing that bugs me is the fact they can’t warrant the water resistance that a new or apple certified phone would have.Which means it has absolutely  been  worked on (renewed iPhone) by a third party vender ???Had it a few days and it has been fine 90% battery life …charged it last night at around 8:30. 9 oclock it was fully charged and it’s now at 38 % so about 15 hrs.with little to mild use .The camera acts up a little ,as in scanning an id for identity verification.but all around it seems to be performing like an I phone .",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "daddy"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "I got one classified as “good.” I can’t see any damage on the phone. It looks like new. Setting it up went perfectly, absolutely no issues, and e sim was installed without problems. The battery is at 87% which is what I expected. My old phone was a year and a half old and it’s 87% too. The phone though lasts longer than the old iPhone 12.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Katherine Lorene Crowe"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 28, 2025",
      "reviewText": "Very happy so far with this phone.  It arrived in excellent condition. There was a few tiny scratches, really not noticeable unless you are really looking. The color is exactly as pictured and it holds a charge as it should. I have not had any issues with the phone getting to hot. I have played games and watched videos, the temperature remained fine.Overall, I feel this was a good purchase.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "helpfulVotes": 29,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on October 28, 2024",
      "reviewText": "The seller is great, we had to send back the first phone because we thought it was defective, it turned out that there is a significant conflict with the portability of the old phone information and 18.0.1 upgrade.  When we cut on the phone we set it up to transfer the old phone material first, then it wanted to upgrade the software prior to the transfer.  The upgrade spooled around for 18 hrs, then the portability function (over WiFi and Cloud) simply would not work.  AT&T couldnt figure it out....we sent the phone back thinking it was defective (turns out it was fine), got a new phone same model, etc.New phone had the same issues, and I was thinking at this point it cannot be coincidence so it must me a software conflict.  And....it was.  After MUCH tinkering with it here is the workaround for those of you who are in the same situation (as an aside, we were upgrading my wife's ancient XE to a 14 but I think this happens with a lot of phones no matter the model)1.  Cut on the new phone2.  Opt to NOT set up the new phone with the old phone (ie, do NOT transfer the old phone data yet).3.  Go to settings, opt to update the software to 18.0.14.  After this, ERASE the phone.  It will keep 18.0.1 on there, it will remove any impediments to port over the information.5.  KEEP the e-sim information on there(it gives you that option when you erase, it is ok not to do it but you will have to put it back on so just keep it on).6.  Boot the phone back up7.  OPT to set it up with the old phone (likely the older phone will prompt you for this first).8.  You can set it up over Wifi or Cloud, make sure you have backed up the old phone on the cloud just before set up if you opt for that.9.  There is an option to use direct cabling to transfer, but it is a pain because Apple insists on using the proprietary cabling they have, so it means you have to first port everything onto a laptop then transfer it.  Safer but not any quicker.  I would not do that unless you have cloud issues and/or bad WiFi.Phone has worked great since we did the workaround, and I want to compliment the seller as they were quick to send a replacement phone to us and very communicative on the issues.  I hope the workaround here helps others, it was utterly baffling to us.  Apple needs to get it together on the portability issues since they just released the new model and apparently this is an issue with a number of older to newer transfers, very disappointing for them to not catch this.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "deaconhound"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "iPhone showed up in like new condition.  Came with lightning cable.  In case someone else runs into the issue I did.  We use Visible which says it’s by Verizon so I assumed (incorrectly) that I could use a Verizon locked phone.  It did not work so I had to return the first phone I bought and I purchased an unlocked phone.  Everything transferred over from my old phone just fine and everything is working great.  No complaints!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "caliberbob"
    },
    {
      "helpfulVotes": 9,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 6, 2025",
      "reviewText": "I purchased this as I wanted a newer phone and this seemed a less expensive way to go. I was a refurbished iPhone 14. It came in a nice box and a charger cable, but not a charger. Not usually a problem as most people over time accumulate several them over time. It looked brand new and works fine. Unfortunately, I had assumed that refurbished meant “like new”, but apparently it also means “it was checked out, cleaned up and it works”. What it does not mean is a new battery. Mine had a battery with 84% charge capacity. In fairness, the company’s fine print indicates this so that’s on me to have overlooked that. In fairness I did get a “newer” phone just not one that was “like new” which meant like a new one, not just close. So, the iPhone is a newer one and works well, just will not hold a charge as long. If that doesn’t matter then this a good choice.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "R. C. Elder"
    },
    {
      "helpfulVotes": 11,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 21, 2025",
      "reviewText": "Quejas? ¡Ninguna! Estaba un poco nervioso por realizar esta compra ya que es la primera vez que compro algo “renovado” y que buena experiencia primeriza me he llevado. El iPhone llegó en EXCELENTE estado con la capacidad de batería al 100% y nuevo (Revisando el número de serie verifiqué que, en efecto, el celular es nuevo).Sin rasguños de ningún tipo, quizá un rayón diminuto en la pantalla que es imperceptible a primera vista a menos que lo observes cuidadosamente. La batería le dura 1 día y medio a 2 dependiendo del uso que le dé. Esperé una semana para testearlo bien y escribir una reseña correcta para que las demás personas sepan bien cual fue mi experiencia y así facilitar la compra de otros clientes. En fin, estoy satisfecho con mi compra. Gracias al vendedor por enviarme el producto rápido.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Jorge Pinzon"
    },
    {
      "helpfulVotes": 6,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 16, 2025",
      "reviewText": "I tried to save myself some money and having to renew my xfinity plan for another 24 months by buying a refurbished iPhone 14 for my son. The phone looked brand new but even though it was unlocked we spent hours on the phone with xfinity and in person trying to get it on my xfinity account.  Very frustrating.  Even called apple but no one could figure out what was wrong.  I finally gave up and bought a new iPhone 14 from xfinity.  The seller was great about issuing a refund. It actually happened very quickly.  In hindsight I wish I had just bought the new one from xfinity to start with.  I gave the seller a 5 cause I don’t think it was their fault.  I did email him twice and the answers back didn’t really help much but they were responsive with the refund.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Dave"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 6, 2025",
      "reviewText": "I got the phone about two days ago it’s working good so far no issues the battery is 85 percent which isn’t bad for a used phone the physical appearance is good so far I can say it’s working well and I have it for four days",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 11, 2025",
      "reviewText": "i had the smallest crack near my camera and top speaker but other than the the phone is perfect.i dont know if it was just me but its a little slower than a brand new phone to set up eSIM. but after some time i got the hang of it.phone works perfectly! the battery life was af 98% when i got it (4.5 months and it is now at 96%).",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Sylvia"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Phone seems to be working well, however, cosmetically it has some scratches on the corner that are viewed from further away than 12 inches. Listing says free of scratches when viewed from 12 inches.  Not a big deal, but not as advertised.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Dan"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "The phone came in great condition. No scratches or anything. Had 100% battery health and everything. My order just kept getting delayed but other than that it was great!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Dee4z"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 7, 2025",
      "reviewText": "Pretty much the most important thing about an iPhone that matters more than a camera, some scratches, and even the overall iPhone is, and will always be, the battery percentage.Mine is 88% for the excellent condition. I just hope this lasts, as I bought it for use in Peru and not the states. So, charging your phone is a whole lot less convenient when not in the US, surrounded by chargers and plugs/outlets.I will update this within a few months to see the battery life and how it will hold up.Other than that, it looks great; it even got a USB-A cable + charger box, which is a plus.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Hunter Shaw"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 10, 2025",
      "reviewText": "Good but the battery life was 83%iPhone 14 red",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "David lopez"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 28, 2025",
      "reviewText": "I have had my new iPhone 14 for three days and I love it. I had to call TracFone to get the phone set up, but they were so nice and set me up in a few minutes. My iPhone is so much easier to use than my old iPhone 6. I am so happy with this new phone because itis so easy to use.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Book Lover"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "Good",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Cool"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "I’m very pleased with the iPhone I purchased through Amazon.  It was truly unlocked.  I use prepaid service through straight talk and I was able to  simply call my phone company and have my number transferred to the phone.  Easy peasy.  And the phone looks just like it would had I went into a phone store and purchased it brand new.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Jessica Bingham"
    },
    {
      "helpfulVotes": 6,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 14, 2024",
      "reviewText": "Ordered a phone in good condition. According to Amazon there isn’t supposed to be any scratches on the screen when it is in good condition. There are 2 deep scratches and smaller scratches on the screen. Not upset about it but it doesn’t follow what Amazon says. Battery was at 100% health so It makes up for the scratches. But i am a bit disappointed in that there were scratchesBesides that the phone is in good condition, was a bit of scuff marks on the side but a case hid that. The speakers are loud, was fully unlocked and was able to switch it over to my carrier easily. Was worried when I saw reviews saying the phone wasn’t unlocked but I didn’t have that issue.Overall I’m happy with the phone, just the scratches were disappointing.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "J"
    },
    {
      "helpfulVotes": 3,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 1, 2025",
      "reviewText": "It is wayyyyy smaller that I thought looks almost like my iPhone 12 but anyways it also doesn’t have the slot to enter a SIM card but it came with a SIM card opener thing. Really makes no sense but I haven’t started using it but it’s pretty but very small",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Jessica"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 11, 2025",
      "reviewText": "Good for the most part. However, the phone was not completely wiped. My Facebook account will not transfer. The previous owner’s account will not go away.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Beth Campbell"
    },
    {
      "helpfulVotes": 13,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 12, 2024",
      "reviewText": "Phone arrived packaged nicely and included charging cube and cord.  I had to present my drivers license and sign for it when FedEx delivered it.  Some scratches on the sides, but front and back screen look new.  Very disappointed however to check the battery health and it only be at 85%.  I would have thought that an “excellent, like new” phone would’ve came with a new battery since that has always been my experience with Apple refurbished products. (I do realize this is not a certified Apple refurbished product) I purchased this as a gift for my daughter, so no time to return and get a different phone.  For the price paid, I would’ve expected a “like new” phone that has a new battery.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon customer"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 30, 2025",
      "reviewText": "Phone arrived in non-working order. That happens from time to time. But what doesn’t always happen is quality service after such an event. No issues at all, the phone was easy to return, quick turn around on the refund.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "T. Flebbe Jr."
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 25, 2025",
      "reviewText": "WORKING FINE SO FAR",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Nilsa V."
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 7, 2025",
      "reviewText": "Will update with pictures. Overall the phone is nice and works great. No scratches or chips. The battery life is at 88% which isn’t a huge deal for me I’m home a lot and have the time to keep it charged. The sides were very obviously painted. You can see it on the back and front glass. But other than a little bit of cosmetics and the battery life I would 100% recommend this!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Alyssa"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 14, 2025",
      "reviewText": "No está mal tiene algunas imperfecciones porque es de uso pero funciona bien",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Muy pequeño lo compré por las medidas de mi mesa y quedó chico"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 21, 2025",
      "reviewText": "My phone was delivered three days early and it works great! Setup and information transfer was seamless. My new phone was ready to use in 10 minutes. This is the first time I've ever bought a phone that wasn't from a cell phone service provider, and I couldn't have been more pleased with the experience. I will definitely buy from this seller again.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Sky Newton"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 14, 2024",
      "reviewText": "Ordered just the basic quality level !!Had very mixed feelings about ordering because it’s like you just gotta be one the lucky ones ones to get a good one so I rolled the dice being cheap bastered I am but I love quality at same time haha I got lucky my iPhone 14 was in mint condition only problem was battery life in settings said 82 percent I’ve had the phone nearly 3 months now that hasn’t changed it charges to 100 percent every time and last long time but it dies at 4 percent life everything else perfect and I ordered just the basic cheapest quality level !!",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Unhappy about  no cancelation policy"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "I think I got pretty much a brand new phone lol. Battery was at 100% health wise or whatever, everything’s perfect and all set up.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Landon Flemmer"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "No scratches or any issues from this seller . Product looked like new and zero wear and tear issues . Back was shining like new",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "SravanKR"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 18, 2025",
      "reviewText": "Good product",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amaizing"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on February 17, 2025",
      "reviewText": "Good condition",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Tsvet"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 1, 2025",
      "reviewText": "Llegó tal cual se ve en las imágenes. Estaba en buen estado y limpio. Lo llevo usando semanas y no me dado ni un solo problema. Sin duda lo compraría de nuevo para alguien más.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Theom"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 17, 2025",
      "reviewText": "The phone seems fine.  But the product description said I'd need to get a sim card from my provider and this phone uses eSim.  No sim tray in this phone.  Caused some confusion...",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Gloria J."
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 21, 2024",
      "reviewText": "I purchased this phone based on so many good reviews. The phone arrived quickly and cosmetically it is beautiful, no scratches, dings or dents. The phone is functional but battery life was 86% on arrival and a month later is down to 85%. I should have looked for a phone with a premium rating. Since I do not use my phone for gaming or internet and only occasional texting, it will probably be ok for me.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "just love to shop"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 7, 2025",
      "reviewText": "Excellent condition phone. Works great. Was able to transfer information easily. Battery life is much better than my last phone. Definitely recommend.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Silvia Marquez"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 2, 2025",
      "reviewText": "I'm just a regular customer.  This iPhone 14 Pro Max is what it says it is. It does what it is supposed to do. It was much less than a new phone but other than that I noticed no difference between this phone and a new one. I've upgrade from a 11 Pro to this 14 ProMax.  I'll be using this phone until it fails, or maybe somewhere around the release of iPhone 18.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kindle Customer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 27, 2025",
      "reviewText": "Phone quality is great, 87 battery health but it lasts very long",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Ashley John"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "Great phone, great price. fast delivery, excellent battery life.It’s like a brand new phone… no scratches or imperfections on the exterior case or screen.. Battery health showing 100%. I have only been using it for three or four days, but so far I could not be happier with this purchase.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "VTcollegemom"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "First time the box came completely empty but after notifying Amazon, they made things right. Great phone at a great price.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Randy"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "100% battery percentage! Very pleased and happy with my buy :)",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Jess E Lopez"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "Excellent. It was unlocked and we added it to the Xfinity plan. Great deal.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Josh and Ericka"
    },
    {
      "helpfulVotes": 16,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "At first I was expecting a phone in not so good conditions as it was “used-acceptable” I was expecting visible scratches etc. It arrived earlier than expected as well as in super good conditions. It looked and felt brand new. No visible scratches and works great. Definitely worth your money. Battery life is great as well as camera quality.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Roxy"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 10, 2025",
      "reviewText": "My son loves his new phone.  He can't put it down.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Bernadette Edwards"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 14, 2025",
      "reviewText": "phone looks great and everything transferred perfectly my only issue is the battery which is at 85 percent but other than that its good",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Samantha Kovalska"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "Nice phone for the price.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Ford"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 31, 2024",
      "reviewText": "Very nice quality on the phone there are a few scratches on the outside of the phone but nothing major. Battery health is ok it’s at 89% so not bad but could be better but for the price of this phone it is very good.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Lilah Solek"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 23, 2024",
      "reviewText": "I love the phone, it was in great condition, but not excellent as I purchased. Minor scratches not big enough to spoil the look and the battery health is what annoyed me, 87%. It wasn’t a bad buy all around",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Lori"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Phone Is So Pretty ! I Love The Color & The Phone Works Really Well & Is In Perfect Condition. Very Durable",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Aryanah Miller"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 24, 2025",
      "reviewText": "So happy with the purchase. The phone is like new and it was delivered before the expected date. I was so happy!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Zeynep Veli"
    },
    {
      "helpfulVotes": 5,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 12, 2025",
      "reviewText": "I was SUPER hesitant to buy this phone because of some of the reviews but I still bought it anyways and it actually works like new. I have no problem with it so far and there’s zero scratches. It was also very easy to set up.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "skye"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 2, 2025",
      "reviewText": "Very pleased with this ... easy to set up, works like a charm!Thank you for an excellent transaction!!  A++++",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Eric S. Fillman"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 15, 2025",
      "reviewText": "Toda la bateria, sin rayones, sin detalles. El empaque no es original ni tampoco el cargador.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Neoray"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "Came excellent condition even tho shipping took forever. No problems at all",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Bri"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "My son loved the phone thank you so much",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Crissy"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 12, 2025",
      "reviewText": "Amazing condition",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Zatricia Flores"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 13, 2025",
      "reviewText": "I’ve had this phone over six months now, and I have not had any problems with it. This one looked and worked as if it was brand new when I received it. I’m very happy with this purchase.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "crispy"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "Very pleased with phone so far. Arrived late, but that's on fedex not the seller. Anyway was as described and my daughter loves it",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Ann Dubinko"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 3, 2025",
      "reviewText": "The phone I got looks brand new and works perfect. I highly recommend it.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "tomfishhunter"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on November 27, 2024",
      "reviewText": "Phone is good. Few areas you can see where the screen was replaced and not seated all the way.  Corners of the screen are lifted a little and not flush some fix areas near the camera where the sames was smoothed and polished. Overall Good I would not rate as excellent as seller has listed and would expect it to be $50 to $100 less than what I paid. Function of phone.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "SlamDunk"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "Good Deal",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Theress"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 13, 2025",
      "reviewText": "as gift",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 2,
      "reviewDate": "Reviewed in the United States on October 6, 2024",
      "reviewText": "All of this was experienced in the span of about 24-48 hours, and due to my work, I couldn’t keep the device because of the performance issues experienced:I needed a phone quick because my last phone died. While I appreciate the quick turn around on my order and delivery, the device had issues.For starters, the refurbished one I ordered and received took a long time to set up. You couldn’t just pair it with another device to get everything transferred. If you tried this, you would see the latest update would take days to complete and the timeline never changed.I reached out to apple and they helped me get it set up, however, there were several performance issues with the device I received.Total time it took to get the phone set up: 6.5 hours.Details: Started at 4pm as soon as the device was delivered, and after seeing the update was still not completed around 9pm, I worked with Apple support to get the device finally set up around 10pm.Performance issues:The charging port was loose, so even if the device was connected to a plug in charger, it wouldn’t always charge. This also impacted connection to CarPlay when driving. The phone would be sitting in the seat beside me, plugged in, but if it moved slightly, the connection wouldn’t work and I’d have to unplug it and plug it back in. It’s not tight enough to keep a good connection.There was an issue with screen responsiveness and phantom typing. If you needed to tap or select anything closer to the edge of the screen, it wouldn’t register. At times the screen wouldn’t respond at all, or if it was face down and I picked it up, I would see it was randomly typing characters in the Home Screen search box. I would have to manually turn the screen off (side button) for it to stop.There was also an issue with the front facing camera and sensor. The camera was really fuzzy and not able to pick up anything at times. The sensor wouldn’t always correctly adjust the screen brightness over the night I had it.The physical device itself also has scratches and dents all over it. While I don’t care about cosmetic as much as the above, the phone I received was more along the lines of poor condition overall.For this seller, I think it would be a good idea to do more intensive performance testing with the phones/devices before you send them out. You should also include correct setup instructions with the devices so your customers can set them running with ease and not have to waste half a day trying to get the phone setup to work.Overall, with the issues and hassle I experienced with the device I was sent, it was more cost effective to go buy the same model in new condition for the additional $100 at a local Best Buy.",
      "reviewTitle": "2.0 out of 5 stars",
      "reviewerName": "katlyn"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "Fast delivery and good product.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 11, 2025",
      "reviewText": "Would recommend",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Makayla Long"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 14, 2025",
      "reviewText": "Excelente",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "maria"
    },
    {
      "helpfulVotes": 7,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 21, 2025",
      "reviewText": "I would 100% recommend this. Phone came early in a really good condition Battery health was 86%, sound, camera was good as well. Camera acts funny (especially front) sometimes to be completely honest but to be fair, it’s not brand new and I know that I can’t really expect it to be perfect. Overall I’d rate a 9/10 at the time of reviewing this product(I just got it). I’d post an update if I notice any issues in the future.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Alameen"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 24, 2025",
      "reviewText": "The few instructions were confusing. Mentioned the SEMs card but this phone does not use a SEMS card.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Sue Rednour"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 16, 2024",
      "reviewText": "El teléfono funciona muy bien, sin embargo he comprado en ocasiones anteriores teléfono reacondicionados y los daños estéticos suelen ir en la parte de atrás, algunas esquinas. Este tiene dos rayas en la pantalla, una pequeña y otra mediana.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Amazon Customer"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 9, 2025",
      "reviewText": "Its great it came with no scratches or damage’s charges good was easy to set up 90 percent of battery",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "William Hathaway"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 24, 2025",
      "reviewText": "It looks like it is brand new. Battery life is 100% and holds for a long time. A++++",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Steven K. Jackson"
    },
    {
      "helpfulVotes": 0,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 8, 2025",
      "reviewText": "It came like brand new cell phone",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Edward"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "Definitivamente lo volvería a comprar",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Asbel Pacheco"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 10, 2025",
      "reviewText": "The delivery was a day delayed but it arrived and the phone worked great. Transferred data without any problems.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Azalea"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 2, 2025",
      "reviewText": "I have just received my item and I love it",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Fyness Reed"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 28, 2025",
      "reviewText": "por más que sea reacondicionado funciona muy bien y tiene muy buena batería",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Juan Yebra"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "iPhone was an excellent shape and works perfect. Much appreciated.!!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kidroc"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 27, 2025",
      "reviewText": "What can I say? Is Apple phone work just like all Apple phone work it’s good.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Anthony craig"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on January 7, 2025",
      "reviewText": "I can’t tell this is a refurbished product. Looks feels an operates just like brand new.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Donn Werrbach"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 21, 2024",
      "reviewText": "El teléfono se encuentra en buenas condiciones físicas, sistémicas, con sus sistemas de audio bien hasta el momento, identificador de Face ID  en buenas estado. Bajo porcentaje de batería.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "JC"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "In perfect condition and with charger cable",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "jesus delvalle"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "Good price works good and fast shipping",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Bob Hare"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 10, 2024",
      "reviewText": "I purchased an “excellent” condition phone. I certainly wouldn’t classify it as excellent. “Good” would be a better category considering the markings on the phone. It was clearly dropped several times. The functionality of the phone is fine. It came unlocked and was easy to setup with T-Mobile.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "Dennis"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 2, 2025",
      "reviewText": "Perfect condition and came with charger!",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Maria Koutsis"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 26, 2025",
      "reviewText": "Looks great and works great.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Richard"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 9, 2025",
      "reviewText": "Perfect",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Shopper"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on March 4, 2025",
      "reviewText": "Excelente calidad precio. Super cumplidos",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Maria Moran"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 13, 2025",
      "reviewText": "Perfect. Out the box, clean IPhone 14. Powered up and connected. IEMI clean no issues activating. Pleasure to work with.",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Ramirez"
    },
    {
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 21, 2025",
      "reviewText": "I gave it to a friend who needed a phone  after being without for over a month  He was ecstatic",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "barb cwikla"
    },
    {
      "helpfulVotes": 8,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on January 16, 2025",
      "reviewText": "I was scared to buy this because yk how it be when shopping online for things especially high in value. And one thing I LOVEEEE is the fact that IT CAME THE NEXT DAY!! It said it would be delivered on Sunday, for reference I bought it on Wednesday and it came on Thursday the next MORNING!!! Omg I'm very grateful for that. Another thing, my phone came in perfect condition no scratches or defects. I'd say get it if you need a phone it's perfect and it's UNLOCKED",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Hannah"
    },
    {
      "isCritical": false,
      "rating": 3,
      "reviewDate": "Reviewed in the United States on March 5, 2025",
      "reviewText": "Phone looks and works like new. But the screen is not an original. And the replacement is not a real iPhone screen. They also wiped the info from the phone showing if it’s original parts. For the price it’s worth it but kinda shady for real.",
      "reviewTitle": "3.0 out of 5 stars",
      "reviewerName": "Chris giampietro"
    },
    {
      "isCritical": false,
      "rating": 4,
      "reviewDate": "Reviewed in the United States on December 5, 2024",
      "reviewText": "Overall the phone condition is fine, I’d give it a score of 8.5/10 looks-wise, and the phone is functional which is important. I’m surprised it came with a brand new charging cable! Thumbs up for this. We’ll see what happens within the next couple of weeks.",
      "reviewTitle": "4.0 out of 5 stars",
      "reviewerName": "JulianQ"
    },
    {
      "helpfulVotes": 2,
      "isCritical": false,
      "rating": 5,
      "reviewDate": "Reviewed in the United States on February 16, 2025",
      "reviewText": "The phone is in mint condition, touch great, battery health good and most importantly it’s unlocked! I recommend it",
      "reviewTitle": "5.0 out of 5 stars",
      "reviewerName": "Kimiesha L."
    }
  ],
  "title": "Apple iPhone 13, 128GB, Midnight - Unlocked (Renewed)"
}