{"reviews":[{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    EXCELLENT PHONE & BEYOND AMAZING SELLER/CUSTOMER SERVICE!!!","date":"Reviewed in the United States on September 18, 2024","body":"I honestly can’t say enough amazing things about my experience buying a renewed iPhone 11 from this seller and dealing with their customer service! I would 1000/10 recommend anyone and everyone even considering purchasing a phone from them to absolutely do so because you won’t be disappointed!!! But read below for the full story/review, both good and bad opinions.My oldest daughter dropped her iPhone XR in the toilet and it completely died. This seller had the best priced renewed iPhone I found with next day delivery and good reviews, so I purchased the phone. It was my first time buying a phone that wasn’t brand new, so I was nervous about what condition the phone and battery would be in.The phone was sent via UPS, which I didn’t love because they left the package at the gate on the street instead of driving into our ranch and delivering it to our house in the back corner like Amazon and USPS do. Not to mention it was supposed to be here between by like 1:45 or 2:45 and they didn’t deliver it until 10pm! But that’s an issue with UPS, not the seller.When we opened the package I was pleased to see that there were very minimal dents or scuff marks on the phone and it appeared to be in really good condition. One thing I wasn’t pleased with was the fact that the phone arrived dead. I worried that meant the battery wasn’t great, but I was wrong. After charging for a bit I checked the battery health and it was 100%, so they clearly installed a brand new battery! I was really happy with my purchase, but upon setting up the phone I noticed there was this awful high pitched screech/glitching sound coming from the speaker, so I reached out to the seller to try and get a replacement sent instead of going thru the hassle and delay of returning it and having to order a new one once the refund posted.The seller responded almost immediately (they did so every single time we communicated over the course of a week, even when I reached out at almost 8pm their time!) and offered to send me the shipping label and then they’d overnight a replacement to me once they received the phone. I asked them if I could pay to overnight the phone to them so there wouldn’t be as long of a wait without a phone, and they said they would do me one better and as soon as I took the phone to the post office to send them a copy of my receipt and they’d overnight me the replacement then! This took place on a Friday and I didn’t want the shipping delay the weekend would cause, so I told them I’d reach out Monday for the shipping label and that I had out a brand new screen protector on the phone when I got it so I’d be sending it back with it on.Life got hectic and I didn’t reach out until Thursday afternoon, but they quickly sent me the shipping label. When trying to wipe the phone there was an hour delay because stolen phone protection was on, so I missed making it to the post office by like 6 mins and had to go Friday morning instead.I went to the post office and all was well until I mentioned that there was a phone in the package when I asked them for extra tape, and she said they couldn’t ship a used phone via priority mail (only new never used phones) so I needed to have them send me a hazardous shipping label instead. When I told the seller they offered to send me a new label, but I chose to try another post office first and just not mention the contents of the package because the battery WAS brand new, and I didn’t want to go thru the hassle of sending the label somewhere to be printed since I don’t have a printer, going there and paying to have it printed, and then going back to the post office. I took it to another post office nearby and had zero issues sending it.When I got back to the car I sent them a copy of the receipt, and true to their word within only like 5-10 minutes they had already send me the tracking information for the replacement shipment and let me know they put a screen protector on the new phone for me! Of course there were issues with UPS again including a delay that showed it wasn’t going to come until Monday, but thankfully it arrived on Saturday like it was supposed to, and fairly early (10-11am).When I opened the replacement package and inspected the phone I was SHOCKED! I thought the first phone was is great condition, but this one looked BRAND NEW! There wasn’t a single scratch or dent or scuff or any abnormality on the exterior of the phone! It’s also worth noting that the phone wasn't dead this time, it was midway charged. I checked the battery health again and it was also 100%! I tested out the speaker and there were no issues with the phone whatsoever. Honestly if you put it side by side with a brand new phone nobody could tell the difference, and it was a fraction of the cost of a new phone!I also reached out to the seller a few days later for a friend of mine to see if they also sold Androids and they were super helpful in getting me the info I was looking for!Between the phenomenal condition of the phone and the excellent customer service, I won't buy a renewed phone from anyone else in the future when one of my daughters inevitably break their phone! This was honestly the best experience I've ever had with a seller/replacement item on Amazon in the 15+ years I've used the site!","helpfulVotes":88},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s was good for the price","date":"Reviewed in the United States on February 19, 2025","body":"I recently had the iPhone 11, from games to apps. The dual-camera system took amazing photos, even in low light.The purple color was a highlight. It was a subtle, elegant shade that looked stylish without being too flashy. The glossy finish on the glass back added a premium feel.Battery life was impressive, lasting all day with heavy use. The iOS interface was user-friendly and regularly updated. Overall, the iPhone 11 in purple was a great choice for performance, camera quality, and design. Highly recommended!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition/ looks brand new!","date":"Reviewed in the United States on February 12, 2025","body":"The phone is perfect. I ordered it in refurbished excellent condition. The battery health is at 100% and there is not a single scratch or dent on the phone. It looks as if it is brand new out of the box.  It was very easy to set up. I have already used it for texting and phone calls and no issues with speaker or keyboard. Very user friendly and I highly recommend. You can’t beat the price. I bought it in pastel purple.","helpfulVotes":5},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone, decent price","date":"Reviewed in the United States on January 22, 2025","body":"I needed a new unlocked iPhone for my wife, since her 6 plus cannot run on any recent IOS iterations and is getting dropped by our mobile carrier.  Sooo, a used 11 seemed a logical choice, since her needs are minimal.  I have one as well and love it (no plans to upgrade).After hunting around for about a week, I finally committed.  The phone arrived early and properly packaged.  There were some scratches on the edges, but only one of note.  It even had a (perfect) screen protector.  It was unlocked, easy to set up, and seems to run flawlessly.  The battery reserve so far is okay, although iPhone Settings claim it is an aftermarket replacement, and cannot tell me anything about battery health.  Battery issues ae commonly reported with used phones, but mine seems fine.A couple of minor issues.  While the edge scratches were not functional, they were borderline for condition rated as \"excellent.\"  Also, when ordering, play the extra $5 for FedEx or UPS delivery.  Ours came USPS and arrived unexpected early.  It was left on the top of our mailbox, but I was able to get it before heading off for a short trip.To sum up, this was a good phone at a decent price (about$225 with 128 GB memory).  When my phone needs replacement, I would go with this seller again, but would not buy anything rated less than \"excellent condition\".","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    11/10","date":"Reviewed in the United States on March 11, 2025","body":"Soooo perfect and pretty it’s like brand new. I was scared to get it cause this is my first time ordering a phone from here but trust me it’s beyond my expectations. No scratches, speaker sounds great, not glitchy or slow (which i was scared about), the camera is perfect, and i’m so happy with this purchase, like it’s so worth the money. Trust the reviews it’s a really nice phone you won’t be disappointed!!!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!","date":"Reviewed in the United States on March 4, 2025","body":"Works well even after I have had it for almost 2 years. I will say when I bought it the battery health was not 100% so seems the battery was not replaced. But still holds a charge and has a pretty good battery life for an older phone. And love the color"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely worth it!","date":"Reviewed in the United States on February 10, 2025","body":"This phone is awesome was a little nervous at first buying this because i had never bought a unlocked phone before but i needed to since I have been needing an upgrade from the iPhone 7 i have and I haven’t put service on this new phone yet but all the other features work great and battery compacity was 80% as they said so and phone is in great condition they even shipped it here hella fast would buy from them again!!","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone, Still Going Strong!","date":"Reviewed in the United States on February 11, 2025","body":"I bought this iPhone 11 on Amazon in 2023 at 85% battery health, and I still have it. It works well, and I haven’t had any major issues. The performance is solid, the camera is good, and it handles daily tasks smoothly. Battery life has held up decently, though it has naturally degraded a bit over time. Overall, a reliable phone and a good purchase!","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so great, thank you.","date":"Reviewed in the United States on March 2, 2025","body":"So far so great, I’ve been using this phone from Dec  2024 to present….the battery health came at 81% wasn’t good but it was a win because I purchased a iPhone 11 Pro Max with 95% that died 12 days in and I had a bad experience with another company and it was hell to return but eventually I got my refund. This seller shipped within 24 hours and it arrived within 48 hrs. I did my research and found the iPhone 11 is one of the most affordable and reliable 11 models so I took a chance and got  it over the iPhone XR because I really needed a phone that was higher than my iPhone 6 Plus that I had for 6 years. It came brand new, no scratches. Thank you. You should definitely get it.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen came cracked","date":"Reviewed in the United States on February 10, 2025","body":"I was very skeptical about buying this product, especially off of Amazon since I wouldn’t be able to check it in a real time before purchasing it, but I scanned through the reviews to see what everyone else was saying before purchasing it and I have to say I am pleasantly surprised the device looks almost brand new the back is free of scratches. The camera is free of scratches as well but there’s a single scratch on the screen which is kinda hard to see.The battery capacity is at 100% which I was only expecting it to be about 95% . I would definitely recommend anyone to purchase.Edit: the product is good but I noticed a crack on the screen today and decided to process a return everything else is great though"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good product, worked better than expected.","date":"Reviewed in the United States on March 5, 2025","body":"Great product, I will not give the 5 stars due to the battery length, but nothing as a consequence of the normal usage, considering that is a refurbished product.I will by again with this supplier, no doubt about it."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good !","date":"Reviewed in the United States on March 6, 2025","body":"Works great, had it for about 5/6 months, it came with 75% battery health and now it’s 72%Phone works as it should, great, feels great, I think it’s worth the money and it looked great."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    10/10 Recommend","date":"Reviewed in the United States on March 6, 2025","body":"Good phone for it to be renewed. 10/10 recommend. Comes as described. Only thing i think needs to he better, is the chargers. They aren’t original iPhone chargers. But i love everything else."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple iPhone 11 Review: A Reliable Backup That Feels Like New","date":"Reviewed in the United States on February 20, 2024","body":"Update:  I'm back with an update on our journey with the iPhone 11, and let me tell you, it's been quite the rollercoaster. Initially, I bought one for my daughter from a different seller, and it was, to put it mildly, a bit of a disaster. We had issues left and right – Face ID not working, the phone overheating – you name it. So, we returned it, feeling a bit skeptical about the whole refurbished scene.But here's where the plot twists: we decided to give it another go, this time purchasing from the Amazon resellers store, specifically from a shop called Hybrid IT. And oh boy, what a difference! The iPhone we received this time around was nothing short of impeccable. It arrived with all the essentials – a charger, a charging cable, and even a SIM card tool, all neatly packed. The phone itself? It could've fooled me for brand new.This experience really hammered home the lesson that when it comes to refurbished goods, the \"who\" is just as crucial as the \"what.\" The quality and condition of the product can vary wildly depending on the seller. Hybrid IT sent out an excellent product that exceeded our expectations in every way.For those of you wary about diving into the world of refurbished electronics, let this be a testament. With the right seller, you can get your hands on a device that feels brand new, without the hefty price tag. We're over the moon with our iPhone 11, and I'll be sure to keep you all posted if anything changes. But for now, it seems like we've struck gold.--------------------I recently found myself in need of a quick replacement after my daughter accidentally broke her phone. The Apple iPhone 11, 64GB in black, seemed like a promising choice, primarily because we needed something that could be set up swiftly and would perform seamlessly as a backup.Out of the box, the iPhone 11 felt like a brand-new device despite being a model released a few years back. The sleek black finish and the familiar design immediately caught my eye, reassuring me that this choice would not disappoint.Setting up the iPhone 11 was mostly straightforward, especially with the unlocked version making it easy to switch from the old device. The transfer of data and settings from the previous iPhone was seamless, thanks to Apple's ecosystem. However, we hit a slight snag with the Face ID setup - it took a bit longer than expected to get it working properly. Despite this hiccup, once configured, Face ID has been working flawlessly.The iPhone 11's performance has been impressive. The touch screen is responsive, making navigation and typing a breeze. Wi-Fi connectivity is fast, ensuring that browsing and app downloads are efficient. Although it's not the latest model, it handles everyday tasks with ease, from streaming video content to gaming, without any noticeable lag.The main issue we encountered was the initial difficulty in setting up Face ID. It required a few attempts to configure, which was a minor inconvenience in an otherwise smooth setup process. After overcoming this challenge, the phone has been working perfectly.Overall, this refurbished Apple iPhone 11 has proven to be a reliable and efficient backup phone. Its ease of setup, fast Wi-Fi, and responsive touch screen make it feel like a new device. The hiccup with Face ID setup was a small obstacle that, once overcome, didn't detract from the overall positive experience. I would recommend the iPhone 11 to anyone in need of a quick replacement or a dependable backup device","helpfulVotes":139},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple iPhone 11 – \"Smooth Performance, But Battery Life Could Be Better\"","date":"Reviewed in the United States on January 30, 2025","body":"I’ve been using the iPhone 11 for a while now, and overall, I’m really happy with it. The performance is smooth, and the camera quality is excellent for taking photos and videos. I’ve also found the face recognition feature to be really convenient. However, I’ve noticed that the battery life isn’t as long-lasting as I hoped. I have to charge it halfway through the day if I’m using it a lot. Still, it’s a great phone for those looking for a reliable iPhone without breaking the bank.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Need a new phone for a good price","date":"Reviewed in the United States on January 30, 2025","body":"This phone is almost excellent it has a good battery life, good screen touch response, and everything else seems to be in good condition except the speakers the left speaker doesn’t seem to produce any sound only the right speaker does which is kinda annoying the phone itself also seems to heat up slowly but surely, it’s still a great purchase I just think everything should be tested to its fullest capability especially if a person orders “excellent” but overall I’d give this a 8.5"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I phone 11 refurbished excellent condition","date":"Reviewed in the United States on December 29, 2024","body":"I bought this I phone 11 through this seller. I would have givin it 5 stars because the phone is like brand new not a scratch or anything on it, it is flawless and it works. But the shipping was so late I was suppose to get it Monday before Christmas and I even paid extra to make sure it was and I’m just now recieving it today a week past the day it was suppose to be here. But other than that the phone is awesome my son loves it and like I said it’s a brand new phone. Will more and likely be buying through this seller again in the future if I need a new I phone.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Product review","date":"Reviewed in the United States on March 10, 2025","body":"I ordered a green 128gb but received a purple 256gb. Does not bother me, I only got it for my square app for my small business. I still use my old iphone 7 which is in excellent condition."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Goodish condition","date":"Reviewed in the United States on February 26, 2025","body":"I understand that good used means minor scratches but definitely DOES NOT mean cracked…"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    4 out of 5 stars","date":"Reviewed in the United States on January 23, 2025","body":"The phone arrived in excellent condition! However, when I turned it on there was a red dot on the dark screen. It kinda bothers me but when the phone is on it doesnt show. The phone works well. Functions just normal. I have no issue with it. Battery life is excellent. I bought this phone for work so, its pretty great! Thank you!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Low Cost, Good Quality, High Performance and Budget-Friendly","date":"Reviewed in the United States on January 30, 2025","body":"I was looking for a budget-friendly iPhone for my 15 year old niece and decided on the iPhone 11 because of the great reviews.I must say I was a bit skeptical at first, but boy am I happy I gave in and made this purchase. My niece was extremely happy. It was indeed a win-win situation. The product didn't break my bank and my niece is happy and extremely satisfied with the performance of the phone.The item was a gift for my niece, so unfortunately, I do not have a photo of the device."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Looks like new!","date":"Reviewed in the United States on March 4, 2025","body":"Wow, YMMV, however, I was very pleasantly surprised at the quality of phone I received. The phone was in great shape, no scratches, looked new, battery life has been great in the month I've had it."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone, but refurbished with after market display","date":"Reviewed in the United States on February 8, 2025","body":"Great phone, works fine, but still has FireWire instead of USB C, and an after market display which is not an Apple product."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished iphone","date":"Reviewed in the United States on March 15, 2025","body":"Phone gets hot after a few minutes use. Works but can’t use it long cause it gets hot"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 11","date":"Reviewed in the United States on January 16, 2025","body":"Ordered the yellow iPhone 11 for my mom who is currently still using the 8+ with a broken screen.  The shipping was extremely fast. When I hear or read the word “refurbished” I assume “fixed up”, in this case it only seems to have been factory reset. The phone wasn’t cleaned before sent or anything. There is gunk along the sides where the previous owner would have used a case and things got trapped inside and stuck to the phone. It’s also around the charging port. The screen came with the clear plastic as if it were a new screen but there is some scratches (understandable) . The cosmetic blemishes are very minor and for the price, I think it was a great purchase for the price! For a used phone, I would consider the condition great.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good purchase","date":"Reviewed in the United States on March 8, 2025","body":"My first iPhone. Functions well, really durable, the screen size was ok and it was easy to set up. Was a good purchase."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone as described","date":"Reviewed in the United States on October 25, 2024","body":"EDIT: Our daughter was given the phone a few days ago and it has been working great! There is one spot on the right side of the screen that is lighter than anywhere else. The only thing I can think of that would be causing it is something underneath is pressing up against the back side of a recently replaced screen. It's there regardless of what is showing on the screen. All colors and any image and you can still see a small white area that never gets color and then fades into the normal looking screen. It's so small, it's almost unnoticeable. I only put it in the review in case it is indeed something behind the screen and eventually causes issues. Currently, I am happy with the phone. Our daughter loves it and it appears to function perfectly!Original Review: So far the phone is great! There doesn't appear to be any cosmetic issues at all. The phone turned on, loaded up and accepted my daughter's account login. Battery health is perfect, storage capacity is correct for my order. We won't actually be giving it to our daughter till her birthday in a couple weeks but preliminary inspection went well. Will update the review once we start actually using it but I am happy with the phone so farIMPORTANT INFO FOR CUSTOMERS: This review is specific to the seller that was assigned to me and DOES NOT represent the product you will be buying. The \"renew\" program compiles every review from every seller and shows it on this one page. Do not make the mistake I made. Reading all these reviews does not represent the product you will receive. The seller you get your product from may not have a single review in this ad. I got lucky, most don't. Do not use these reviews to help in your decision to purchase.","helpfulVotes":5},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good purchase","date":"Reviewed in the United States on February 7, 2025","body":"It’s a great phone the battery eventually started to die but it’s a great size"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    To large for me","date":"Reviewed in the United States on February 12, 2025","body":"Returned.  To large for my hand"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .","date":"Reviewed in the United States on February 25, 2025","body":"It’s a good phone the quality is amazing. The volume works. The sound works, came with no cracks only problem was the charger it came with didn’t work so I had to use my old one"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good service","date":"Reviewed in the United States on March 13, 2025","body":"Everything is as it should be ! , I’m super excited about it ."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone","date":"Reviewed in the United States on February 14, 2025","body":"I am very happy with this purchase and the phone has been working well. It is a good value for the money. It is just the right size and it takes great pictures. Friends of mine thought the pictures were of postcard quality. I highly recommend this item if you are in need."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone 11 de 128 gb","date":"Reviewed in the United States on March 9, 2025","body":"El teléfono está en buen estado , tiene sus marcas pero está muy bien , una buena compra","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent","date":"Reviewed in the United States on March 12, 2025","body":"TALKTEKVery good seller, physical and internal condition and function is excellent!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s great to use","date":"Reviewed in the United States on February 10, 2025","body":"It is in great condition!!! I love it"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice, not scam guys i love it.","date":"Reviewed in the United States on March 3, 2025","body":"Acceptable but the phone still working all good and looking good though likes 95% new battery is 85% but it's really nice for this price."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Title: Excellent Purchase - iPhone 11 in Great Condition!","date":"Reviewed in the United States on February 4, 2025","body":"I recently purchased an iPhone 11 from Amazon, and I couldn't be more satisfied! The phone arrived in pristine condition, exactly as described. It looked brand new, with no scratches or dents, and it has been performing flawlessly since I started using it. The shipping was prompt, and the packaging was secure, ensuring the phone arrived safely. I highly recommend buying from this seller if you're looking for a reliable and quality smartphone!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost prefect phone","date":"Reviewed in the United States on January 16, 2025","body":"I had a iPhone 11 once before but in purple and I loved that phone. This was my first phone I’ve ever bought off Amazon and I was a bit skeptical and nervous. I was afraid that my phone would be cracked or the battery health would be low but everything was great. No scratches or cracks, battery health came at 90%, camera quality is good too. Only thing that I don’t like are that the buttons are a bit hard to push sometimes but it’s not the worst thing. When I pulled it out of the box and unwrapped it, even my parents had told me they’re thinking about getting one too. Overall, great purchase.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This seller is trustworthy","date":"Reviewed in the United States on March 15, 2025","body":"Had my phone for 5 years now no problems"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is great! Shipping & setup frustrating","date":"Reviewed in the United States on October 18, 2023","body":"The renewed iPhone 11 itself is in great condition. Battery health is at 91% and came with a screen protector. It’s been 2 weeks since setup completed and so far the phone is functioning as if it is new.[Edited to add:  After 1 month, the screen protector cracked twice. It has protected the main screen, but it is not that durable itself. The screen protector on my old phone went a year without cracking.]My issues are with 1) shipping and 2) setup.1) Shipping:  Amazon said it would arrive on a specific date (3 days from time of order) and would require signature. Well, it was delivered a day early and left at the gate (that is always open), not at my house/door, and no one signed for it. The issue is that the gate is next to a public park, not secure at all and gets a fair amount of foot traffic. We had no idea they delivered it a day early and  anyone could have walked by and taken it. Normally we’d be excited about packages arriving a day early, but this was a high $ item, left in a public area. Thankfully my husband left the house to run an errand and saw it by the gate. Unknown how long it was sitting there.2) Setup took nearly 2 weeks and at least 15 times restating the setup process. It would get a little further in the process each time, then an issue would arise or would lock up and would require to start over again. Our rural town does not have high speed internet so went into town to use Starbucks WiFi & it was not enough to do what was needed. Ended up at a friend’s house but after 2 hrs I had to leave for appointments & errands. First issue, before I could do anything, the new iPhone requires an iOS update. It took 2 hrs to update the iOS on this new phone. Then it got stuck installing it, so had to install/uninstall it 4 separate times. Ended up going on a pre planned trip to see family in a big city and the internet at their house was like night and day. I was able to do the entire setup that weekend, but still had issues & had to call Apple for help. The whole set up process was soooo frustrating, infuriating, and disappointing that it took so long and was not as easy as they make it out to be. & Im good at troubleshooting electronic issues and researching resolutions. One thing I noticed is much of the troubleshooting advice online was outdated, even on the apple help website. Hope others have an easier time with setup.","helpfulVotes":56},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy it","date":"Reviewed in the United States on March 13, 2025","body":"Very nice. Looks brand new and works perfectly"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good iPhone Affordable Cost","date":"Reviewed in the United States on January 22, 2025","body":"We needed an iPhone for my wife since her SE old phone started having a problem with the second battery. This 11 version renewed made sense price wise since she use the phone only when she goes shopping alone so we can keep in touch. Transferring her apple account to the new phone was done quick and moving the SIM from the old phone to the 11 secured her connection with Mint Mobile provider. No glitches at all in the process. I am very happy and satisfied with the purchase."},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Hmmmmm","date":"Reviewed in the United States on March 7, 2025","body":"I have mixed reactions. I received it yesterday. The phone looks great, no scratches. But the touch screen is sort of glitching. It will not let me press anything when the phone is laying flat on a surface. It needs to be tilted up some to be able to click on anything. Even a youtube video running with no delay, wont let me click to skip an ad. I have to always pick up the phone or it ignores me pressing. Also when texting, the letters on the right side of the screen need to be pressed 5-6 times to work. Not sure what to do since I already transf all my stuff to it.  ;/"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Still working","date":"Reviewed in the United States on March 5, 2025","body":"Refurbished, came with protective screen cover, I would say excellent condition, most definitely worth the money. Would purchase again."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!","date":"Reviewed in the United States on February 13, 2025","body":"I was so nervous but read the reviews and I purchased. The battery health was 99% maxed out, there’s not a scratch or ding on it. Besides the fact it arrived dead, it works fantastic! Set up was easy and everything works as it should. Totally worth it"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works well","date":"Reviewed in the United States on January 24, 2025","body":"Nice buy, 92% battery life. Only issue I ordered a black but received a yellow"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice","date":"Reviewed in the United States on January 26, 2025","body":"It was worth it, battery came at 89% health"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    FROM AOP3D: **A Stellar Companion: Apple iPhone 11 Unlocked (64GB, Black)**","date":"Reviewed in the United States on April 14, 2024","body":"⭐️⭐️⭐️⭐️⭐️If you're in the market for a smartphone that seamlessly marries cutting-edge technology with sleek design, look no further than the Apple iPhone 11. As a devoted Apple enthusiast, I recently upgraded to this model, and I must say, it's exceeded my already high expectations.Let's start with the design. The iPhone 11 boasts a stunning 6.1-inch Liquid Retina HD display that truly brings everything to life, from vibrant photos to immersive gaming experiences. The build quality is impeccable, with a robust aerospace-grade aluminum and glass construction that feels premium in the hand. The matte finish on the back not only looks sophisticated but also minimizes fingerprints, which is a practical touch.Performance-wise, the iPhone 11 is a powerhouse. The A13 Bionic chip ensures lightning-fast responsiveness, whether you're multitasking between apps, editing videos on the go, or playing graphics-intensive games. This phone handles it all effortlessly. Plus, with iOS, you get the smoothest, most intuitive user experience in the smartphone world. Updates are timely, and the ecosystem seamlessly integrates with other Apple devices if you're part of the ecosystem.Now, let's talk about the camera setup—a standout feature of the iPhone 11. The dual-camera system (12MP Ultra Wide and Wide cameras) captures stunning photos with impressive detail and color accuracy. Night mode is a game-changer, allowing you to take beautifully illuminated shots even in low-light conditions. The ability to shoot 4K videos at 60fps with extended dynamic range further showcases the iPhone 11's imaging prowess.Battery life has been another pleasant surprise. The iPhone 11 easily lasts me through a full day of heavy use, thanks to optimizations in hardware and software. Fast charging support means I can quickly top up when needed, which is incredibly convenient.As for connectivity, having the iPhone 11 unlocked gives me the flexibility to switch between carriers without any hassle. It supports 4G LTE and the latest Wi-Fi standards, ensuring a stable and speedy connection wherever I go.In terms of value, the iPhone 11 hits the sweet spot. It offers flagship-level performance and features without the premium price tag of the Pro models. The 64GB storage variant provides ample space for apps, photos, and videos, but you can always opt for higher capacities if needed.In conclusion, the Apple iPhone 11 is a triumph of design, performance, and value. Whether you're an Apple aficionado or simply looking for a top-tier smartphone experience, this device delivers on all fronts. It's reliable, versatile, and beautifully crafted—a true testament to Apple's commitment to innovation. I wholeheartedly recommend the iPhone 11 to anyone seeking a dependable and feature-rich mobile companion.","helpfulVotes":46},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Screen wasn’t original","date":"Reviewed in the United States on January 13, 2025","body":"Phone screen wasn’t original and it s not so good in touch responsiveness. Everything else is as expected"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s really a good deal","date":"Reviewed in the United States on March 6, 2025","body":"So far it’s a great phone an great price"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value for money","date":"Reviewed in the United States on February 24, 2025","body":"Ok totally worth it, had it for months and no issues so far, battery percentage was 74% so I can’t complain, would recommend"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Purple iPhone 11~","date":"Reviewed in the United States on June 2, 2024","body":"I ordered this phone and received it in less than 4 days. I chose the “excellent” condition out of all the renewed options. It is a lot bigger than I expected, but then again, I didn’t check the dimensions before I ordered it. The phone was packaged in a single bubble wrap sleeve. The box it came in contained a wall adapter and charging cable. The phone is almost flawless except for some scuff marks around the charging port. There are also some scuff marks around the volume up button.I like that the color of the iPhone is a muted lavender color rather than a vibrant purple. The phone came with a screen protector already installed. I didn’t realize this until hours later while I was setting up the phone. The battery health is set at 90%, and this was written on the bubble wrap sleeve.The one thing I will say about this phone is that it does lack a working left speaker on the bottom. The other reviews all seem to mention the speaker problem, and I hate to agree. It’s not a dealbreaker, but I do wish the audio was up to par with the “excellent” condition the phone is supposed to be in.By the way, this phone was sold to me by Electronic Deals. They seem to have a slightly above average reputation. I love the fact it has 128gb of storage. I upgraded from a refurbished iPhone 7, and I think I made a good decision! I like my new phone. I just need to get used to not having a home button lol.","helpfulVotes":11},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely not in excellent condition.","date":"Reviewed in the United States on December 4, 2024","body":"The phone was wrapped on to a piece of cardboard on the box for shipping. The screen face has two very noticeable circles on it from where the phone had been stacked on top of each other in storage and the other phone cameras scratched the screen. It did not come with a box, instructions, or a charging cord. It does work well we so I think a very good condition is the right description.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best iPhone ever","date":"Reviewed in the United States on February 27, 2025","body":"Great product , battery live is incredible .. best purchase I’ve made you won’t regret it"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works as it should","date":"Reviewed in the United States on March 10, 2025","body":"Nice phone"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love it","date":"Reviewed in the United States on February 25, 2025","body":"It worked very well. I’ve been using it for one month and it haven’t given me no issue."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good iPhone","date":"Reviewed in the United States on February 22, 2025","body":"This is my first iPhone and I love it. The battery capacity is 100%.it’s brand new.moves smoothly and overall amazing.a amazing choice for a cheaper phone."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    4 months later and phone is acting up","date":"Reviewed in the United States on November 23, 2024","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    I’ve had pretty good luck buying used phones, so far this phone was no exception. Not a scratch on the screen and battery life is 94%. No complaintsUpdate: Almost 4 months later and phone has ghost screen, meaning the phone has a mind of its own, currently I can not hit the letter “I“ when typing. O use to be able to shut phone off and turn back on and It would fix it but now it won’t. There seems to be something wrong with the screen and after researching it symptoms appear to be water damage related. Will lower product rating if customer service doesn’t make it right."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPHONE","date":"Reviewed in the United States on January 30, 2025","body":"I bought this for my daughter because prices of iphones are too high in price and I have to say it's a great phone that came with a screen protector and battery life is at 100% amazing the only bad thing about is that my daughter complains that the phone over heats too much but overall it's an amazing phone."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100% battery","date":"Reviewed in the United States on February 24, 2025","body":"Amazing especially for the price and it being refurbished 100% battery no scratches or dents😩🫶"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bello teléfono.","date":"Reviewed in the United States on February 23, 2025","body":"Nos llegó en perfecto estado, tal cual lo ofrecieron, los detalles físicos fueron muy mínimos. Lo recomiendo."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno","date":"Reviewed in the United States on March 8, 2025","body":"Salió muy bueno"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product","date":"Reviewed in the United States on February 15, 2025","body":"My phone came with 0 problems! No scratches that I can find and it works great! Had trouble with FedEx getting it to me, but the product itself is great."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mint green","date":"Reviewed in the United States on March 7, 2025","body":"Phone works great"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth the amount","date":"Reviewed in the United States on February 28, 2025","body":"Good purchase, no faults or issues and it works just fine."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery doesn’t seem to work, right","date":"Reviewed in the United States on January 14, 2025","body":"Good price, good Phone it looks newBut the battery doesn’t always charge"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I'm content with it.","date":"Reviewed in the United States on November 14, 2024","body":"I received this iphone yesterday and I was expecting it to be in excellent condition. What I got instead was a scratched screen and more scratches on the back and top of the phone. I also got a battery health of 73% which was disappointing. I got a replacement battery costing me $100.  Now it works like brand new and I used a case and screen protector to cover the imperfections. I'm impressed with the performance and camera. I should have picked good condition instead but it's a risk taken when buying these renewed phones.","helpfulVotes":10},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works exactly like it should. Clear microphone.","date":"Reviewed in the United States on March 9, 2025","body":"Love it!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It Wasn't Damaged....","date":"Reviewed in the United States on March 4, 2025","body":"Delivered Was Great....💯💯💪🏾💪🏾👌🏾👌🏾"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    😕","date":"Reviewed in the United States on December 30, 2024","body":"Phone been working fine when I first got it realized that it couldn’t detect the battery and for some reason when o make a call it automatically goes to speaker phone"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s pretty good phone","date":"Reviewed in the United States on December 21, 2024","body":"Its a good phone it just came with a ton of scratches but overAll it’s a good phone it did come smaller than I thought but that’s ok perfect phoneSolid 4/5"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    would never know it was used!","date":"Reviewed in the United States on July 29, 2024","body":"I recently purchased the iPhone 11 256GB Renewed, and overall, I’m quite satisfied with my purchase. Here are my thoughts:Pros:Great Value: For a renewed phone, it offers excellent value. The price is significantly lower than a brand-new model, yet it performs almost as well.Battery Health: The battery health was at 90% when I received it, which is impressive for a renewed device.Camera Quality: The camera is fantastic, capturing clear and vibrant photos. It’s perfect for everyday photography.Storage Capacity: With 256GB of storage, I have plenty of space for apps, photos, and videos without worrying about running out of space.Cons:Minor Scratches: There were a few minor scratches on the back, but nothing too noticeable or affecting functionality.Accessories: The phone came with a generic charger and cable, which work fine but aren’t as high-quality as the original Apple accessories.Echo Issue: Occasionally, there’s a slight echo during calls, but it’s not a deal-breaker for me.Overall: If you’re looking for a budget-friendly iPhone with ample storage and great performance, the iPhone 11 256GB Renewed is a solid choice. Just be prepared for a few minor imperfections that come with a renewed product.","helpfulVotes":51},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality","date":"Reviewed in the United States on February 22, 2025","body":"Love it my daughter go crazy when I surprise her.love it"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good","date":"Reviewed in the United States on December 26, 2024","body":"I bought this for my daughter and after two weeks the volume start act up sometimes it’s not reading the SIM card sigh just a lot of problems"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    🫶🏾🫶🏾🫶🏾💯♥️","date":"Reviewed in the United States on March 5, 2025","body":"Satisfied customer"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent quality phone","date":"Reviewed in the United States on November 24, 2024","body":"Mint green color as described, usually when I get a new phone there is at least some charge to it and there was no charge at all. No scratches at all. Charger is an off brand one but still works well. Screen protector was off center a little bit. Was easy to set up once it had it’s charge"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product","date":"Reviewed in the United States on February 16, 2025","body":"Phone functionality is great , battery life  is good even tho is refurbished. I didn’t waste any money buying this product."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 11","date":"Reviewed in the United States on February 28, 2025","body":"I love this phone!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    My new IPhone","date":"Reviewed in the United States on February 22, 2025","body":"I have always used Android devices, but this IPhone 11 is awesome!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality","date":"Reviewed in the United States on March 2, 2025","body":"I love it"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Power button and screen","date":"Reviewed in the United States on December 17, 2024","body":"The product is excellent as new, only the power button is hard and the screen is not original, it has 83 BH"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worth it!!!","date":"Reviewed in the United States on December 18, 2024","body":"I was very skeptical before purchasing an iPhone through Apple… But I am so glad that I did. Received a wonderful product in the mail safely. It works perfectly! I don’t think I will ever be buying a brand new iPhone ever again… I would recommend this to anyone who’s in need of a phone but doesn’t want to spend the big bucks! I’ll be purchasing another for a family members after my first experience!Only thought I have is if you do a video call for 30 mins or longer, the back of the phone gets very hot to the touch but that’s it. It cools down immediately after the call is done. Doesn’t get hot when it charges and tbh it’s not a deal breaker for me (yet)"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone review","date":"Reviewed in the United States on October 22, 2024","body":"its a good phone but it does get hot fast & the phone came with several permanent scratches in the screen but i put a screen protector over it so you cant see unless theres no screen protector. everything else was fine and the battery life is good for a few days but afterwards it starts to die fast . the weight is good not heavy at all . it connects to everything fine and works good also. it just gets really hot so i have to let it sit for a while .","helpfulVotes":10},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is like new","date":"Reviewed in the United States on November 24, 2024","body":"The phone itself came in great condition, not properly protected with bubble wrap, but the phone is great not a scratch! The charger isn’t apple though and doesn’t work at all even though it says it’s a fast charger. Thank god I had some from my old iPhone still😂","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Value, battery never gets above 80%","date":"Reviewed in the United States on December 27, 2024","body":"Looks new performs well but the battery only charges to about 80%."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice phone!","date":"Reviewed in the United States on February 8, 2025","body":"This phone looks really good and seems to be working well!"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its okay","date":"Reviewed in the United States on January 26, 2025","body":"I ordered this and although i knew it was renewed i guess i was hoping it would be better than it was. It turns on and the screen seems to work when you touch it but i thought it was odd that there was already a screen protector on the phone. I took the screen protector off and there are scratches in the right hand corner ish of the screen. It doesnt seem to affect the function of it but it is disappointing. I bought this for my brother for his birthday and i doubt he will care as long as it works."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    0","date":"Reviewed in the United States on February 16, 2025","body":"Perfect phone .. It’s a normal iphone 11. It helped me whenI broke my old phone","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Instructions please","date":"Reviewed in the United States on December 28, 2024","body":"Did not receive any instructions"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING","date":"Reviewed in the United States on January 30, 2025","body":"i ordered it excellent and it came perfect with no starches or anythinggg and also had 95% battery health, this is AMAZINGGG"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPhone 11 (Renewed)","date":"Reviewed in the United States on February 11, 2025","body":"PERFECT CONDITION!!! FAST SHIPPING!!! WOULD DEFINITELY SHOP AGAIN !!!!! HIGHLY RECOMMENDED!!!!! :) (: :) (:","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So pretty, wonderful gift!","date":"Reviewed in the United States on November 25, 2024","body":"The only issues I have are very minor. There was a slight scratch across the screen, barely noticeable. The battery goes to 84%. Which isn’t bad, but I was expecting a bit more from paying for the most expensive choice.Overall, I’m happy.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was a great phone","date":"Reviewed in the United States on December 26, 2024","body":"It was in great condition and switch over to Verizon good."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on February 22, 2025","body":"Quality is good"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works","date":"Reviewed in the United States on February 23, 2025","body":"It worked great"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good","date":"Reviewed in the United States on February 16, 2025","body":"It was very good condition and working soo great"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    For my daughter","date":"Reviewed in the United States on February 9, 2025","body":"Loved it .up and working well"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    like new","date":"Reviewed in the United States on February 24, 2025","body":"just like new"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT EXCEPT","date":"Reviewed in the United States on January 19, 2025","body":"this phone is great esp for the price however around the camera the color it a little chipped, but tht doesnt affect anything so its still a great phone. it did say tht the battery wasnt a verified apple battery but its working great and the battery life is 100% so🤷🏽‍♀️","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100% recommended","date":"Reviewed in the United States on January 3, 2025","body":"I made this purchase almost two years now I think and we haven't had any issues with it especially being that it's been used by a teenager who just happens to drop it every now and then. I even recommended it to a friend who bought one for her son almost a year now and it's still going strong too. Buying a refurbished device is really scary but I give it to Amazon on this one, they did an honest good job with these devices.","helpfulVotes":2}],"reviewCount":0,"reviewAvgRating":4.2,"status":"completed"}