{"reviews":[{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Perfect condition iphone! No scratches and 99% battery","date":"Reviewed in the United States on February 22, 2025","body":"I bought an amazon renewed excellent condition iphone 13 from the seller bayshine trading. My expectations were low and was completely fine with having scratches on the phone and low battery health. But when I received my phone my expectations were beyond exceeded. My phone has no scratches anywhere and has 99% battery health! The phone did come a little 'dirty' on the edges but came off easily with an alcohol wipe. It takes a charge perfectly, camera works and looks good, sound quality is perfect. Everything I've tested so far works like new. Of course everyone will receive a different renewed phone but I think with the extreme discount a renewed phone gives (refurbished off bestbuy is 500, i paid 300 on amazon), as well as guaranteed 30 day refunds and returns, it is 100% worth it. I will be buying renewed iphones off amazon for all my future phones! :)","helpfulVotes":35},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Great quality!","date":"Reviewed in the United States on March 4, 2025","body":"Phone arrived earlier than delivery date, and came in near perfect condition! Screen and back look great! Just small dings on one top corner. Battery life is at 82% Upon opening. Phone is working great so far! Definitely worth the price! Would recommend this seller to anyone looking for an iPhone in good shape! Not sure on other colors but with the pink I would assume mostly females have owned them previously and most women I know keep their phones in cases so that probably contributes to the quality of the specific phone I ordered so keep in mind who would have owned the specific phone you order!","helpfulVotes":6},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Perfect purchase for the $$$$","date":"Reviewed in the United States on February 27, 2025","body":"Only complaint was the delivery, says overnight and took 4 days to arrive.Phone overall is a 5star Works just fine. I upgraded from my 11 to this 13 and im pleased with my purchase. Local stores wanted 600$+ and limited colors. This Came with a screen protector already installed and the charger wire which i was not expecting so that was a plus for me. 2/27/25 is when I receive my phone. if anything changes ill update. for now, Im definitely buying another one for my work phone. Price is right, condition is excellent. Few minor scratches marks from previous phone case but for a used phone no complaints looks new.","helpfulVotes":11},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Good Quality","date":"Reviewed in the United States on January 6, 2025","body":"I bought this iPhone 13 128GB Starlight, and since it’s a renewed product, I was quite nervous when I first ordered it. However, when it was delivered, it was amazing. The exterior was in good condition, the frame was nice with no scratches, and even the back and camera worked well. After setting up the phone, I checked everything and was very satisfied to find that the screen hadn’t been replaced, it’s the original screen. Overall, everything is great. The reason I gave it 4 stars is because the battery capacity is only at 85%. If it were higher, it would definitely deserve 5 stars. But for a renewed product, this is already excellent","helpfulVotes":25},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Perfect","date":"Reviewed in the United States on March 4, 2025","body":"My boyfriend needed a new phone very bad and we were tight on money and didn’t want to spend 1k plus for a new one. I was very skeptical buying a phone online, as of course you could really get anything. But this phone is literally perfect. It took a couple days to get here, and it was perfectly unscathed. No scratches, no cracks, and it functions so perfectly. It’s as if we got a brand new iPhone. I definitely recommend this product. Also for reference we bought the best condition option. 100% worth it!","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Love love love! Best value than anywhere else.","date":"Reviewed in the United States on March 9, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Overall great product for the price! I recieved just what I asked for, iPhone 13 with 256 GB storage in the color Pink. The phone came in great condition, no dents, scrapes or anything like that, just a few normal wear scratches on the screen, but very very small and minor. Cameras work fantastic, I have no issues with glitches and the provided charging cable worked 100%!The only few complaints I have are: I did pay for excellent and got a maximum capacity of 81% battery, I would expect a higher number for the condition I payed for; Also, under the 'what you'll get' list says that I should've gotten the SIM removal tool and I did NOT get one. And lastly, there are some areas that have what looks like dirt specks in small crevices, nothing too major and you can't really see it unless you're 10 inches or closer. Charging port also looks a bit dirty but it charged fine and fast with the cable provided.Final grading: 9.3/10, would buy again!Although there were a few let downs like Battery MC and missing the SIM tool, the value for the item in its condition is absolutely worth it.","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":3,"title":"Mediocre","date":"Reviewed in the United States on January 27, 2025","body":"I ordered the iPhone 13 pink, it came today and the phone itself overall is emmaculate condition. There are no scuffs or scratches anywhere or dents. No screen damage or issues. My only complaint is that I ordered this in “excellent” condition and the battery health is 88%. Apple recommends replacing batteries after 85%, so this battery isn’t really that great overall. Anything above 90 would’ve been much preferred but overall this was a great purchase for the price. Color is super cute in person.Update: 3 days later I am updating my stars from 4 to 3. The battery health % has already dropped to 86 from 88 in 3 days. This battery is not good anymore like I mentioned in my previous review. It already needs replacing or the replacement this seller used is garbage.","helpfulVotes":32},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"I recommend. (Read if your concerned it’s not worth it)","date":"Reviewed in the United States on March 15, 2025","body":"No I’m not a bot. Even tho it was delayed by a day. Which is fine. The phone came basically brand new. No cracks or scratches or any residue on the front or back, or sides. 100% battery health. The picture quality is super good, feels great, doesn’t lag or anything, battery lasts a long time from one charge to 100% depending on what you do, the brightness of the screen is nice as well, and it’s easy to set up, i transferred my data from my previous iPhone to this one. I basically saved $200-300 on a brand new phone. Nothing about it feels refurbished, it feels and runs like a brand new phone.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Great emergency replacement phone","date":"Reviewed in the United States on February 24, 2025","body":"I took a gamble and mine was about 83% battery capacity which is worse off than most, but I don't use it much except next to a charger. its run speed is great, it came in six hours, which is ridiculously fast. there's no cracks or scratches on it anywhere and i had no troubles with service this one's better off than my cracked broken 12 so I'm pretty happy with it."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Mostrar % rendimiento de batería","date":"Reviewed in the United States on March 6, 2025","body":"Se debería escribir en las especificaciones el rendimiento de la batería (ej 85%) ya que que el que compre dice 83 % x lo tanto va a tener muy corta duración esa batería, en ese sentido estoy decepcionado)"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"It's okay, but........","date":"Reviewed in the United States on March 5, 2025","body":"The phone is nice, but was not equipped with a new batterie. The batterie is 80%. It should be 100% in my opinion. Update…… the screen had a flaw and the alarm didn’t work. The phone had to be returned.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"So far, so good.","date":"Reviewed in the United States on March 10, 2025","body":"Arrived on time. In good condition. Had to charge upon arrival. Device got pretty warm and hoping this won't be an issue. Battery health is 84%. Fingers crossed it will last a few years."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Battery max capacity below promised","date":"Reviewed in the United States on February 22, 2025","body":"Phone condition is good in general. But it was not up to Amazon “Excellent” rating level, as it was stated in description. The biggest concern and disappointment is maximum remaining battery capacity of 76%, instead of expected 85 and above. Screen, camera and body are fine, couple of light scratches on screen still can be found.","helpfulVotes":6},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Muy buena compra","date":"Reviewed in the United States on March 11, 2025","body":"Todo en perfectas condiciones sin ninguna queja, lo único es que no trajo el pin para la bandeja de tarjeta sim, me llegó con 86% de batería."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Non-Apple Parts and dying battery","date":"Reviewed in the United States on January 31, 2025","body":"Overall, the phone was in good shape externally. Clean & scratch free.However, the battery was at 87% lifespan and apple recommends replacement at 80 so it is near the end and the battery dies rather quickly for an iPhone 13.The screen was replaced with a non-apple screen.* There is a constant pop up that tells me about the non-standard part.* The right side of the screen isn't correctly aligned with the display so typing p or backspace is difficult.* The screen has some halo when displaying certain things.","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Good phone","date":"Reviewed in the United States on February 27, 2025","body":"Bought the phone in good condition. It came close to perfect with minor scratches and the battery health at 89%. The only gripe that I have is that there could've been better packaging and there was no included charging adaptor. Otherwise, I'm happy with my purchase!"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Great Price!!","date":"Reviewed in the United States on March 8, 2025","body":"Phone is in great condition, but did not have 100% battery health came with 87%, but for a used phone works great came through the mail pretty quick, works great."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"works like new","date":"Reviewed in the United States on January 28, 2025","body":"This was my first time purchasing a refurbished electronic of any kind so I was nervous. Reviews were great overall and you do get a month to return if it ends up being defective. I upgraded from an iPhone 6 which was still working fine but I wanted to find an upgrade before it actually breaks and I'm without a phone. So the upgrade from a 10 year old phone was massive even though this one is already 3ish years old.I received it with about 87% battery life. For about the first week, I was on it constantly all day every day getting everything set up just the way I want it and trying out new features that weren't available on my old obsolete phone. And everything works perfectly. The only way I can really tell it was used was by the scratches around (not on) the back camera lenses, but since I hardly even look at the back of my phone it doesn't bother me.I'm not someone who always has to have the latest tech, so this has worked really well for me. I think I might always choose to just go through a reputable dealer for a used phone anytime I need to upgrade.","helpfulVotes":6},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Dirty","date":"Reviewed in the United States on March 7, 2025","body":"The quality is excellent but the outside is a little scratch but its not that bad. BUT it was dirty, like the little holes and sockets ."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Birthday Girl","date":"Reviewed in the United States on March 12, 2025","body":"Good cell phone for being used.  A birthday gift for a 13 years of age girl."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Phone came fast, pgk’d well, battery has been fine - works well except issue discussed in review","date":"Reviewed in the United States on March 1, 2025","body":"I withdrew returning this iPhone as the problems it is having is something with possibly Fb and messenger as I googled it and then my 2 daughters said they had the same issue — that is grey box popping up as you type in messenger or FB.The phone was in great condition and I have been using it now for 4 days and cancelled the refund if it.  It works great and love it.  Thank you to the company for being patient .. they were great!!"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Excellent","date":"Reviewed in the United States on February 26, 2025","body":"Phone looks exactly as advertised, in EXCELLENT condition. You would think it was never used. I put 4 stars only because I'm used it for a couple of days. Delivery was on time as well."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Good deal","date":"Reviewed in the United States on January 29, 2025","body":"It’s a fair deal. Came on time, and transferring data from my old phone was easy. Phone is in good shape, a few minor pin marks on the screen and on the back, near to the cameras, but barely noticeable doesn’t bother me. Phone works great, camera and other functions were working properly, battery has 81% life time. Touchscreen became lazy after protector installation, specially for typing. I’m going to replace the protector and evaluate. But I recommend the product!","helpfulVotes":5},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Very happy with my purchase","date":"Reviewed in the United States on January 8, 2025","body":"At first I was kind of skeptical with this product since it was refurbished, but I really liked it! It’s good for the price. It was like it was brand new! And it is indeed an apple product. Not a scam. My only problem was that I ordered it December 17, 24’ and it didn’t get here until January 7th 25’. Probably because it was Christmas.And don’t forget, your SIM card probably won’t work UNLESS the phone has the same carrier. I had to go in store to purchase me a SIM card for 30$. Overall 10/10. Oh and to take my advice get the EXCELLENT version for less complications.","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"phone","date":"Reviewed in the United States on January 7, 2025","body":"i got the phone a day earlier then i was suppose to but the phone battery is at 72. i have prepaid verizon i am going to have to go in the verizon store to try to get it turned on this phone and my old phone have a sim card but when i transferred it messed up i don't know how but i think i disactivated the sim by clicking something that popped up possibly. in other words it isn't as easy as everyone made it seem to transfer the sim card and it automatically turn on. it came wrapped i love this phone and it works great very much needed upgrade.","helpfulVotes":5},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Satisfied with Refurbished","date":"Reviewed in the United States on February 26, 2025","body":"Only have had this a few days, so far, but I am happy with my purchase. I was nervous about buying refurbished (have never done that before) but it feels like a new phone. There was one small scratch/dent on the top of the phone despite the fact that the description said the condition was “Excellent” (which is defined as no scratches). But, it’s not noticeable with a case. Will likely buy refurbished again, in the future."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Works fine","date":"Reviewed in the United States on February 12, 2025","body":"I have it a 4 star because I ordered a green one but received a pink one, no issue with the phone except the color. Luckily the wife was cool with a pink one."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Pleasantly surprised","date":"Reviewed in the United States on August 23, 2024","body":"So let me start out by saying that I am not one to purchased refurbished phones and whenever something would happen to one of mine and I had to turn it into the Phone company and they would send me a refurbished one to replace mine, there was always something wrong with them. So, that has always made me a little bit gunshy regarding that particular situation.With that said, as a full-time caregiver for the last 11 years, I have not been able to work and unfortunately can no longer purchase the best of the best with the flagship phones that I used to get back in the day. Many of my parents doctors do some video visits and some of them actually prefer FaceTime so as a result, having an iPhone was actually partly a necessity for that reason.I have always been an Android girl, )still have that too), so I didn’t quite know what iPhone I needed to get, but after some research, I finally settled on what I thought would be the best choice for me both with regard to the technology inside and with the price as well as the warranty.I had actually considered either an iPhone 11 or an iPhone 13 as my choice. As we are now on the 15 I found the 13 to be the wisest choice of the two.After researching many different sites, some very reputable and actually recommended by people, I decided to land on Amazon‘s renewed program because I’ve always had a nice experience when there have been any issues with a product and I’ve never had any problems with customer service. They’ve always been very helpful and I thought if anything were to happen with the phone, I would be hoping to have the same type of experience.In looking at the options, I chose to actually pay more to have one that was put forth by Amazon themselves because they offered a year warranty as opposed to many of the others who were a bit cheaper and offered maybe 30 days or so etc.And hey, so far, so good! The Phone arrived. It was in perfect cosmetic condition and I have not had any issues with it since. The battery was at 87% and although I would’ve liked to had it higher than that, I was glad to see that it still was pretty snappy when I needed it to be.So I would say that I have been very pleased so far and I would absolutely recommend the renewed program to anyone interested, but can only speak to the actual product provided by Amazon itself, however, I’m sure many of the third-party individuals that sell refurbished items may have some really good product themselves.Ah…there I go again…refurbished…renewed…to-may-toe…to-mah-toe… well you get the jist…","helpfulVotes":27},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Battery life, scratches","date":"Reviewed in the United States on March 13, 2025","body":"I bought this phone 2 months ago. the battery is like 85. none of the parts were replaced, the screen is intact, and there are no scratches. I admit I was scared to purchase from amazon, but they did not let me dow.n I recommend."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Great iPhone","date":"Reviewed in the United States on March 12, 2025","body":"My previous review about this product was not so good due to my package not being delivered. However, when I contacted them, they sent me a replacement and it was actually delivered this time. I’m happy with my purchase and I would definitely order again.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Battery health","date":"Reviewed in the United States on February 12, 2025","body":"The product was in great condition but there was two things wrong with it it had bad battery health and had scuffs on the sides other than that it was great"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Good value and condition","date":"Reviewed in the United States on January 9, 2025","body":"I decided to purchase a refurbished iphone.  I’d purchased one before for my son who needed a replacement and that experience was fine.  So, not wanting to spend a thousand dollars for a new iphone, I decided to get a refurbished one in excellent condition.  And, it was really excellent condition and provided the bump up in storage, functionality and battery life I wanted without the price.  The plus is buying recycled products is much better for our beautiful earth.  Very satisfied customer","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"pretty good condition","date":"Reviewed in the United States on February 19, 2025","body":"it works perfectly; however, it came with a few scratches on the screen. the battery life seems very durable!","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Decent Phone.","date":"Reviewed in the United States on February 1, 2025","body":"Phone is great works like it’s brand new! Was easy to set up and had no problems transferring. The only bad thing is the battery percentage. Mine was at 86%. Comes with new charger as well.","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"This phone is worth it","date":"Reviewed in the United States on February 22, 2025","body":"I loved the price of this phone very affordable for this model. The shipping was amazing fully wrapped. It came with a charger. I’ve been using this phone for over a month and there have been no cracks and that’s good because I drop my phone a lot. The weight is also light but heavy enough that it feels like you're still holding something. I approve and give 10/10","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Refurbished Problem","date":"Reviewed in the United States on January 20, 2025","body":"I got thos phone for my teenage son for his birthday. He loves it! However, when we got it, the port wasn't working well and had problems with charging. We went to an apple store and they cleaned out the port. There was a ton of dirt in it!Thankfully it works now!","helpfulVotes":3},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"IPHONE 13","date":"Reviewed in the United States on March 1, 2025","body":"IPhone 13 arrived in less than a day after ordering. 0pened package,  it looked like it had never been used. Not a scratch on it. Battery health was at 89%. I am well pleased. A shout out to the seller and Amazon. For the price of $320. I feel like I got a fantastic deal."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"This phone is highly recommended to buy","date":"Reviewed in the United States on January 28, 2025","body":"I bought this phone after wanting it for a while, but the only slight con I have is the battery capacity was at 86% but it lasts through a whole day of school. So it I recommended 👍🏾","helpfulVotes":2},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"YES!!!","date":"Reviewed in the United States on March 10, 2025","body":"I bought mine in excellent condition. And INDEED it is in excellent condition it looks BRAND SPANKING NEW. Battery at 100 % health. Not even one nick or scratch. I would definitely recommend it for the money."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Pretty happy good buy","date":"Reviewed in the United States on December 13, 2024","body":"So far I’m happy with this phone. I had a few problems when first used it. The talk to text and Siri weren’t working. Once I did the updates and Reset the phone it was fixed. They both are working fine now.I’m not super happy with the screen. It’s either too sensitive or not enough. It skips letters on the front screen and along the edges,Over all it’s a great buy. Much better than spending $1000 on a new phone.The phone looks nice barely noticeable that it’s used. There are a few minor scratches around the camera but that’s all. You wouldn’t notice if you didn’t know to look.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Definitely worth the buy.","date":"Reviewed in the United States on February 19, 2025","body":"Very skeptic about buying a refurbished phone. I’ve always bought new. There were a few reviews that had me worried as some customers weren’t satisfied. I took a chance because the good outweighed the bad.Cosmetically there was one small scratch. Nothing major. Screen was flawless.Functionality smooth, and very responsive!Charging speed is very fast. (Impressive)Durability seems really good so far. I’d definitely shop again."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Wowzers. Mines was MINT","date":"Reviewed in the United States on March 12, 2025","body":"In perfect condition with 98% battery health what a steal. I was skeptical initially but I’m glad I purchased this. Saved me from having to stick with an android for two years"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Great Deal","date":"Reviewed in the United States on March 11, 2025","body":"Very great products. I purchased three items and was just trusting the process and you guys didn’t disappoint. I’ll definitely have you in mind whenever purchasing phones. Value for money!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Very Pleased 😄","date":"Reviewed in the United States on March 13, 2025","body":"The phone was even better in person!! It looks brand new & is such a pretty color of pink. I am very pleased with my purchase 😁"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Incredible value.","date":"Reviewed in the United States on February 23, 2025","body":"I was initially hesitant to buy a refurbished phone. However, I was very pleased. The phone arrived within 48 hours and was in near mint condition. It was also a whipping $300 less than my carrier wanted to charge me.This will definitely hold me over till upgrading to the 17 is in my budget at the end of the year.","helpfulVotes":3},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"phone 13","date":"Reviewed in the United States on February 4, 2025","body":"works awesome , easy set up, nice screen. the actual phone part though was very scratched and chipped. super fast shipping"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Great condition iphone 13","date":"Reviewed in the United States on March 2, 2025","body":"I was a little hesitant about buying a renewed phone but I’m so glad I did the phone came in perfect condition. Also came with a screen protector already on it. Everything works camera, sound & etc. I will definitely buy phones only from here now, I love it!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Steal fasho!","date":"Reviewed in the United States on February 21, 2025","body":"I got my “new” phone in like 3 days from ordering. It is perfect. No scratches no dents. Looks like the original screen and my battery health is at %100 which I always am worried about when getting refurbished phones. Super satisfied with my purchase. I’ve had my phone for about 2 weeks now. Waited to make sure no issues. Thanks for the good purchase!","helpfulVotes":5},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Good Phone ♥️","date":"Reviewed in the United States on February 15, 2025","body":"Like new condition.BUT, the battery health 81%"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Phone overall review","date":"Reviewed in the United States on March 4, 2025","body":"Phone is in great condition looks just like the picture & the battery is awesome holds great charge ! My girls were satisfied & so was I ! I would definitely recommend buying !"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Most definitely recommend IPhone 13","date":"Reviewed in the United States on March 7, 2025","body":"I love my new IPhone 13 White. It was easy to set up just by switching my sim card to the new phone. Battery was at 93% & everything looks & works amazing."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"iPhone 13","date":"Reviewed in the United States on January 15, 2025","body":"Came with white crusty stuff all over. And it sounds weird when I send voice messages..idk if the white stuff has something to do with it but I cleaned it off and other than that the phone calls sound fine and it works pretty good.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"iPhone 13","date":"Reviewed in the United States on December 10, 2024","body":"I received a good price on this iPhone 13 considering I took advantage of the Amazon store card and got 80.00 off the price. I’m very pleased with my renewed iPhone 13. It only had a very small scratch on the screen.  It was cricket locked which I have cricket service. I switched over the  old phones data etc. with no problem. I was able to keep my original phone number. iPhone sold at cricket wireless are very expensive. They wanted 699.00 with keeping my old number. I paid 240.00 for renewed for the same phone.. I would recommend this seller.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Easiest Experience Ever","date":"Reviewed in the United States on January 10, 2025","body":"FYI if you have an eSIM card on your old iPhone like I did holy crap. So unbelievably simple to transfer service (NOT DATA) to your new phone. Like press a couple buttons on both phones simple. And no getting permission from the account holder if you are on a family plan. Data, ya that’s simple too, as long as you back up your old phone over the cloud or onto a computer. And no bullshit Verizon charges for a “new” SIM card or waiting there! Seriously I’ll never buy a phone another way (yes, I always buy my phones outright, personal preference).Technical details aside, the phone was listed in excellent condition and it is, one or two small dings to the metal sides but otherwise perfect. 80% battery health (which lasts longer than my 2nd generation SE at 92%). I did not realize the seller was sending by FedEx signature required, but luckily it was able to go pick it up at the local shipping center. Packaged securely, no damage in transport.Highly recommend.","helpfulVotes":11},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Perfect buy","date":"Reviewed in the United States on March 6, 2025","body":"Came with no issues and like new. Very easy to set up with wifi and the installation of the Sim card. Excellent buy and would recommend over upgrading straight from the app of your service provider."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Just as described!","date":"Reviewed in the United States on March 15, 2025","body":"Excellent condition, just as described. Very fair price. Fast shipping. No issues connecting to our service carrier either! Very pleased. Thank you!!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Satisfied customer","date":"Reviewed in the United States on March 12, 2025","body":"The iPhone 13 has worked like it should. No problems, shipping was fast and iPhone came in perfect condition with no damage."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Almost new condition :-)","date":"Reviewed in the United States on March 13, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Ordered from 3rd party companies and received junk that was rusted and dropped in a garbage disposal, which they advertised as “excellent condition”. I got fed up and tried Amazon refurbished. WOW, this thing is beautiful. Only wear is at the top where some color faded from touching someone’s face. No scratches, scuffs or dirt in the speakers…so clean! It arrived in a brilliantly designed package that seals the product in a plastic sleeve, while holding it suspended in the center of the box so it can’t be harmed. ProductRED on the iPhone 13 looks amazing in person, I’ve only ever owned black phones so this is a fun blast of color. Besides the fingerprints I just put on this, the phone looks new."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"iOS 13","date":"Reviewed in the United States on January 6, 2025","body":"This is my first iPhone. I was going to rate the product 5 stars but I noticed 2 scratches on the screen after I had the phone for 2 days.  Will keep the phone as you can only see the scratches under a bright light."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"nothing but great","date":"Reviewed in the United States on March 4, 2025","body":"10/10 no dings no scratches looks and feels brand new battery life is great also this was a complete steal go for it i ordered the pink one"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Lots of trouble w/ set up","date":"Reviewed in the United States on October 22, 2024","body":"the phone came in very fast, the delivery said it wouldn't be here until around halloween and it came in yesterday. the phone came in super nice minor scratch on the bottom, speakers work, all 3 microphones work. the problem came in when i started to set up the phone. i went through the entire process and got to the part to transfer everything from my other phone to this one and it told me i had to update it. i could not get the phone to update. i let it sit in the update screen for 2 hours and it did not start to update. i had to set up the phone with no transferring to update it. after that i erased the phone again and was finally able to transfer all of my stuff. it was definitely a struggle but i finally got it and am very happy."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Phone was excellent condition","date":"Reviewed in the United States on January 18, 2025","body":"Phone was excellent condition no complaints battery health could have been a little better than 84% but otherwise I'm satisfied would buy again ."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Very good for the price","date":"Reviewed in the United States on July 28, 2024","body":"This was my first time buying a refurbished phone, so I was nervous about what I might get, but a couple of days in, I have to say I'm pretty satisfied.First, shipping was very fast! I had the phone in my hands within 48 hours of placing the order, which surpassed all my expectations. It came with a charger (both the cable and block). The phone was dead when it arrived, so I needed to charge it first, but no big deal. The first thing I noticed was that there are some small chips and scratches around the edges of the device, most noticeable on the top, but with a case on, the damage will barely be visible. I've been using it without a case the last couple of days while waiting for the one I ordered to arrive, and even uncovered, it doesn't look that bad. Screen and cameras are in perfect condition. The phone was perfectly clean on arrival too, no dirt or dust.The max battery capacity is 85%. Since I paid for excellent quality, this was a bit disappointing to me and is the reason for me rating only 4 stars, especially after seeing other reviews of people who got batteries in the 90s, but it's still a major upgrade over what I had before (a 2020 SE with only 72% capacity). Overall, I've been happy with the performance so far, especially for the price. I would buy from MobileSupply again!","helpfulVotes":33},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Satisfied","date":"Reviewed in the United States on February 6, 2025","body":"👍"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Very Happy with Purchase","date":"Reviewed in the United States on March 13, 2025","body":"Very Happy with purchase. Clean and great battery life left. Would buy from again."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"100%","date":"Reviewed in the United States on March 15, 2025","body":"Fast shipping, phone exactly as described! Well worth the price !"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"It came wholesome. Not broken or issues","date":"Reviewed in the United States on March 14, 2025","body":"Works fine. Clean and my daughter is grateful. True to their word service."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Wow!!","date":"Reviewed in the United States on March 11, 2025","body":"Phone is amazing' just like NEW! My daughter loves it. Thank you."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Ships by fedex","date":"Reviewed in the United States on January 31, 2025","body":"In love with this phone so far battery life is 85% but everything works great on it delivery was fast just didn’t care for fedex shipping it took for ever for them to deliver it. But over all 10/10. Only thing I didn’t care for is when I got it. It was already on the Home Screen. Only comes with block and cord (not apple). But every thing was 100% for me! Thank you so much!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Reembolsaron la compra en tiempo y forma.","date":"Reviewed in the United States on February 27, 2025","body":"Le pondré 5 estrellas. Lo que estoy puntuando es la honestidad, ya que el producto estaba defectuoso. He recibidos el reembolso luego de reenviar el equipo."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"iPhone 13","date":"Reviewed in the United States on January 8, 2025","body":"I love that the phone was in excellent condition the body of the phone is excellent my only dislike is the battery health I thought the battery health will be closer to at least 90-95%"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"iphone","date":"Reviewed in the United States on March 5, 2025","body":"honestly when I got in very very good condition it's 89% I can careless came in 3 days so don't worry 🙏🏻"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Great Refurbished Phone!","date":"Reviewed in the United States on January 8, 2025","body":"Hi! I just got my iPhone 13! I bought the Apple iPhone 12, 128BG, Pink - Unlocked Excellent. The phone came earlier than expected which made me super happy because I had to leave for college soon. The iPhone has a couple of scratches on the sides but nothing I really notice much. I got ready to put my screen protector on today but then noticed there was a screen protector already on which was odd but I guess it's a plus. I looked at the battery health, and it's currently at 80% Battery Health. I don't think it's overall a bad deal for a refurbished phone. I usually get refurbished phones from Amazon and always have a positive experience. If you're looking to get a budget friendly phone, this is your sign to get it!","helpfulVotes":11},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Love it!!","date":"Reviewed in the United States on March 6, 2025","body":"Shipment came quickly. Phone is in perfect condition and came with 99% battery life. Very happy with my purchase. Highly recommend"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"\"EXCELLENT PHONE\"","date":"Reviewed in the United States on March 14, 2025","body":"EXCELLENT QUALITY PHONE, \"PERFECT\" MUCH BETTER THAN EXPECTED"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Fast shipping","date":"Reviewed in the United States on January 28, 2025","body":"Little scuff on corner but phone works and shipping was fast."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Good phone","date":"Reviewed in the United States on March 15, 2025","body":"Everything works perfect, battery is doing great."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Better than expected!","date":"Reviewed in the United States on March 9, 2025","body":"iPhone 13 in perfect condition with 100% battery health! Better than expected!Thank you!!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Excelente","date":"Reviewed in the United States on March 14, 2025","body":"Me llegó muy bien el equipo"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Condiciones óptimas","date":"Reviewed in the United States on February 23, 2025","body":"Llego en excelente condiciones, solo unos pequeños detalles que ya con cover puesto no se visualizan y que la batería está en 88%, a parte de eso todo muy bien y funciona de maravilla."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Excelente estado del telefono","date":"Reviewed in the United States on January 28, 2025","body":"Todo muy bien"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Nice ohone","date":"Reviewed in the United States on March 14, 2025","body":"Daughter love it, very nice phone"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"A refurbished cell phone","date":"Reviewed in the United States on March 13, 2025","body":"Timely shipping and it works!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"👍👍👍","date":"Reviewed in the United States on March 7, 2025","body":"Arrived same day I ordered. No complaints. Looks and works perfect!"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Not excellent but worth the price","date":"Reviewed in the United States on January 16, 2025","body":"I work as a cell phone rep , battery is at 85 percent. 4/5"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Don’t be afraid to get this! Amazing phone","date":"Reviewed in the United States on March 4, 2025","body":"Came with no defects. SO pretty and after 5 months I don’t regret this purchase one bit."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"100% RECOMENDADO","date":"Reviewed in the United States on March 8, 2025","body":"Excelente porcentaje de bateria, excelente condicion fisica. Recomendado 100%"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Make sure the phone is in good condition and unlock","date":"Reviewed in the United States on March 8, 2025","body":"I love my phone and no issues so far"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Best Buy  I’ve ever made! Great phone","date":"Reviewed in the United States on January 24, 2025","body":"I love this phone. I’m using it to do this review. I had no trouble setting it up. Charged it right away. I was so happy with the condition, I opened it and it looked new. In excellent condition, no dents or scratches that I see. I’m so glad I got this. I will get refurbished for now on. This company sent it right away. MLK day delayed delivery. I’m so happy so far. Now to order a protective cover . The price is almost unbelievable to what one new would cost. I’m very sold on this company and seller.","helpfulVotes":20},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Phone is in good condition with  (1) noticeable scratch in the top.  Battery was at 100%","date":"Reviewed in the United States on August 21, 2024","body":"Overall, I am happy with this purchase.  The battery reports 100%, and overall the phone is in good condition.  If you keep your phone in a case, you wouldn't notice the small gouge on the top right.  There is additional minor wear and tear around the metal housing (seems like the prior user didn't use a case).  If you prefer to go caseless, expect that you could receive a device with some minor but noticeable wear and tear.  However, the phone was not sold as \"flawless\" so some wear and tear is to be expected.  For my use case, the phone met my needs.  I threw it in a case and don't notice the flaws  The phone came with a glass screen protector which was a nice touch.  I haven't pulled off the screen protector  to see if the underlying screen has scratches.  if there is wear-and-tear on the screen (ex. small scratches from keys, etc.) they are minimal and not noticeable thought the screen protector.  Overall satisfied with this purchase for my use case.","helpfulVotes":17},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"No está completamente en excelente estado","date":"Reviewed in the United States on January 11, 2025","body":"El teléfono tiene algunos golpes en las orillas, no se encuentra en excelente estado como dice en la descripción del producto"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Perfect condition","date":"Reviewed in the United States on February 27, 2025","body":"I was so nervious to be scammed but the phone was in perfect condition to be a second hand. I’m so happy.","helpfulVotes":1},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Old version but operates brand new","date":"Reviewed in the United States on March 4, 2025","body":"A month later, and the phone still works like brand new. No issues at all!"},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"It works good but the battery is lower than expected","date":"Reviewed in the United States on January 9, 2025","body":"The battery capacity is only at 87%. The package itself was late two times. Other than that not many issues, and no damage."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Quality iPhone at a great price","date":"Reviewed in the United States on February 5, 2025","body":"This iPhone 13 looks and operates like brand new, which I got refurbished at a fraction of the original cost.  The dealer also expedited shipping to me after i let him know that my older iPhone had died, so I would highly recommend them for anyone else debating using them for their next iPhone purchase."},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Battery life as expected! 👏🏼","date":"Reviewed in the United States on February 27, 2025","body":"Great conditions! For the price I paid I got 90% battery life which is perfectly fine!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Work really well ( its like it’s brand new )","date":"Reviewed in the United States on February 12, 2025","body":"I’ve had the phone for about 2 weeks now, it came in good condition. Definitely felt like it was brand new. It didn’t come with any scratches or anything, I also tested out the camera and volume and it was GREAT!!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"AMAZING","date":"Reviewed in the United States on February 17, 2025","body":"Immaculate condition, and 92% battery health! Setup was a breeze and the unit is beautiful :)It's like a brand new phone at half the price, thanks!"},{"reviewType":"normal","reviewerName":null,"rating":5,"title":"Legit like fr","date":"Reviewed in the United States on March 1, 2025","body":"Had phone for bout a week now and works great nothing wrong. Great purchase."},{"reviewType":"normal","reviewerName":null,"rating":4,"title":"Phone","date":"Reviewed in the United States on January 18, 2025","body":"Woks so far"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Mediocre","date":"Reviewed in the United States on January 27, 2025","body":"I ordered the iPhone 13 pink, it came today and the phone itself overall is emmaculate condition. There are no scuffs or scratches anywhere or dents. No screen damage or issues. My only complaint is that I ordered this in “excellent” condition and the battery health is 88%. Apple recommends replacing batteries after 85%, so this battery isn’t really that great overall. Anything above 90 would’ve been much preferred but overall this was a great purchase for the price. Color is super cute in person.Update: 3 days later I am updating my stars from 4 to 3. The battery health % has already dropped to 86 from 88 in 3 days. This battery is not good anymore like I mentioned in my previous review. It already needs replacing or the replacement this seller used is garbage.","helpfulVotes":32},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Update; Camera Glitch/  iPhone locked by owner! Beware","date":"Reviewed in the United States on February 28, 2025","body":"Update, I was able to get into the phone , then the software crashed. Had to wait on that to resolve by updating it from the computer. Everything works  well now but the  Phone camera . It glitches and freezes. Can’t take pictures.My review will change once I get a resolution but the phone arrived and says it’s locked by the owner! I can’t do anything with the phone and I paid $300+. This needs to be  resolved asap!"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Definitely not as “excellent” as I expected…","date":"Reviewed in the United States on January 29, 2025","body":"All four sides of the phone has pitting. The back also has little dots throughout. The screen is perfect, no seen or felt scratches or cracks.The phone max battery capacity is 86% …side note, when I plugged it in, it didn’t turn on to the set up menu (like normal.) It was just an unlocked phone with all the apps on it & no Apple ID. It had screen shots in the photo album of how to screenshot from April of 2024… that was sus so I reset the phone to set up from the beginning. No functionality loss.Overall not what I’d expect from a professional seller & definitely not what I’d expect for paying for “excellent”","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Phone is locked 🤦🏾‍♀️","date":"Reviewed in the United States on January 24, 2025","body":"I ordered this phone and loved it but when it came to setting up to my current phone service, the representative told me that the phone has a previous balance on it and that the phone is blocked. I ordered it as “Unlocked” & made sure that it was compatible with my current phone company. It has been such a hassle having to send the phone back to get my money back to then order another phone without a phone in use now. It is so frustrating and annoying. Be careful when purchasing these phones.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"It has scratches and battery capacity is 88%","date":"Reviewed in the United States on December 14, 2024","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    For buying a used phone it’s pretty OK I guess but the only problem that I have with it is, I wish it came with a better battery capacity. After reading some other reviews on here, there’s people that paid for good condition versus excellent and they got a better battery. I would prefer to have a better battery so that way I can make sure the device will last for a couple years for my daughter overall it’s functional it does what it’s supposed to and it’s gonna have a case on it so I’m not really concerned about little minor scratches. I also purchased the Asurian protection plan to go with it just in case there’s any problems because Amazon offers it for five dollars a month with the purchase order so far so good. I’m only giving it three stars because of the battery. I was hoping to get a better capacity.","helpfulVotes":45},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Great phone, poor delivery service.","date":"Reviewed in the United States on July 9, 2024","body":"The phone is great, there is a few scratches, none are actually visible except for one tiny one. The others are only visible if I flash a light onto my phone while it's turned off. The phone runs very smooth compared to my iPhone 7, and has an 87% on battery health. My only issue with this is the item was delayed multiple times. I was told it was to be delivered on Saturday but for whatever reason it wasn't and I was home all day. On that same day I called them, I am told it was to be picked up at my local CVS, so I went there, just for them to tell me, they don't have it until Monday. So I went back home, waited a few days, and on Monday morning I recieve a text telling me the package is ready for pick-up at CVS, so I went and it still wasn't there. They told me to come back in on the afternoon, and I did. After 3 different occasions of being told to come in, I explained my situation to the seller and they offered me just a small $10 for compensation... I finally got the product today on Tuesday when they told me to come in this morning. It should never be this difficult to communicate with a customer in my opinion, but it is what it is. Good product, terrible delivery.","helpfulVotes":16},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Get wt ya paid for","date":"Reviewed in the United States on March 13, 2025","body":"Definitely adding lens over the camera, it isn’t perfect but charges fast and really clean  except the camera just not what I expected but I can fix that I got “good renewable one” I wish I got the “expectable” but I think I can work with this"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Error en el Software","date":"Reviewed in the United States on February 25, 2025","body":"El teléfono sin considerar que tenia unos pequeños detalles estéticos, que son comprensibles ya que es un teléfono reacondicionado, vino con un problema en el software estando desactualizado e impidiendo que se pudiera realizar la configuración inicial"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Had High Hopes","date":"Reviewed in the United States on November 23, 2024","body":"As I am strapped for money, I decided to go the refurbished route in hopes of saving a few dollars since Apple got rid of the monthly card installments for an unlocked phone. When I first opened the box, I noticed it was in excellent physical condition. Almost perfect. I definitely had high hopes for this phone from the get go. Unfortunately, I immediately started having issues once I connected it. It started freezing, I couldn't access my settings or voicemail, and my battery life was already at 85%. I restarted the phone and it worked for about 30 minutes before I started having issues again. While on the charger, at about 90% charged, it turned off on me a twice while I was using it. It didn't automatically turn back on so I had to turn it on again both times. I figured that wasn't a huge problem and would contact Amazon customer service in the morning if it did it again however I started having more problems. Had to make a quick trip to the store and thats when I noticed that as soon as I got in the car and was no longer connected to wifi, it immediately just went to \"No Service\". I would restart it and when it turned on, it would work for a about 3-5 minutes but then would go back to \"No Service\". Fortunately, I knew where I was if not I definitely would have been lost at night. After I got home, I restarted a couple more times but it wouldn't connect to my cellular data anymore or work t all unless I was connected to WIFI. As I stated previously, I had high hopes. Unfortunately, looks like I got a defective phone but I can't risk or deal with the chance of getting another refurbished phone with problems so I decided to go and ahead and return the phone. I literally had to run to to Best Buy 15 minutes before they closed to buy a new phone because unfortunately in this day and age, you can't be without a phone. Hopefully this is a good alternative for someone else, but I did not get that lucky.","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"damaged battery… very disappointing","date":"Reviewed in the United States on December 25, 2024","body":"i bought this on december 4 and waited to open it until christmas because it was a gift but we opened it and saw that the battery was already in 89% which is insane because it’s supposed to be fixed and in good condition, i know it’s renewed but it’s still supposed to be fixed in stuff… hopefully at least i can get an amount of my money back because i can’t even return it because im not in the US… it also came with scratches but that’s fine, i was okay with it as long as everything was well but the battery condition i cannot accept. hopefully i get a response back","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Battery","date":"Reviewed in the United States on February 23, 2025","body":"I payed excellent condition and the phone has an 82% battery  But every thing else is good","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"U get what u pay for","date":"Reviewed in the United States on January 14, 2025","body":"While the phone has no scratches or cracks , it came with battery health at 86, and not in an official apple box , did not come with the pick to get Sim card out , and the phone arrived almost dead . I also pay for prime for free shipping  and it took over a week to get here."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Not what I was expecting, has issues","date":"Reviewed in the United States on February 7, 2025","body":"The phone has difficult to use buttons on the sides.  Also, the color on the phone visibly scraped on the back near the camera lenses. This was my second renewed phone, so I knew what to expect, and it is not as good as my first. No comparison.  Not really happy with it, but it's mine now..."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Poor battery capacity","date":"Reviewed in the United States on January 21, 2025","body":"The phone is in excellent physical condition and that’s where it ends.That a phone is considered in excellent condition with a battery capacity under 90% is ridiculous.This phone came to me with 85% battery capacity.  Apple suggests replacing batteries once their capacity is under 80% so I’m going to need to replace the battery in a matter of months. This isn’t “excellent” at all.In the future I’ll just spend the extra money on a brand new phone.","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Review","date":"Reviewed in the United States on March 3, 2025","body":"Phone seems to be operating efficiently and smoothly, but battery health was 81%."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Sensor o Lightning fallado","date":"Reviewed in the United States on August 19, 2024","body":"Le pongo 3 estrellas porque  el tema de cargador no me anduvo bien. De la nada me salta un cartel de  “Charging not available”  y mi celular nunca estuvo expuesto a lugares con agua o humedad. De hecho siempre que me baño, NUNCA dejo el celular en el baño. Esto me apareció al segundo día que usé el celular nuevo. Es raro, debe ser una falla del sensor. Después dejo de aparecer y el celular me cargo bien pero cada tanto me tira el cartel. A raíz de esto, me compré un cargador inalámbrico y esta todo Ok. Igual con el cargador de cable también me anda pero de la nada pira y tira ese cartel, pasa cuando paso cerca de un baño que quizás alguien se bañó, pero es raro. Lo peor de todo es que lo compré refurbished pero en excelente condiciones. Esto no debería pasar. Ademas vivo en Argentina y no estoy en USA para poder arreglarlo o quejarme con Amazon. El resto del celular anda todo ok, esto del cargador me pasa cada tanto, pero no debería pasarme!! Eso","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"1st order = low quality replacement screen; but returned/swapped for good phone","date":"Reviewed in the United States on April 18, 2024","body":"Initially, we got a phone from this vendor that was a dud (for us). We returned it and tried them a 2nd time. The 2nd phone seems a decent deal.For the first phone (iPhone 13) we received:The battery life on the renewed phone was fairly good - at 94% of original capacity. This had been an issue with phones from this vendor per other reviews but was not an issue with ours.  However, this renewed phone had a non-Apple replacement screen that was noticeably low in quality - grainy, with colors dulled, and it cut off part of the display area. Touch responsiveness was bad. Given Amazon pledge that the product was \"professionally inspected and tested by Amazon-qualified supplier,\" I feel the substandard screen should have been spotted and the lower quality disclosed. My family member and my time were wasted by this attempt to pass off a lower quality solution. Return process was easy, although it did require a trip to the UPS store.For the second, replacement (iPhone 13) phone:The replacement for the returned 1st phone arrived quickly. The battery life seems great (100% of original capacity). The screen this time is MUCH better than the low quality screen on the original phone. The case has some scratches and a dent on the ring surrounding one of the camera lenses, but the lens seems unaffected. All in all, a fair price for used phone. Working well after a month of use.","helpfulVotes":46},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"iPhone 13","date":"Reviewed in the United States on March 1, 2025","body":"Viene con un poco en malas condiciones","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Wrong condition.","date":"Reviewed in the United States on March 2, 2025","body":"I ordered an excellent one, and it came in good condition."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Batteries are not Apple brand","date":"Reviewed in the United States on February 12, 2025","body":"They put a new battery in, but it’s not Apple brand. I’ve had many experiences with aftermarket phone batteries. They usually go bad after a few months and barely hold charge."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Delayed Delivery!","date":"Reviewed in the United States on February 2, 2025","body":"The phone is nice, but there was too much delay on the delivery. It actually arrived three days after the actual expected delivery date stated.I waited forever!"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Not Excellent Condition like described, but decent…","date":"Reviewed in the United States on March 14, 2025","body":"Product seems ok. Been using it for a day and half. Screen doesn’t like to recognize my touch at times, but it improved a little when I did the update. It’s not super bad, just annoying at times, but this is for my kid, so I didn’t want a new phone. Battery sucks so I have to get that replaced. That’s about $90. Quite disappointed in that aspect. For the cost, I would have expected a decent battery. Only one small scratch on the screen that’s not really noticeable. I’m not too familiar with buying refurbished phones, so maybe these are normal. Maybe not. I feel like the price was a bit high for the product received. Camera seems to be functioning fine. Back of the phone isn’t scratched or cracked at all. Overall, not excellent quality like described, but decent.."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"I can’t download apps","date":"Reviewed in the United States on March 6, 2025","body":"I can’t download apps"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Display not original, lower quality","date":"Reviewed in the United States on February 26, 2025","body":"Purchased sold and shipped by Amazon. It arrived a day before than expected, which is great. iPhone looked in good condition, has a few scratches on the corners and the bottom where the screws are. The problem was when I compared to my sister's iPhone 13, bought in store, the renewed phone wasa little bit heavier and the display is clearly not original, touch is the same and it works normally, but the image quality is lower and true tone doesn't work as smoothly.The price was very good, so I could expect something like this, however, it's not what I want and I'm returning the phone and trying the premium option. I'm expecting a smooth return process, will update my review about it. I do believe they should be clear that you can expect a swapped not original display.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"It’s small and same camera lens as an iPhone 11","date":"Reviewed in the United States on January 27, 2025","body":"I thought the phone would be bigger for some reason I’ve had an iPhone 11 the camera looks the same"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Original owner of phone had an outstanding balance left on the phone.","date":"Reviewed in the United States on November 29, 2024","body":"Received phone in great condition. Worked for almost a month and then it went into SOS mode. Did everything to try and reset it so it would connect to my carrier. Called the carrier and turns out the previous owner of the phone had not paid this phone off completely and my carrier inevitably locked it out. They need to vet the phones better so this doesn’t happen again. Other than that, I truly loved the phone which is why I am so bummed.","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Amazon Not-so-renewed","date":"Reviewed in the United States on November 18, 2024","body":"Everything about the phone works perfectly except the charge port.  Charging cable was loose in the port, fell out easily, charged sporadically.  I thought about returning the phone, but after spending hours and hours setting it up, I dreaded having to start over. Then I watched a video on YouTube about cleaning the charge port. I followed the instructions and got an unbelievable amount of lint, hair and gunk out of the charge port. Now the cable stays in and my phone charges consistently.  Hey, Amazon!  Shouldn’t cleaning the phone thoroughly, including the charge port, be part of your renewal process?"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"La batería no es Apple","date":"Reviewed in the United States on January 17, 2025","body":"El teléfono estéticamente está bien trabaja bien lo único es que cuando yo checo la batería para ver en cuánto porcentaje está de visa y resulta que no la da me informe al respecto y es por qué según el signo que sale es que le pusieron batería que no es de Apple"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Amazing phone! Battery and overheating is the primary issue.","date":"Reviewed in the United States on August 3, 2024","body":"I bought the phone in \"excellent\" condition and the phone looks brand new and feels brand new! The issue I have with my phone is the battery. I received a notification that the battery is not an “Apple verified” battery, which I didn’t think was a problem. However, the battery drains really quickly and only lasts about 3 hours. I am also experiencing overheating issues. Like, the phone easily gets hot, but that could also be a battery-related issue. I’m going to get the battery replaced, but otherwise every other aspect of the phone is perfect and working well!Update: In order to get the battery replaced, I had to get the display replaced as well, as it wasn't a genuine apple display. That costed around $400 at the Apple Store. So, in my opinion, it's safer to get the phone straight from apple and spend a bit more money.","helpfulVotes":7},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Good phone but not what I ordered","date":"Reviewed in the United States on June 29, 2024","body":"I ordered the iPhone 13 in starlight, waiting a week for it to come in despite originally being told I would get it with two day shipping, and opened the box to a different coloured phone. Luckily my mum liked the colour of the phone and bought it off me so I didn’t have to go through the hassle of returning it, but I had to order a different phone so I’m without a phone for nearly two weeks longer than expected.Colour aside, I ordered the excellent quality and it’s appearance was as promised with no visible damage to the exterior of the phone. The battery life was at 90% and charged quickly and seems to hold its charge for a good amount of time. It’s fairly easy to use, though the touch screen wasn’t perfectly responsive (though in my experience no iPhones are). Didn’t seem to generate heat while being used which was a big issue with some of the iPhones.Overall good value for the money but I can’t say that the wrong colour and how long it took to arrive didn’t rub me the wrong way.","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Battery life not great","date":"Reviewed in the United States on December 17, 2024","body":"I mean the product itself is fine. The battery life is at 80 percent so that’s not that good, only lasts a few hours. Came with a few small dents on the top and some scratches. Kind of disappointed I spent 360 on it and the battery life isn’t better. Not sure if the money was worth it."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Frustrated @ first but I think we good","date":"Reviewed in the United States on February 9, 2024","body":"I was very excited to get a new phone my old one dying. But when I got it I was a little upset. For a few reasons:1. The phone just came in a bubble wrap pouch and then in a box and in the shipping bag. So a little sketchy on the packaging part but I guess not a huge deal (it did come with a charger and block. Not the official apple one but still good)2.There were minor cracks at the top of the screen and the charging hole is a little scratched3.It was kinda just dirty. The back camera had some stuff around it same with the speakers. Not hard to clean it but just work I didn’t want to put into a new (ish) phone lol4.It took me over 2 hours to get it set up. It needed to be updated but after a little over a hour of it trying to update I gave up and restarted the whole process. It worked the second time but the phone got so hot from doing all this.I decided to just keep it for a bit and see if it’ll have any issues (it’s only been a day ) but no issues (yet ?). I also realized that the chips were just a screen protector so that’s good.So kinda a rough start but so far I’m liking it.","helpfulVotes":3},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Good","date":"Reviewed in the United States on February 5, 2025","body":"It was good, just the battery was to low from what I expected"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Its okay","date":"Reviewed in the United States on January 3, 2025","body":"Was worth it to save money but i do think for the price the phone could have come with a Real apple charger at least. However my son uses it with no issues the camera lenses are scuffed up."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Renewed is good, as long as...","date":"Reviewed in the United States on September 27, 2024","body":"In September 2024, I purchased a renewed Apple Iphone 13, when it arrived I (as always) put a glass protector on the phone before starting it up.  When I placed the glass protector on the screen, the glass protector would not adhere around the edges of the screen (yes, the two dust dots in the middle of the screen are my fault in the picture above).  I have not seen this problem before but it looked like a liquid must have damaged the screen under the prior owner(s). Battery capacity for a used phone was fine at 86%, one of the camera lenses had a scratch right through the middle.  Perhaps this is the difference between Amazon renewed and premium renewed. Other than the inconvenience of sending it back for exchange, I have purchased other renewed items and this is not major disappointment because of the return policy.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Shows they don’t truly test these","date":"Reviewed in the United States on January 14, 2025","body":"My upper speaker is broken. It’s either completely silent or it sounds like static. The battery is 88% which is disappointing as it’s supposed to be guaranteed 90% at LEAST. The appearance is good with minimal scratches.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"Buyer Beware - Faulty Phone - Poor Customer Service","date":"Reviewed in the United States on February 5, 2025","body":"Ordered 3 phones in late October 2024.  They were Christmas gifts for my wife and kids.  The phones weren't opened and turned on until shortly after Dec 25th.  Two of the phones work perfectly.  My wife's phone freezes frequently.  Woot the seller hide behind the return/refund policy being 90 days and pushed me to Amazon.  Amazon wouldn't do anything either.  I called/emailed both companies several times.  I even took the phone to Apple and they ran diagnostics which indicated the faulty part that was installed when it was refurbished.This is the best part.  I received this communication back from Woot and thought they finally were going to help... Unfortunately when I requested the return package they went back to the refund/return policy.  It just shows they aren't consistent and don't have their act together.  I've purchased my wife a new iphone and will try to sell the faulty one back for some small credit.Feb 2, 2025 2:30 AMHello there, I'm sorry to hear that about your item. Unfortunately, we cannot offer a replacement as your request was received outside of our 30-day return window. ( https://www.amazon.com/gp/orc/returns/homepage.html/ref=orc_surl_ret_hp?fg=1)​ However, the item is still available on Amazon if you would like to re-purchase it. If you prefer to return the item for a full refund, you can contact us back so that we can help you with a prepaid return label. I realize that asking you to contact us again would be disappointing. However, we really feel that this is the best way to assist you with this concern. Thank you for understanding, and we appreciate your patience. I hope to hear from you soon. Best regards, Charles Spurgeon Thank you. Woot.com","helpfulVotes":12},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Nice phone but...","date":"Reviewed in the United States on January 4, 2025","body":"The phone looks great and works great except apparently it has not been removed from the previous owners account. It doesn't seem to want to do it itself. Going to need help with that.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Decent but could be better for excellent","date":"Reviewed in the United States on November 21, 2024","body":"I had received this phone with decent scuffs and dents as expected. But as a surprise it had a decent battery life at 94%. I had bought 2 iPhones at the same time. The blue one with 94% dropped so quickly to 80% battery life. It overheats constantly and can run slow at times. The pink one arrived with 85% and has only dropped to 83%, It has been 3 months."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Satisfied","date":"Reviewed in the United States on December 8, 2024","body":"Was a little scratched up when I got it, and you can tell by how long the battery lasts it’s used, but it works just fine and overall is in great condition. Great option if you need a new phone but can’t afford a brand new one"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Estéticamente intacto pero batería degradada","date":"Reviewed in the United States on January 16, 2025","body":"Esperaba que al precio está por lo menos llegara con la batería al 85% por que una batería al 80% está casi para remplazarla. Estéticamente perfecto."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Has an error message about non conforming parts","date":"Reviewed in the United States on January 8, 2025","body":"Something was replaced on the phone that did not meet Apple specifications.  Everything works fine but that little notice message is aggravating"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Defective Charger","date":"Reviewed in the United States on September 18, 2024","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    The phone arrived decent the charger after two days started having shortage problems. I instantly contacted Amazon they informed me they’d contact the seller for a new charger or a partial refund I have not heard back from the seller at all. Amazon says my only option is to return the phone. I brainstormed phones and retailers for months this is NOT the solution I wanted. I’ve put all of my business apps and Apple login on the phone now I have to remove all of it and stop work again. This is going to be a huge hassle. I have to send the entire phone back because of a charger. Which I will be doing.","helpfulVotes":6},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Came Dirty, with Malfunctioning internal speaker","date":"Reviewed in the United States on May 8, 2024","body":"I waited a few weeks to post a review just in case problems started cropping up and I’m glad I did. Two things:Immediately upon unboxing the phone, I noticed it was dirty. Like, gunk caked on the sides where the buttons are and on the bottom where the speaker/charger port is. It looks like someone took someone’s phone out of its case after prolonged use and just put it in the box.Secondly, as SOON as I started using the phone, I noticed that I could only hear calls via speakerphone. The other person could hear me just fine, but I couldnt hear them through the internal ear piece speaker next to the front camera. After countless google searches, trouble shooting forums, hours cleaning out my speakers with isopropyl alcohol, resetting my network features, you name it. It turns out it is NOT a software bug, and the phone itself is defective. The sound from the internal speaker is either muted completely (no audio) or its extremely distorted, crackling, sounds like terrible radio static, etc. The only thing that seems to fix it (temporarily, i have to do this several times a day) is by pressing down on the screen a few inches under the front camera. And even then I have to play a guessing game with where and how hard to push!Amazon has this product listed as ‘inspected, tested, and refurbished as necessary to be fully functional according to Amazon Renewes Standards.” No one even made sure the phone I received was CLEAN, let alone functioning properly. I could've had the same experience, taking a hand me down phone from a friend or family member, and probably wouldnt have had to pay hundreds of dollars for it. A partial refund would be nice, considering I was quoted $100 to fix the speaker on a phone that was already supposed to be fixed, but I dont have much hope. My other phone was in far worse shape and I technically cant use it, or else I would return this altogether.","helpfulVotes":4},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Beware lower battery capacity","date":"Reviewed in the United States on September 17, 2024","body":"The phone looks terrific and it works fine, but I was surprised that buying \"excellent\" renewed came with an 80% battery minimum - I didn't investigate this in advance so mea culpa - just be aware.  I'd have gone with \"good\" or \"acceptable\" if I'd known - it's in an Otterbox case with a glass screen protector anyway, no one sees the case.  I do loke the Apple iPhone 13 - the battery life is an improvement over my iPhone 12 Mini - and I didn't want to go with a 14 or 15 as I bought right before the 16 was released so I knew those prices would be dropping - I'll probably upgrade next fall.","helpfulVotes":2},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"The quality","date":"Reviewed in the United States on January 16, 2025","body":"The phone is in good condition, it's almost new but the battery is not good, it has completely deteriorated"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Phone was dirty","date":"Reviewed in the United States on October 31, 2024","body":"Phone came pretty quick but it wasn’t in the condition I was expecting at all. It was dirty. I’ve never had a refurbished phone that came dirty. The screen protector was already on (that’s not supposed to be there), came set up (that’s not supposed to be like that), overall felt like the phone was probably stolen and sold to me.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Heavy","date":"Reviewed in the United States on January 18, 2025","body":"Heavy duty case. Plastic screen covers are poor. Need to get glass cover to ensure a \"bubbleless\" look."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"A little more damage than expected.","date":"Reviewed in the United States on January 13, 2025","body":"I knew this was a refurbished phone but the three little lenses had quite a bit of damage."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Iphone 13","date":"Reviewed in the United States on January 1, 2025","body":"It came with a few dents and scratches but the phone itself works perfectly fine."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Mixed Feelings","date":"Reviewed in the United States on August 11, 2024","body":"I was using my iPhone 8 before this, so I have to say this was a major upgrade.The reason I am rating this 3 stars is because, it was a minor chip at the top of the border of the phone and at the bottom as well, and I bought the phone in excellent condition. Then the battery health is also 87%, and again, I bought the phone in excellent condition.Don’t get me wrong, the battery is still a big and huge step up from my previous phone, the performance is amazing, and the camera quality is just awesome. I just felt a little misled when they said it was in excellent condition. I still highly recommend if you’re looking for a phone that’s affordable and compatible!"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"The good - Battery, The bad - Speaker/Phone usage","date":"Reviewed in the United States on December 12, 2024","body":"Speaker is messed up and makes practicality for phone usage limited to speaker and only on high volumes. Yet I got a 99% battery and make it difficult to want an exchange for since I may lose a good battery."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Dudas de calidad","date":"Reviewed in the United States on December 18, 2024","body":"El producto se veía bien y funcionaba, aparente mente, bien. Pero una semana después, de recibido, se esta pegando y la pantalla no funciona bien, realmente no es lo que se esperaba"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Tried to cover damage with sharpie","date":"Reviewed in the United States on February 14, 2025","body":"I purchased the “great condition” iPhone 13 vs the good/ satisfactory options. When I got it the volume up/down and power buttons were very chipped. The phone is midnight blue and seller covered them all with black sharpie. With natural light it shined right through - tacky. When I tried to charge it for the first time there was a huge amount of when I’d consider pocket lint in charging port- dirty. Got a case to solve this, but disappointed","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Articulo deteriorado","date":"Reviewed in the United States on January 21, 2025","body":"El artículo vino chimado con distintos colores"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Fair","date":"Reviewed in the United States on December 16, 2024","body":"The phone had visible scratches around the phone and camera plus the loudspeaker for the phone was not working. The charger that came with the phone was a slow charger"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Item defective keep dropping carrier","date":"Reviewed in the United States on December 31, 2024","body":"Item in good shape was just defective."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Speaker problems","date":"Reviewed in the United States on November 28, 2024","body":"Phone is good bt phone speaker voice not clear to much dusty and left side speaker not working…","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"seller i purchased from did not do their jobs \"renewing\" this phone.","date":"Reviewed in the United States on February 26, 2025","body":"phone arrived at 81% battery health out of the box. first major red flag. i put up with this and said ok whatever, and used it for another month. after this month of use i also noticed a very subtle warp in the frame that prevents any screen protector (out of the 3 different brands i have tried) from laying perfectly flat without any air bubbles, which i had previously just chalked up to user error... until it happened for a fifth time in the same exact spots as the previous four attempts... naturally, i contacted seller (since at the time i purchased this, this was only available through an external seller and not directly from amazon). i told them it was false advertisement to sell a phone as \"refurbished\" when they clearly made no effort doing anything to actually refurbish it, and that if i'm going to have to get repairs done myself, i wanted to be reimbursed. i was basically just told \"nuh uh\" and that my only option was to return it. seems to be some quality control issues here, i would recommend saving and just getting a new one over this poor excuse for a refurb because it is not worth the money. absolutely livid. i am thankful that i am able to return this at all though. went and bought the same phone brand new for $100 less at walmart instead.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Disappointed","date":"Reviewed in the United States on February 28, 2025","body":"I’m very disappointed in the phone. The battery health is 60%!!!! Now don’t get me wrong, I know this is supposed to be a “refurbished” phone. But when I think of excellent condition with now me having to go and spend and extra $100 dollars for a battery replacement makes the phone not the greatest value.  Disappointed"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Not excellent condition as stated","date":"Reviewed in the United States on May 12, 2024","body":"When I bought this it said it was in excellent condition, but upon receiving it I found that my four year old iPhone 11’s screan was far less scratched. There are three or four deep scratches, along with a crack on the back of the phone. It’s very scuffed up all around the sides of the phone, which again my 11 was in waaayy better condition aesthetically. The camera is fine, what you’d expect from an iPhone with nothing wrong. Battery was at 87% when receiving which is good for a used phone.Again just disappointed by the shape this “excellent” quality phone was in. I also noticed the piece of paper that arrived with it said the phone was B grade.That’s my only gripe tho","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Not in excellent condition…","date":"Reviewed in the United States on August 17, 2024","body":"Phone was delivered two days early, which was awesome since i lost my phone and wanted this one as soon as possible. However when it arrived it had a big crack across the top of it on the back side. The sides on the back have dirt in them and in some spots it looks like the back panel is chipped and clearly has been dropped. The package did not have any cushioning, it was in a big box with just a plastic bag around the phone. Other than that I am very happy with this, however I would not have classified this phone as being in excellent condition.","helpfulVotes":4},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"product overall okay, calling doesnt work unless its on speaker","date":"Reviewed in the United States on February 27, 2025","body":"I cant make normal phone calls i have to answer everything on speaker. This is inconvenient , I cant take personal phone calls or private phone calls becaus everyone can hear everything. Ive messed with every setting even factory reset the phone. now i have to take it directly to apple to fix this issue."},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"Not unlocked","date":"Reviewed in the United States on December 4, 2024","body":"Bought this for my daughter for her first phone. Stated it was unlocked however xfinity said they are not able to connect it to our line - says it’s common for them to say it’s unlocked but it’s actually not. I purchased on amazon because it was returnable incase something like this happened but it’s been absolutely impossible to return.  Apple products apparently can only be returned by ups pickup and you have to be home when they come to get it. I have spent every day sitting at home afraid to even shower that I’ll miss them and it’s been a week of no show!!!! Amazon is useless and says you need to call UPS but they are useless too and haven’t been able to connect me to anyone who can help. They won’t let me drop it at the UPS store either. I’m so frustrated and can’t get it returned and get my $400 back!!!!! I had to buy a phone at xfinity and pay double so definitely want this $400 back! Buyer beware-  don’t buy this- they lied when they said returnable - UPS will not pickup (yet my status says “picked up”  UGH! They need to make this returnable to the UPS store- it makes no sense to me why I can’t !  Trying to figure out who else I can contact (besides a lawyer next )Update: Finally the correct  UPS came and picked it up after another ups driver showed up without even a label or receipt - after about two weeks of waiting for them- it’s holiday season and I know they are busy but it was very poorly organized. I finally have a refund however!","helpfulVotes":20},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Wrong color, wrong charging cord","date":"Reviewed in the United States on September 18, 2024","body":"I was sent a black phone instead of the red I ordered from 2nd club. The phone charger it came with does not fit the phone.That said the phone looks pristine — no dings or scratches. 87% battery life. I will keep it because it’s too much trouble to return. I have other charging cables I will use. I am so happy to have a new, functional phone, but the customer service from 2nd club is pretty cheesy.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Works","date":"Reviewed in the United States on September 12, 2024","body":"Purchased this; suppose to be in excellent condition. Mine has some kind of glue around the camera lenses as if the last owner had something decorative around them. iPhone battery came at 89% which is a bit low for being labeled excellent condition. My iPhone 11 has better battery life than this 13. Other than the glue around the lenses and the meh-ish battery life the phone is fast, looks good, and works as intended."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Came with 82% battery life, has trouble calling","date":"Reviewed in the United States on February 20, 2025","body":"Phone came with 82% battery life and it glitches.Also have had to restart my phone multiple times a day to get the phone to call or text, it usually just says “call failed” multiple times in a row and I check with the service provider and it’s not on their end"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Get what you pay for","date":"Reviewed in the United States on November 10, 2024","body":"Phone was in good condition, not great. Several chips taken out of the finish of the phone around the edge and around the camera lenses. Did not affect the functionality in any way.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"what??","date":"Reviewed in the United States on March 5, 2025","body":"i would give it five stars, since the food is good, but a little laggy on imessage facetime even though its only a little every few minutes, still annoying. but, my main complaint is the delivery. it was 2 days late, and it arrived on a oil rig truck...like wtff? sounds veryyyy weird to me..."},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"Beware of This Company! Faulty Products and Terrible Service","date":"Reviewed in the United States on August 26, 2024","body":"I purchased a refurbished iPhone from this company in December, hoping for a good deal. Unfortunately, what I received has been nothing but a headache. By March, the phone started giving my daughter problems, and that's when the real nightmare began.I contacted the company, explaining the issues and requesting a full refund, which I was entitled to under their policy. Instead of honoring the refund, they offered to fix the phone. I reluctantly agreed, hoping they would make things right. I sent the phone back to them, providing all necessary information, including the passwords they needed to access the device.After what felt like endless back-and-forth, they returned the phone to me, claiming they couldn't access it, even though I had provided all the information they requested. To my frustration, the phone was still not working when I received it back. I couldn't continue dealing with the situation at that time because I had to leave the country.Upon returning, I decided to take the phone to a professional store to see if they could fix it. I visited two different repair shops, and neither could do anything to bring the phone back to life. At this point, it's clear that this company sold me a completely defective product and failed to fix it when given the opportunity.Not only am I out the money I spent on this phone, but I am also stuck with a completely useless iPhone. This company stole my money and neglected to resolve the issue they caused. It's shocking and disappointing that Amazon even allows such companies to sell on their platform. I trusted Amazon to vet the sellers they work with, but clearly, that trust was misplaced.Save yourself the trouble and avoid this company at all costs. They do not stand behind their products, and their customer service is a joke. I'm now left without a phone and with a lot of frustration.SHAME ON THIS COMPANY and SHAME ON AMAZON for letting them operate on their platform!","helpfulVotes":70},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Excelente","date":"Reviewed in the United States on December 24, 2024","body":"Tiene buena cámara toma buenas fotos"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Inaccurate Description","date":"Reviewed in the United States on March 15, 2025","body":"Definitely not in “Excellent condition”. Small chip on the corner screen and both the power and silence buttons are sticky ://This is after I ordered one and the main speakers didn’t work. Now I would like to return this one but it’s a hassle to keep returning."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"El zoom de la cámara frontal da las imágenes borrosas","date":"Reviewed in the United States on February 28, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n    Para tomar fotos o videos con la cámara frontal, presenta un problema, se ve borroso al hacerle zoom del 1x en adelante. Hice los ajustes desde la configuración y no se solucionó. Lo demás funciona muy bien, pero la cámara es algo importante en el uso del teléfono."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Some little issues","date":"Reviewed in the United States on January 28, 2025","body":"It keeps having a box pop up asking me if I want to “transfer my data” from another device that is currently active..but I don’t have any other devices that are currently active!It won’t stop! It’s so annoying, especially in the middle of calls. Also, sometimes it notifies me of texts but other times it doesn’t. This was a birthday gift from my husband…I’m grateful, but would’ve rather he spend more for a better option"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Bought the best quality","date":"Reviewed in the United States on December 5, 2024","body":"Loose charger"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Not excellent. Fair at best.","date":"Reviewed in the United States on March 2, 2025","body":"Scratched to hell, not excellent. But I need a phone and don't have time to return it as my iphone 12 broke. However Amazon gave me an additional 20% discount off the phone for the inconvenience, hence why it got 2 stars instead of 1."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"No original batterie","date":"Reviewed in the United States on November 16, 2024","body":"It looks in good shape, nevertheless the batterie is not original, let’s see the performance of the phone. I’ll keep you posted"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"It had scratches","date":"Reviewed in the United States on December 28, 2024","body":"We got the green one for our daughter. When we got it it had a bunch of little scratches on the screen on the edge.  We decided to keep it since it was a Christmas and let her decide if she wanted to return or not. She decided to keep it since the phone case will cover much of the scratches. We just like to get what we paid for. Yes, I understand it was refurbished but we have bought one before and it didn't have any scratches or damage to it. Otherwise it probably have a 5 star."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Not satisfied. Cracked. Locked. Not what I expected.","date":"Reviewed in the United States on December 8, 2024","body":"This was a horrible experience. I do not have a phone that works. So I saved money over the year to buy a new one. But when it came it wasn’t even good. Like the product suggested. They said it was checked by many people, but I think not. The phone is cracked. I also ordered it unlocked to have it transferred to my carrier. But it came locked, and it’s a very long process to get it unlocked. But even that I couldn’t do. So now I have to go through life with my broken phone."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"GOOD AND BAD","date":"Reviewed in the United States on March 15, 2025","body":"Was a great deal but I paid for “excellent condition” and it doesn’t look like EXCELLENT, it has some scratches on the screen and the frame, the battery condition is to low, I probably just return it or ask for a replacement"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Unrecognized camera","date":"Reviewed in the United States on June 27, 2024","body":"I understand I purchases a renewed phone but I bought it for the camera - which was obviously the part that was renewed since I had an alert after powering on.  I guess I wonder if the camera truly functions like a brand new Iphone13?  The phone also makes a high pitched sound every now and again when charging so I’m not 100% sure I’ll keep it.  I understand this is a risk for buying renewed.  It was shipped quickly and its condition is really great."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Phone ear speaker didn’t work (updated review)","date":"Reviewed in the United States on May 23, 2023","body":"Updated Review:I returned the phone and got a full refund. I still wish that the inspection of the phones were better. It is annoying to go through the process of ordering, testing the phone, then having to return it. I did end up buying another Refurbished iPhone on Amazon. There are a number of third party distributors that work with Amazon. I used one of the other higher rated vendors, and am now happy with my phone.—-Old Review:The phone I received could not be used to make calls, as the ear speaker didn’t work correctly. The speaker was completely garbled. I wish they had better quality control. I have returned the phone and am waiting for a refund. I will increase my star rating slightly once the refund goes through. But I would be weary that another issue would be present if I tried to order through them again. It’s a long process to order, receive, return, wait for a refund. How many times would someone want to go through that process in order to get a completely working phone?","helpfulVotes":4},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Pantalla cambiada (tener cuidado)","date":"Reviewed in the United States on November 10, 2024","body":"La pantalla estaba cambiada y el protector que quise ponerle no se pegaba como debia.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"iPhone 13","date":"Reviewed in the United States on November 23, 2024","body":"Looks good but several quirks. Most irritating thing is constant return to beginning when scrolling!"},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Signs of wear and teat","date":"Reviewed in the United States on November 17, 2024","body":"Scratched and 80 % battery life , bought it as “mint condition “"},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"Was not quality like they promised","date":"Reviewed in the United States on August 17, 2024","body":"We ordered and it came in timely fashion. I waited two days to open it because I was waiting for my screen protector and case I ordered from another place and didn't want to break it in the meantime. When we opened and put on screen protector and case, it would not charge normally. The only way it would charge was if you pulled up on the cord which is not efficient. We purposely bought a refurbished excellent one so that it would be excellent quality.It took a few days for the company to respond to our request for a refund/exchange and within that time frame, over a week will have passed before I can order a new one due to the money being tied up waiting for the refund. We sent back yesterday and hoping it doesn't take much longer.To add to the frustration, we specifically ordered this during Ohio's tax free week so we saved money on tax on this purchase, but because it was not the quality they promised, we asked to exchange it so we could save the money on the tax again. They said they couldn't exchange (even though this company had other phones on here to sell-not like I really wanted to buy from them again anyways due to honesty issues). So we, lost 30-35 dollars because we now have to pay taxes on a different product and the time wasted because my other phone went to crap in the mean time and I was expecting theirs to actually work when we received it.Will not be purchasing from this company again. Not quality or honest with their sales.","helpfulVotes":28},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"iphone","date":"Reviewed in the United States on November 10, 2024","body":"some what like it because sometimes it want let me text","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Not that bad","date":"Reviewed in the United States on August 27, 2024","body":"The phone is in good condition, no scratches or anything but it does  overheats quickly , when I first received the phone the battery life was at 84 % not even one week of usage it went down to 81 % which is very disappointing . The screen is good in general and overall it’s a good phone for the price but if you like a higher quality I’d say buy it at apple ."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Not holding a charge","date":"Reviewed in the United States on April 12, 2024","body":"I received this phone in the mail the other day was super excited it looked to be in great condition but now that i’ve got all my info transferred over, literally everything, it’s not holding a charge and i can’t get into it because it’s dead. My brains telling me no biggie just return it, however i can’t reset the phone with it being dead, meaning if i were to return it all my info is going into who knows who’s hands. Struggling with the debate of risking it all (my information as well as my clients for work) or just taking the $500 loss.Just save yourself the trouble and buy a new phone from apple if you want a new apple phone.","helpfulVotes":1},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"This phone is not unlocked","date":"Reviewed in the United States on March 9, 2025","body":"This is a scam, it says it’s unlocked but it’s locked. And now I have to return it.Other than that I didnt even get to check out the phone yet bc I couldn’t transfer…"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Battery life problem","date":"Reviewed in the United States on February 27, 2025","body":"Battery life only 79%! - this is not the renewed optimal iPhone 13 that I would expect.  I’m waiting for the seller to get back to me and will post additional review."},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"DO NOT BUY!!!","date":"Reviewed in the United States on February 21, 2025","body":"If I could give negative stars, I would. I purchased a renewed phone as a gift for my mom. For months she struggled with phone calls dropping and the phone randomly restarting. We have very touchy carrier coverage in our area, so we thought it was attributed to this. After the issues got worse, we reached out to Apple and they ran a special diagnostic test resulting in issues that they said “come with a bad phone that has not been properly restored.” I reached out to the seller, and they refused to provide any type of support. I then followed up with Amazon, who sent this reply verbatim to me “The A-to-z Guarantee protects buyers when they do not receive an item or an item does not match its description. Although we understand your disappointment, you received the item and the item matched its description.” So I guess because the item matched the description of “iPhone,” they’re covered - who cares if it actually works, right??? Ridiculous.","helpfulVotes":2},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"No era el color que había comprado","date":"Reviewed in the United States on October 14, 2024","body":"Compré el iphone 13 de color blanco Starlight pero me enviaron de color azul. Sin embargo el equipo funciona bien y llegó algunos regalos en el paquete."},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Cuts off without warning","date":"Reviewed in the United States on March 9, 2025","body":"Phone is as described physically. Unfortunately, I’ve had the device for LESS than 48 hours and it’s already buffered, frozen, then turned off 3x. Will ABSOLUTELY be returning."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"El teléfono no funciona en mi pais","date":"Reviewed in the United States on July 28, 2024","body":"El teléfono está en excelente estado pero al momento de poner la sim para usar en Colombia se queda bloqueado con este error: \"tarjeta sim no valida\" he averiguado y me dicen que debo pagar a Tmovile una cuenta pendiente de un usuario  anterior, para desbloquear la sim. Es esto cierto  o que debo hacer para poder usarlo en Colombia?"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Excellent condition?!","date":"Reviewed in the United States on January 31, 2025","body":"The phone looked good, that’s where the “excellent” condition ended. The bottom speaker/mic openings were FULL of dust and Lord knows what else. The battery maximum capacity was only 82%. The charging brick I received doesn’t work. I am not excited about this “excellent” “renewed” product."},{"reviewType":"critical","reviewerName":null,"rating":1,"title":"It came with a defective screen","date":"Reviewed in the United States on December 29, 2023","body":"Update: I had thought it was a screen protector it came with that was peeling away & leaving bubbles under it. It turns out that the screen itself was peeling away! Next thing I know, it began crackling and spreading. I’m now trying to return it. A refurbished product should have better quality control. I’m disappointed that the screen is falling apart like this. It has been in a new otterbox since I bought it. So it was NOT a screen protector.When I got this, I was really excited because I needed to upgrade from an old iPhone. This seems to do the trick except that it came with some sort of screen protector that I did not know was on it. As I was putting my OtterBox case onto it, one of the corners of the screen protector suddenly started peeling up and now has an air pocket underneath it at each of the corners. When I try to press the corner back down to get the air pocket out from underneath it, this weird screen protector suddenly cracked and is now spreading across this screen protector.  I’m thankful it had a screen protector but the screen protector isn’t doing a good job when itself is peeling away from the screen. Now I’m gonna have to remove the screen protector and replace it with another one. That was a waste of money. The battery life is pretty good. I checked it and they guarantee it to have at least 80% of the original battery life and this came with 84% so that works. The size of the screen is pretty darn good and easier for me to see. There are a lot more features to this 13 model than the word to the seven model which I’ve been using so I am pleased with the Apple iOS.","helpfulVotes":24},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Microphone not working well","date":"Reviewed in the United States on February 26, 2025","body":"Product was in good physical condition, but microphone is really low quality or malfunctioning. Makes phone calls very difficult."},{"reviewType":"critical","reviewerName":null,"rating":3,"title":"Bien, aunque no fue el color elegido","date":"Reviewed in the United States on October 5, 2024","body":"El celular está bien, aunque tiene algún arañazo y el color no fue el elegido .Vino con 88% de batería"},{"reviewType":"critical","reviewerName":null,"rating":2,"title":"Very insufficient battery life","date":"Reviewed in the United States on October 9, 2024","body":"This iPhone 13 came in the mail at 32% battery and I figured it was no big deal, just put it on the charger. Sadly this phone does not stay charged, and it doesn’t hold a charge for long. I’ve had this phone for only 48hrs and I’ve had to put it on different chargers six different times already. As I write this the phone is on a charger yet again at 21% which is four hours after it said it was at 100% battery. This phone is cosmetically nice with an unscratched screen and no dings in the actual phone, but if it doesn’t hold a charge I can’t use it consistently so I don’t care how pretty it is. The seller was a very nice person, but “nice” doesn’t give me a phone I can keep charged."}],"reviewCount":0,"reviewAvgRating":null,"status":"completed"}