{"reviews":[{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect condition iphone! No scratches and 99% battery","date":"Reviewed in the United States on February 22, 2025","body":"I bought an amazon renewed excellent condition iphone 13 from the seller bayshine trading. My expectations were low and was completely fine with having scratches on the phone and low battery health. But when I received my phone my expectations were beyond exceeded. My phone has no scratches anywhere and has 99% battery health! The phone did come a little 'dirty' on the edges but came off easily with an alcohol wipe. It takes a charge perfectly, camera works and looks good, sound quality is perfect. Everything I've tested so far works like new. Of course everyone will receive a different renewed phone but I think with the extreme discount a renewed phone gives (refurbished off bestbuy is 500, i paid 300 on amazon), as well as guaranteed 30 day refunds and returns, it is 100% worth it. I will be buying renewed iphones off amazon for all my future phones! :)","helpfulVotes":35},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality!","date":"Reviewed in the United States on March 4, 2025","body":"Phone arrived earlier than delivery date, and came in near perfect condition! Screen and back look great! Just small dings on one top corner. Battery life is at 82% Upon opening. Phone is working great so far! Definitely worth the price! Would recommend this seller to anyone looking for an iPhone in good shape! Not sure on other colors but with the pink I would assume mostly females have owned them previously and most women I know keep their phones in cases so that probably contributes to the quality of the specific phone I ordered so keep in mind who would have owned the specific phone you order!","helpfulVotes":6},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect purchase for the $$$$","date":"Reviewed in the United States on February 27, 2025","body":"Only complaint was the delivery, says overnight and took 4 days to arrive.Phone overall is a 5star Works just fine. I upgraded from my 11 to this 13 and im pleased with my purchase. Local stores wanted 600$+ and limited colors. This Came with a screen protector already installed and the charger wire which i was not expecting so that was a plus for me. 2/27/25 is when I receive my phone. if anything changes ill update. for now, Im definitely buying another one for my work phone. Price is right, condition is excellent. Few minor scratches marks from previous phone case but for a used phone no complaints looks new.","helpfulVotes":11},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Quality","date":"Reviewed in the United States on January 6, 2025","body":"I bought this iPhone 13 128GB Starlight, and since it’s a renewed product, I was quite nervous when I first ordered it. However, when it was delivered, it was amazing. The exterior was in good condition, the frame was nice with no scratches, and even the back and camera worked well. After setting up the phone, I checked everything and was very satisfied to find that the screen hadn’t been replaced, it’s the original screen. Overall, everything is great. The reason I gave it 4 stars is because the battery capacity is only at 85%. If it were higher, it would definitely deserve 5 stars. But for a renewed product, this is already excellent","helpfulVotes":25},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect","date":"Reviewed in the United States on March 4, 2025","body":"My boyfriend needed a new phone very bad and we were tight on money and didn’t want to spend 1k plus for a new one. I was very skeptical buying a phone online, as of course you could really get anything. But this phone is literally perfect. It took a couple days to get here, and it was perfectly unscathed. No scratches, no cracks, and it functions so perfectly. It’s as if we got a brand new iPhone. I definitely recommend this product. Also for reference we bought the best condition option. 100% worth it!","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love love love! Best value than anywhere else.","date":"Reviewed in the United States on March 9, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Overall great product for the price! I recieved just what I asked for, iPhone 13 with 256 GB storage in the color Pink. The phone came in great condition, no dents, scrapes or anything like that, just a few normal wear scratches on the screen, but very very small and minor. Cameras work fantastic, I have no issues with glitches and the provided charging cable worked 100%!The only few complaints I have are: I did pay for excellent and got a maximum capacity of 81% battery, I would expect a higher number for the condition I payed for; Also, under the 'what you'll get' list says that I should've gotten the SIM removal tool and I did NOT get one. And lastly, there are some areas that have what looks like dirt specks in small crevices, nothing too major and you can't really see it unless you're 10 inches or closer. Charging port also looks a bit dirty but it charged fine and fast with the cable provided.Final grading: 9.3/10, would buy again!Although there were a few let downs like Battery MC and missing the SIM tool, the value for the item in its condition is absolutely worth it.","helpfulVotes":2},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mediocre","date":"Reviewed in the United States on January 27, 2025","body":"I ordered the iPhone 13 pink, it came today and the phone itself overall is emmaculate condition. There are no scuffs or scratches anywhere or dents. No screen damage or issues. My only complaint is that I ordered this in “excellent” condition and the battery health is 88%. Apple recommends replacing batteries after 85%, so this battery isn’t really that great overall. Anything above 90 would’ve been much preferred but overall this was a great purchase for the price. Color is super cute in person.Update: 3 days later I am updating my stars from 4 to 3. The battery health % has already dropped to 86 from 88 in 3 days. This battery is not good anymore like I mentioned in my previous review. It already needs replacing or the replacement this seller used is garbage.","helpfulVotes":32},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I recommend. (Read if your concerned it’s not worth it)","date":"Reviewed in the United States on March 15, 2025","body":"No I’m not a bot. Even tho it was delayed by a day. Which is fine. The phone came basically brand new. No cracks or scratches or any residue on the front or back, or sides. 100% battery health. The picture quality is super good, feels great, doesn’t lag or anything, battery lasts a long time from one charge to 100% depending on what you do, the brightness of the screen is nice as well, and it’s easy to set up, i transferred my data from my previous iPhone to this one. I basically saved $200-300 on a brand new phone. Nothing about it feels refurbished, it feels and runs like a brand new phone.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great emergency replacement phone","date":"Reviewed in the United States on February 24, 2025","body":"I took a gamble and mine was about 83% battery capacity which is worse off than most, but I don't use it much except next to a charger. its run speed is great, it came in six hours, which is ridiculously fast. there's no cracks or scratches on it anywhere and i had no troubles with service this one's better off than my cracked broken 12 so I'm pretty happy with it."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Mostrar % rendimiento de batería","date":"Reviewed in the United States on March 6, 2025","body":"Se debería escribir en las especificaciones el rendimiento de la batería (ej 85%) ya que que el que compre dice 83 % x lo tanto va a tener muy corta duración esa batería, en ese sentido estoy decepcionado)"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's okay, but........","date":"Reviewed in the United States on March 5, 2025","body":"The phone is nice, but was not equipped with a new batterie. The batterie is 80%. It should be 100% in my opinion. Update…… the screen had a flaw and the alarm didn’t work. The phone had to be returned.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far, so good.","date":"Reviewed in the United States on March 10, 2025","body":"Arrived on time. In good condition. Had to charge upon arrival. Device got pretty warm and hoping this won't be an issue. Battery health is 84%. Fingers crossed it will last a few years."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery max capacity below promised","date":"Reviewed in the United States on February 22, 2025","body":"Phone condition is good in general. But it was not up to Amazon “Excellent” rating level, as it was stated in description. The biggest concern and disappointment is maximum remaining battery capacity of 76%, instead of expected 85 and above. Screen, camera and body are fine, couple of light scratches on screen still can be found.","helpfulVotes":6},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Muy buena compra","date":"Reviewed in the United States on March 11, 2025","body":"Todo en perfectas condiciones sin ninguna queja, lo único es que no trajo el pin para la bandeja de tarjeta sim, me llegó con 86% de batería."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Non-Apple Parts and dying battery","date":"Reviewed in the United States on January 31, 2025","body":"Overall, the phone was in good shape externally. Clean & scratch free.However, the battery was at 87% lifespan and apple recommends replacement at 80 so it is near the end and the battery dies rather quickly for an iPhone 13.The screen was replaced with a non-apple screen.* There is a constant pop up that tells me about the non-standard part.* The right side of the screen isn't correctly aligned with the display so typing p or backspace is difficult.* The screen has some halo when displaying certain things.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on February 27, 2025","body":"Bought the phone in good condition. It came close to perfect with minor scratches and the battery health at 89%. The only gripe that I have is that there could've been better packaging and there was no included charging adaptor. Otherwise, I'm happy with my purchase!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Price!!","date":"Reviewed in the United States on March 8, 2025","body":"Phone is in great condition, but did not have 100% battery health came with 87%, but for a used phone works great came through the mail pretty quick, works great."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works like new","date":"Reviewed in the United States on January 28, 2025","body":"This was my first time purchasing a refurbished electronic of any kind so I was nervous. Reviews were great overall and you do get a month to return if it ends up being defective. I upgraded from an iPhone 6 which was still working fine but I wanted to find an upgrade before it actually breaks and I'm without a phone. So the upgrade from a 10 year old phone was massive even though this one is already 3ish years old.I received it with about 87% battery life. For about the first week, I was on it constantly all day every day getting everything set up just the way I want it and trying out new features that weren't available on my old obsolete phone. And everything works perfectly. The only way I can really tell it was used was by the scratches around (not on) the back camera lenses, but since I hardly even look at the back of my phone it doesn't bother me.I'm not someone who always has to have the latest tech, so this has worked really well for me. I think I might always choose to just go through a reputable dealer for a used phone anytime I need to upgrade.","helpfulVotes":6},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dirty","date":"Reviewed in the United States on March 7, 2025","body":"The quality is excellent but the outside is a little scratch but its not that bad. BUT it was dirty, like the little holes and sockets ."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Birthday Girl","date":"Reviewed in the United States on March 12, 2025","body":"Good cell phone for being used.  A birthday gift for a 13 years of age girl."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone came fast, pgk’d well, battery has been fine - works well except issue discussed in review","date":"Reviewed in the United States on March 1, 2025","body":"I withdrew returning this iPhone as the problems it is having is something with possibly Fb and messenger as I googled it and then my 2 daughters said they had the same issue — that is grey box popping up as you type in messenger or FB.The phone was in great condition and I have been using it now for 4 days and cancelled the refund if it.  It works great and love it.  Thank you to the company for being patient .. they were great!!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent","date":"Reviewed in the United States on February 26, 2025","body":"Phone looks exactly as advertised, in EXCELLENT condition. You would think it was never used. I put 4 stars only because I'm used it for a couple of days. Delivery was on time as well."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good deal","date":"Reviewed in the United States on January 29, 2025","body":"It’s a fair deal. Came on time, and transferring data from my old phone was easy. Phone is in good shape, a few minor pin marks on the screen and on the back, near to the cameras, but barely noticeable doesn’t bother me. Phone works great, camera and other functions were working properly, battery has 81% life time. Touchscreen became lazy after protector installation, specially for typing. I’m going to replace the protector and evaluate. But I recommend the product!","helpfulVotes":5},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy with my purchase","date":"Reviewed in the United States on January 8, 2025","body":"At first I was kind of skeptical with this product since it was refurbished, but I really liked it! It’s good for the price. It was like it was brand new! And it is indeed an apple product. Not a scam. My only problem was that I ordered it December 17, 24’ and it didn’t get here until January 7th 25’. Probably because it was Christmas.And don’t forget, your SIM card probably won’t work UNLESS the phone has the same carrier. I had to go in store to purchase me a SIM card for 30$. Overall 10/10. Oh and to take my advice get the EXCELLENT version for less complications.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone","date":"Reviewed in the United States on January 7, 2025","body":"i got the phone a day earlier then i was suppose to but the phone battery is at 72. i have prepaid verizon i am going to have to go in the verizon store to try to get it turned on this phone and my old phone have a sim card but when i transferred it messed up i don't know how but i think i disactivated the sim by clicking something that popped up possibly. in other words it isn't as easy as everyone made it seem to transfer the sim card and it automatically turn on. it came wrapped i love this phone and it works great very much needed upgrade.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied with Refurbished","date":"Reviewed in the United States on February 26, 2025","body":"Only have had this a few days, so far, but I am happy with my purchase. I was nervous about buying refurbished (have never done that before) but it feels like a new phone. There was one small scratch/dent on the top of the phone despite the fact that the description said the condition was “Excellent” (which is defined as no scratches). But, it’s not noticeable with a case. Will likely buy refurbished again, in the future."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works fine","date":"Reviewed in the United States on February 12, 2025","body":"I have it a 4 star because I ordered a green one but received a pink one, no issue with the phone except the color. Luckily the wife was cool with a pink one."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pleasantly surprised","date":"Reviewed in the United States on August 23, 2024","body":"So let me start out by saying that I am not one to purchased refurbished phones and whenever something would happen to one of mine and I had to turn it into the Phone company and they would send me a refurbished one to replace mine, there was always something wrong with them. So, that has always made me a little bit gunshy regarding that particular situation.With that said, as a full-time caregiver for the last 11 years, I have not been able to work and unfortunately can no longer purchase the best of the best with the flagship phones that I used to get back in the day. Many of my parents doctors do some video visits and some of them actually prefer FaceTime so as a result, having an iPhone was actually partly a necessity for that reason.I have always been an Android girl, )still have that too), so I didn’t quite know what iPhone I needed to get, but after some research, I finally settled on what I thought would be the best choice for me both with regard to the technology inside and with the price as well as the warranty.I had actually considered either an iPhone 11 or an iPhone 13 as my choice. As we are now on the 15 I found the 13 to be the wisest choice of the two.After researching many different sites, some very reputable and actually recommended by people, I decided to land on Amazon‘s renewed program because I’ve always had a nice experience when there have been any issues with a product and I’ve never had any problems with customer service. They’ve always been very helpful and I thought if anything were to happen with the phone, I would be hoping to have the same type of experience.In looking at the options, I chose to actually pay more to have one that was put forth by Amazon themselves because they offered a year warranty as opposed to many of the others who were a bit cheaper and offered maybe 30 days or so etc.And hey, so far, so good! The Phone arrived. It was in perfect cosmetic condition and I have not had any issues with it since. The battery was at 87% and although I would’ve liked to had it higher than that, I was glad to see that it still was pretty snappy when I needed it to be.So I would say that I have been very pleased so far and I would absolutely recommend the renewed program to anyone interested, but can only speak to the actual product provided by Amazon itself, however, I’m sure many of the third-party individuals that sell refurbished items may have some really good product themselves.Ah…there I go again…refurbished…renewed…to-may-toe…to-mah-toe… well you get the jist…","helpfulVotes":27},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life, scratches","date":"Reviewed in the United States on March 13, 2025","body":"I bought this phone 2 months ago. the battery is like 85. none of the parts were replaced, the screen is intact, and there are no scratches. I admit I was scared to purchase from amazon, but they did not let me dow.n I recommend."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great iPhone","date":"Reviewed in the United States on March 12, 2025","body":"My previous review about this product was not so good due to my package not being delivered. However, when I contacted them, they sent me a replacement and it was actually delivered this time. I’m happy with my purchase and I would definitely order again.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery health","date":"Reviewed in the United States on February 12, 2025","body":"The product was in great condition but there was two things wrong with it it had bad battery health and had scuffs on the sides other than that it was great"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good value and condition","date":"Reviewed in the United States on January 9, 2025","body":"I decided to purchase a refurbished iphone.  I’d purchased one before for my son who needed a replacement and that experience was fine.  So, not wanting to spend a thousand dollars for a new iphone, I decided to get a refurbished one in excellent condition.  And, it was really excellent condition and provided the bump up in storage, functionality and battery life I wanted without the price.  The plus is buying recycled products is much better for our beautiful earth.  Very satisfied customer","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    pretty good condition","date":"Reviewed in the United States on February 19, 2025","body":"it works perfectly; however, it came with a few scratches on the screen. the battery life seems very durable!","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent Phone.","date":"Reviewed in the United States on February 1, 2025","body":"Phone is great works like it’s brand new! Was easy to set up and had no problems transferring. The only bad thing is the battery percentage. Mine was at 86%. Comes with new charger as well.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is worth it","date":"Reviewed in the United States on February 22, 2025","body":"I loved the price of this phone very affordable for this model. The shipping was amazing fully wrapped. It came with a charger. I’ve been using this phone for over a month and there have been no cracks and that’s good because I drop my phone a lot. The weight is also light but heavy enough that it feels like you're still holding something. I approve and give 10/10","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished Problem","date":"Reviewed in the United States on January 20, 2025","body":"I got thos phone for my teenage son for his birthday. He loves it! However, when we got it, the port wasn't working well and had problems with charging. We went to an apple store and they cleaned out the port. There was a ton of dirt in it!Thankfully it works now!","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    IPHONE 13","date":"Reviewed in the United States on March 1, 2025","body":"IPhone 13 arrived in less than a day after ordering. 0pened package,  it looked like it had never been used. Not a scratch on it. Battery health was at 89%. I am well pleased. A shout out to the seller and Amazon. For the price of $320. I feel like I got a fantastic deal."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is highly recommended to buy","date":"Reviewed in the United States on January 28, 2025","body":"I bought this phone after wanting it for a while, but the only slight con I have is the battery capacity was at 86% but it lasts through a whole day of school. So it I recommended 👍🏾","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    YES!!!","date":"Reviewed in the United States on March 10, 2025","body":"I bought mine in excellent condition. And INDEED it is in excellent condition it looks BRAND SPANKING NEW. Battery at 100 % health. Not even one nick or scratch. I would definitely recommend it for the money."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty happy good buy","date":"Reviewed in the United States on December 13, 2024","body":"So far I’m happy with this phone. I had a few problems when first used it. The talk to text and Siri weren’t working. Once I did the updates and Reset the phone it was fixed. They both are working fine now.I’m not super happy with the screen. It’s either too sensitive or not enough. It skips letters on the front screen and along the edges,Over all it’s a great buy. Much better than spending $1000 on a new phone.The phone looks nice barely noticeable that it’s used. There are a few minor scratches around the camera but that’s all. You wouldn’t notice if you didn’t know to look.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Definitely worth the buy.","date":"Reviewed in the United States on February 19, 2025","body":"Very skeptic about buying a refurbished phone. I’ve always bought new. There were a few reviews that had me worried as some customers weren’t satisfied. I took a chance because the good outweighed the bad.Cosmetically there was one small scratch. Nothing major. Screen was flawless.Functionality smooth, and very responsive!Charging speed is very fast. (Impressive)Durability seems really good so far. I’d definitely shop again."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wowzers. Mines was MINT","date":"Reviewed in the United States on March 12, 2025","body":"In perfect condition with 98% battery health what a steal. I was skeptical initially but I’m glad I purchased this. Saved me from having to stick with an android for two years"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Deal","date":"Reviewed in the United States on March 11, 2025","body":"Very great products. I purchased three items and was just trusting the process and you guys didn’t disappoint. I’ll definitely have you in mind whenever purchasing phones. Value for money!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Pleased 😄","date":"Reviewed in the United States on March 13, 2025","body":"The phone was even better in person!! It looks brand new & is such a pretty color of pink. I am very pleased with my purchase 😁"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Incredible value.","date":"Reviewed in the United States on February 23, 2025","body":"I was initially hesitant to buy a refurbished phone. However, I was very pleased. The phone arrived within 48 hours and was in near mint condition. It was also a whipping $300 less than my carrier wanted to charge me.This will definitely hold me over till upgrading to the 17 is in my budget at the end of the year.","helpfulVotes":3},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone 13","date":"Reviewed in the United States on February 4, 2025","body":"works awesome , easy set up, nice screen. the actual phone part though was very scratched and chipped. super fast shipping"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great condition iphone 13","date":"Reviewed in the United States on March 2, 2025","body":"I was a little hesitant about buying a renewed phone but I’m so glad I did the phone came in perfect condition. Also came with a screen protector already on it. Everything works camera, sound & etc. I will definitely buy phones only from here now, I love it!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Steal fasho!","date":"Reviewed in the United States on February 21, 2025","body":"I got my “new” phone in like 3 days from ordering. It is perfect. No scratches no dents. Looks like the original screen and my battery health is at %100 which I always am worried about when getting refurbished phones. Super satisfied with my purchase. I’ve had my phone for about 2 weeks now. Waited to make sure no issues. Thanks for the good purchase!","helpfulVotes":5},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Phone ♥️","date":"Reviewed in the United States on February 15, 2025","body":"Like new condition.BUT, the battery health 81%"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone overall review","date":"Reviewed in the United States on March 4, 2025","body":"Phone is in great condition looks just like the picture & the battery is awesome holds great charge ! My girls were satisfied & so was I ! I would definitely recommend buying !"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Most definitely recommend IPhone 13","date":"Reviewed in the United States on March 7, 2025","body":"I love my new IPhone 13 White. It was easy to set up just by switching my sim card to the new phone. Battery was at 93% & everything looks & works amazing."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 13","date":"Reviewed in the United States on January 15, 2025","body":"Came with white crusty stuff all over. And it sounds weird when I send voice messages..idk if the white stuff has something to do with it but I cleaned it off and other than that the phone calls sound fine and it works pretty good.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 13","date":"Reviewed in the United States on December 10, 2024","body":"I received a good price on this iPhone 13 considering I took advantage of the Amazon store card and got 80.00 off the price. I’m very pleased with my renewed iPhone 13. It only had a very small scratch on the screen.  It was cricket locked which I have cricket service. I switched over the  old phones data etc. with no problem. I was able to keep my original phone number. iPhone sold at cricket wireless are very expensive. They wanted 699.00 with keeping my old number. I paid 240.00 for renewed for the same phone.. I would recommend this seller.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Easiest Experience Ever","date":"Reviewed in the United States on January 10, 2025","body":"FYI if you have an eSIM card on your old iPhone like I did holy crap. So unbelievably simple to transfer service (NOT DATA) to your new phone. Like press a couple buttons on both phones simple. And no getting permission from the account holder if you are on a family plan. Data, ya that’s simple too, as long as you back up your old phone over the cloud or onto a computer. And no bullshit Verizon charges for a “new” SIM card or waiting there! Seriously I’ll never buy a phone another way (yes, I always buy my phones outright, personal preference).Technical details aside, the phone was listed in excellent condition and it is, one or two small dings to the metal sides but otherwise perfect. 80% battery health (which lasts longer than my 2nd generation SE at 92%). I did not realize the seller was sending by FedEx signature required, but luckily it was able to go pick it up at the local shipping center. Packaged securely, no damage in transport.Highly recommend.","helpfulVotes":11},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect buy","date":"Reviewed in the United States on March 6, 2025","body":"Came with no issues and like new. Very easy to set up with wifi and the installation of the Sim card. Excellent buy and would recommend over upgrading straight from the app of your service provider."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just as described!","date":"Reviewed in the United States on March 15, 2025","body":"Excellent condition, just as described. Very fair price. Fast shipping. No issues connecting to our service carrier either! Very pleased. Thank you!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied customer","date":"Reviewed in the United States on March 12, 2025","body":"The iPhone 13 has worked like it should. No problems, shipping was fast and iPhone came in perfect condition with no damage."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost new condition :-)","date":"Reviewed in the United States on March 13, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Ordered from 3rd party companies and received junk that was rusted and dropped in a garbage disposal, which they advertised as “excellent condition”. I got fed up and tried Amazon refurbished. WOW, this thing is beautiful. Only wear is at the top where some color faded from touching someone’s face. No scratches, scuffs or dirt in the speakers…so clean! It arrived in a brilliantly designed package that seals the product in a plastic sleeve, while holding it suspended in the center of the box so it can’t be harmed. ProductRED on the iPhone 13 looks amazing in person, I’ve only ever owned black phones so this is a fun blast of color. Besides the fingerprints I just put on this, the phone looks new."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iOS 13","date":"Reviewed in the United States on January 6, 2025","body":"This is my first iPhone. I was going to rate the product 5 stars but I noticed 2 scratches on the screen after I had the phone for 2 days.  Will keep the phone as you can only see the scratches under a bright light."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nothing but great","date":"Reviewed in the United States on March 4, 2025","body":"10/10 no dings no scratches looks and feels brand new battery life is great also this was a complete steal go for it i ordered the pink one"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Lots of trouble w/ set up","date":"Reviewed in the United States on October 22, 2024","body":"the phone came in very fast, the delivery said it wouldn't be here until around halloween and it came in yesterday. the phone came in super nice minor scratch on the bottom, speakers work, all 3 microphones work. the problem came in when i started to set up the phone. i went through the entire process and got to the part to transfer everything from my other phone to this one and it told me i had to update it. i could not get the phone to update. i let it sit in the update screen for 2 hours and it did not start to update. i had to set up the phone with no transferring to update it. after that i erased the phone again and was finally able to transfer all of my stuff. it was definitely a struggle but i finally got it and am very happy."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone was excellent condition","date":"Reviewed in the United States on January 18, 2025","body":"Phone was excellent condition no complaints battery health could have been a little better than 84% but otherwise I'm satisfied would buy again ."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good for the price","date":"Reviewed in the United States on July 28, 2024","body":"This was my first time buying a refurbished phone, so I was nervous about what I might get, but a couple of days in, I have to say I'm pretty satisfied.First, shipping was very fast! I had the phone in my hands within 48 hours of placing the order, which surpassed all my expectations. It came with a charger (both the cable and block). The phone was dead when it arrived, so I needed to charge it first, but no big deal. The first thing I noticed was that there are some small chips and scratches around the edges of the device, most noticeable on the top, but with a case on, the damage will barely be visible. I've been using it without a case the last couple of days while waiting for the one I ordered to arrive, and even uncovered, it doesn't look that bad. Screen and cameras are in perfect condition. The phone was perfectly clean on arrival too, no dirt or dust.The max battery capacity is 85%. Since I paid for excellent quality, this was a bit disappointing to me and is the reason for me rating only 4 stars, especially after seeing other reviews of people who got batteries in the 90s, but it's still a major upgrade over what I had before (a 2020 SE with only 72% capacity). Overall, I've been happy with the performance so far, especially for the price. I would buy from MobileSupply again!","helpfulVotes":33},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Satisfied","date":"Reviewed in the United States on February 6, 2025","body":"👍"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very Happy with Purchase","date":"Reviewed in the United States on March 13, 2025","body":"Very Happy with purchase. Clean and great battery life left. Would buy from again."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    100%","date":"Reviewed in the United States on March 15, 2025","body":"Fast shipping, phone exactly as described! Well worth the price !"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It came wholesome. Not broken or issues","date":"Reviewed in the United States on March 14, 2025","body":"Works fine. Clean and my daughter is grateful. True to their word service."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Wow!!","date":"Reviewed in the United States on March 11, 2025","body":"Phone is amazing' just like NEW! My daughter loves it. Thank you."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ships by fedex","date":"Reviewed in the United States on January 31, 2025","body":"In love with this phone so far battery life is 85% but everything works great on it delivery was fast just didn’t care for fedex shipping it took for ever for them to deliver it. But over all 10/10. Only thing I didn’t care for is when I got it. It was already on the Home Screen. Only comes with block and cord (not apple). But every thing was 100% for me! Thank you so much!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Reembolsaron la compra en tiempo y forma.","date":"Reviewed in the United States on February 27, 2025","body":"Le pondré 5 estrellas. Lo que estoy puntuando es la honestidad, ya que el producto estaba defectuoso. He recibidos el reembolso luego de reenviar el equipo."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 13","date":"Reviewed in the United States on January 8, 2025","body":"I love that the phone was in excellent condition the body of the phone is excellent my only dislike is the battery health I thought the battery health will be closer to at least 90-95%"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iphone","date":"Reviewed in the United States on March 5, 2025","body":"honestly when I got in very very good condition it's 89% I can careless came in 3 days so don't worry 🙏🏻"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Refurbished Phone!","date":"Reviewed in the United States on January 8, 2025","body":"Hi! I just got my iPhone 13! I bought the Apple iPhone 12, 128BG, Pink - Unlocked Excellent. The phone came earlier than expected which made me super happy because I had to leave for college soon. The iPhone has a couple of scratches on the sides but nothing I really notice much. I got ready to put my screen protector on today but then noticed there was a screen protector already on which was odd but I guess it's a plus. I looked at the battery health, and it's currently at 80% Battery Health. I don't think it's overall a bad deal for a refurbished phone. I usually get refurbished phones from Amazon and always have a positive experience. If you're looking to get a budget friendly phone, this is your sign to get it!","helpfulVotes":11},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it!!","date":"Reviewed in the United States on March 6, 2025","body":"Shipment came quickly. Phone is in perfect condition and came with 99% battery life. Very happy with my purchase. Highly recommend"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    \"EXCELLENT PHONE\"","date":"Reviewed in the United States on March 14, 2025","body":"EXCELLENT QUALITY PHONE, \"PERFECT\" MUCH BETTER THAN EXPECTED"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fast shipping","date":"Reviewed in the United States on January 28, 2025","body":"Little scuff on corner but phone works and shipping was fast."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on March 15, 2025","body":"Everything works perfect, battery is doing great."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better than expected!","date":"Reviewed in the United States on March 9, 2025","body":"iPhone 13 in perfect condition with 100% battery health! Better than expected!Thank you!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente","date":"Reviewed in the United States on March 14, 2025","body":"Me llegó muy bien el equipo"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Condiciones óptimas","date":"Reviewed in the United States on February 23, 2025","body":"Llego en excelente condiciones, solo unos pequeños detalles que ya con cover puesto no se visualizan y que la batería está en 88%, a parte de eso todo muy bien y funciona de maravilla."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente estado del telefono","date":"Reviewed in the United States on January 28, 2025","body":"Todo muy bien"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice ohone","date":"Reviewed in the United States on March 14, 2025","body":"Daughter love it, very nice phone"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A refurbished cell phone","date":"Reviewed in the United States on March 13, 2025","body":"Timely shipping and it works!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    👍👍👍","date":"Reviewed in the United States on March 7, 2025","body":"Arrived same day I ordered. No complaints. Looks and works perfect!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not excellent but worth the price","date":"Reviewed in the United States on January 16, 2025","body":"I work as a cell phone rep , battery is at 85 percent. 4/5"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Don’t be afraid to get this! Amazing phone","date":"Reviewed in the United States on March 4, 2025","body":"Came with no defects. SO pretty and after 5 months I don’t regret this purchase one bit."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    100% RECOMENDADO","date":"Reviewed in the United States on March 8, 2025","body":"Excelente porcentaje de bateria, excelente condicion fisica. Recomendado 100%"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Make sure the phone is in good condition and unlock","date":"Reviewed in the United States on March 8, 2025","body":"I love my phone and no issues so far"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best Buy  I’ve ever made! Great phone","date":"Reviewed in the United States on January 24, 2025","body":"I love this phone. I’m using it to do this review. I had no trouble setting it up. Charged it right away. I was so happy with the condition, I opened it and it looked new. In excellent condition, no dents or scratches that I see. I’m so glad I got this. I will get refurbished for now on. This company sent it right away. MLK day delayed delivery. I’m so happy so far. Now to order a protective cover . The price is almost unbelievable to what one new would cost. I’m very sold on this company and seller.","helpfulVotes":20},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is in good condition with  (1) noticeable scratch in the top.  Battery was at 100%","date":"Reviewed in the United States on August 21, 2024","body":"Overall, I am happy with this purchase.  The battery reports 100%, and overall the phone is in good condition.  If you keep your phone in a case, you wouldn't notice the small gouge on the top right.  There is additional minor wear and tear around the metal housing (seems like the prior user didn't use a case).  If you prefer to go caseless, expect that you could receive a device with some minor but noticeable wear and tear.  However, the phone was not sold as \"flawless\" so some wear and tear is to be expected.  For my use case, the phone met my needs.  I threw it in a case and don't notice the flaws  The phone came with a glass screen protector which was a nice touch.  I haven't pulled off the screen protector  to see if the underlying screen has scratches.  if there is wear-and-tear on the screen (ex. small scratches from keys, etc.) they are minimal and not noticeable thought the screen protector.  Overall satisfied with this purchase for my use case.","helpfulVotes":17},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    No está completamente en excelente estado","date":"Reviewed in the United States on January 11, 2025","body":"El teléfono tiene algunos golpes en las orillas, no se encuentra en excelente estado como dice en la descripción del producto"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect condition","date":"Reviewed in the United States on February 27, 2025","body":"I was so nervious to be scammed but the phone was in perfect condition to be a second hand. I’m so happy.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Old version but operates brand new","date":"Reviewed in the United States on March 4, 2025","body":"A month later, and the phone still works like brand new. No issues at all!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works good but the battery is lower than expected","date":"Reviewed in the United States on January 9, 2025","body":"The battery capacity is only at 87%. The package itself was late two times. Other than that not many issues, and no damage."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality iPhone at a great price","date":"Reviewed in the United States on February 5, 2025","body":"This iPhone 13 looks and operates like brand new, which I got refurbished at a fraction of the original cost.  The dealer also expedited shipping to me after i let him know that my older iPhone had died, so I would highly recommend them for anyone else debating using them for their next iPhone purchase."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life as expected! 👏🏼","date":"Reviewed in the United States on February 27, 2025","body":"Great conditions! For the price I paid I got 90% battery life which is perfectly fine!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Work really well ( its like it’s brand new )","date":"Reviewed in the United States on February 12, 2025","body":"I’ve had the phone for about 2 weeks now, it came in good condition. Definitely felt like it was brand new. It didn’t come with any scratches or anything, I also tested out the camera and volume and it was GREAT!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING","date":"Reviewed in the United States on February 17, 2025","body":"Immaculate condition, and 92% battery health! Setup was a breeze and the unit is beautiful :)It's like a brand new phone at half the price, thanks!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Legit like fr","date":"Reviewed in the United States on March 1, 2025","body":"Had phone for bout a week now and works great nothing wrong. Great purchase."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone","date":"Reviewed in the United States on January 18, 2025","body":"Woks so far"}],"reviewCount":0,"reviewAvgRating":null,"status":"completed"}