{"reviews":[{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality, great price, fast shipping options","date":"Reviewed in the United States on February 26, 2025","body":"Really fast shipping option was great because I broke my phone. The phone is in excellent condition as described. The screen has one needle pin scratch (literally a teeny tiny dot that is less than a speck of dust) and one scratch that’s less than a mm, which is incredible. I expect some wear and tear, but it is way better than my expectations and experience buying refurbished phones. I’m very pleased. It’s as described if not better. I will be purchasing from this seller again. Great prices and reviews on their page by the way. Works like brand new and it has 86% battery life. Came with a charger box and a chord, very nice of them to include both with the amazing deal it was already at. I would recommend anyone to buy a phone from here and am eyeing another now for family. Thank you so much seller!","helpfulVotes":11},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it 💛💛💛","date":"Reviewed in the United States on February 20, 2025","body":"Great phone in great condition. Battery health was a bit low at 90% but was in great condition and works well. I had a it of trouble setting up the Apple ID, I upgraded from an IPhone 12. I had previously disconnected my previous line so no longer have the number. Unfortunately the old number was still connected, so every time I would try to use the Apple ID connected to the iPhone 12 it would send a confirmation code to the phone number so I had no way of using the phone number. So I had to create a new Apple ID and email. Other than that everything works fine and I purchased the yellow option and love the phone and the color is cute!💛💛💛","helpfulVotes":10},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    1st purchase was great! This one was not!","date":"Reviewed in the United States on September 19, 2024","body":"I have had this iPhone for 38 days.It has the worst battery life of any iPhone I've ever owned, and I have owned ONLY iPhones since the first version was released 17 years ago.This is the second iPhone 14 that I've bought from the renewed store .The first one I bought on December 4th, 2023, and I could not have been happier with the phone.It arrived in brand new condition, and performed flawlessly.On the recommendation of a friend, I checked the battery health and charging after having it for MONTHS and it was at 100%! I was thrilled!I absolutely loved the phone!I never had a single problem with it.Unfortunately, on July 30 of this year I dropped it, and it was beyond repair.I immediately went back to the Amazon renewed store and purchased another iPhone 14 because my experience with the first one was so fantastic.It arrived in new looking condition, exactly like the one I bought in December 2023.It was not scratched or anything really noticeable, it just seemed to be \"worn\" a little bit, but I fully understood that it was a renewed phone, and any cosmetic issues were not that important to me, including the color, which, when my iPhone is in its case, you cannot tell what color it is anyway.Unfortunately, I DID NOT look at the battery health and charging when I first got the phone 38 days ago, but I did look at it about two weeks ago, and it said 93%.I thought, ok, it's a renewed phone, it's not going to have 100% battery life.I can live with that.Well, I just looked at it today and it's now at 90% battery health and charging.So this phone is dying quickly.After being fully charged it dies within hours.I have it completely set up for optimized battery life.I have lost emails and messages that I was in the middle of composing, and the phone just dies.I've been in the middle of important phone calls when the phone dies, simply because I had just fully charged it a few hours before that, and thought I would be fine for hours to come.I just had a total shoulder replacement surgery a week ago, and I was on the phone with my doctors office yesterday about my first post-op appointment, and my phone died in the middle of it.I thought I had HOURS left before the phone would die.Then I had to plug it in, and wait for it to come back alive, so I could call my doctor back and hopefully not wait a half hour after losing my place in line.On top of that is also has issues with the touchscreen being glitchy, and sometimes I have to tap on things several times to get them to work.As I said, I have been an iPhone owner/user since the very first version came out 17 years ago.I've always loved all my iPhones, and I will continue to be an iPhone user for the rest of my life.This is in no way reflection on Apple iPhones whatsoever.They are an amazing and fantastic piece of technology.I think I just got a bad one for the first time in my life.Luckily, I have just checked and I have until November 6th to return this phone, and I WILL be returning it.The problem is, what do I do in the meantime?Am I expected to buy a new one and get that shipped to me, transfer all my information from this phone to the new one, and then return this one?That is extremely hard to do financially!I am actually still paying for this phone on my Amazon Prime American Express card!Or, do I return this phone and wait until the refund has been issued and then buy another phone? Then wait until that is sent to me.I would not have a phone for at least a week in the interim, and we all know these days that's a practical impossibility.I am also having several medical issues.Like I said, I just had a total shoulder replacement surgery last Monday, September 9th, and have several upcoming follow up appointments, and physical therapy appointments.I also have several other non-related medical issues that definitely require that I have a phone.I just don't know what to do.","helpfulVotes":165},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Well, worth the purchase","date":"Reviewed in the United States on March 8, 2025","body":"Awesome product I chose the excellent unlocked version. I had absolutely no issues connecting it. The phone itself is in brand new condition not a blemish scratch or damage of any sort I would recommend this seller to anybody.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great!","date":"Reviewed in the United States on February 26, 2025","body":"Good so far. Phones battery healt is at 86%. Phone condition is good, no scratches. Phone seems to be working well. The screen looks great. The only thing I would say makes a difference is that the camera has a little visible wear and tear. I was scared to order as the reviews werent great but im glad I did.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So far so good!","date":"Reviewed in the United States on February 25, 2025","body":"Battery life is at 86%, sure the iPhone has defects and some weird dirt/rust on the back of camera but I haven’t had any issues yet as I’m setting it up. I can’t speak for other customers who have had issues but so far so good!Edit after a week: It was some weird junk on the back camera, the phone has to scratches or any dents and has been working properly. Only downside is that the camera doesn’t detect QR codes. That’s not a deal breaker for me. Glad it works and satisfied for a used iPhone 14!!","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone and save my boyfriend money","date":"Reviewed in the United States on March 8, 2025","body":"My boyfriend loves his new phone. Looked like new when he got it. He’s never bought used before and I talked him into it having had such a good experience myself with a used phone from Amazon. He’s so glad he did it, saving him over $200 from what the phone store was going to cost him. He loves the features on this phone.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s perfect","date":"Reviewed in the United States on February 14, 2025","body":"I love the color and besides a few small scratches which are to be expected, the phone works perfectly and has a great battery life. A very affordable and reliable option if your not looking to get a brand new iPhone.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Verify with geekbench6","date":"Reviewed in the United States on March 2, 2025","body":"So far so good…the only thing that bugs me is the fact they can’t warrant the water resistance that a new or apple certified phone would have.Which means it has absolutely  been  worked on (renewed iPhone) by a third party vender ???Had it a few days and it has been fine 90% battery life …charged it last night at around 8:30. 9 oclock it was fully charged and it’s now at 38 % so about 15 hrs.with little to mild use .The camera acts up a little ,as in scanning an id for identity verification.but all around it seems to be performing like an I phone ."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone! Good price!","date":"Reviewed in the United States on March 12, 2025","body":"I got one classified as “good.” I can’t see any damage on the phone. It looks like new. Setting it up went perfectly, absolutely no issues, and e sim was installed without problems. The battery is at 87% which is what I expected. My old phone was a year and a half old and it’s 87% too. The phone though lasts longer than the old iPhone 12.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent condition","date":"Reviewed in the United States on February 28, 2025","body":"Very happy so far with this phone.  It arrived in excellent condition. There was a few tiny scratches, really not noticeable unless you are really looking. The color is exactly as pictured and it holds a charge as it should. I have not had any issues with the phone getting to hot. I have played games and watched videos, the temperature remained fine.Overall, I feel this was a good purchase."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great seller, issues with 18.0.1 update and porting old to new phone but found a workaround","date":"Reviewed in the United States on October 28, 2024","body":"The seller is great, we had to send back the first phone because we thought it was defective, it turned out that there is a significant conflict with the portability of the old phone information and 18.0.1 upgrade.  When we cut on the phone we set it up to transfer the old phone material first, then it wanted to upgrade the software prior to the transfer.  The upgrade spooled around for 18 hrs, then the portability function (over WiFi and Cloud) simply would not work.  AT&T couldnt figure it out....we sent the phone back thinking it was defective (turns out it was fine), got a new phone same model, etc.New phone had the same issues, and I was thinking at this point it cannot be coincidence so it must me a software conflict.  And....it was.  After MUCH tinkering with it here is the workaround for those of you who are in the same situation (as an aside, we were upgrading my wife's ancient XE to a 14 but I think this happens with a lot of phones no matter the model)1.  Cut on the new phone2.  Opt to NOT set up the new phone with the old phone (ie, do NOT transfer the old phone data yet).3.  Go to settings, opt to update the software to 18.0.14.  After this, ERASE the phone.  It will keep 18.0.1 on there, it will remove any impediments to port over the information.5.  KEEP the e-sim information on there(it gives you that option when you erase, it is ok not to do it but you will have to put it back on so just keep it on).6.  Boot the phone back up7.  OPT to set it up with the old phone (likely the older phone will prompt you for this first).8.  You can set it up over Wifi or Cloud, make sure you have backed up the old phone on the cloud just before set up if you opt for that.9.  There is an option to use direct cabling to transfer, but it is a pain because Apple insists on using the proprietary cabling they have, so it means you have to first port everything onto a laptop then transfer it.  Safer but not any quicker.  I would not do that unless you have cloud issues and/or bad WiFi.Phone has worked great since we did the workaround, and I want to compliment the seller as they were quick to send a replacement phone to us and very communicative on the issues.  I hope the workaround here helps others, it was utterly baffling to us.  Apple needs to get it together on the portability issues since they just released the new model and apparently this is an issue with a number of older to newer transfers, very disappointing for them to not catch this.","helpfulVotes":29},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Used iPhone 14 Excellent","date":"Reviewed in the United States on March 12, 2025","body":"iPhone showed up in like new condition.  Came with lightning cable.  In case someone else runs into the issue I did.  We use Visible which says it’s by Verizon so I assumed (incorrectly) that I could use a Verizon locked phone.  It did not work so I had to return the first phone I bought and I purchased an unlocked phone.  Everything transferred over from my old phone just fine and everything is working great.  No complaints!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished, but not “like new”","date":"Reviewed in the United States on January 6, 2025","body":"I purchased this as I wanted a newer phone and this seemed a less expensive way to go. I was a refurbished iPhone 14. It came in a nice box and a charger cable, but not a charger. Not usually a problem as most people over time accumulate several them over time. It looked brand new and works fine. Unfortunately, I had assumed that refurbished meant “like new”, but apparently it also means “it was checked out, cleaned up and it works”. What it does not mean is a new battery. Mine had a battery with 84% charge capacity. In fairness, the company’s fine print indicates this so that’s on me to have overlooked that. In fairness I did get a “newer” phone just not one that was “like new” which meant like a new one, not just close. So, the iPhone is a newer one and works well, just will not hold a charge as long. If that doesn’t matter then this a good choice.","helpfulVotes":9},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Experiencia 10 de 10 Muy Recomendable Batería al 100%","date":"Reviewed in the United States on February 21, 2025","body":"Quejas? ¡Ninguna! Estaba un poco nervioso por realizar esta compra ya que es la primera vez que compro algo “renovado” y que buena experiencia primeriza me he llevado. El iPhone llegó en EXCELENTE estado con la capacidad de batería al 100% y nuevo (Revisando el número de serie verifiqué que, en efecto, el celular es nuevo).Sin rasguños de ningún tipo, quizá un rayón diminuto en la pantalla que es imperceptible a primera vista a menos que lo observes cuidadosamente. La batería le dura 1 día y medio a 2 dependiendo del uso que le dé. Esperé una semana para testearlo bien y escribir una reseña correcta para que las demás personas sepan bien cual fue mi experiencia y así facilitar la compra de otros clientes. En fin, estoy satisfecho con mi compra. Gracias al vendedor por enviarme el producto rápido.","helpfulVotes":11},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Couldn’t get this phone on my xfinity network but no problem getting a refund","date":"Reviewed in the United States on February 16, 2025","body":"I tried to save myself some money and having to renew my xfinity plan for another 24 months by buying a refurbished iPhone 14 for my son. The phone looked brand new but even though it was unlocked we spent hours on the phone with xfinity and in person trying to get it on my xfinity account.  Very frustrating.  Even called apple but no one could figure out what was wrong.  I finally gave up and bought a new iPhone 14 from xfinity.  The seller was great about issuing a refund. It actually happened very quickly.  In hindsight I wish I had just bought the new one from xfinity to start with.  I gave the seller a 5 cause I don’t think it was their fault.  I did email him twice and the answers back didn’t really help much but they were responsive with the refund.","helpfulVotes":6},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s ok","date":"Reviewed in the United States on March 6, 2025","body":"I got the phone about two days ago it’s working good so far no issues the battery is 85 percent which isn’t bad for a used phone the physical appearance is good so far I can say it’s working well and I have it for four days"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great for price","date":"Reviewed in the United States on February 11, 2025","body":"i had the smallest crack near my camera and top speaker but other than the the phone is perfect.i dont know if it was just me but its a little slower than a brand new phone to set up eSIM. but after some time i got the hang of it.phone works perfectly! the battery life was af 98% when i got it (4.5 months and it is now at 96%)."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not as advertised","date":"Reviewed in the United States on February 27, 2025","body":"Phone seems to be working well, however, cosmetically it has some scratches on the corner that are viewed from further away than 12 inches. Listing says free of scratches when viewed from 12 inches.  Not a big deal, but not as advertised."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    GREAT!","date":"Reviewed in the United States on March 1, 2025","body":"The phone came in great condition. No scratches or anything. Had 100% battery health and everything. My order just kept getting delayed but other than that it was great!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    88% battery life. We will see...","date":"Reviewed in the United States on January 7, 2025","body":"Pretty much the most important thing about an iPhone that matters more than a camera, some scratches, and even the overall iPhone is, and will always be, the battery percentage.Mine is 88% for the excellent condition. I just hope this lasts, as I bought it for use in Peru and not the states. So, charging your phone is a whole lot less convenient when not in the US, surrounded by chargers and plugs/outlets.I will update this within a few months to see the battery life and how it will hold up.Other than that, it looks great; it even got a USB-A cable + charger box, which is a plus."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy again","date":"Reviewed in the United States on March 10, 2025","body":"Good but the battery life was 83%iPhone 14 red"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this new iPhone 14","date":"Reviewed in the United States on February 28, 2025","body":"I have had my new iPhone 14 for three days and I love it. I had to call TracFone to get the phone set up, but they were so nice and set me up in a few minutes. My iPhone is so much easier to use than my old iPhone 6. I am so happy with this new phone because itis so easy to use."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice","date":"Reviewed in the United States on March 12, 2025","body":"Good"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ordered a phone in good condition and mostly happy with it","date":"Reviewed in the United States on December 14, 2024","body":"Ordered a phone in good condition. According to Amazon there isn’t supposed to be any scratches on the screen when it is in good condition. There are 2 deep scratches and smaller scratches on the screen. Not upset about it but it doesn’t follow what Amazon says. Battery was at 100% health so It makes up for the scratches. But i am a bit disappointed in that there were scratchesBesides that the phone is in good condition, was a bit of scuff marks on the side but a case hid that. The speakers are loud, was fully unlocked and was able to switch it over to my carrier easily. Was worried when I saw reviews saying the phone wasn’t unlocked but I didn’t have that issue.Overall I’m happy with the phone, just the scratches were disappointing.","helpfulVotes":6},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It’s okay","date":"Reviewed in the United States on February 1, 2025","body":"It is wayyyyy smaller that I thought looks almost like my iPhone 12 but anyways it also doesn’t have the slot to enter a SIM card but it came with a SIM card opener thing. Really makes no sense but I haven’t started using it but it’s pretty but very small","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Truly unlocked & easy set up","date":"Reviewed in the United States on March 1, 2025","body":"I’m very pleased with the iPhone I purchased through Amazon.  It was truly unlocked.  I use prepaid service through straight talk and I was able to  simply call my phone company and have my number transferred to the phone.  Easy peasy.  And the phone looks just like it would had I went into a phone store and purchased it brand new.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone not completely wiped. Prevent data transfer of Facebook.","date":"Reviewed in the United States on February 11, 2025","body":"Good for the most part. However, the phone was not completely wiped. My Facebook account will not transfer. The previous owner’s account will not go away."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    “Excellent, like new” condition","date":"Reviewed in the United States on December 12, 2024","body":"Phone arrived packaged nicely and included charging cube and cord.  I had to present my drivers license and sign for it when FedEx delivered it.  Some scratches on the sides, but front and back screen look new.  Very disappointed however to check the battery health and it only be at 85%.  I would have thought that an “excellent, like new” phone would’ve came with a new battery since that has always been my experience with Apple refurbished products. (I do realize this is not a certified Apple refurbished product) I purchased this as a gift for my daughter, so no time to return and get a different phone.  For the price paid, I would’ve expected a “like new” phone that has a new battery.","helpfulVotes":13},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Faulty product, phenomenal service","date":"Reviewed in the United States on January 30, 2025","body":"Phone arrived in non-working order. That happens from time to time. But what doesn’t always happen is quality service after such an event. No issues at all, the phone was easy to return, quick turn around on the refund.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    THIS WAS REFURB GOOD CONDITION","date":"Reviewed in the United States on February 25, 2025","body":"WORKING FINE SO FAR"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    iPhone 14","date":"Reviewed in the United States on February 14, 2025","body":"No está mal tiene algunas imperfecciones porque es de uso pero funciona bien","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great experience","date":"Reviewed in the United States on February 21, 2025","body":"My phone was delivered three days early and it works great! Setup and information transfer was seamless. My new phone was ready to use in 10 minutes. This is the first time I've ever bought a phone that wasn't from a cell phone service provider, and I couldn't have been more pleased with the experience. I will definitely buy from this seller again.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery life 88%","date":"Reviewed in the United States on January 7, 2025","body":"Will update with pictures. Overall the phone is nice and works great. No scratches or chips. The battery life is at 88% which isn’t a huge deal for me I’m home a lot and have the time to keep it charged. The sides were very obviously painted. You can see it on the back and front glass. But other than a little bit of cosmetics and the battery life I would 100% recommend this!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So I was very mixed about doing this","date":"Reviewed in the United States on December 14, 2024","body":"Ordered just the basic quality level !!Had very mixed feelings about ordering because it’s like you just gotta be one the lucky ones ones to get a good one so I rolled the dice being cheap bastered I am but I love quality at same time haha I got lucky my iPhone 14 was in mint condition only problem was battery life in settings said 82 percent I’ve had the phone nearly 3 months now that hasn’t changed it charges to 100 percent every time and last long time but it dies at 4 percent life everything else perfect and I ordered just the basic cheapest quality level !!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good","date":"Reviewed in the United States on February 18, 2025","body":"Good product"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Clean iPhone 14","date":"Reviewed in the United States on March 12, 2025","body":"No scratches or any issues from this seller . Product looked like new and zero wear and tear issues . Back was shining like new"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Battery at 100% health! Brand new phone","date":"Reviewed in the United States on March 12, 2025","body":"I think I got pretty much a brand new phone lol. Battery was at 100% health wise or whatever, everything’s perfect and all set up."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Exactly what I ordered","date":"Reviewed in the United States on February 17, 2025","body":"Good condition"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    product description incorrect - ordered an unnecessary sim card","date":"Reviewed in the United States on January 17, 2025","body":"The phone seems fine.  But the product description said I'd need to get a sim card from my provider and this phone uses eSim.  No sim tray in this phone.  Caused some confusion...","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente","date":"Reviewed in the United States on March 1, 2025","body":"Llegó tal cual se ve en las imágenes. Estaba en buen estado y limpio. Lo llevo usando semanas y no me dado ni un solo problema. Sin duda lo compraría de nuevo para alguien más."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Should have read desriptions more closely","date":"Reviewed in the United States on December 21, 2024","body":"I purchased this phone based on so many good reviews. The phone arrived quickly and cosmetically it is beautiful, no scratches, dings or dents. The phone is functional but battery life was 86% on arrival and a month later is down to 85%. I should have looked for a phone with a premium rating. Since I do not use my phone for gaming or internet and only occasional texting, it will probably be ok for me.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great product","date":"Reviewed in the United States on January 27, 2025","body":"Phone quality is great, 87 battery health but it lasts very long"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new iPhone!","date":"Reviewed in the United States on February 12, 2025","body":"Great phone, great price. fast delivery, excellent battery life.It’s like a brand new phone… no scratches or imperfections on the exterior case or screen.. Battery health showing 100%. I have only been using it for three or four days, but so far I could not be happier with this purchase.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Really Great","date":"Reviewed in the United States on March 7, 2025","body":"Excellent condition phone. Works great. Was able to transfer information easily. Battery life is much better than my last phone. Definitely recommend."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great investment","date":"Reviewed in the United States on March 9, 2025","body":"100% battery percentage! Very pleased and happy with my buy :)"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Sweet as Apple iPhone Pie","date":"Reviewed in the United States on February 2, 2025","body":"I'm just a regular customer.  This iPhone 14 Pro Max is what it says it is. It does what it is supposed to do. It was much less than a new phone but other than that I noticed no difference between this phone and a new one. I've upgrade from a 11 Pro to this 14 ProMax.  I'll be using this phone until it fails, or maybe somewhere around the release of iPhone 18."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Need new phone asap!","date":"Reviewed in the United States on March 10, 2025","body":"My son loves his new phone.  He can't put it down."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Apple","date":"Reviewed in the United States on March 14, 2025","body":"Nice phone for the price."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Fixed first mistake","date":"Reviewed in the United States on March 5, 2025","body":"First time the box came completely empty but after notifying Amazon, they made things right. Great phone at a great price."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It is a good phone and unlocked let's you join any network","date":"Reviewed in the United States on March 9, 2025","body":"Excellent. It was unlocked and we added it to the Xfinity plan. Great deal.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone if you’re looking for something cheap","date":"Reviewed in the United States on December 31, 2024","body":"Very nice quality on the phone there are a few scratches on the outside of the phone but nothing major. Battery health is ok it’s at 89% so not bad but could be better but for the price of this phone it is very good."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought mine for less than $330","date":"Reviewed in the United States on February 12, 2025","body":"At first I was expecting a phone in not so good conditions as it was “used-acceptable” I was expecting visible scratches etc. It arrived earlier than expected as well as in super good conditions. It looked and felt brand new. No visible scratches and works great. Definitely worth your money. Battery life is great as well as camera quality.","helpfulVotes":16},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great purchase","date":"Reviewed in the United States on January 14, 2025","body":"phone looks great and everything transferred perfectly my only issue is the battery which is at 85 percent but other than that its good"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone","date":"Reviewed in the United States on February 27, 2025","body":"Phone Is So Pretty ! I Love The Color & The Phone Works Really Well & Is In Perfect Condition. Very Durable"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works like new","date":"Reviewed in the United States on February 12, 2025","body":"I was SUPER hesitant to buy this phone because of some of the reviews but I still bought it anyways and it actually works like new. I have no problem with it so far and there’s zero scratches. It was also very easy to set up.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent transaction / excellent product","date":"Reviewed in the United States on March 2, 2025","body":"Very pleased with this ... easy to set up, works like a charm!Thank you for an excellent transaction!!  A++++"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    100 batery","date":"Reviewed in the United States on January 15, 2025","body":"Toda la bateria, sin rayones, sin detalles. El empaque no es original ni tampoco el cargador.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Iphone 14","date":"Reviewed in the United States on March 5, 2025","body":"Came excellent condition even tho shipping took forever. No problems at all"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone is great","date":"Reviewed in the United States on March 9, 2025","body":"My son loved the phone thank you so much"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    AMAZING","date":"Reviewed in the United States on March 12, 2025","body":"Amazing condition"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Would buy again","date":"Reviewed in the United States on February 27, 2025","body":"Very pleased with phone so far. Arrived late, but that's on fedex not the seller. Anyway was as described and my daughter loves it"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Its a great phone","date":"Reviewed in the United States on March 3, 2025","body":"The phone I got looks brand new and works perfect. I highly recommend it."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone is Good not Excellent","date":"Reviewed in the United States on November 27, 2024","body":"Phone is good. Few areas you can see where the screen was replaced and not seated all the way.  Corners of the screen are lifted a little and not flush some fix areas near the camera where the sames was smoothed and polished. Overall Good I would not rate as excellent as seller has listed and would expect it to be $50 to $100 less than what I paid. Function of phone."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I14 Cell Phone","date":"Reviewed in the United States on March 14, 2025","body":"Good Deal"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ok","date":"Reviewed in the United States on March 13, 2025","body":"as gift"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    .","date":"Reviewed in the United States on March 8, 2025","body":"Fast delivery and good product."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality","date":"Reviewed in the United States on March 11, 2025","body":"Would recommend"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Muy buena compra","date":"Reviewed in the United States on March 14, 2025","body":"Excelente"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Instructions","date":"Reviewed in the United States on February 24, 2025","body":"The few instructions were confusing. Mentioned the SEMs card but this phone does not use a SEMS card."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen producto, pero dos rayones medianos en la pantalla","date":"Reviewed in the United States on December 16, 2024","body":"El teléfono funciona muy bien, sin embargo he comprado en ocasiones anteriores teléfono reacondicionados y los daños estéticos suelen ir en la parte de atrás, algunas esquinas. Este tiene dos rayas en la pantalla, una pequeña y otra mediana."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 14","date":"Reviewed in the United States on January 9, 2025","body":"Its great it came with no scratches or damage’s charges good was easy to set up 90 percent of battery"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Review","date":"Reviewed in the United States on March 8, 2025","body":"It came like brand new cell phone","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buena calidad","date":"Reviewed in the United States on March 9, 2025","body":"Definitivamente lo volvería a comprar"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phond","date":"Reviewed in the United States on January 10, 2025","body":"The delivery was a day delayed but it arrived and the phone worked great. Transferred data without any problems."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thank you","date":"Reviewed in the United States on March 2, 2025","body":"I have just received my item and I love it"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    gran teléfono aunque sea reacondicionado","date":"Reviewed in the United States on February 28, 2025","body":"por más que sea reacondicionado funciona muy bien y tiene muy buena batería"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great buy","date":"Reviewed in the United States on December 23, 2024","body":"I love the phone, it was in great condition, but not excellent as I purchased. Minor scratches not big enough to spoil the look and the battery health is what annoyed me, 87%. It wasn’t a bad buy all around"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    iPhone 14 Rec","date":"Reviewed in the United States on March 4, 2025","body":"iPhone was an excellent shape and works perfect. Much appreciated.!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A good Apple phone","date":"Reviewed in the United States on February 27, 2025","body":"What can I say? Is Apple phone work just like all Apple phone work it’s good."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Product, like new!","date":"Reviewed in the United States on February 24, 2025","body":"So happy with the purchase. The phone is like new and it was delivered before the expected date. I was so happy!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Refurbished like new","date":"Reviewed in the United States on January 7, 2025","body":"I can’t tell this is a refurbished product. Looks feels an operates just like brand new."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Calidad/precio","date":"Reviewed in the United States on December 21, 2024","body":"El teléfono se encuentra en buenas condiciones físicas, sistémicas, con sus sistemas de audio bien hasta el momento, identificador de Face ID  en buenas estado. Bajo porcentaje de batería."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone","date":"Reviewed in the United States on February 13, 2025","body":"I’ve had this phone over six months now, and I have not had any problems with it. This one looked and worked as if it was brand new when I received it. I’m very happy with this purchase.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very happy","date":"Reviewed in the United States on March 5, 2025","body":"In perfect condition and with charger cable"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked great","date":"Reviewed in the United States on March 4, 2025","body":"Good price works good and fast shipping"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works but definitely not “excellent” category","date":"Reviewed in the United States on December 10, 2024","body":"I purchased an “excellent” condition phone. I certainly wouldn’t classify it as excellent. “Good” would be a better category considering the markings on the phone. It was clearly dropped several times. The functionality of the phone is fine. It came unlocked and was easy to setup with T-Mobile."},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Better off getting a new one","date":"Reviewed in the United States on October 6, 2024","body":"All of this was experienced in the span of about 24-48 hours, and due to my work, I couldn’t keep the device because of the performance issues experienced:I needed a phone quick because my last phone died. While I appreciate the quick turn around on my order and delivery, the device had issues.For starters, the refurbished one I ordered and received took a long time to set up. You couldn’t just pair it with another device to get everything transferred. If you tried this, you would see the latest update would take days to complete and the timeline never changed.I reached out to apple and they helped me get it set up, however, there were several performance issues with the device I received.Total time it took to get the phone set up: 6.5 hours.Details: Started at 4pm as soon as the device was delivered, and after seeing the update was still not completed around 9pm, I worked with Apple support to get the device finally set up around 10pm.Performance issues:The charging port was loose, so even if the device was connected to a plug in charger, it wouldn’t always charge. This also impacted connection to CarPlay when driving. The phone would be sitting in the seat beside me, plugged in, but if it moved slightly, the connection wouldn’t work and I’d have to unplug it and plug it back in. It’s not tight enough to keep a good connection.There was an issue with screen responsiveness and phantom typing. If you needed to tap or select anything closer to the edge of the screen, it wouldn’t register. At times the screen wouldn’t respond at all, or if it was face down and I picked it up, I would see it was randomly typing characters in the Home Screen search box. I would have to manually turn the screen off (side button) for it to stop.There was also an issue with the front facing camera and sensor. The camera was really fuzzy and not able to pick up anything at times. The sensor wouldn’t always correctly adjust the screen brightness over the night I had it.The physical device itself also has scratches and dents all over it. While I don’t care about cosmetic as much as the above, the phone I received was more along the lines of poor condition overall.For this seller, I think it would be a good idea to do more intensive performance testing with the phones/devices before you send them out. You should also include correct setup instructions with the devices so your customers can set them running with ease and not have to waste half a day trying to get the phone setup to work.Overall, with the issues and hassle I experienced with the device I was sent, it was more cost effective to go buy the same model in new condition for the additional $100 at a local Best Buy.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works great","date":"Reviewed in the United States on February 26, 2025","body":"Looks great and works great."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like new","date":"Reviewed in the United States on March 9, 2025","body":"Perfect"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    teléfono como nuevo","date":"Reviewed in the United States on March 4, 2025","body":"Excelente calidad precio. Super cumplidos"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great purchase!","date":"Reviewed in the United States on February 13, 2025","body":"Perfect. Out the box, clean IPhone 14. Powered up and connected. IEMI clean no issues activating. Pleasure to work with.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Loved it","date":"Reviewed in the United States on February 21, 2025","body":"I gave it to a friend who needed a phone  after being without for over a month  He was ecstatic"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It said it'll deliver in 4 days IT CAME THE NEXT DAY","date":"Reviewed in the United States on January 16, 2025","body":"I was scared to buy this because yk how it be when shopping online for things especially high in value. And one thing I LOVEEEE is the fact that IT CAME THE NEXT DAY!! It said it would be delivered on Sunday, for reference I bought it on Wednesday and it came on Thursday the next MORNING!!! Omg I'm very grateful for that. Another thing, my phone came in perfect condition no scratches or defects. I'd say get it if you need a phone it's perfect and it's UNLOCKED","helpfulVotes":8},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not original iPhone screen","date":"Reviewed in the United States on March 5, 2025","body":"Phone looks and works like new. But the screen is not an original. And the replacement is not a real iPhone screen. They also wiped the info from the phone showing if it’s original parts. For the price it’s worth it but kinda shady for real."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent shape","date":"Reviewed in the United States on December 5, 2024","body":"Overall the phone condition is fine, I’d give it a score of 8.5/10 looks-wise, and the phone is functional which is important. I’m surprised it came with a brand new charging cable! Thumbs up for this. We’ll see what happens within the next couple of weeks."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    JUST AS DESCRIBED! THE PHONE UNLOCKED!","date":"Reviewed in the United States on February 16, 2025","body":"The phone is in mint condition, touch great, battery health good and most importantly it’s unlocked! I recommend it","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beautiful Red","date":"Reviewed in the United States on January 25, 2025","body":"I would never know that the phone wasn’t new. It arrived a day early and was packed very wellThere are no blemishes scratches, the color is gorgeous, and the phone works with no problemsDon’t hesitate to buy refurbished electronics, I was a bit worried buying the refurbished phone but totally happy with this purchase  AND I saved so much money!!Thank You to these sellers","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone came in very good condition","date":"Reviewed in the United States on January 21, 2025","body":"I would 100% recommend this. Phone came early in a really good condition Battery health was 86%, sound, camera was good as well. Camera acts funny (especially front) sometimes to be completely honest but to be fair, it’s not brand new and I know that I can’t really expect it to be perfect. Overall I’d rate a 9/10 at the time of reviewing this product(I just got it). I’d post an update if I notice any issues in the future.","helpfulVotes":7},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Like brand new","date":"Reviewed in the United States on February 24, 2025","body":"It looks like it is brand new. Battery life is 100% and holds for a long time. A++++"}],"reviewCount":0,"reviewAvgRating":4.1,"status":"completed"}