{"reviews":[{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    BEST PHONE EVER","date":"Reviewed in the United States on March 5, 2025","body":"battery life is great and it came in great condition and i love the phone and the charger that came with it works great to and i recommend it to anyone"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Happy with this phone so far","date":"Reviewed in the United States on February 8, 2025","body":"The phone works well. Relatively fast with plenty of storage. Good battery life. Decent size. Great price. Will update this review if I need to","helpfulVotes":7},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good","date":"Reviewed in the United States on February 14, 2025","body":"For the price ,i recomend it , mine works fine with tmobile and it came new, so far so good","helpfulVotes":6},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value","date":"Reviewed in the United States on February 7, 2025","body":"Good purchase, great phone. It's only a new days from i am using the phone but it is just as described. It is an unlock phone & it works in the Caribbean. Easy setup and functions well, It is charging as it should & with he fast charging port its really charging fast & good battery life. Appearance is nice, clean & slick. But i fine the phone itself is a little to heavy & thick. But all in all I am happy with my purchase & its working good thus far.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No issues with Metro PCS to bet activated","date":"Reviewed in the United States on March 3, 2025","body":"Beautiful and works perfectly","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ot runs great","date":"Reviewed in the United States on March 3, 2025","body":"Great phone I love it"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good buy","date":"Reviewed in the United States on February 25, 2025","body":"Good buy, picture quality is great, battery life good also. Set up was seamless. Delivery was prompt.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with AT&T in US","date":"Reviewed in the United States on November 3, 2024","body":"The phone is not compatible with AT&T 5g network in the US. After I put in my SIM card it could receive texts, but calls and mobile data were all unavailable.","helpfulVotes":38},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal","date":"Reviewed in the United States on March 3, 2025","body":"Great product for the price. Son broke his iPhone and this served as a compatible replacement"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No padding inside the box","date":"Reviewed in the United States on January 28, 2025","body":"No packaging padding. The new cell phone and the new physical protectors are OK Thank God. They arrived bumping on each other in a box without internal padding!!!The power supply doesn’t have information on its body. 9 Volts? The on-line manual doesn’t explain much about this “incognito” power supply."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone was okay, but the giggle bite were not what I wanted.","date":"Reviewed in the United States on February 27, 2025","body":"Nice phone."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I Named It “The Princess”","date":"Reviewed in the United States on October 28, 2024","body":"Overall the phone is fine and does everything I need for less money than an iPhone.But The Princess is very picky about phone chargers. She doesn’t like all the other phone chargers on Earth that charge every other make and model just fine.No, the Princess only likes HER wall charger. Luckily she doesn’t mind the USB that is integrated into a couple of outlets in our house. I haven’t asked her yet if she will tolerate my car charger.Seriously now, I plugged the phone into the the charger I have used for years and I got a message on the screen that it wasn’t good enough and charging would take 39 hours!! Yes. 3. 9. 39 hours. Bizarre. With two previous phones is was a few hours.So I will adapt to the special needs of The Princess and hope that I don’t need to start carrying with me, everywhere I go, her special charger.","helpfulVotes":27},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Perfecto para personas mayores","date":"Reviewed in the United States on January 20, 2025","body":"Se lo compré a mi abuela como regalo de navidad ya que tenía un celular algo viejo, ya mi abuela está familiarizada con la marca Samsung por lo tanto tampoco se le hizo muy difícil el adaptarse al nuevo teléfono, pero en general es l celular muy bueno, rápido la pantalla con buen brillo, las bocinas cuentan con un sonido muy claro, la cámara cumple con lo necesario, aunque como casi todo celular de gama media/media baja las cámaras en nocturno dejan que desear, el almacenamiento perfecto (solo usa WhatsApp y guarda fotos jaja), muy bueno recomendado","helpfulVotes":4},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Phone","date":"Reviewed in the United States on January 15, 2025","body":"Pretty good Samsung. Its the one my daughter wanted. Only issue is that the Charger is no good. Plugged in my fast charger and the phone works fine.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung A15","date":"Reviewed in the United States on January 29, 2025","body":"Mice phome. Just what i expectrd and needed"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone","date":"Reviewed in the United States on February 26, 2025","body":"My dada lost his phone i bought this one for him.He loves it so far"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone but","date":"Reviewed in the United States on January 6, 2025","body":"My son loves his new phone. Only issue we’re experiencing now is that it takes about 9 hours to charge."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Samsung cel","date":"Reviewed in the United States on January 11, 2025","body":"Practico..me resulta muy interesante hasta el momento."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is not for USA","date":"Reviewed in the United States on January 11, 2025","body":"This is a pretty good phone. I noticed a lot of reviews are talking about it not really being unlocked, but it is. It's just international. That's why it starts off in another language and doesn't allow USA carriers. A lot of people seemed to have missed that part (myself included) and I wasted money buying phone plans for a phone that wasn't compatible. If you're reading this from the USA and thinking of ordering it or it's on the way, cancel it. The phone is great every other way but you won't be able to get a plan on it.","helpfulVotes":44},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Teléfono Samsung Galaxy A-15","date":"Reviewed in the United States on February 14, 2025","body":"Se ve bueno lo compré para hacer un regalo ya lo cargo y después lo probaré"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smart telefone","date":"Reviewed in the United States on February 21, 2025","body":"It's magnificent. It fulfills all its functions.","helpfulVotes":3},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very good product","date":"Reviewed in the United States on December 28, 2024","body":"Works very well, holds a lot of apps and sound quality is really good."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It works great","date":"Reviewed in the United States on December 18, 2024","body":"This phone works very well, the price is reasonable, and you can use SIM cards purchased anywhere with it."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Data transferred easily from  Galaxy S20 FE","date":"Reviewed in the United States on February 6, 2025","body":"Seems to me just as good as my S20, but with a better battery.  The seller also through in a ultra fast charger (thanks)!","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Buen funcionamiento","date":"Reviewed in the United States on February 12, 2025","body":"Grandioso es el teléfono que hoy en día uso y esta como nuevo"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good screen quality non-slip grip","date":"Reviewed in the United States on February 10, 2025","body":"Good cell phone protection stretch rejects resistance"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works","date":"Reviewed in the United States on December 29, 2024","body":"I bought this phone for my dad who just came from Nigeria. I bought it because it is unlocked and has dual sim. The sim he bought from Nigeria worked perfectly with it but the sim here in the US didn’t work and I was going to return it. Then I was advised to take it to a local phone/computer repair store and he made the US sim work with the phone. The phone is definitely a great buy.","helpfulVotes":8},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Su gran aporte","date":"Reviewed in the United States on February 12, 2025","body":"Excelente me encanta"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect for kids","date":"Reviewed in the United States on January 27, 2025","body":"I bought this for my 7 year old son. Much better then expected, easy to set up, good quality, even with pictures.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice","date":"Reviewed in the United States on December 10, 2024","body":"It worked"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    50/50","date":"Reviewed in the United States on March 4, 2025","body":"Phone was fine, however the charging brick doesn't work and the screen protector came damaged"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Must have","date":"Reviewed in the United States on January 29, 2025","body":"Bought this as a birthday gift for my dad and he absolutely loved it"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy A15 (SM-155M/DSN), 128GB 6GB RAM, Dual SIM, Factory Unlocked GSM, Internation","date":"Reviewed in the United States on October 25, 2024","body":"wHEN i PURCHASED IT WAS ON SALE AND i DO SO PREFER THE SAMSUNG TO HAVING TO LEARN HOW TO USE ANOTHER TYPE.  I FIND VERY RELIABLE.  tHE PRICE WAS GREAT .","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    xsf","date":"Reviewed in the United States on February 5, 2025","body":"working good"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nit compatible with Spectrum","date":"Reviewed in the United States on February 18, 2025","body":"Spectrum mobile Don't want to give me service with this phone. I had to return it."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    True to size","date":"Reviewed in the United States on January 19, 2025","body":"Phone work well , connection great  battery life excellent, phone quality  great,  looks colour on point ."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good looking Phone","date":"Reviewed in the United States on January 24, 2025","body":"It looks good. as described by seller . It is a gift."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Value Replacement Phone","date":"Reviewed in the United States on December 30, 2024","body":"With my daughter breaking her Pixal phone, this is a great and cheaper phone replacement. If you are use to Android and Samsung phones, the functions are intuitive.The only down side is that the phone doesn't have the greatest camera quality compared to the Galaxy S-series phones. Nonetheless, everything else works fine.","helpfulVotes":9},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Charging box doesn’t work","date":"Reviewed in the United States on January 29, 2025","body":"Phone is in perfect condition but the charging box that came with it doesn’t work. At one point my phone said it would take 4 hours to completely charge."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the price","date":"Reviewed in the United States on January 12, 2025","body":"I've reached a point where sometimes the latest and greatest isn't really necessary. This phone is great value and does all I need it to do"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone for the price","date":"Reviewed in the United States on August 28, 2024","body":"I use this phone to test APPS etc so not using it yet for call, texts etc. I used the camera and found it better than my iPhone 12 mini. For pictures like license etc. that needs to be shot from a close distance, this phone worked great providing clarity and resolution in the image. It was very hard to do the same with my iPhone and the Samsung phone picture quality is much better.","helpfulVotes":13},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functionality, Quality, space.","date":"Reviewed in the United States on December 26, 2024","body":"I think I purchased this phone refurbished, I honestly don't remember. However, it is excellent quality, 128Gb memory, excellent speed for a used phone, excellent condition (no scratches etc), it's also very easy to set up . It also comes with a charger.  Camera quality it perfect as well. I Bought the phone case separately.","helpfulVotes":12},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for the price","date":"Reviewed in the United States on June 22, 2024","body":"I needed to replace my S20 Fe and didn't want to buy a expensive new galaxy again.This phone is functionally the same as the S20 Fe and has an improvement like placing the fingerprint sensor on the side button.It's not as fast but that's to be expected. It also has great battery life.This phone is almost perfect but it's buggy at times. Randomly the screen won't respond where you press it and it will not type the words you spell.Honestly feels like it's purposefully made not to preform as well as Samsungs more expensive phones to get people to spend more money.","helpfulVotes":15},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Communication","date":"Reviewed in the United States on January 9, 2025","body":"Amazon support helped me get my gift as fast as possible. The phone is new and no issues with delivery. Great phone for the price."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does NOT work for Boost Mobile. Only T-Mobile network.","date":"Reviewed in the United States on August 10, 2024","body":"My wife needed a new phone so we searched for Boost Mobile phones and this phone popped up. We ordered and went to activate it but the phone was constantly in Roaming. We called tech support only to find out that this phone only works on the T-Mobile network. We're leaving boost mobile for another carrier. Other than that the phone is a typical Samsung device. It runs smooth, clear screen and works as it should. No complaints just be careful of your carrier before you order.","helpfulVotes":29},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love my new phone","date":"Reviewed in the United States on January 19, 2025","body":"It actually came with screen protectors and accessories that was cool"},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Misleading description not unlocked. Good looking phone","date":"Reviewed in the United States on January 16, 2025","body":"I recently purchased this phone, and I am very disappointed. The description of the phone is misleading, and the phone is not as advertised. The description claims that the phone is unlocked, but it is not. When I went to Metro, the representative looked up the IMEI and stated that the phone is locked and may have been refurbished. This is a big problem, because I need a phone right away, and all the local stores are out of stock for the Galaxy A15. I have requested a refund, but I have read other reviews that say it is taking longer than 30 days to process a refund for this same issue. I hope this will not be the case for me, because I feel that I should receive my refund as soon as they receive their product. I would like to be able to go to an actual store and purchase a phone without having to worry about this happening again. But the phone is very nice looking!","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Senior ready. Vivid screen colors.","date":"Reviewed in the United States on January 13, 2025","body":"Easy, reliable phone. Watch movies on it. Pairs well with my 2024 Subaru. Sound quality is fine."},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    ID FUNCTIONS DO NOT WORK. Would like to returrn for refund or","date":"Reviewed in the United States on January 26, 2025","body":"Inputted photo  and fingerprint successfully but actuation steps will not appear. Would like to return"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Arrived on-time","date":"Reviewed in the United States on December 14, 2024","body":"Was very disappointed  😞  when I order a dual sim yes it is a dual  and micro SD. But is either or  you have e to chose which sim to install if you use the SD is only one sim if you use both sim no SD  and that's not what I wanted. But overall it's a beautiful  phone unlock and good for the caribbean","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love everything about this phone","date":"Reviewed in the United States on January 21, 2025","body":"I like everything about it"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Check with your cell phone service provider before buying this phone","date":"Reviewed in the United States on October 27, 2024","body":"I have MetroPCS by T-Mobile and the shop told me they would not be able to transfer my phone number to this phone. They said this happened with another customer who actually had the salesperson go through the attempt and the she was unable to make phone calls or receive calls with it. So the fact that this is an \"unlocked phone\" is no guarantee it will work with all carriers. He also said it is somewhere halfway between 3G and 4G. Not quite as good as most 4G phones but not quite as slow as 3G. If this is all you want you can buy a cheaper phone for a lot less money IMO.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Best phone I have owned","date":"Reviewed in the United States on December 21, 2024","body":"Unlike those negative reviews, this phone works as described and came on time. A tip for buyers, make sure your number is unlocked before you insert your SIM card into the phone.Will definitely buy from here again. 🤗","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love it","date":"Reviewed in the United States on January 4, 2025","body":"Ive inly neen using it two days but I do love it. Worth the money for sure."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno","date":"Reviewed in the United States on October 3, 2024","body":"Buen telefono lo recomiendo"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Cargador en mal estado.","date":"Reviewed in the United States on September 22, 2024","body":"El cargador no trabaja bien y no pudieron darme una solución, me tocó comprar uno nuevo."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Compra desde Argentina","date":"Reviewed in the United States on January 3, 2025","body":"Pedido llego en tiempo estimado. Todo perfecto. El celular anda bien en Argentina"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Husband hates this phone","date":"Reviewed in the United States on December 30, 2024","body":"I wish I had gotten him the Samsung I have, which is much better than this Galaxy."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Solid","date":"Reviewed in the United States on August 17, 2024","body":"Color is beautiful,  phone arrived on time. Very solid phone.  I dislike the one speaker at the bottom,I  wish it had more. Other than that works how it's suppose too."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No Samsung Pay/Wallet","date":"Reviewed in the United States on July 30, 2024","body":"Great battery life. Fast enough. Acceptable screen. A great value for the priceUnfortunately does not have or support Samsung Wallet. I wish they would have made that clear in the description. A small percentage of these a15s do not support and this is one of them","helpfulVotes":2},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Is usable","date":"Reviewed in the United States on October 15, 2024","body":"It took ten times for the phone to connect to my wi-fi so that I could set up the phone. It doesn't recognize my location, so the weather report doesn't apply to me. There were a couple of things in settings that buffered until the phone shut off, so I couldn't pursue those options. Since I only intend to use it for calls and texting, I'm keeping the phone. It's still amazing that this is a replacement phone, and it's still not performing as it is designed to do!","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great affordable phone","date":"Reviewed in the United States on March 25, 2024","body":"I got this to replace a 2-year-old Moto G power. The ratings and reviews said that the Samsung a15 had great battery life which is the single most important thing to me. I have been completely happy with this phone for a couple of weeks now. The screen is much brighter than most, which I like. I love many of the things Samsung has done with its software including adaptive screen brightness. It is a tremendous value. The only thing I'm not happy with is that when you use wired earbuds, the sound stutters at lower volumes unless it has a 3.5 mm plug with four sections instead of three. Earbuds with microphones have four sections. So I can't use my old earbuds, I ordered some new ones with microphones (and they work perfectly). Other than that, it is snappy, has plenty of RAM, plenty of storage, the fingerprint sensor works well, the cameras are pretty good and Samsung seems to be good about updates. Another of my essential criteria is no 5g. 5G is proven dangerous and I don't want to be anywhere near it. While this is 5G capable on certain networks, you can turn it off which is wonderful! You certainly can't go wrong for $170!","helpfulVotes":82},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good","date":"Reviewed in the United States on September 23, 2024","body":"Good phone","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good deal","date":"Reviewed in the United States on September 10, 2024","body":"I have had cell for about two weeks now and find that it's a huge improvement from my last cell. I researched for a few days and it paid off. I choose the one with pearl style finish because it was less money. Go figure plain black cells are more desirable. I came to the conclusion that Samsung and Apple are the only two with resell value. 128 memory and unlocked in short is the knowledge I will give you. Happy shopping.","helpfulVotes":5},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Dissappointed","date":"Reviewed in the United States on August 22, 2024","body":"Finally got it working, mostly, thanks to a YouTube video.  Had to download an app on the old phone to transfer files.  T-Mobile says it's not a truly compatible phone - there were no instructions.  Can't find my contacts list yet.  I accepted a delay in shipping so it all would be delivered together, except the case won't be here for another 2-3 weeks.  I asked a question on the site and got a three stupid answers that didn't apply.  I hope this has call screening like the Motorola (which had defective internal storage!).  If usage improves my opinion, I will revise my review.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not work with Verizon!! Please read!","date":"Reviewed in the United States on May 18, 2024","body":"The phone worked for first 3 days and then Verizon caught up to it and shut it down.  They told us the phone is not compatible with their system, which is funny because it worked fine for 3 days.  I think they just want to make sure everyone buys from their stores. Other than that,  for those days the phone worked great!","helpfulVotes":17},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung A15","date":"Reviewed in the United States on January 1, 2025","body":"Good cell phoneLots of memory"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Too short of screen time","date":"Reviewed in the United States on December 3, 2024","body":"I love the battery life of this phone but I do not like that it turns off after 15 minutes if you don't look at it,very annoying"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent","date":"Reviewed in the United States on January 7, 2025","body":"Excellent seller!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great quality phone","date":"Reviewed in the United States on June 10, 2024","body":"I got this to replace my S9 that I had for 5 years. I was skeptical to move from the S to the A series, but am pleased that I didn't give up any quality. I really like the new phone. The data transfer was so easy and even brought in my apps & saved most of my progress on games. The screen quality and picture quality is excellent. My favorite feature is the speaker volume. My S9 was never loud enough and I find I have to turn down the top volume when using the speaker - it's too loud which is fantastic. I also like the fingerprint recognition being integrated with the power-on button.","helpfulVotes":9},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung A15","date":"Reviewed in the United States on June 23, 2024","body":"It has a very long battery life.does the basic stuff I bought it for..only thing is..it freezes at times and you have to keep pressing he power button in order to get it off sleep mode when you want to use it","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Thank you","date":"Reviewed in the United States on December 30, 2024","body":"I just get it.","helpfulVotes":1},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned","date":"Reviewed in the United States on October 25, 2024","body":"Returned as it was incompatible with my existing eSIM from Spectrum. Not sure whether Samsung, Spectrum, retailer or I got it wrong, but I made an assumption that an unlocked phone would be fully unlocked, not partially. And that Spectrum’s eSIM would work on it","helpfulVotes":1},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Beautiful phone","date":"Reviewed in the United States on November 1, 2024","body":"The phone arrived same day, brand new in all the original packaging. It is beautiful. When transferring my data, I found there wasn't enough space on the phone. I stopped and returned it. Another hard return. Great price and it was beautiful","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Celular","date":"Reviewed in the United States on November 25, 2024","body":"Mi papá está encantado con el celular nuevo, la cámara es todo lo q él esperaba. El viaja mucho y quiere una cámara de buena calidad y este lo tiene.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The phone not unlocked","date":"Reviewed in the United States on December 25, 2024","body":"It need a pin to get the phone unlocked"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Excelente servicio y puntualidad","date":"Reviewed in the United States on December 14, 2024","body":"Es un buen producto y de buena calidad me gusto muchoTrabaja excelente 👌🏿","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    I love this phone.","date":"Reviewed in the United States on May 22, 2024","body":"I love my phone. I don't want to be making payments or locked into contracts for a $1000+ priced phone. Unlocked and works with my carrier! I was able to easily transfer data from my old phone to this one in minutes. So nice. It does lag a little o. The samsumg internet . But the picture is great and it works great for my simple needs. Has great amount of storage! Really for the price it's amazing. I do wish it was a tad bigger but overall I'd recommend! I would also say to those about compatability read all the descriptions and details and contact seller if necessary.  This is not a 5g phone.","helpfulVotes":66},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung phone","date":"Reviewed in the United States on December 10, 2024","body":"Really nice phone wife really loves it. Came very well packaged definitely buy again from here.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    phone","date":"Reviewed in the United States on December 17, 2024","body":"when opened everything was in spanish not english"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Me llego bien","date":"Reviewed in the United States on December 20, 2024","body":"Para un segundo teléfono es mejor este","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No complaints","date":"Reviewed in the United States on August 16, 2024","body":"I bought this phone for my daughter...... she has not complained."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone","date":"Reviewed in the United States on December 19, 2024","body":"This phone is easy to use, lovecthe color,","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Anda muy boen","date":"Reviewed in the United States on August 29, 2024","body":"Anda muy bien"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Returned this","date":"Reviewed in the United States on July 18, 2024","body":"It was ok but know as response as I had hoped, but not a bad product.","helpfulVotes":1},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This makes me sad =(","date":"Reviewed in the United States on August 21, 2024","body":"I wanted this phone so much but unfortunately it isn't 100% compatible with T-mobile. It will only work with 2g/3g and I could only get one bar of service in my house.The phone itself is in brand new condition. The color is beautiful and everything seems to function well. I'm so bummed to have to send it back."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung A15","date":"Reviewed in the United States on November 11, 2024","body":"Excellent product, had A11 with great results so upgraded due to memory having downloads galore which I think are a nuisance. Canceled some but the A11 didn't have a lot of memory.","helpfulVotes":4},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    the phone did not come with a sim card","date":"Reviewed in the United States on November 18, 2024","body":"the product itself is fine --- the problem was that there was no sim card .","helpfulVotes":1},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Phone works fine so far, charger DOES not work. Still trying to get charger replaced!!!!!!!!!!!!!","date":"Reviewed in the United States on September 26, 2024","body":"So far phone works fine. Charger does not work. Went thru Amazon to get new charger. That was a joke, they send you in circles. Amazon finally transfers me to company selling phone, they only send me a charger box no cord. So problem Still not resolved! Having to reach out to company again!"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Value for my money","date":"Reviewed in the United States on July 13, 2024","body":"The condition of the phone is really nice."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worked in kenya","date":"Reviewed in the United States on December 2, 2024","body":"Bought for my brother in kenya and was able to take Asimov's card from there and worked great","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Awesome","date":"Reviewed in the United States on December 28, 2024","body":"Excellent"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Bought for a friend.","date":"Reviewed in the United States on October 30, 2024","body":"Bought this for a friend who had a phone that was 7 years old and doesn't use a cell phone much. For his occasional use, this would work for him just fine. He was very happy with it.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Smart phone","date":"Reviewed in the United States on November 9, 2024","body":"This was a great purchase didn't want to spend a lot on a replacement phone it was affordable and it works perfectly.","helpfulVotes":8},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Pretty good phone","date":"Reviewed in the United States on September 17, 2024","body":"I have tested both AT&T, Verizon, and T-Mobile SIM card and they all work. Phone does not support eSIM, but does have NFC for contactless payment so Google or Samsung Pay works just fine. Phone also has 90 Hz refresh rate which allows navigating on it pretty smooth. Good phone with micro SD Card support.","helpfulVotes":15},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samung Galaxy","date":"Reviewed in the United States on December 13, 2024","body":"It was My Boyfriend gift he Loved it"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It was good. but the case I ordered with it was too bulky","date":"Reviewed in the United States on September 11, 2024","body":"It was good. but the case I ordered with it was too bulky and it fell out my pocket while on a bike ride and I guess someone found it because I can't track it... Now begging around for a new one because I can't afford another."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Affordable price, but wasn't compatible.","date":"Reviewed in the United States on November 13, 2024","body":"Just didn't work with my phone carrier, so I had  to return it.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung galaxy A15","date":"Reviewed in the United States on December 20, 2024","body":"Work excellent"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This is a awesome device","date":"Reviewed in the United States on September 25, 2024","body":"I am usually a iPhone person, I bought this a secondary device and man, I love this phone, Samsung really has done some work on their devices. I bought the unlocked version and it works well with the two sims I have inside. I love this phone would highly recommend it to anyone","helpfulVotes":3}],"reviewCount":0,"reviewAvgRating":4.2,"status":"completed"}