{"reviews":[{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Feature packed phone at an economic price","date":"Reviewed in the United States on March 10, 2025","body":"Excellent phone for the price. I am mainly a Google Pixel user. However, I got this phone for my parent who mainly uses it for making phone calls. The call quality is on par with my Google Pixel phones. The phone packs useful features at an affordable price.  The phone has fingerprint sensor, face unlock in addition to basic pattern and pin unlock.The phone screen is large and pleasant to look at but not unwieldy.The bloat apps are minimal. Fortunately, Samsung allows you to uninstall majority of the apps this phone ships with. Therefore, I've uninstalled many of the unnecessary OEM apps. Before buying the phone, I went through a few reviews commenting on how laggy this phone is. However, I have not had any such lag issues.Buttons have reasonable tactile feel.It's plastic body feels fragile; however, it's functional. Fortunately, a $15 phone case addresses that problem.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy A16 Phone","date":"Reviewed in the United States on February 21, 2025","body":"I had a Moto phone, but the cracked screen (I guess I don't juggle phones very well) was interfering in being able to use it.  I had the screen replaced three times, and the phone still wouldn't work right, so I decided to move on.  I'm an Android user, and NOT techie at all, so I needed to stick with that system.  My son recommended this phone to me, and so far, I really like it.  It's easy to use, it feels good in my hand (size, shape, weight), and while the layout and some apps are different, I'm not having to relearn the entire phone.  The ONLY negative so far is using the 'swipe' texting feature.  My Moto gave me reasonable options.  This one comes up with words I'm not even sure ARE words, and they certainly don't make any sense in context.  Good phone, reasonable price.  Camera gives nice photos.","helpfulVotes":22},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    It's overall a great phone","date":"Reviewed in the United States on March 10, 2025","body":"It's working good came wrapped in cellophane, unblemished in mint condition. I've experienced some freezing up, but I'm not sure if it's my phone service or wifi connection.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    TOP NOTCH!","date":"Reviewed in the United States on February 1, 2025","body":"I had a 2022 Motorola G Stylus 5G and it sucked! That Motorola was the worst phone I have ever owned. It was horribly slow and you couldn't open 2 apps at once. Then I bought this beautiful Samsung A16 5G at a really cheap price and I have to say, it's the best Samsung phone I have ever owned for the price. The quality and speed is definitely TOP NOTCH! You can open multiple apps and run with ease. It also has really good battery life too. It's all around a great phone and for the price it's your best option. Spend less and get a lot more.","helpfulVotes":49},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is obscenely slow...","date":"Reviewed in the United States on March 10, 2025","body":"Absolute piece of junk.  This phone is obscenely slow, (uch slower than the 5 year old Moto g60s I am replacing). It's loaded with Samsung bloatware that inhibits use of the Google Apps I have used for years.  I'm really dissappointed, I was expecting a quality product.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works as well as 1000 dollar phone","date":"Reviewed in the United States on February 17, 2025","body":"I had a very old Samsung I use as an emergency phone for my granddaughter to use if going out with friends. It wore out so I got this phone.Oh my GOSH! This phone is fantastic! It takes really good clear photos. Excellent connectivity. It works with My phone company.I could not BELIEVE what a great value this phone was. I have a thousand dollar phone. It is just as good. My next phone will be another one of these.This phone is truly unlocked. It is American. I will not be buying another (fruit) phone.","helpfulVotes":21},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent phone!","date":"Reviewed in the United States on February 15, 2025","body":"This phone was easy to setup and navigate through the different menus.  I like the camera features.  The cost factor was very good for me. The phone does what I need to do.","helpfulVotes":6},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Excellent for the price","date":"Reviewed in the United States on March 9, 2025","body":"The screen is very good and the service is amazing! Very sleek phone"},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Typical Samsung Phone","date":"Reviewed in the United States on February 11, 2025","body":"As even the head of Samsung admits, tgey try to copy Apple. The phones are larded up with bloatware. You have to uninstall and disable apps you don't want or use.  They take up ram, rom, data, and battery. So ial media junk apps and games are first to go. Samsung keyboard also stinks, so plan on replacing it with Google's.Set up before you connect with home wifi, and before you jnstall sim card.Go to Apps and show sustem apps to unistall or disable meta , samsung, and even some google junk.then, you have a phone that can run snappy and get decent performance. The phrase \" keep it simple\" has it right. Too bad the people at Samsung are so Apple obsessed that they also lard up the phone with junk apps.","helpfulVotes":8},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    MUST BUY","date":"Reviewed in the United States on March 10, 2025","body":"I WAS so scared that it would come cracked and scrated up because I only saw a few reviews so I didn't think it was real but it was/is and I am so happy with the results the camera quality is super good as long as u have good lighting, it works smoother than my old phone (Motorola) and has much more space to download a lot of stuff but if ur on it too long it will heat up so give it some time to rest other than that I really love this phone it also came super quick"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    What do you want a phone for?","date":"Reviewed in the United States on February 12, 2025","body":"I love me some gadgets! I loved my Note 9. Well... not really. I don't like having something that constantly wants my attention. My kids are grown so leave me alone.There are a couple of apps I need to monitor. Short backstory: I am a real boomer. I was born in the first half of the last century. I remember party lines, rotary dials, and 7 digit phone numbers. Yes, thats before area codes.What I like about the A16.It didn't cost me my first born child... I mean it didn't cost me a months rent or small payments well into the afterlife.Its not ancient. I can make calls. I can read my health levels passively, although I'm still not getting my blood pressure cuff to talk to the phone...What I dont like about the A16The MOST annoying thing is it won't allow me to add different ringtones to different contactss. It was annoying enough that the Note 9 didn't allow me to change my notification sounds individually, when I could previously. I was allowed to copy contacts with different alert sounds with the Note 9. I can't with this phone. I know... first world problems. (rant off)This phone seems like it doesn't know if it is large phone or a small tablet. Neither do I.I am mad at myself for not noticing it doesn't hava a battery that will charge remotely. This boomer's hands don't work like they did when I was 30. I have trouble with plugging the thing to a charger.I am mostly annoyed that since I bought the phone from Amazon I had to do all the assembly myself, i.e. putting sim/sd cards in and transfering data. --also my fault. I think I have it 3 stars and not 4 because my devices hate me. All of them.","helpfulVotes":15},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Teaching old dogs new tricks","date":"Reviewed in the United States on February 25, 2025","body":"I am not a gadget person, the phone rings, I pick it and say hello.  But this phone has my attention.  The photos are crisp and clear.  The whistles and bells make sense to me and am making a good attempt at using them.  At almost 60 years old I think its time to use it for all of its conveniences.  This one is user friendly.  My old phone (Samsung too), I felt I stumbled upon its amenities.  Where this one is dummie proof.","helpfulVotes":17},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Inexpensive phone","date":"Reviewed in the United States on February 21, 2025","body":"For the price, this phone does everything expected.  The only issue I've found so far is the lack of a headphone jack.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Artículo de calidad precio","date":"Reviewed in the United States on March 11, 2025","body":"Artículo en condición ejemplar, tal y como es descrito por el vendedor, me funcionó adecuadamente con todos los proveedores de red locales, recomendado como segundo celular o como regalo."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Budget Friendly","date":"Reviewed in the United States on February 24, 2025","body":"I bought it for my brother. A good beginners phone."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Almost Perfect...","date":"Reviewed in the United States on February 1, 2025","body":"So far so good.The good: nice screen,  5G, Samsung quality. Good deal.The bad: The phone is much larger than my previous phone.  It doesn't fit well in my jeans pocket like the old one.The ugly: nothing.","helpfulVotes":35},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works on tmobile","date":"Reviewed in the United States on March 1, 2025","body":"Purchased this to replace daughters phone. Went to mobile, and they informed me if we were buying a phone outright, to come here. Fast delivery, fast activation and seamless performance. Very pleased! Save a lit of money this way."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    great phone","date":"Reviewed in the United States on January 21, 2025","body":"I bought this to replace my Motorola phone which I was starting to hate, since it's resources are maxed out and even worse, won't maintain a network connection.  I like Samsung phones much better anyway, so when I saw the positive reviews on C-Net combined with the fact it works with Mint Mobile service, it was a no brainer.  Set up was a little longer than I expected, probably due to the fact my old Motorola phone kept dropping the internet.  I simply transferred my existing sim  and memory cards to the new phone and used the Smart Switch app to complete the switch.  In less than an hour, I received a text confirmation from Mint Mobile that the transfer was complete.  Keep in mind this does not come with a charger.  Very pleased overall.","helpfulVotes":12},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone","date":"Reviewed in the United States on March 7, 2025","body":"The samsong galaxy, seems to be a very good phone, my amazon app on this phone is much different, I liked the old format better...Thanks for such great service.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    Bueno y bonito pero no es Dual SIM física, solo tiene para una tarjeta.","date":"Reviewed in the United States on January 19, 2025","body":"El acabado está muy bonito pero el sistema está un poco lento, de nuevo no tenía muchas apps y no responde rápido. Es un equipo bueno, mejor que uno básico y tiene disponibilidad para eSIMs pero no para sims físicas, solo una, entonces no me sirve.Lo tuve tres días y lo vendí.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great phone and for my lifestyle.","date":"Reviewed in the United States on February 19, 2025","body":"This phone works very well for me.  It has everything I need to use as a phone and to view email, youtube, listen to music and podcasts and snap pictures.  I don't need the latest expensive phone.  I just need a great phone for a decent price.","helpfulVotes":4},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent phone for the price","date":"Reviewed in the United States on January 31, 2025","body":"Very decent phone for the price. works well"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Just my size","date":"Reviewed in the United States on March 6, 2025","body":"Love my new phone.Clear pictures .Love the photos it takes"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great fast charging 👌","date":"Reviewed in the United States on March 12, 2025","body":"Good value for the price 👌"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n    -","date":"Reviewed in the United States on March 11, 2025","body":"Es buena y de material muy resistente"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good for price","date":"Reviewed in the United States on February 26, 2025","body":"I needed to buy a phone rapidly and this looked like a promising alternative. I am happy with my choice, good alternative for price."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Samsung Galaxy A16 5G phone","date":"Reviewed in the United States on February 17, 2025","body":"Purchased this unlocked phone several weeks ago.  The locking process and set up with my carrier was smooth.  It's working well, and I currently have no issues.  I haven't used the camera yet."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfectly priced","date":"Reviewed in the United States on February 28, 2025","body":"There is nothing more you need for this perfectly priced phone. I am complete overjoyed with this product.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great upgrade","date":"Reviewed in the United States on March 3, 2025","body":"Great phone upgraded from galaxy A10 and all I can say is wow!!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cant beat it for the price","date":"Reviewed in the United States on February 11, 2025","body":"Phone turned on, worked with my T-Mobile sim with no issues. Did some software updates and was good to go. I will be set for the next few android releases, so this $200 phone will be worth its money for sure. Screen looks amazing.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great!","date":"Reviewed in the United States on February 16, 2025","body":"This phone has all the great features needed. I love the fact it is an android, as I find them simple and easy to use.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works great","date":"Reviewed in the United States on March 4, 2025","body":"Works great"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Daughter's first phone","date":"Reviewed in the United States on February 19, 2025","body":"Gift for a 13 yr old for birthday. Loved the features,  so far it's working well."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone","date":"Reviewed in the United States on February 22, 2025","body":"This is a great upgrade from my moto g I love this"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Love the size and design of this phone!","date":"Reviewed in the United States on January 30, 2025","body":"This new phone was very easy to use at the onset.  I didn't experience any problems at all.  The information manual included in the settings section was very informing and a good place to check for questions.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing","date":"Reviewed in the United States on February 2, 2025","body":"For $200, this phone is so much better then expected and the fact that it's unlocked and works with Verizon. And Samsung backs this up with 6 android update is a great deal.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone","date":"Reviewed in the United States on February 9, 2025","body":"Great phone and reasonable price! Arrived quickly with everything included. Was easy to transfer my information to.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good quality","date":"Reviewed in the United States on February 16, 2025","body":"Best price / product balance."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works","date":"Reviewed in the United States on February 16, 2025","body":"Easy to apply and install"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Muy básico","date":"Reviewed in the United States on February 28, 2025","body":"It is a very basic phone but with all the quality of Samsung. I really fall short on the processor and memory. In addition the battery does not withstand heavy use.","helpfulVotes":2},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ok phone.","date":"Reviewed in the United States on March 13, 2025","body":"It's and OK phone. Lags a lot and would not recommend it for games and such."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great deal!","date":"Reviewed in the United States on February 14, 2025","body":"Works perfect!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on February 13, 2025","body":"Worked as described!"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone!","date":"Reviewed in the United States on January 21, 2025","body":"If you are looking for a decent, basic reliable phone it's the Galaxy A16 5G. Good specs and good quality for the money! Highly recommended for your basic needs for the day.","helpfulVotes":5},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    worked as described; very happy","date":"Reviewed in the United States on February 8, 2025","body":"Excells in performance"},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on February 2, 2025","body":"Works great.  Lots of storage.  Works with Metro PCS.","helpfulVotes":6},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    awsome","date":"Reviewed in the United States on January 31, 2025","body":"incredible phone"},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functionality Delayed or not at all","date":"Reviewed in the United States on January 14, 2025","body":"When typing the letters are delayed, then sometimes repeats.Messages, most don't open for you to read them or there is a 30sec 1min delay especially personal messagesEasy setup, size is good.","helpfulVotes":15},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Perfect phone in budget","date":"Reviewed in the United States on January 17, 2025","body":"It is very light weight,classy sleek phone…lokk is very good,really value for money .","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Amazing Entry Level Phone","date":"Reviewed in the United States on January 17, 2025","body":"The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n    Super snappy. Great storage and screen. Looks like it has pretty good battery life. Upgrading from an A12, so I love the new camera features and the 90hz screen, something apple hasnt even put on their iPhone 16s, as they still have 60hz lol.","helpfulVotes":15},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not the best","date":"Reviewed in the United States on February 11, 2025","body":"Phone is super laggy, there's times it takes minutes to be able to use this phone again because of the amount of lag it randomly gets. Feels like a smartphone from 12 years ago.","helpfulVotes":3},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Keyboard","date":"Reviewed in the United States on February 12, 2025","body":"Keybard letters too hard to use  you touch the letters gently  and they type other things not happy","helpfulVotes":1},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Cheap but laggy","date":"Reviewed in the United States on January 14, 2025","body":"Why is this phone slower than my 3 year old Motorola One Ace?2? Giving it abother week of trials but 6 years of updates ain't so great when it's slow out the gate.","helpfulVotes":11},{"reviewerName":null,"rating":2,"title":"2.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A16 5G","date":"Reviewed in the United States on January 12, 2025","body":"This phone is not smooth enough as I expected","helpfulVotes":4},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trash Phone too Slow","date":"Reviewed in the United States on March 6, 2025","body":"This phone is Garbage 4 GB of ram are to short for this phone is lagging and freezing this is the worse phone ever ,pls buy something else for this price u came get a cubot X90 or Xiaomi and will preform better than this garbage","helpfulVotes":4},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very delicate, handle with caution.","date":"Reviewed in the United States on February 18, 2025","body":"Bought as a gift for my sister, she dropped it on grass and the screen completely spiderwebbed. If you decide to buy make sure you get a heavy duty case for it. Called around and it would cost 200 bucks for a screen replacement, which is about the same as the cost of a new one.","helpfulVotes":7},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    No memory card device,","date":"Reviewed in the United States on March 8, 2025","body":"There are no memor card, device,I can not use samsung galaxy A16 5G  at all, I returned west hollywood whole foods market same day I received,it's sacks, it pulling my lregs,","helpfulVotes":2},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not recommended","date":"Reviewed in the United States on March 11, 2025","body":"Loosing charge quickly,  not a new phone it's a refurbished phone","helpfulVotes":1},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Unlocked?","date":"Reviewed in the United States on February 28, 2025","body":"A hassle after setting it up. It wouldn't work with TMobile, so unlocked? Disappointed and returned.","helpfulVotes":3},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Mine loses charge very quickly","date":"Reviewed in the United States on March 1, 2025","body":"The phone works fine but it loses charge very quickly. At least mine does.","helpfulVotes":8},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Buy a charger!","date":"Reviewed in the United States on February 13, 2025","body":"Very disappointed that this phone did not come with a charger!","helpfulVotes":2},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not an unlocked phone","date":"Reviewed in the United States on January 11, 2025","body":"does not work on MetroPCS by T-Mobile. Not an unlocked phone. Error \"your phone is not registered on this network\"","helpfulVotes":71},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Scam","date":"Reviewed in the United States on January 28, 2025","body":"The phone IS NOT UNLOCKED!!!!","helpfulVotes":10},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Not Unlocked","date":"Reviewed in the United States on January 14, 2025","body":"It's not unlocked like they claim it is.","helpfulVotes":12},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A brand name phone without much to impress with","date":"Reviewed in the United States on January 27, 2025","body":"This is one of the least expensive Galaxy smartphones you can get in 2025, so for that I give credit where it's due.If you're comparing with other, more expensive Samsung devices, you may be disappointed at a lack of speed and features.If you're comparing with other off-brand phones at similar prices, there are pros and cons: lower specs on one hand; but more stable and reliable against weird bugs; and probably much easier to find various cases for what I'm sure will be a popular phone option this year.Where it stands out against other phones in the $200 price range is that it has the most popular \"optional\" features, 5G connectivity and NFC (tap-to-pay, etc).And, not surprising for a Samsung device but worth noting, I found the camera quality to be pretty good. Not *as* vivid as top tier Pixel, Galaxy, and iPhones of the past 2-3 years, but much much better than off-brand phones in this price range, of which I have tried several. Both the photo and video cameras look \"good\" - like, you wouldn't think your photos come out grainy or blurry or the camera can't focus. Unfortunately that's prevalent with other budget phones but Samsung has maintained a minimum level of quality with the camera.That's about where any \"outstanding-ness\" ends. The rest is an unremarkable, decent phone for everyday use. There is no \"unboxing experience\" - it comes in a very simple basic package – which is fine, pass the savings down to the consumer.  The screen is just a little bit larger than average, and has a vivid and clear display. Part of the phone's body is plastic, which also feels un-premium compared to other devices. The phone's internal specs, especially the 4GB RAM are pretty low for today's apps, even without trying to play 3D games or use AR filters and experiences. I found this phone occasionally lagging just to switch between apps like email and my browser, if I've been multitasking for a while.Battery life is OK and a fresh phone lasts comfortably throughout the day. It is compatible with 25w fast chargers but not wireless charging; disqualifying some accessories. You can get a full charge in under 2 hours.Finally, if you're curious about some of the Galaxy AI features that you may have seen on commercials... at the time of this review, most of them are not natively available to this phone. I mean, sure, you can download apps like Gemini, but the \"circle it\" and other features that are just directly part of the UI in higher-tier Samsung phones, are not available on this one.","helpfulVotes":5},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Entry Level Phone","date":"Reviewed in the United States on January 14, 2025","body":"This is a great phone, all things considered, especially given its class as a lower end economy smartphone. Even though it's definitely value oriented, you get a pretty decent phone that can do quite a lot for you.First of all, the specs are mostly decent. You've got a large, bright display. You've got \"decent\" cameras. You're also getting a chipset that isn't too bad at all. Impressively, you're also getting 128GB of onboard storage. The one thing I think is unfortunate is the 4GB of RAM, which definitely doesn't feel like enough in this day and age. But that's just part of the tradeoff, I suppose.It's not fast, but it's not nearly as sluggish as I would have expected. Once it's settled down, it's a perfectly usable device without much frustration. The current Samsung software that runs on top of Android is actually a lot less bloated and \"in your face\" than it was a few years ago. Samsung has clearly taken some of that criticism seriously and created a slightly faster, less bloated, sleeker experience. Still, it's annoying to have to deal with having two different accounts just to get started (Samsung and Google), because there are two different \"app stores,\" and Samsung insists you also use theirs to update their own apps. Remember that 4GB of RAM? Sometimes, if you're using a bunch of apps, there's a tendency for them to start closing due to trying to manage the RAM. It's definitely unfortunate.Build quality is another area where there are some \"tradeoffs.\" It's an all plastic device aside from the screen. The sides are plastic, and the back is plastic. But it still looks and feels pretty good in the hand, and it's lightweight due to all that plastic as well. The speakers sound \"OK\" and get loud enough to use. Photo quality is noticeably unimpressive compared to flagship phones (which I tested it next to) but perfectly acceptable for general use.Overall, I would say that it's a solid device for its category, and I would recommend it.","helpfulVotes":7},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Decent Phone","date":"Reviewed in the United States on January 31, 2025","body":"Decent phone for the price point. Given that it is a new model it functioned very well. Although just a tad bit slower/laggy than I'm use compared to my old Galaxy S8+ but it's bearable. I don't run a lot of apps on it so you would think over the years that issue with the A series would be fixed. It was an easy transition to migrate my old Samsung data over so that was a plus. Visuals and screen clarity was nice. I like that it still had an expandable memory card slot for the phone. I also had no issues moving it to my carrier as it recognized it right away.","helpfulVotes":1},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great Phone!","date":"Reviewed in the United States on January 15, 2025","body":"The Samsung Galaxy A16 is a powerhouse.  We had no problem switching our old galaxy A10 phone with consumer cellular to this A16.  It was a smooth transaction.  I also downloaded the transfer app on the old Samsung with help of the new phone and was able to move my photos and other things like apps to the new phone.  It is fast and the screen large and clear.  The camera has great settings to take even professional looking photos.  I love that you can make the font large for elderly folks.  I wish the sound was louder on speaker though for folks that are hard of hearing.  I really wish Samsung would make their phones wireless as they are behind the times with that.  This phone was taking the place of our old Samsung so I just used the wireless adaptor we had which works fine.  Overall this is a very nice phone and  for a price under $200 compared to competitors which can be 5 times the price or more  you really cannot beat it.  I totally recommend this phone.","helpfulVotes":2},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good battery life","date":"Reviewed in the United States on January 31, 2025","body":"Overall a decent phone that offers a high quality screen bright and vibrant . Good speaker quality for call and speaker phone clear and crisp . Fsat charged in about 1 hr or so . The ram is suffient enough for web surfing , shoping and average use . Nice build quality and all day battery life with moderate use . Camera quality is average the is fine for that average everyday user . Very functional and capable phone for daily use . Nice design good button response and value","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great device, ESPECIALLY for the price","date":"Reviewed in the United States on January 17, 2025","body":"Had an extra line on our account and decided to get an inexpensive phone to attach it to. Been an iPhone user for many years now after previously being a long-time android user, and was excited to see how Android and Samsung had changed over the years. Short version - I was pleasantly surprised by this phone.PHYSICALFirst off, this is a big phone. A BIG phone! I've used a \"Pro\" size iPhone for the past 5 years, so the extra 1\" in height and .25\" in width took some getting used to. A nice thing about the phone being so large is that the screen is also very large, and my eyes definitely appreciated the extra size and clarity! Speaking of the screen, it's the typical gorgeous AMOLED screen that you expect from Samsung. You simply can't beat the contrast on a screen like that! The build quality seems very good, and it has a fingerprint reader built into the power button. A lot of great features and quality that I would expect from a much more expensive phone.CAMERAI'm very impressed by the camera setup. First off it has a 3 camera setup just like my iPhone 14 Pro, with the same Standard, Wide Angle and Zoom lens grouping. The primary camera is a 50mp sensor, which results in very sharp images that you can print out at very large sizes. It also has an option to take 12mp photos as well to save on storage space. That's more than enough resolution for social media posting and other digital uses. In my testing, photo quality has been great. The portrait mode on this phone I think is a better implementation than the portrait mode on my iPhone. The manual exposure controls were easy to access and use. Once again, quality I would expect from a $900+ phone.SOFTWAREStandard Samsung version of Android OS. You either love it or hate it. It came with a LOT of preinstalled apps which I really don't like, but that's not unique to this particular model of phone.HARDWAREThe processor/ram is really the only place where I felt this seemed like a \"budget\" phone. The system seemed a bit sluggish at times, with delayed response when calling up apps, menus or hitting the home button. Built in storage is pretty good at 128GB, but the ability to use a SD card to expand storage is awesome, and something you don't see too often (NEVER on an Apple product).PHONEWorks great as a phone; obviously speeds, connectivity and the like will be dependent on your network and location.OVERALLIn the short-term, this phone shows an incredible value with what you get for the price. If I'm spending $199 on a phone I typically expect to get something very basic and very plastic, with outdated features that are already on their last legs. This phone feels like it could hold it's own for quite a few years, and with a promise from Samsung of 6 OS updates in the future, it very likely will. Samsung hit a home run with this one!","helpfulVotes":8},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Does not have wireless charging","date":"Reviewed in the United States on January 16, 2025","body":"I understand that this is the budget line of phones from Samsung. I was still surprised to see that it has no wireless charging capability. Unfortunately, no one in my family wants to swap out their phone and lose that feature. I cant really review it beyond that. I will probably just turn it into a dedicated music player to par with some Bluetooth speakers.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Quality phone with a good screen.","date":"Reviewed in the United States on March 10, 2025","body":"Its got a very nice screen that's easy to see, even in daylight.  It might be easier to see (in bright daylight) than my iPhone13. My wife has some games she likes to play on it, nothing incredibly taxing, but it has snappy performance, both loading the game in in the game, so memory is pretty quick as well as the GPU. The camera does a really good job as well, but phone cameras are all amazing these days, at least for the last 5-7 years.It's a really nice phone, but Samsung rarely disappoints and seems to stand behind their products with updates."},{"reviewerName":null,"rating":4,"title":"4.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good Overall Phone, With the Added Peace of Mind from Samsung","date":"Reviewed in the United States on January 17, 2025","body":"I'm going to be honest before I continue with my review, and that is for the past four or so years, I have been more of a Samsung fanboy than an Apple fanboy. Ever since the iPhone X, Apple has been resting on its laurels for far too long, and the final straw was the hideous iPhone 14. People can be subjective about Jony Ive and his role in all the aesthetics of Apple products, but I bet even he had to let out a groan when all Apple did with the iPhone 14 was to make its already hideous camera lens array was to make it even more bigger and hideous. I must admit, Apple's nectar must be so sweet that every year they can wrap some poo up in tin foil and call it art, but anyone who has ever studied art, or even just love the art of aesthetics, can agree that there must be some sort of symmetry in design. If you are going to have a square lens array, at least put it in the middle of the top, so people can give you the golf clap that at least you tried. iPhone 11, 12, 13 already had bad design language, but to kick people in the nards with the 14 was the final middle finger for me: Apple stopped caring, Apple stopped trying. That thing, along with the 15 and 16, are FUGLY. At least with the regular 16, they had the decency to turn it into a pill-shaped array, but the last time Apple succeeded in its design language was all the way back with the iPhone X (and the subsequent XS).Thanks for listening to my Ted Talk, now let me tell you why I appreciate Samsung. The bottom line is, at least they try, and they are not afraid of trying. You have the main premium lineup in the S series (I use the S24 Ultra), and they have their experimental/progressive lineups in the Fold and Slip series. But they don't forget their backbone consumers (yes, the world exists outside of the US), and that's why they have their A series and M series. I think this particular A series is their cheapest iteration, at $200. And to be frank, there are better $200 phones out there, such as from Blu, and a generic company called Nuu, which makes pretty darn good phones with OLED screens and better specs.However, in the end, if you're not so sure about generic brands, then there's no other brand that I would recommend than Samsung for low to mid tier phones, as with everything, it comes down to support, both software wise, and in customer support if something goes wrong. From the software side, here it is in Samsung's own words:\"SIX YEARS OF UPDATES. AWESOME SECURITY: Six years of OS and security updates mean you can keep your Galaxy A16 5G longer, making it a great value for years to come.\"Six years of software support is pretty awesome for any phone, but it's even more awesome for a $200 phone. That means for people without the means, that is a silent affirmation from Samsung that the phone should last at least that long. However, in this day and age, it's hard to recommend an Android phone with 4GB of RAM, because RAM is not just for running apps, but also the background processes those apps need to run, such as using your GPS, Wi-fi, Bluetooth, etc. Therefore, I would only recommend 20 or so apps with this phone (in addition to the ones it already comes with), whichever are the most necessary apps that you use everyday. Otherwise, it might slow down to a crawl if you fill this phone up with all the apps of your main phone. Otherwise, use one app at a time, and make sure to exit the ones you are not using. What is great, though is the AMOLED screen that Samsung has included, as usually this tech is reserved for their more premium phones. It's 90Hz, so it's pretty spry when you're scrolling, and the image quality is excellent. It's a pleasure to watch movies on this thing, very similar to my Flip 5.Since I am used to using Galaxy-level phones, it's a bit hard to go back down to the more entry-level phone. That's why for me, as a power user, I give this phone a four-star rating. However, if you are more utilitarian and practical, and don't need all the bells and whistles, than this phone can be your main daily driver. As for me, it makes an excellent secondary phone for when I travel internationally, as it's always good to have an emergency phone just in case, and it's especially effective for peace of mind. Overall, a good phone, and a much better value for its price.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for the money","date":"Reviewed in the United States on March 15, 2025","body":"This Samsung Galaxy A16 5G is a great budget-friendly smartphone. For its price, it offers solid performance, a good display, and long battery life. The 5G connectivity is a nice bonus, making browsing and streaming smooth. The camera is decent for everyday use, and the build quality feels sturdy. The design is also sleek and good looking. This phone definitely delivers excellent value for the money."},{"reviewerName":null,"rating":3,"title":"3.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Nice basic android phone","date":"Reviewed in the United States on January 20, 2025","body":"One of the best qualities about this phone is the case. It's very sleek and a nice size overall. The cameras work well and provide very nice images. The interface of this phone is a very laggy but works for basic functions. You will have to play around with the settings to set things the way you may like them. If the processor was faster and didn't lag so much I would give the phone an additional star.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    This phone is AWESOME!","date":"Reviewed in the United States on January 23, 2025","body":"I was hesitant in trying this phone as I'd have to do the whole swapping the phone deal and adding it to Carrier service BUT....I'm so glad I did. This phone does not disappoint. It functions properly and as it should with an exceptional battery life. I love the size and it's easy to store and access when needed. The speed of this phone out preformed the other. Camera quality is a plus! I love in a rural area where service is not all that great. Never have I found a phone that had enough bars to pickup a phone call and actually let me have a full conversation in years...until now! The phone was unlocked and ready for use. I simply added my sim card to the phone and followed the instructions for setup through the phone and with service provider. Not very teck savvy either and was able to complete the whole process and navigate the phone easily. I would highly recommend over and over!","helpfulVotes":11},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good price for an unlocked phone","date":"Reviewed in the United States on January 14, 2025","body":"This phone is an unlocked phone so it can be used with whatever carrier you want, we have Cricket and it works with it. I think the price is very reasonable for an unlocked phone. This phone is about the same size as all of the rest of our phones, which honestly I would really like something smaller, but everything seems to be around the same size. This phone is actually lighter than our Moto phones. My daughters friends say that they can hear her better, but there is no headphone jack. I read that she can get an adapter for that, so we ordered one of those, so we'll see how that works. It has plenty of storage, and the touch screen and fingerprint sensor all seems to work really well. You do have to have a Samsung account, so that was something new that we never have had before. It takes very clear photos. It has fast charge, doesn't have wireless charging. I would compare it to my Moto stylus, but without a stylus, a few things are different, but seems to work just as well. I think it has a glass back, at least that is what it looks like to me.","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Functions as expected for the upper bottom-end price.","date":"Reviewed in the United States on January 24, 2025","body":"Switch-over was as easy as taking out old SIM card and installing it into the A16.  T-mobile is behaving as it was prior to the switch.  I elected not to use a transfer app, so it took longer to setup and configure.  The speed, the performance, and the function it has, is right about what I thought it'd be.There are 2 things I miss having with the A16 - 1 is the lack of a 3.5mm audio port (gotta use BT earbuds now).  2 is the Android v14 on it doesn't have the mobile data speed option - shows the speeds of data transfer happening.  But life will continue without these features...So overall, I give it a 4.8 star rating at this point (miss those 2 features I mentioned).  I'll return to update with any pros/cons that reveal themselves."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Capable entry level phone","date":"Reviewed in the United States on January 16, 2025","body":"There's a lot of like about this entry level phone - Be it the crisp 6.7\" Super AMOLED screen or the 50MP wide angle, 5MP ultrawide and 2MP macro camera modules. This phone comes with Android 14 installed, and a promised 6 future major upgrades.However, with entry level pricing there won't be flagship specs all around. For example, that S AMOLED screen is 90Hz, as compared to other A series (A25/35) that are 120Hz. The WiFi is limited to ac.. no WiFi6/6e/7. The dust and water resistance rating limited to IP54. The cameras are limited to recording at 1080p 30fps. No wireless charging, wired charging is limited to 25W. USB while Type-C, is limited to 2.0. The chipset is Exynos, not Snapdragon.That said, these are still respectable specs, and you get a lot of value for your $200. In fact, as of this writing, there's also a gift card promotion being offered.","helpfulVotes":4},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A great mid-range phone with a budget price tag!","date":"Reviewed in the United States on January 15, 2025","body":"Other reviews have commented on it being \"plasticy\" - I say this - who carries around their phone without a case? Who cares what the outside is made of when if you're able to see it, it's destroyed the first time you drop it or the cat knocks it off the table?Activated on AT&T as simply as inserting my old SIM card and turning on the phone - zero issues!Performance is suprisingly good as is the display, being of the Super AMOLED variety. Colors are vibrant but not over-saturated as AMOLED tends to be.Battery life for me was one full day plus several hours the next day - enough to get to a charger should I forget to put it on the cord before going to bed.Volume from the speaker could stand to be a little louder but nothing to really complain about.6 major OS update - WOW - even my previous phone (Phone 7 pro) didn't offer that!This should be the new defacto-standard for inexpensive phones - way to go Samsung!","helpfulVotes":3},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Great phone for my needs!","date":"Reviewed in the United States on January 16, 2025","body":"I have no issues with this phone whatsoever. It was extremely simple to tranfer my contacts and apps from my old phone using smart switch. I'm pretty low tech, so that's really saying something! It's plenty fast for me. I haven't noticed anything that annoys me as of yet. I just transferred my SIM card from my old AT&T phone to this one and I was up and running immediately. I love the large screen. It's clear and bright. Cameras are good. I haven't tried all the features yet, but I'm very happy so far. Phones are crazy expensive, so I'm impressed by the low price on this one. It feels good and sounds decent as well. I have no problem recommending this phone to average users such as myself.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    A Worthwhile Upgrade","date":"Reviewed in the United States on January 17, 2025","body":"Moving from the Samsung A10 to this was a big improvement. The AMOLED display is brighter and sharper, making videos and browsing way more enjoyable. It’s faster too—apps open quickly, and there’s no lag when switching between tasks.I also love the expandable storage, which means no more constantly deleting stuff. The fast charging is a huge step up from the A10, saving me a lot of time. It feels sturdy but still lightweight, and the blue-black color is a nice touch.If you’re upgrading from an older model, this phone is a solid choice. It’s worth it for the display, speed, and overall performance.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    works fine on mint mobile","date":"Reviewed in the United States on January 14, 2025","body":"Biggest and fanciest phone I've ever had, so this might color my review a bit. Works fine on MintMobile, no issues setting up. Was the easiest phone to set up i've ever had, actually. Big screen but lightweight, feels strong. I've read reviews on the internet about it being slow or laggy, but this has not been a problem for me. I use my phone for talking on the phone, messaging, and emails, and it's been completely fine. Way more camera features than I'll ever use, and I truly have no complaints with any other part of it.","helpfulVotes":2},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    nice","date":"Reviewed in the United States on January 14, 2025","body":"This is a nice phone, it is fairly simple. It has a nice camera and is a good size. It isn't crazy big or too tiny. The phone itself runs well and is quick to load apps or turn on. It is a nice choice for anyone that wants a good base phone without a lot flair."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Very nice","date":"Reviewed in the United States on January 18, 2025","body":"This is a nice galaxy phone. It has a lot of new features and it's easy to operate. I like the different colors you can choose from. It is very fast charging which makes things even simpler."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Good phone","date":"Reviewed in the United States on January 15, 2025","body":"The Samsung A16 is a phone that will perform well for most people for basic uses like calling and general app use. It has a vibrant display and very good battery life. The camera takes decent photos in the daytime but at night or in low light they are somewhat worse. Overall it is a reliable device that will please many people who don't want to spend a lot of money.","helpfulVotes":9},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    excellent phone","date":"Reviewed in the United States on January 16, 2025","body":"Samsung makes a quality product."},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Works as described (Verizon)","date":"Reviewed in the United States on January 14, 2025","body":"This is absolutely carrier unlocked. I checked with the top 3 carriers and this can work with them if you have current service. It’s a great basic starter phone that is inexpensive, so it works great for work purposes. I simply didn’t want to deal with work calls coming to my personal line. Now I don’t know about pre paid phone services that may not work with those carriers. Just be sure to check before you open the box. That way it stays sealed, and you can return within 30 days so you are covered either way. I would recommend it!","helpfulVotes":4},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Slower than IE","date":"Reviewed in the United States on March 5, 2025","body":"I've had this phone for 10 months, it's slow. It responds slowly to touch. Apps of varying size and usage run laggy and crash frequently. It's noticeably slow. It has trouble running more than one app at a time. If I need information from another app, and try to toggle to my previous app, it will already have been closed in the background and will start over from the beginning. I have to have a pen and paper to take notes while filling out forms on my phone, my first android phone wasn't this bad. When I play music on a streaming app, it stops randomly of its own volition. Restarting helps for a short time. I've deleted apps down to the barest bones, moved my photos off local storage, even reset a few times. Happens on wifi and all levels of signal strength from a large national carrier. I'm an IT professional, I've pulled out all the stops, this phone is just slow. I will not miss it come upgrade time. I would not recommend this phone.","helpfulVotes":3},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Worst phone EVER.","date":"Reviewed in the United States on March 7, 2025","body":"Not ordered from Amazon, got new from cricket wireless. Horrible, awful phone. Worst I've ever had. So slow. If you try to Google something while watching YouTube in the floating square, the video stutters. You can't change apps without significant lag. Reminds me of dial up internet. It's so bad I'm using my old phone. Also, in an emergency, getting to the phone app wouldn't be very fast. Basically you can't rely on this phone in an emergency if you need to dial 911 fast. Shame on you samsung for putting your name on this phone.","helpfulVotes":3},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Trash","date":"Reviewed in the United States on March 14, 2025","body":"Not enough RAM to function properly, glitches all the time.  Cannot deal with it anymore. Insanely frustrating."},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Terrible ergonomics.","date":"Reviewed in the United States on March 9, 2025","body":"Bought this from MINT. it's all the phone I need but it has the absolutely worst finger print sensor I've ever used. No good way to pick it up and access it with one hand, major failure.","helpfulVotes":1},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    So slow it's unusable","date":"Reviewed in the United States on February 11, 2025","body":"Very nice screen, feels well built, speakers are loud, and the power-button-integrated fingerprint scanner is incredible. But the pros stop there.This is, by far, the slowest phone I've ever used. I've used budget Androids before, but this one is dismal. Switching apps is painful. Simple things like loading messages or opening the browser take ages.Do yourself a favor and buy and older, better phone. This looks like a S24, but it feels slower than my S3","helpfulVotes":3},{"reviewerName":null,"rating":1,"title":"1.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Ripped off.","date":"Reviewed in the United States on March 10, 2025","body":"Didn't get everything that was supposed to come with it.","helpfulVotes":1},{"reviewerName":null,"rating":5,"title":"5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    The \"Just Right\" Phone","date":"Reviewed in the United States on January 14, 2025","body":"The Samsung Galaxy A16 5G will probably be the best-selling individual phone model in the world for 2025. It sells well because it meets all the needs of the average person at a very reasonable price. This model, the SM-A166U (US version) has a nice OLED full HD screen, a 90Hz refresh rate, 4GB of RAM and 128 GB of storage, as well as a micro SD slot for additional storage. It does not have a headphone jack, which for 2025, has been deleted. Calls are nice and clear and it will receive 6 Android OS updates and 7 years of security updates - a nice addition by Samsung.  It should work with all of the major US carriers as well as the numerous MVNOs being the US model. This phone has been on sale since October in other areas of the world but has only gone on sale in the US since January 9th 2025. My only complaint about this phone is that it is only sold as a 4GB 128GB version in the US, whereas other parts of the world can get versions that have up to 8 GB of RAM and 256 GB of storage. Amazon sells these variants at a slightly higher price. If you're a T-Mobile, Metro or Mint Mobile customer, you might be able to use these GSM variants and have a better, faster and more future-proof phone. Check what 5G and 4G bands your carrier uses to be sure your A16 5G will work. The only downside is these variants don't come with a warranty. If you're a Verizon customer, stick with the US model.","helpfulVotes":24}],"reviewCount":0,"reviewAvgRating":4.2,"status":"completed"}